{"title":"Basic laws of electromagnetism - Irodov","uid":9051685,"size":22157107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:004ab7158b6c2af300ca6cc90f879c2c529b9ed4&amp;dn=Basic+laws+of+electromagnetism+-+Irodov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1381872933,"description":" &lt;a href=&quot;http://stat.homeshop18.com/homeshop18/images/productImages/723/basic-laws-of-electromagnetism-medium_1090c0b2fe591e791ff0e40e530b45e5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://stat.homeshop18.com/homeshop18/images/productImages/723/basic-laws-of-electromagnetism-medium_1090c0b2fe591e791ff0e40e530b45e5.jpg&lt;/a&gt;\n\nThe main idea behind this book is to amalgamate the description of the basic concepts of the theory and the practical methods of solving problems in one book. Therefore, each chapter contains first a description of the theory of the subject being considered (illustrated by concrete examples) and then a set of selected problems with solutions. The problems are closely related to the text and often complement it.The main idea behind this book is to amalgamate the description of the basic concepts of the theory and the practical methods of solving problems in one book. Therefore, each chapter contains first a description of the theory of the subject being considered (illustrated by concrete examples) and then a set of selected problems with solutions. The problems are closely related to the text and often complement it. Hence they should be analyfed together with the text. In author's opinion, the selected problems should enable the reader to attain a deeper understanding of many important topics and to visualize (even without solving the problems but just by going through them) the wide range of applications of the ideas presented in this book.In order to emphasize the most important laws of electro-magnetism, and especially to clarify the most difficult topics, the author has endeavored to exclude the less important topics. In an attempt to describe the main ideas concisely, clearly and at the same time correctly, the text has been kept free from superfluous mathematical formulas, and the main stress has been laid on the physical aspects of the phenomena. With the same end in view, various model representations, simplifying factors, special cases, symmetry considerations, etc. have been employed wherever possible. ","torrent":{"xt":"urn:btih:004ab7158b6c2af300ca6cc90f879c2c529b9ed4","amp;dn":"Basic+laws+of+electromagnetism+-+Irodov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"004ab7158b6c2af300ca6cc90f879c2c529b9ed4","infoHashBuffer":{"type":"Buffer","data":[0,74,183,21,139,108,42,243,0,202,108,201,15,135,156,44,82,155,158,212]},"announce":[],"urlList":[]}}