{"title":"Wayne Shorter - Speak no Evil (FLAC, non-RVG)","uid":6403663,"size":242857448,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00c75374d9cc6aeee4dedb717bb7b207f062e9aa&amp;dn=Wayne+Shorter+-+Speak+no+Evil+%28FLAC%2C+non-RVG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bartoko","files":6,"time":1305737515,"description":"I think this old edition sounds better than the RVG remaster.\nEnjoy\n\n\n\n\n\nReview\nby Thom Jurek\nOn his third date for Blue Note within a year, Wayne Shorter changed the bands that played on both Night Dreamer and Juju and came up with not only another winner, but also managed to give critics and jazz fans a different look at him as a saxophonist. Because of his previous associations with McCoy Tyner, Elvin Jones, and Reggie Workman on those recordings, Shorter had been unfairly branded with the &quot;just-another-Coltrane-disciple&quot; tag, despite his highly original and unusual compositions. Here, with only Jones remaining and his bandmates from the Miles Davis Quintet, Herbie Hancock and Ron Carter on board (with Freddie Hubbard filling out the horn section), Shorter at last came into his own and caused a major reappraisal of his earlier work. The odd harmonic frameworks used to erect &quot;Fee-Fi-Fo-Fum,&quot; with its balladic structure augmented with a bluesy regimen of hard bop and open-toned modalism, create the illusion of a much larger band managing all that timbral space. Likewise on the title track, with its post-bop-oriented melodic line strewn across a wide chromatic palette of minors and Hancock's piano pushing through a contrapuntal set of semi-quavers, the avant-garde meets the hard bop of the '50s head on and everybody wins. The loping lyric of the horns and Hancock's vamping in the middle section during Shorter's solo reveals a broad sense of humor in the saxophonist's linguistics and a deep, more regimented sense of time and thematic coloration. The set ends with the beautiful &quot;Wild Flower,&quot; a lilting ballad with angular accents by Hancock who takes the lyric and inverts it, finding a chromatic counterpoint that segues into the front line instead of playing in opposition. The swing is gentle but pronounced and full of Shorter's singular lyricism as a saxophonist as well as a composer. \n\n\n\nTrack listing\n\n(All pieces written by Shorter)[4]\n01- &quot;Witch Hunt&quot; 8:07\n02- &quot;Fee-Fi-Fo-Fum&quot; 5:50\n03- &quot;Dance Cadaverous&quot; 6:45\n04- &quot;Speak No Evil&quot; 8:23\n05- &quot;Infant Eyes&quot; 6:51\n06- &quot;Wild Flower&quot; 6.00\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:00c75374d9cc6aeee4dedb717bb7b207f062e9aa","amp;dn":"Wayne+Shorter+-+Speak+no+Evil+%28FLAC%2C+non-RVG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00c75374d9cc6aeee4dedb717bb7b207f062e9aa","infoHashBuffer":{"type":"Buffer","data":[0,199,83,116,217,204,106,238,228,222,219,113,123,183,178,7,240,98,233,170]},"announce":[],"urlList":[]}}