{"title":"Handbook of Practical Logic and Automated Reasoning and Handbook","uid":11328600,"size":709431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00d5e2a3fc326ae269ae4a8107032f89b3ce35fc&amp;dn=Handbook+of+Practical+Logic+and+Automated+Reasoning+and+Handbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Housbot","files":1,"time":1414650028,"description":"Includes 2 books which are very hard to find through google.\n\nHANDBOOK OF PRACTICAL LOGIC\nAND AUTOMATED REASONING\nJohn Harrison\nThe sheer complexity of computer systems has meant that automated rea-\nsoning, i.e. the use of computers to perform logical inference, has become\na vital component of program construction and of programming language\ndesign. This book meets the demand for a self-contained and broad-based\naccount of the concepts, the machinery and the use of automated reasoning.\nThe mathematical logic foundations are described in conjunction with their\npractical application, all with the minimum of prerequisites.\nThe approach is constructive, concrete and algorithmic: a key feature is\nthat methods are described with reference to actual implementations (for\nwhich code is supplied) that readers can use, modify and experiment with.\nThis book is ideally suited for those seeking a one-stop source for the gen-\neral area of automated reasoning. It can be used as a reference, or as a place\nto learn the fundamentals, either in conjunction with advanced courses or\nfor self study.\n\nThe Handbook of Automated Reasoning is the second book. It appears to only contain part of the book, I apologize for this","torrent":{"xt":"urn:btih:00d5e2a3fc326ae269ae4a8107032f89b3ce35fc","amp;dn":"Handbook+of+Practical+Logic+and+Automated+Reasoning+and+Handbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00d5e2a3fc326ae269ae4a8107032f89b3ce35fc","infoHashBuffer":{"type":"Buffer","data":[0,213,226,163,252,50,106,226,105,174,74,129,7,3,47,137,179,206,53,252]},"announce":[],"urlList":[]}}