{"title":"Manjit Kumar - Quantum (mobi,epub)","uid":9415233,"size":2568201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00ee76430eb90f445fbf61f3d00221a2ed683c0f&amp;dn=Manjit+Kumar+-+Quantum+%28mobi%2Cepub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Kupsha","files":5,"time":1388425706,"description":"For most people, quantum theory is a byword for mysterious, impenetrable science. And yet for many years it was equally baffling for scientists themselves. Manjit Kumar gives a dramatic and superbly-written history of this fundamental scientific revolution, and the divisive debate at its heart.\n\nFor 60 years most physicists believed that quantum theory denied the very existence of reality itself. Yet Kumar shows how the golden age of physics ignited the greatest intellectual debate of the twentieth century.\n\nQuantum sets the science in the context of the great upheavals of the modern age. In 1925 the quantum pioneers nearly all hailed from upper-middle-class academic families; most were German; and their average age was 24. But it was their irrational, romantic spirit, formed in reaction to the mechanised slaughter of the First World War that inspired their will to test science to its limits.\n\nThe essential read for anyone fascinated by this complex and thrilling story and by the band of young men at its heart.","torrent":{"xt":"urn:btih:00ee76430eb90f445fbf61f3d00221a2ed683c0f","amp;dn":"Manjit+Kumar+-+Quantum+%28mobi%2Cepub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ee76430eb90f445fbf61f3d00221a2ed683c0f","infoHashBuffer":{"type":"Buffer","data":[0,238,118,67,14,185,15,68,95,191,97,243,208,2,33,162,237,104,60,15]},"announce":[],"urlList":[]}}