{"title":"The Genesis Flood and Floating Log Mats - Michael Oard","uid":11773243,"size":5162410,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:022c8cc83632b704965847c043d31ca1b7c11a36&amp;dn=The+Genesis+Flood+and+Floating+Log+Mats+-+Michael+Oard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"starxteel","files":1,"time":1427159797,"description":"\nSecular scientists present numerous challenges to the biblical model of the Flood. The floating log mat model helps provide solutions for at least seven of these challenges. This well researched book explains fossilized vertical trees, including multiple layers of vertical trees in Yellowstone National Park; fossilized plants, insects in amber, well-preserved insects or insect parts, and the origin of coal deposits. After the Flood, logs mats provide the potential to explain the many mysteries associated with present and Ice Age plant and animal distributions around the world in the field of bio-geography.\n\n\nAbout the author:\nMichael J. Oard is a creation scientist with a specialization in Atmospheric Science. He is a prolific author who has published numerous books and papers in widely recognized creationist and secular journals. He worked for close to 30 years as a meteorologist/weather forecaster with the (US) National Weather Service, and now dedicates much of his time to creation science research. Mike's research interests have focused primarily on topics such as geological evidence for Noah's flood, the Ice Age, and the mass extinction of the Woolly Mammoths. He speaks regularly at creation conferences and other venues and has served on the board of directors of the Creation Research Society since 2001.\n\nMike received his Masters of Science degree in Atmospheric Science from the University of Washington in 1973. He then worked as a meteorologist for the U.S. National Weather Service until 2001, and as the lead forecaster in Montana from 1981 to 2001","torrent":{"xt":"urn:btih:022c8cc83632b704965847c043d31ca1b7c11a36","amp;dn":"The+Genesis+Flood+and+Floating+Log+Mats+-+Michael+Oard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"022c8cc83632b704965847c043d31ca1b7c11a36","infoHashBuffer":{"type":"Buffer","data":[2,44,140,200,54,50,183,4,150,88,71,192,67,211,28,161,183,193,26,54]},"announce":[],"urlList":[]}}