{"title":"Bob Marley And The Wailers - Catch A Fire (1973) WMA320","uid":6068760,"size":112363341,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0303bf61f66a00f1da34bb4ed845511205750da0&amp;dn=Bob+Marley+And+The+Wailers+-+Catch+A+Fire+%281973%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1293514891,"description":"In The Wailers' &quot;Catch A Fire&quot; and &quot;Burnin'&quot; (both released in the same year, 1973), the group released two instant classics that they never surpassed in terms of artistry, musicianship, rhythm foundation or edginess. And these two albums were also the last two that the original Wailing Wailers (Marley, Tosh, Bunny) made together. \nA blend of new and old (such familiar tracks as &quot;Concrete Jungle,&quot; &quot;Slave Driver,&quot; &quot;400 Years,&quot; &quot;Stop that Train&quot; from &quot;Catch A Fire,&quot; and &quot;Put It On,&quot; &quot;Small Axe&quot; and &quot;Duppy Conqueror&quot; from &quot;Burnin'&quot; were remakes), these albums were the Wailers first releases with the intent to reach an international, mainstream audience. Blending in some rock influences such as the guitar style, and toning down the bass and drum for more treble sounds to reach the rock audiences in Europe and America, the Wailers debut on Island label snuck up slowly on these listeners, just as the intro to &quot;Concrete Jungle&quot; slowly rolls in, opening the &quot;Catch A Fire&quot; album. There may be some lesser, lighter moments on both albums, but no songs are throwaway, no songs are filler. \nSadly, despite being full of gems and instant Wailers classics, original members Peter Tosh and Bunny Wailer left to start solo careers, feeling they were in the shadow of Bob, and had their own stories to tell musically. It was more unfortunate, because Bob Marley and the Wailers (as the group became known) never surpassed the quality of these albums on later efforts. With Tosh's departure went the edgy, bassy rhythm sounds, and with both Bunny and Tosh went the delectable harmonies they provided behind Bob's lead vocals. If there are only two albums in the Wailers library of music, they go by the names &quot;Catch A Fire&quot; and &quot;Burnin'.&quot; They both had a stark, unadulterated emotion and edge that Bob Marley's more pop-influenced efforts lack. With the departures of Tosh and Bunny, it felt as if a light was being extinguished. But listening to these albums again, makes me remember back to a time, when the childhood friends were like brothers, making music together until the sun came up. Listening to these albums is bittersweet, but I can still relive those times listening to the sweet, harmonious music they made together, as family, reminiscing to a time when something truly mystical, magical was happening in the studio. But with the breakup of the original Wailing Wailers, the circle was broken, the fire doused, and what once was one, was splintered into three, to never join back together again. &quot;In the ghetto, bitter was sweet.....&quot; \n\nby SteppingRZA\n\nTRACKLIST:\n\n01 - Concrete Jungle.wma                          \n02 - Slave Driver.wma                             \n03 - 400 Years.wma                                \n04 - Stop That Train.wma                          \n05 - Baby We've Got A Date (Rock It Baby).wma     \n06 - Stir It Up.wma                               \n07 - Kinky Reggae.wma                             \n08 - No More Trouble.wma                          \n09 - Midnight Ravers.wma                          \n10 - High Tide Or Low Tide (Bonus Track).wma      \n11 - All Day All Night (Bonus Track).wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:0303bf61f66a00f1da34bb4ed845511205750da0","amp;dn":"Bob+Marley+And+The+Wailers+-+Catch+A+Fire+%281973%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0303bf61f66a00f1da34bb4ed845511205750da0","infoHashBuffer":{"type":"Buffer","data":[3,3,191,97,246,106,0,241,218,52,187,78,216,69,81,18,5,117,13,160]},"announce":[],"urlList":[]}}