{"title":"Dan Brown, The Lost Symbol Audiobook Eng iTunes .m4b format","uid":5144364,"size":673072089,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:039639b342b8ec9044c9cb42764184d4c4c90bfa&amp;dn=Dan+Brown%2C+The+Lost+Symbol+Audiobook+Eng+iTunes+.m4b+format&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"EthanCase","files":134,"time":1257137294,"description":"Dan Brown, The Lost Symbol 2009 English Audiobook\n\niTunes Audiobook format .m4b AAC audio files\n\nEncoded with iTunes 9.0.1.8 @ 96kbps Stereo\n\n134 Files 17h51:33 641MB Perfect Quality\n\n\nThe Lost Symbol, the stunning follow-up to The Da Vinci Code, is a masterstroke of storytelling - a deadly race through a real-world labyrinth of codes and unseen truths...all under the watchful eye of a terrifying villain. Set within the unseen tunnels and temples of Washington, D.C., The Lost Symbol accelerates through a startling landscape toward an unthinkable finale.\n\nHarvard symbologist Robert Langdon is summoned to deliver an evening lecture in the U.S. Capitol. Within minutes of his arrival, the night takes a bizarre turn. A disturbing object - artfully encoded with five ancient symbols - is discovered in the Capitol Building. The object is an ancient invitation, meant to usher its recipient into a long-lost world of hidden esoteric wisdom. And when Langdon's mentor Peter Solomon - prominent Mason and philanthropist - is kidnapped, Langdon's only hope of saving Peter is to accept this invitation and follow wherever it leads him. Langdon finds himself plunged into a clandestine world of Masonic secrets, hidden history, and never-before-seen locations...all of which seem to be dragging him toward a single, inconceivable truth.\n\nThe Lost Symbol is exactly what Dan Brown's fans have been waiting for...his most thrilling novel yet.\t","torrent":{"xt":"urn:btih:039639b342b8ec9044c9cb42764184d4c4c90bfa","amp;dn":"Dan+Brown%2C+The+Lost+Symbol+Audiobook+Eng+iTunes+.m4b+format","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"039639b342b8ec9044c9cb42764184d4c4c90bfa","infoHashBuffer":{"type":"Buffer","data":[3,150,57,179,66,184,236,144,68,201,203,66,118,65,132,212,196,201,11,250]},"announce":[],"urlList":[]}}