{"title":"Dependency Injection with AngularJS, 2013 [PDF]~StormRG~","uid":9508930,"size":3162134,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03d69b88e5aefb8a19e90cb3b3df77e555b237bc&amp;dn=Dependency+Injection+with+AngularJS%2C+2013+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"steelballz","files":-1,"time":1390365766,"description":"Description\nDependency Injection with AngularJS\nAuthor: Alex Knol\nPublished: December 18, 2013\nPublisher: Packt Publishing\nISBN: 1782166564\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nBook Description\nPublication Date: December 18, 2013\nIn Detail\n\nDependency injection facilitates better testing by allowing us to mock dependencies in testing environments so that we only test one thing at a time. It also enables us to write more maintainable code by decoupling our objects from their implementations. The motivation for using it in AngularJS is to make it easier to transparently load mocked objects in tests.\n\nThis book is a practical manual to get you started on dependency injection. It will also take you along the road to creating testable and reusable code. Ensuring productivity and stability are the two most important things that you will learn.\n\n&quot;Dependency Injection with AngularJS&quot; will introduce you to AngularJS using a simple sample project. By portraying different ways of developing code modules, it will show you the advantages of dependency injection. This will lead to the ability to create reusable components that can easily be tested.\n\nThe book contains a section that will show you how to make a chart component to display historical data. A short chapter will explain some of the theory and the reasons behind dependency injection. You will be introduced to Jasmine, a JavaScript behavior-driven development testing framework. You will learn how to test your code in real browsers using Karma, the lightning fast AngularJS test runner. Lastly the book will show you how to build reusable components you can stack on top of each other.\n\nYou will learn everything you need to know how to use dependency injection with AngularJS.\n\nApproach\n\nThis book is a practical, hands-on approach to using dependency injection and implementing test-driven development using AngularJS.\n\nWho this book is for\n\nDependency Injection with AngularJS is aimed at developers who are aware of AngularJS but need to get started with using it in real life applications. Also, developers who want to get into test-driven development with AngularJS can use this book as practical guide. Even if you know about dependency injection, it can serve as a good reference on how it is used within AngularJS. Readers are expected to have some experience with JavaScript.\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:03d69b88e5aefb8a19e90cb3b3df77e555b237bc","amp;dn":"Dependency+Injection+with+AngularJS%2C+2013+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03d69b88e5aefb8a19e90cb3b3df77e555b237bc","infoHashBuffer":{"type":"Buffer","data":[3,214,155,136,229,174,251,138,25,233,12,179,179,223,119,229,85,178,55,188]},"announce":[],"urlList":[]}}