{"title":"Edison Lighthouse - The Best Of Edison Lighthouse: Love Grows (W","uid":4874536,"size":64247981,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:040a832d4a64b92060f2f5a19d4f553de980986a&amp;dn=Edison+Lighthouse+-+The+Best+Of+Edison+Lighthouse%3A+Love+Grows+%28W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Iron_Horse","files":18,"time":1241052906,"description":"Edison Lighthouse - The Best Of Edison Lighthouse: Love Grows (Where My Rosemary Goes) 1970-72\nCD (2001) To Mp3 182 mbit/s\nIncluded: CD Covers and this Info\n\nReview   by Stephen Thomas Erlewine  allmusic.com\nRepertoire's Best of Edison Lighthouse proves that while the studio-created group was a one-hit wonder, they nevertheless recorded several other bubblegum AM pop songs that were equally engaging and frothy. These may not be substantial songs, but they're well-crafted, appealingly silly, and certain to engage anybody who loved &quot;Love Grows Where My Rosemary Grows.&quot; This is pretty much as good as bubblegum got. \n\n\n&quot;Love Grows (Where My Rosemary Goes)&quot; &lt;a href=&quot; http://en.wikipedia.org/wiki/Love_Grows_(Where_My_Rosemary_Goes)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Love_Grows_(Where_My_Rosemary_Goes)&lt;/a&gt;\n&quot;Love Grows (Where My Rosemary Goes)&quot; was written by Tony Macaulay, Barry Mason and Sylvan Whittingham. Essentially they were a studio group with prolific session singer Tony Burrows providing the vocals. When the song became number one a group needed to be put together rapidly to feature on the popular TV show Top Of The Pops. Sylvan Whittingham found a group called Greenfields and brought them to the auditions a week before Top of the Pops. Once chosen and rehearsed non stop they appeared on the show as 'Edison Lighthouse' to mime to the fastest climbing no 1 hit record in history. Burrows sang the song on the programme, which happened to be his third appearance on the same show with three different groups.[1] It reached number 5 on US pop chart, number 3 in Canada, and number 1 on the UK Singles Chart for five weeks in January and February 1970.\n\n\n&quot;Edison Lighthouse&quot; &lt;a href=&quot; http://en.wikipedia.org/wiki/Edison_Lighthouse&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Edison_Lighthouse&lt;/a&gt;\nEdison Lighthouse was a UK pop group, initially a studio only assemblage that served as a vehicle for session vocalist Tony Burrows and songwriter/record producers Tony Macaulay and Barry Mason. They are best known for their 1970 UK chart-topper and million selling record, &quot;Love Grows (Where My Rosemary Goes)&quot;\n\nCareer\nThe 'original' Edison Lighthouse was Tony Burrows (lead vocalist), Stuart Edwards (lead guitar), David Taylor (bass guitar), George Weyman (drums) and Ray Dorey (guitar). The group's lone Top 40 hit &quot;Love Grows (Where My Rosemary Goes)&quot; (1970) was one of four near contemporaneous UK Singles Chart Top Ten hit singles by Burrows under different names, the others being White Plains' &quot;My Baby Loves Lovin'&quot;, The Pipkins' &quot;Gimme Dat Ding&quot;, and Brotherhood of Man's &quot;United We Stand&quot;. Burrows was also lead vocalist on the single &quot;Beach Baby&quot; (1974) for another studio only group, The First Class.\n\n&quot;Love Grows (Where My Rosemary Goes)&quot; was Number One for five weeks and sold 250,000 copies in the UK. &quot;Love Grows&quot; raced to the Number One position in its second week on the chart, which was at the time the quickest rise by an act new to the chart. The United States release was in February 1970 and reached Number 4 in the Billboard Hot 100, selling a million copies there by April earning the R.I.A.A. gold disc. In Canada the song reached #3.\n\nAfter the success of &quot;Love Grows&quot;, Burrows left to pursue other projects, and Macaulay, who owned the rights to the Edison Lighthouse name, assembled another group of musicians to record under the name. Members of the group Greenfield Hammer were brought in to perpetuate the image of a real working band. Actor and singer Paul Vigrass replaced Burrows and other members of the re-assembled group were David Kerr-Clemenson (bass guitar), Andy Locke (guitar), Eddie Richards (drums) and Wally Scott (guitar). This second edition of Edison Lighthouse cracked the UK Top 50 with the single &quot;It's Up to You Petula&quot; which got to number 29, outselling the no 1 at the time, but because of the postal strike, returns were not sent in by the record shops. The next single &quot;What's Happening&quot;/ coupled with Take a Little Time, which was written by the band, became a huge hit in Japan and the band received silver discs for it. They then went on to tour Australia, New Zealand, Singapore, Malasia and Africa, causing a bit of a stir at the time. The single released for the Africa tour was &quot;Reconsider my Belinda&quot; which had huge success in the African continent. The last single released was &quot;Find Mr Zebedee&quot;. The band then called it a day after returning from a tour of Europe. Dave Kerr-Clemenson, after touring with White Plains and Andy Locke, went on to form Fast Buck and recorded an album with Jet records for the one and only Don Arden/Sharon's dad and toured the world extensively supporting ELO. Eddie Richards was the drummer in First Class who had a hit with Beach Baby. In 2001, Les Fradkin, obtaining the trademark to the name Edison Lighthouse, formed a new group for touring and recording. The lack of further chart activity leaves the group with transatlantic one-hit wonder status.\n\nOrigin of the name\nEdison Lighthouse was named after the Eddystone Lighthouse, a lighthouse off the coast of Cornwall.\n\nOriginal band members:\nTony Burrows (born 14 April 1942, Exeter, Devon)\nStuart Edwards (born 9 June 1946, Maidenhead, Berkshire)\nDavid Taylor (born 7 October 1950, High Wycombe, Buckinghamshire)\nGeorge Weyman (born 18 May 1949, Herne Bay, Kent)\nRay Dorey (born 22 February 1949, Windsor, Berkshire)\n\nTracklist:\n01. Love Grows (Where My Rosemary Goes)\n02. She Works in a Woman's Way\n03. It's Up to You, Petula\n04. What's Happening\n05. Find Mr. Zebedee\n06. Every Lonely Day\n07. It's Gomma Be a Lonely Summer\n08. Let's Make It Up\n09. Take a Little Time\n10. Reconsider, My Belinda\n11. Every Little Move She Makes\n12. In the Bad, Bad Old Days (Before You Loved Me)\n13. Take Me in Your Arms\n14. Melanie Makes Me Smile","torrent":{"xt":"urn:btih:040a832d4a64b92060f2f5a19d4f553de980986a","amp;dn":"Edison+Lighthouse+-+The+Best+Of+Edison+Lighthouse%3A+Love+Grows+%28W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"040a832d4a64b92060f2f5a19d4f553de980986a","infoHashBuffer":{"type":"Buffer","data":[4,10,131,45,74,100,185,32,96,242,245,161,157,79,85,61,233,128,152,106]},"announce":[],"urlList":[]}}