{"title":"RED : My Autobiography by Gary Neville","uid":6668061,"size":9115985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0414b2bba6d1cefe88f911b3e4fd7e0723c03e68&amp;dn=RED+%3A+My+Autobiography+by+Gary+Neville&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"N33","files":4,"time":1315769207,"description":"No player has been more synonymous with the glory years of Manchester United Football Club over the past two decades than right-back Gary Neville. An Old Trafford regular since he attended his first match at the age of six, captain of the brilliant 1992 FA Youth Cup-winning team that became known as \\'Fergie\\'s Fledgling\\', outspoken representative of MUFC, Neville is the ultimate one-club man. He has been at the heart of it all and, at the end of an amazing career, is now ready to tell it all.\n\nAuthoritative, insightful, fearless and never less than 100% honest, no-one has better credentials for documenting the story of United under Sir Alex Ferguson. Neville reveals the behind-the-scenes secrets of his early days with the likes of Giggs, Scholes and his best mate David Beckham; what it was like to play with Cantona, Keane and Ronaldo; the Treble in 1999; and of course an entire career of playing for the greatest manager in the game.\n\nThen there are all his experiences with England, from being the youngest starter at Euro 96 when football came home, to the ups and downs of five major championships and seven managers - Venables, Hoddle, Wilkinson, Keegan, Eriksson, McClaren and Capello. There are opinions and analysis on Gazza, Rooney, WAGs and the true story of the FA and Rio Ferdinand.\n\nFor twenty glorious years, Gary Neville has worn his heart on his sleeve. This is his story.\n\nContains: PDF and EPUB\n\nPlease buy the book if you enjoy it!\n\n1st ever upload hope you all enjoy and seed!","torrent":{"xt":"urn:btih:0414b2bba6d1cefe88f911b3e4fd7e0723c03e68","amp;dn":"RED+%3A+My+Autobiography+by+Gary+Neville","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0414b2bba6d1cefe88f911b3e4fd7e0723c03e68","infoHashBuffer":{"type":"Buffer","data":[4,20,178,187,166,209,206,254,136,249,17,179,228,253,126,7,35,192,62,104]},"announce":[],"urlList":[]}}