{"title":"10.Rillington.Place.1971.720p.WEB-DL.AAC2.0.H.264-ViGi","uid":10294055,"size":3369594607,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:044b10175e8c65bc8658bd65256a807a31f9b213&amp;dn=10.Rillington.Place.1971.720p.WEB-DL.AAC2.0.H.264-ViGi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mfccorrea","files":1,"time":1401898841,"description":"London, 1949. John Christie is an unassuming, middle aged man who, along with his wife Ethel, manages the apartment building at 10 Rillington Place. His unassuming demeanor masks the fact of being a serial killer. His modus operandi is to act as a person with a medical background, lure unsuspecting women to his apartment on the pretense of curing them of some ailment, knock them unconscious with carbon monoxide gas, gain his sexual release through contact with the unconscious body, then strangle the victim dead before disposing of the body usually by burying it in his back yard. His next intended target is Beryl Evans, a young woman who has just moved into a flat in his building. Beryl's husband, Tim Evans, is an illiterate man who likes to put on airs. Already with an infant daughter named Geraldine, the Evanses learn they are going to have another baby, which they cannot afford to have, nor can they afford to abort the pregnancy. This problem, on top of the constant issue of lack of money in all aspects of their lives, places a strain on the marriage, of which all their neighbors are aware through the constant fighting they overhear. Christie will offer to perform the abortion for free. The difference with this intended murder is that Tim will be aware that his wife will have died, but Christie plans either to goad Tim into keeping silent since the abortion would have been illegal, an act to which Tim would have provided his consent, or pin the murder on Tim who would have motive. Will this change in modus operandi affect Christie's ability to kill Beryl, or kill her without detection? \n\nRip Specs (Web-DL HD):\n\nGeneral           : 10.Rillington.Place.1971.720p.WEB-DL.AAC2.0.H.264-ViGi.mkv\nFormat            : Matroska at 4 051 Kbps\nLength            : 3.14 GiB for 1h 50mn 54s 954ms\n\nVideo #0          : AVC\nAspect            : 1280 x 718 (1.783) at 23.976 fps\n\nAudio #0          : AAC\nInfos             : 2 channels, 48.0 KHz\nLanguage          : en\n\nText #0           : UTF-8\nLanguage          : en\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066730/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066730/&lt;/a&gt;\n\nAudio: English\nSubtitles: English\n\n","torrent":{"xt":"urn:btih:044b10175e8c65bc8658bd65256a807a31f9b213","amp;dn":"10.Rillington.Place.1971.720p.WEB-DL.AAC2.0.H.264-ViGi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"044b10175e8c65bc8658bd65256a807a31f9b213","infoHashBuffer":{"type":"Buffer","data":[4,75,16,23,94,140,101,188,134,88,189,101,37,106,128,122,49,249,178,19]},"announce":[],"urlList":[]}}