{"title":"Trine 2 - Complete Story - FULL Cracked - Foxy Games","uid":9055297,"size":3765729540,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:04fdb3aeef2bdffe4bba759621763082934970d6&amp;dn=Trine+2+-+Complete+Story+-+FULL+Cracked+-+Foxy+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"redfoxygames","files":-1,"time":1381940625,"description":"Trine 2 is a puzzle platform video game, requiring the player to use the skills of the three characters, Amadeus the wizard, Zoya the thief, and Pontius the knight, to cross each game level. As with the first game, the mystical &quot;Trine&quot; has bound the three characters together into one common entity, and thus the player controls only one character which can be switched to the other two at any time. Each of the characters has unique abilities: Amadeus can use magic to grab onto certain objects in the game world, and create boxes and planks to be used to get around; Zoya can strike at objects with her arrows, and grapple onto certain surfaces; and Pontius is strong in combat against foes, can bash apart walls, and deflect projectiles with his shield. A combination of these elements are necessary to complete each stage in the game's world.\n &lt;a href=&quot;\nhttp://yuq.me/users/23/145/zVFJrpgvqE.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yuq.me/users/23/145/zVFJrpgvqE.png&lt;/a&gt; &lt;a href=&quot;\nhttp://yuq.me/users/23/145/ERgDjNuz4U.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yuq.me/users/23/145/ERgDjNuz4U.png&lt;/a&gt; &lt;a href=&quot;\nhttp://yuq.me/users/23/145/l8SohpMvVR.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yuq.me/users/23/145/l8SohpMvVR.png&lt;/a&gt; &lt;a href=&quot;\nhttp://yuq.me/users/23/145/3IdylarM8G.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yuq.me/users/23/145/3IdylarM8G.png&lt;/a&gt; &lt;a href=&quot;\nhttp://yuq.me/users/23/145/Mz8CHjSI1R.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yuq.me/users/23/145/Mz8CHjSI1R.png&lt;/a&gt;\n\nCharacters have individual life meters, and if one character's meter depletes, that character cannot be used until the next checkpoint is reached. If all three characters lose their life meter, the player must start back at the last checkpoint. Throughout the game world are special magical vials, and for every fifty of these collected, the player receives a skill point, which can be used to gain abilities through a skill tree for each character. These skill points can be used collectively for each of the three characters, and can be traded between them.\n\nTrine 2 also supports up to three players in a cooperative mode. In this mode, each player controls one of the three characters, but all must be unique; three players will be forced to play as Amadeus, Zoya, and Pontius. Two players can switch characters as long as both agree to the swap. If a character dies, the other players can revive the character at the next checkpoint. The skill tree is shared among all characters, based on the hosting player's saved game.\n\nStory elements are incorporated into the game through the use of an all knowing narrator (voiced by Terry Wilton) as well as in-game scripted sequences. Scattered throughout the levels are also letters, poems, and documents which further flesh out the backstory and provide additional insight into the game's characters.\n\n\nComplete Story edition:\n\nA patch released June 6, 2013 for the Steam version of Trine 2 upgraded it to the Trine 2: Complete Story edition. This new edition includes the Dwarven Caverns level previously available only in the Director's Cut version from the Wii U. A cross-platform and DRM free release of Trine 2: Complete Story was then later made available as part of Humble Indie Bundle 9","torrent":{"xt":"urn:btih:04fdb3aeef2bdffe4bba759621763082934970d6","amp;dn":"Trine+2+-+Complete+Story+-+FULL+Cracked+-+Foxy+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04fdb3aeef2bdffe4bba759621763082934970d6","infoHashBuffer":{"type":"Buffer","data":[4,253,179,174,239,43,223,254,75,186,117,150,33,118,48,130,147,73,112,214]},"announce":[],"urlList":[]}}