{"title":"Ronald S. Irving - Beyond the Quadratic Formula","uid":11127097,"size":1437541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:054a8722799ecd4d4df9fefcef2bd252de9287b0&amp;dn=Ronald+S.+Irving+-+Beyond+the+Quadratic+Formula&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SectorVector","files":-1,"time":1411983959,"description":"\nBeyond the Quadratic Formula (Classroom Resource Materials)\n\nby Ronald S. Irving.\n\nPages     : 244.\nPublisher : The Mathematical Association of America, 2013\nSeries    : Classroom Resource Materials\nISBN-13   : 978-0883857830\nFormat    : PDF\n\n\nThe  quadratic formula  for the  solution of  quadratic equations  was\ndiscovered independently by  scholars in many ancient  cultures and is\nfamiliar to  everyone. Less well  known are formulas for  solutions of\ncubic and quartic equations whose discovery was the high point of 16th\ncentury mathematics. Their study forms the heart of this book, as part\nof the broader  theme that a polynomial's coefficients can  be used to\nobtain detailed information on its roots.\n\n\nThe book  is designed for  self-study, with many results  presented as\nexercises and some supplemented by outlines for solution. The intended\naudience  includes in-service  and  prospective secondary  mathematics\nteachers,  high  school  students  eager to  go  beyond  the  standard\ncurriculum, undergraduates who desire an in-depth look at a topic they\nmay have unwittingly skipped over,  and the mathematically curious who\nwish  to do  some  work  to unlock  the  mysteries  of this  beautiful\nsubject.\n\n\nContents\n========\n\n 1. Polynomials\n 2. Quadratic polynomials\n 3. Cubic polynomials\n 4. Complex numbers\n 5. Cubic polynomials, II\n 6. Quartic polynomials\n 7. Higher-degree polynomials\n    Bibliography\n\n\nAuthor\n======\nRonald Irving has been a Professor of Mathematics at the University of\nWashington since 1981,  prior to which he  held postdoctoral positions\nat Brandeis University, the University of Chicago, and UCSD. He became\nchair  of the  University  of Washington's  mathematics department  in\n2001, Divisional Dean of Natural Sciences in 2002, and Interim Dean of\nArts  and Sciences  in  2006.  In 2003,  Irving  joined  the Board  of\nGovernors of  the Astrophysical  Research Consortium and  continues to\nserve as the secretary-treasurer of the consortium.\n\nSince 2010, he  has been a member  of the external board  of the Burke\nMuseum  of Natural  History  and Culture,  one  of Washington's  state\nmuseums  and a  part  of the  University of  Washington.  Irving is  a\nmember of  the Mathematical  Association of  America and  the American\nMathematical Society.\n\n-_-","torrent":{"xt":"urn:btih:054a8722799ecd4d4df9fefcef2bd252de9287b0","amp;dn":"Ronald+S.+Irving+-+Beyond+the+Quadratic+Formula","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"054a8722799ecd4d4df9fefcef2bd252de9287b0","infoHashBuffer":{"type":"Buffer","data":[5,74,135,34,121,158,205,77,77,249,254,252,239,43,210,82,222,146,135,176]},"announce":[],"urlList":[]}}