{"title":"Eric B &amp; Rakim - Follow The Leader [FLAC] - Kitlope","uid":4211519,"size":257526334,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:05552deaced6f5b8ef6deb88a5032c3dafc12dcc&amp;dn=Eric+B+%26+Rakim+-+Follow+The+Leader+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Kitlope","files":15,"time":1212092491,"description":"Cd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 05552DEACED6F5B8EF6DEB88A5032C3DAFC12DCC\nFile Size: 246 Mb\nYear: 1988\nLabel: Uni/MCA\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nEric Barrier (Eric B.) and Rakim Allah (Rakim), were a hip-hop duo known as Eric B. &amp; Rakim. The pair is generally considered to be one of the most influential and groundbreaking groups in the history of hip hop, due to their dark production and Rakim&amp;#039;s revolutionary rhyming style, which was smooth, seemingly effortless, and used remarkably complex rhyming schemes involving internal rhymes and sophisticated metaphors. Their single &quot;I Know You Got Soul,&quot; which borrowed extensively from the Bobby Byrd record &quot;I Know You Got Soul,&quot; was one of the era&amp;#039;s stand-out James Brown-influenced recordings, and further popularized the extensive sampling of Mr. Brown&amp;#039;s catalogue in an addition to other similar soul and funk artists.\n\nEric B. &amp; Rakim began recording together in the middle of the decade with &quot;Eric B. Is President&quot; (1986 in music) from Zakia Records in Harlem, New York City. The single, produced by Eric B., who incorporated the bassline from the R&amp;B club hit &quot;Over Like A Fat Rat&quot; by Fonda Rae, quickly became a hip-hop anthem. Paid in Full and Follow the Leader were their full-length debuts and were hits by hip hop&amp;#039;s standards at the time. In 1989 the pair teamed up with singer Jody Watley for the Billboard pop top ten hit &quot;Friends&quot; featured on Watley&amp;#039;s Larger Than Life album; this was one of the first collaborations of pop and hip hop artists. Much of their initial impetus and influence can be attributed to their now deceased mentor and deejay, FLAME 3 of the TPA graffiti crew.\n\nThe Coldcut &quot;Seven Minutes Of Madness&quot; remix of &quot;Paid In Full&quot; is considered a milestone in hip hop, remixes and sample based music and is arguably the groups most recognized hit. Despite its world wide success which led to the track entering many overseas top ten music charts, the duo claimed not to like the remix during its release.\n\nThe duo&amp;#039;s last album together was Don&amp;#039;t Sweat The Technique (1992). Its single &quot;Know The Ledge&quot; was the theme song to the urban feature film, Juice. The song was among their most popular hits. During the recording of that album, both members of the duo expressed an interest in creating solo albums. However, Eric B. refused to sign the label&amp;#039;s release contract, fearful that Rakim would abandon him. This led to a long and messy court battle involving the two musicians and their former label MCA.\n\nIn 2004 &quot;I Know You Got Soul&quot; appeared on popular videogame Grand Theft Auto: San Andreas, playing on classic hip hop radio station Playback FM.\n\n\nFollow The leader\n\n\nFollow the Leader is the 1988 follow-up to Eric B. &amp; Rakim&amp;#039;s groundbreaking debut album Paid in Full. Like that LP, Follow the Leader spawned no major hits at the time of its release, but is now generally recognised as one of the most groundbreaking and influential hip-hop albums of all time. In 1998, the album was selected as one of The Source Magazine&amp;#039;s 100 Best Rap Albums, and in 2005, it was ranked 12th on comedian Chris Rock&amp;#039;s list of the Top 25 Hip-Hop Albums ever [1].\n\nToday, the most well-known song from the album is probably &quot;Microphone Fiend&quot;, in which Rakim raps a portrait about his growth and addiction to hip-hop. In 2000, Rage Against the Machine covered this song for their cover album Renegades. The Fun Lovin&amp;#039; Criminals also did a cover of this track in their 2001 album Loco.\n\nThe song &quot;Lyrics of Fury&quot; ranked #5 in the 100 Greatest Rap Songs\n\n\n\n--Samples--\n\n\nFollow the Leader\n\n&quot;Nautilus&quot; by Bob James \n&quot;Listen To Me&quot; by Baby Huey \n&quot;I Wouldn&amp;#039;t Change a Thing&quot; by Coke Escovedo \n\n\n\nMicrophone Fiend\n\n&quot;Schoolboy Crush&quot; by Average White Band \n&quot;Change le Beat&quot; by B-Side &amp; Fab Five Freddy \n\n\n\nLyrics of Fury\n\n&quot;Funky Drummer&quot; by James Brown \n&quot;No Head, No Backstage Pass&quot; by Funkadelic \n\n\n\nEric B. Never Scared\n\n&quot;Those Shoes&quot; by the Eagles \n&quot;Get Up, Stand Up&quot; by Bob Marley &amp; The Wailers \n\n\n\nJust A Beat\n\n&quot;Pussyfooter&quot; by Jackie Robinson \n\n\n\nPut Your Hands Together\n\n&quot;Long Red&quot; by Mountain \n&quot;Handclapping Song&quot; by The Meters \n&quot;Give It To You&quot; by UPP \n&quot;Scratchin&quot; by Magic Disco Machine \n\n\n\nThe R\n\n&quot;Rock Creek Park&quot; by Blackbyrds \n&quot;Space Funk&quot; by Manzels \n\n\n\nMusical Massacre\n\n&quot;It&amp;#039;s Just Begun&quot; by Jimmy Castor Bunch \n&quot;Change Le Beat&quot; by B-Side &amp; Fab Five Freddy \n&quot;I Know You Got Soul&quot; by Eric B. &amp; Rakim \n\n\n\n\n\nTracks\n      \n\n&quot;Follow the Leader&quot; \n&quot;Microphone Fiend&quot; \n&quot;Lyrics of Fury&quot; \n&quot;Eric B. Never Scared&quot; \n&quot;Just a Beat&quot; \n&quot;Put Your Hands Together&quot; \n&quot;To the Listeners&quot; \n&quot;No Competition&quot; \n&quot;The R&quot; \n&quot;Musical Massacre&quot; \n&quot;Beats for the Listeners&quot; \n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:05552deaced6f5b8ef6deb88a5032c3dafc12dcc","amp;dn":"Eric+B+%26+Rakim+-+Follow+The+Leader+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05552deaced6f5b8ef6deb88a5032c3dafc12dcc","infoHashBuffer":{"type":"Buffer","data":[5,85,45,234,206,214,245,184,239,109,235,136,165,3,44,61,175,193,45,204]},"announce":[],"urlList":[]}}