{"title":"The Future of Aging - Pathways to Human Life Extension{BBS}","uid":6658138,"size":16333077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:055f7b6361fec14738314018a08770c4f5b9804d&amp;dn=The+Future+of+Aging+-+Pathways+to+Human+Life+Extension%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315402103,"description":"Just as the health costs of aging threaten to bankrupt developed countries, this book makes the scientific case that a biological &quot;bailout&quot; could be on the way, and that human aging can be different in the future than it is today. Here 40 authors argue how our improving understanding of the biology of aging and selected technologies should enable the successful use of many different and complementary methods for ameliorating aging, and why such interventions are appropriate based on our current historical, anthropological, philosophical, ethical, evolutionary, and biological context. Challenging concepts are presented together with in-depth reviews and paradigm-breaking proposals that collectively illustrate the potential for changing aging as never before. The proposals extend from today to a future many decades from now in which the control of aging may become effectively complete. Examples include sirtuin-modulating pills, new concepts for attacking cardiovascular disease and cancer, mitochondrial rejuvenation, stem cell therapies and regeneration, tissue reconstruction, telomere maintenance, prevention of immunosenescence, extracellular rejuvenation, artificial DNA repair, and full deployment of nanotechnology. The Future of Aging will make you think about aging differently and is a challenge to all of us to open our eyes to the future therapeutic potential of biogerontology.\nProduct Details\n\n    * Hardcover: 883 pages\n    * Publisher: Springer; 1st Edition. edition (October 2, 2010)\n    * Language: English\n    * ISBN-10: 9048139988\n    * ISBN-13: 978-9048139989","torrent":{"xt":"urn:btih:055f7b6361fec14738314018a08770c4f5b9804d","amp;dn":"The+Future+of+Aging+-+Pathways+to+Human+Life+Extension%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"055f7b6361fec14738314018a08770c4f5b9804d","infoHashBuffer":{"type":"Buffer","data":[5,95,123,99,97,254,193,71,56,49,64,24,160,135,112,196,245,185,128,77]},"announce":[],"urlList":[]}}