{"title":"SWAT 4 with Expansion Pack HeXXa","uid":8203806,"size":1101712687,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:057c1d5ca7daf592a3878552395cf5daa3938d6d&amp;dn=SWAT+4+with+Expansion+Pack+HeXXa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"080586","files":-1,"time":1362076302,"description":"\n        ___ __________________  _______  ___  _____   \n       /   |   _   _____/   /  /   /  / /  _     February 26th, 2013\n      /    ~        __)_       /       / /  /_   \n          |    /         /       /     /    |     32/64 Bit Compatible   \n       ___|_  /_______  //___/  /___/  ____|__  / \n             /        /       _/      _/       / \n\n                   SWAT 4 + Stetchkov Syndicate\n\n                     EasyRun Version by HeXXa\n\n\n\nINFO\n_____________\n\nWe are bringing you a fun classic which includes the complete expansion pack.\n\nThis is a very easy menu driven way to play SWAT 4 and The Stetchkov Syndicate.\n\nThe Menu System helps you to very easily run the game.\n\nThis release is fully portable which means that you won't have to install anything!\nAlthough you might need to update DirectX.\nThere's a menu option in this App to install updated DirectX files if needed.\nThe extracted game files can be placed on an USB device and run without installation.\n\nYou can start 'SWAT 4' or the expansion 'SWAT 4 The Stetchkov Syndicate' \nwith the push of a menu button.\n\nEnjoy :)\n\n\nWorks with 32-Bit and 64-Bit OS\n\nBigger Image http://bayimg.com/EaJCIaAep\n\nPlease leave comments about which OS you run this on and if you have 32/64 Bit. \nTell us if you found it simple to use and how this release worked out for you.\n\n\n\nINSTRUCTIONS\n_____________\n\n1. Run SWAT4-HeXXa to Extract (Run as Admin). An Icon will be created on your Desktop.\n2. Follow the choices in the HeXXa App like 'DirectX Update'\n3. Press the Game button for 'SWAT 4' or 'Stetchkov Syndicate' to Start the Game.\n\n\n\n\nGREETiNGS\n_____________\n\nGreetings to SKIDROW, Razor 1911, Paradox, RELOADED, COMPLEX, iMARS, rhc, DAZ,\ntNe, eztv, MOMENTUM, MiNDTHEGAP, CRiMSON, ChattChitto.\n\n\n\n\n\nNETWORK PLAY\n_____________\n\nIn the game, select 'LAN' then click button 'DIRECT IP'. Type your friends IP address \nwho is hosting the server. Either that or you host and your friend(s) connects to you.\nThis way you can play with your friends connecting directly to their IP address.\nYou will need to accept SWAT4 in your Windows Firewall when Windows asks.\nThe person hosting the game server will also need to properly forward \nincoming packets in his/her router.\nSWAT 4-The Stetchkov Syndicate requires you to forward the UDP 10480-10483 ports.\nYou cannot connect to official Internet game servers running a cracked game \nsuch as this, so single player gaming or internet hosting with friends are the \navailable gaming options.\n\nSWAT 4 features several multiplayer game modes, all of which are team-based: \nSWAT versus suspects. Here is a list of the multiplayer modes.\n\nBarricaded Suspects:\nTeams gain points by arresting or killing members of the other team. \nThe team which hits the score limit first or has the highest score when the \nround time ends wins.\n\nVIP Escort:\nA random member of the SWAT team is selected to be the VIP. The suspects must arrest \nthe VIP, hold him for two minutes and then execute him. The SWAT team must escort the \nVIP to an extraction point on the map. \nIf the suspects kill the VIP without holding him for two minutes, SWAT wins. \nIf a SWAT team member kills the VIP, suspects win.\n\nRapid Deployment:\nThree to five bombs are placed throughout the map. The SWAT team must locate and \ndisable them all within a time limit, if they fail to do so, suspects win.\n\nCo-op: \nThis allows the player to play through the single-player missions with up to four \nother people taking the place of computer-controlled SWAT officers. In the expansion, \nCo-op can run on custom missions and with up to ten players per game, which can further \nbe split into two completely separate teams (red and blue) with a leader each. \nThis is not similar to single player teams where an element leader controls both teams.\n\n\n\nMINIMUM REQUIREMENTS\n_____________________\n\nOS: Windows XP\nProcessor: Intel Pentium III 1GHz or AMD 1.2GHz\nMemory: 256MB Memory\nHard Disk Space: 3GB Free\nGraphics: GeForce2+, Anything really, works on Portable computers and Netbooks\nDirectX: 9\n\nRECOMMENDED SYSTEM\n___________________\n\nOS: Windows XP &amp; Windows Vista &amp; Windows 7\nProcessor: Pentium 4 2GHz, AMD Athlon Equivalent or any Dual Core\nMemory: 1GB Memory\nGraphics: GeForce FX5200 or ATi 9600 or higher\nGame Uses same graphics engine as UT2k4 so if that runs fine, this one will too.\n\n\nReview Score on Metacritic \t85 / 100","torrent":{"xt":"urn:btih:057c1d5ca7daf592a3878552395cf5daa3938d6d","amp;dn":"SWAT+4+with+Expansion+Pack+HeXXa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"057c1d5ca7daf592a3878552395cf5daa3938d6d","infoHashBuffer":{"type":"Buffer","data":[5,124,29,92,167,218,245,146,163,135,133,82,57,92,245,218,163,147,141,109]},"announce":[],"urlList":[]}}