{"title":"[Jane_Hosie_Bounar,Kelly_Hart,Mitch_Geller]New Perspectives on A","uid":11075606,"size":347326615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05cebcee682b5345886d0942f236715bd286bd41&amp;dn=%5BJane_Hosie_Bounar%2CKelly_Hart%2CMitch_Geller%5DNew+Perspectives+on+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"zombie_rox","files":1,"time":1411329080,"description":"NEW PERSPECTIVES ON ADOBE PHOTOSHOP CS6, COMPREHENSIVE offers a critical-thinking approach to teaching Photoshop. This text explains and reinforces design software concepts and skills through the New Perspectives' signature case-based, problem-solving pedagogy. Students will transcend point-and-click skills to take full advantage of the software's utility.\n\nPublisher: Cengage Learning; 1 edition (April 15, 2013)\nLanguage: English\nISBN-10: 1133526314\nISBN-13: 978-1133526315\n\nEditorial Reviews\nAbout the Author\nAuthor and instructional design expert Jane Hosie-Bounar has written articles, textbooks, and online training for a variety of software products, including Microsoft Office, Windows 8, and Adobe Photoshop. She has also written about using Web 2.0 technology for research and collaboration, and to create and manage an online persona. In addition to writing technical books and online training, she is a fiction writer whose novel Life Belts won the Delacorte Press Prize.\n\nKelly Hart is a multimedia artist specializing in sophisticated conceptual and aesthetic design for user interfaces and public display as well as film, video, 2-D animation, and multimedia design. Kelly's background includes project management for a diverse range of large-scale media and multimedia projects. In addition to writing, teaching and running a full service multimedia design firm, she continues to produce and distribute her independent video art and has been shown in many prestigious national venues including KERA/PBS &quot;Frame of Mind&quot;, Syracuse University, Dallas Video Festival, Mackinney Arts Center, Axlegrease &quot;Squeaky Wheel&quot;, Philadelphia DUTV 54, Manhattan (35) &quot;Bijou Matinee&quot;, MacWorld and Siggraph.\n\nCombining backgrounds in Art, Psychology and Media Technologies with 12 years as a University Professor, Mitch Geller divides his time between running Nu-Design, a full-service Multimedia/Web Design firm, working in digital imaging and video, and teaching the occasional seminar. His expertise includes advanced programming and artistic design for database, Web, CD-ROM and intranet based applications. He is a board member at DCCC Richland, has been on the faculty at MacWorld, featured in Siggraph, co-authored the bestselling New Perspectives on Dreamweaver series of books and has written a chapter for Virtual Publics (Yale University Press). His work has been shown internationally including: Video Witnesses; Festival of New Journalism, The Humboldt Film, INFERMENTAL7(200 City International Tour) International Festival of Progressive Film and Video, USA Film Festival, the Marin County Film and Video Exhibition, the United States Film and Video Festival, the Chicago International Film Festival, the 26th, and the 26th Festival Der Nationen. In his spare time he enjoys sleeping. \n","torrent":{"xt":"urn:btih:05cebcee682b5345886d0942f236715bd286bd41","amp;dn":"%5BJane_Hosie_Bounar%2CKelly_Hart%2CMitch_Geller%5DNew+Perspectives+on+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05cebcee682b5345886d0942f236715bd286bd41","infoHashBuffer":{"type":"Buffer","data":[5,206,188,238,104,43,83,69,136,109,9,66,242,54,113,91,210,134,189,65]},"announce":[],"urlList":[]}}