{"title":"Bad Company - Live At Wembley [320k MP3]","uid":10597457,"size":270126686,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:05fcfbab2411fd22a321d1c6d0ccf322d8a96b83&amp;dn=Bad+Company+-+Live+At+Wembley+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"smbdownload","files":-1,"time":1405874229,"description":"The six albums released by the original Bad Company between 1974 and 1982 arguably defined arena rock and, by extension, classic rock. The hard-hitting, no-frills, soulful sound created by vocalist Paul Rodgers (who also contributed piano and guitar occasionally), lead guitarist Mick Ralphs, bass guitarist Boz Burrell, and drummer Simon Kirke lives on through eternal radio airplay. Rodgers, Ralphs, Burrell, and Kirke reunited in 1999 to remind the public about the original band's legacy and downplay (if not bury) the Rodgers-less Bad Company lineups that experienced various levels of success from the late '80s through much of the 1990s. Burrell died in 2006, but Rodgers, Ralphs, and Kirke joined forces for a few short tours since then to keep the original Bad Company's musical flag flying proudly. Released in 2011, Live at Wembley captures a concert at London's Wembley Arena on April 11, 2010. (Since Burrell's passing, two members of Rodgers' solo band -- former Heart guitarist Howard Leese and bass guitarist Lynn Sorensen -- have supplemented the core surviving trio.) The band turns in a strong performance in its home country with all of the major pop and rock radio hits present and accounted for, often with extended intros and jams: &quot;Can't Get Enough,&quot; &quot;Run with the Pack,&quot; &quot;Seagull,&quot; &quot;Feel Like Makin' Love,&quot; &quot;Shooting Star,&quot; &quot;Rock and Roll Fantasy,&quot; &quot;Movin' On,&quot; &quot;Ready for Love,&quot; and &quot;Bad Company.&quot; Classics are expected during a concert, of course, but any live performance by a band of Bad Company's stature is fleshed out with album cuts, minor hits, and overlooked gems revered by die-hard fans. Therefore, &quot;Honey Child,&quot; the hit cover of the Coasters' &quot;Young Blood,&quot; &quot;Gone, Gone, Gone,&quot; &quot;Electric Land,&quot; &quot;Simple Man,&quot; and &quot;Deal with the Preacher&quot; truly complete the package. (The underappreciated &quot;Electric Land&quot; from 1982's otherwise lackluster Rough Diamonds is a major treat.) \n\n\nTrack Listing [320k MP3]\n\t\n\t\t\t\nCan't Get Enough \nHoney Child\nRun with the Pack\nBurnin' Sky\nYoung Blood\nSeagull\nGone, Gone, Gone\nElectric Land\nSimple Man\nFeel Like Makin' Love\nShooting Star\nRock and Roll Fantasy\nMovin' On\nReady for Love\nBad Company\nDeal with the Preacher\nBad Company Interviews","torrent":{"xt":"urn:btih:05fcfbab2411fd22a321d1c6d0ccf322d8a96b83","amp;dn":"Bad+Company+-+Live+At+Wembley+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05fcfbab2411fd22a321d1c6d0ccf322d8a96b83","infoHashBuffer":{"type":"Buffer","data":[5,252,251,171,36,17,253,34,163,33,209,198,208,204,243,34,216,169,107,131]},"announce":[],"urlList":[]}}