{"title":"Stossel.2013.11.21.[Real Charity].Fox Business.CF.avi","uid":9241654,"size":321706856,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:061f28d1821f7437f24a28e3d89eb6651925a95f&amp;dn=Stossel.2013.11.21.%5BReal+Charity%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1385286793,"description":"----------\n\nSTOSSEL - [Real Charity] - Fox Business Network\n2013, November 21, Thursday (via reair on 1123)\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nGOVERNMENT CHARITY: Newsday columnist Ellis Henican says what most Americans believe: it's mostly government's job to help the poor and those in trouble after disasters like Hurricane Katrina. We'll debate.\n\nGIVE DIRECTLY: Michael Faye co-founded the nonprofit organization GiveDirectly, which weirdly, gives $1,000 directly to poor people in Kenya. He says this form of charity works. I'm skeptical. But it's better than government aid.\n\nOBAMAPHONE: Jillian Kay Melchior of the National Review recently reported on free government cell phone fraud. She got three Obamaphones, even though she isn't &quot;eligible.&quot;\n\nBUSINESS OR CHARITY?: Billionaire Ted Turner once told me that his fellow billionaire Warren Buffet was &quot;cheap&quot; because he didn't give much to charity. But Ben Powell, director of the Free Market Institute at Texas Tech, says entrepreneurs help people more through innovation and job creation, than through charity. I think he's right.\n\nEND FOREIGN AID?: Gregory Adams, director of Oxfam's aid effectiveness program, says governments should spend more on foreign aid. But Magatte Wade, an African entrepreneur, says foreign aid does more harm than good.\n\nBLEEDING HEART LIBERTARIANS: Jason Brennan, a Georgetown University professor, promotes the website Bleeding Heart Libertarians. He says libertarians should embrace the concept of social justice.\n\nMY TAKE: I didn't always give to charity, but when I started getting paid to make speeches, I decided to donate that money. It changed my life. I realize I like giving money away. It makes me happy. But which charities should I give to? Charity rating websites are helpful but not definitive. They get lied to, don't include all charities, and the definition of &quot;program&quot; is fuzzy. I give to charities I can see, like Student Sponsor Partners, Central Park Conservancy, and the Doe Fund. I can watch them and judge how they're spending my money. Maybe that's the best gauge; give locally.","torrent":{"xt":"urn:btih:061f28d1821f7437f24a28e3d89eb6651925a95f","amp;dn":"Stossel.2013.11.21.%5BReal+Charity%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"061f28d1821f7437f24a28e3d89eb6651925a95f","infoHashBuffer":{"type":"Buffer","data":[6,31,40,209,130,31,116,55,242,74,40,227,216,158,182,101,25,37,169,95]},"announce":[],"urlList":[]}}