{"title":"Leonard Cohen - Old Ideas (2012) [2014_Qobuz 24-44,1]","uid":11823161,"size":450886993,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0653f9e3091816c55102d63f508aa5ab44aa1b1c&amp;dn=Leonard+Cohen+-+Old+Ideas+%282012%29+%5B2014_Qobuz+24-44%2C1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sidmal","files":13,"time":1429315914,"description":"Leonard Cohen - Old Ideas (2012/2014)\n FLAC (tracks) 24-bit/44,1 kHz | Time - 41:25 minutes | 452 MB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Old Ideas is the twelfth studio album by Canadian singer-songwriter Leonard Cohen, released in January 2012. It is Cohen's highest-charting release in the United States, reaching number 3 on the Billboard 200, 44 years after the release of his first album. The album topped the charts in 11 countries, including Finland, where Cohen became, at the age of 77, the oldest chart-topper, during the album's debut week.\n\n\n Leonard Cohen, has always possessed a droll, self-effacing sense of humor. He expresses it on the opening track of Old Ideas in the third person: &quot;I love to speak with Leonard/He's a sportsman and a shepherd/He's a lazy bastard/Living in a suit....&quot; It's just of the typical Cohen topical standards on offer here: spiritual yearning, struggle, love, loss, lust, and mortality are all in abundance, offered with the poet's insight. He is surrounded by friends on Old Ideas. Patrick Leonard, Dino Soldo, and Anjani Thomas get production and co-writing credits. Sharon Robinson, Dana Glover, Jennifer Warnes, and the Webb Sisters all appear on backing vocals. Cohen mixes up the musical forms more than he has in the past. The loungey electronic keyboards on &quot;Going Home&quot; are balanced by Glover's female backing chorale, an acoustic piano, and Bela Santelli's violin. The sly, minor-key Gypsy jazz groove on &quot;Amen&quot; is played by a banjo, violin, and Cohen's guitar; it tempers his searing lyric, which posits the notion that the totality of love, divine or otherwise, can only truly be achieved when the object of desire has seen his worst, metaphorically and literally. &quot;Show Me the Place&quot; finds Cohen once again adopting the Protestant hymnal as directly as he did on &quot;Hallelujah&quot; -- albeit more quietly -- and wedding it to his simple, direct melodic sensibility. The song is a prayer, not for redemption, but to enter the cloud of spiritual unknowing before his demise, to discover the terrain where suffering itself is birthed. Warnes' gorgeous backing vocals, piano, guitar, and violin accompany his beneath-the-basement, cracked-leather baritone in delivering the song with conviction and vulnerability. Cohen's live band joins him on &quot;Darkness,&quot; where he evokes, musically, his love of both late-'40s R&amp;B and gospel, even as he frankly discusses the inevitable entrance into the big goodnight. He also revisits the spartan sound of his early career with &quot;Crazy to Love You,&quot; written with Thomas, on which his only accompaniment is his acoustic guitar. Here, he wrestles with an unwanted but nonetheless nagging attachment to erotic desire. &quot;Come Healing&quot; is another gospel-ized hymn, with Glover's vocals, church organ, violin, and Cohen's nearly croaking vocal; he sings with reverence: &quot;O see the darkness yielding/That tore the light apart/Come healing of the reason/Come healing of the heart....&quot; &quot;Banjo&quot; is a country-blues that gives the songwriter a chance to indulge his love for Hank Williams while reflecting on Hurricane Katrina as Soldo's New Orleans-inspired horns add a haunted effect to the tune. Cohen speaks not only for himself, but the ghosts of restless spirits wandering in his vision. &quot;Lullabye&quot;'s lyrics, accompanied by a high lonesome harmonica and a whispering jazz organ to counterintuitively offer an attempt at comfort to the disconsolate. &quot;Different Sides,&quot; with its slow, loopy groove, is a basic shuffle that addresses unresolved conflict in lust and law (spiritual and carnal), bringing Old Ideas to a close with an ironic tension. Here Cohen meets conflict, tension and his other well-worn topics head-on. He doesn't sound as wearyt as he did on Dear Heather: He accepts them for what they are--all aspects of the same thing--the contradictory nature of life itself.  \n\n\nTracklist:\n\n 01 - Going Home\n 02 - Amen\n 03 - Show Me the Place\n 04 - Darkness\n 05 - Anyhow\n 06 - Crazy to Love You\n 07 - Come Healing\n 08 - Banjo\n 09 - Lullaby\n 10 - Different Sides","torrent":{"xt":"urn:btih:0653f9e3091816c55102d63f508aa5ab44aa1b1c","amp;dn":"Leonard+Cohen+-+Old+Ideas+%282012%29+%5B2014_Qobuz+24-44%2C1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0653f9e3091816c55102d63f508aa5ab44aa1b1c","infoHashBuffer":{"type":"Buffer","data":[6,83,249,227,9,24,22,197,81,2,214,63,80,138,165,171,68,170,27,28]},"announce":[],"urlList":[]}}