{"title":"The Brave - Conquering the Fear - Hayley Dimarco.epub","uid":9801025,"size":3286319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06cd2af98f9b4f86bd4b703ea078469216640f46&amp;dn=The+Brave+-+Conquering+the+Fear+-+Hayley+Dimarco.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1395376967,"description":"The teen years are full of fears big and small. Teens are afraid to be themselves, afraid of being left out, afraid of being alone, and afraid of being lost in the crowd. They crave attention and acceptance and spend much of their time reacting to the fear of not fitting in.\n\nBestselling authors Hayley and Michael DiMarco help teens embrace being the &quot;me&quot; they're supposed to be, regardless of the expectations or criticisms of others. They offer teens &quot;five smooth stones&quot; they can use to slay the fear, shyness, and other giants in their lives. Perfect for any teen, both the &quot;confident&quot; and the &quot;shy.&quot;\n\nFrom the Back Cover\n\nWhat do you fear?\n\nFailure? Bullies? Pop quizzes? Abandonment? Natural disasters? Doing something embarrassing?\n\nThere's a ton of stuff in this world that makes us fearful, stressed, and worried. Things that make us want to give up and hide. Things that make us doubt that God cares.\n\nBut the Brave around us aren't somehow superhuman. They've just learned to have faith. Not in themselves, but in something--in Someone--much bigger than their fears.\n\nAre you tired of being afraid? Want to be one of the Brave?\n\nIt might be easier than you think.\n\nHayley DiMarco is the founder of Hungry Planet, where she writes and creates cutting-edge books that connect with the multitasking mind-set. She has written and cowritten numerous bestselling books for both teens and adults, including Dateable, Mean Girls, Sexy Girls, B4UD8, God Girl, and the God Girl Bible.\n\nMichael DiMarco is the publisher and creative director of Hungry Planet and has written or cowritten a number of bestselling books, including God Guy, B4UD8, Die Young, and Independence Day.\n\nMichael and Hayley live with their daughter in Nashville, Tennessee.\n\nAbout the Author\n\nHayley DiMarco is the founder of Hungry Planet, where she writes and creates cutting-edge books that connect with the multitasking mind-set. She has written and cowritten numerous bestselling books for both teens and adults, including Dateable, Mean Girls, Sexy Girls, B4UD8, God Girl, and the God Girl Bible.\n\nMichael DiMarco is the CEO of Hungry Planet and has written or cowritten a number of books, including Marriable, God Guy, B4UD8, and Almost Sex.\n\nMichael and Hayley live with their daughter in Nashville, Tennessee.","torrent":{"xt":"urn:btih:06cd2af98f9b4f86bd4b703ea078469216640f46","amp;dn":"The+Brave+-+Conquering+the+Fear+-+Hayley+Dimarco.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06cd2af98f9b4f86bd4b703ea078469216640f46","infoHashBuffer":{"type":"Buffer","data":[6,205,42,249,143,155,79,134,189,75,112,62,160,120,70,146,22,100,15,70]},"announce":[],"urlList":[]}}