{"title":"XCOM_Enemy_Unknown_The_Complete_Edition_Linux-Razor1911","uid":10411051,"size":14308053026,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:07015aeede76dd4e7896cbc160b17e170a69f222&amp;dn=XCOM_Enemy_Unknown_The_Complete_Edition_Linux-Razor1911&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Mr.Stifmeister","files":2,"time":1403534177,"description":" 1 9 1 1 JED\n\n\n\nRazor 1911 proudly presents:\n\nXCOM Enemy Unknown The Complete Edition Linux\n\n(C) Feral Interactive\n\n\n\nDate: 2014-06-23 Game Type: Strategy\n\nSize: 1 Disc Protection: Steam\n\n\n\nGame Notes\n\n\n\nTake on a mysterious alien threat and develop a strategy to save your planet\n\nwith XCOM: Enemy Unknown. Build and expand your XCOM headquarters and lead\n\nyour squad into deadly and fierce battles against the imminent threat\n\nRecruit soldiers and develop them in order to take them into combat, and\n\nuncover and research extraterrestrial technology to enhance and expand your\n\nweapons and capabilities. With this Complete Edition, you'll also receive\n\naccess to the thrilling XCOM: Enemy Within expansion pack, as well as the\n\nElite Soldier, Slingshot and Second Wave add-on content. A new Genetics Lab\n\nallows you to physically augment your soldiers' chests, brains, eyes, skin\n\nand legs, while a Cybernetics Lab enables the development of the new\n\nMechanized Exoskeletal Cybersuit, or MEC. You now have stronger, faster\n\nwarriors and a new MEC Trooper class with specialized abilities and suits\n\nthat can carry flamethrowers and grenade launchers. Your engineering team\n\nand the Foundry tirelessly work to develop new weapons and equipment to\n\ngive your operatives an extra tactical edge against two new alien classes\n\nincluding the Mechtoid. Fortunately, a valuable new alien resource, the\n\nMELD, has been released into the landscape, providing access to new\n\nresearch and upgrades. Then take the battle online to mix and match aliens\n\nand soldiers and combine abilities to outsmart and overpower your opponent\n\nin adrenaline-pumping, one-on-one, turn-based multiplayer matches. With\n\nthis Complete Edition, you'll be ready for any alien threat you encounter\n\n\n\nThe Complete Edition includes XCOM: Enemy Unknown, XCOM: Enemy Within\n\nexpansion pack, Elite Soldier add-on content and Slingshot add-on content\n\n\n\nInstall Notes\n\n\n\n1. Extract RARs\n\n2. Unpack the archive file\n\n3. Copy crack to /binaries/linux/x86_64 and /xew/binaries/linux/x86_64\n\n4. Start the game ./xcom.sh\n\n5. Have fun!\n\n\n\nRequires Ubuntu 14.04 64bit OS to play\n\n\n\nRazor 1911 Greetings\n\n\n\nRazor 1911 slices out greets to our friends and competitors around the world!\n\n\n\n/\n\nRazor 1911 /__ Since 1985\n\n/ /\n\n/__/__\n\n\n\nSUPPORT THE COMPANIES THAT PRODUCE QUALITY SOFTWARE!\n\nIF YOU ENJOYED THIS PRODUCT, BUY IT! SOFTWARE AUTHORS DESERVE SUPPORT!!","torrent":{"xt":"urn:btih:07015aeede76dd4e7896cbc160b17e170a69f222","amp;dn":"XCOM_Enemy_Unknown_The_Complete_Edition_Linux-Razor1911","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07015aeede76dd4e7896cbc160b17e170a69f222","infoHashBuffer":{"type":"Buffer","data":[7,1,90,238,222,118,221,78,120,150,203,193,96,177,126,23,10,105,242,34]},"announce":[],"urlList":[]}}