{"title":"Stranger and the Gunfighter (Western) {Lee Van Cleef} [1974]","uid":7956285,"size":816985379,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07cd08406a6f72cb274a06cb12635b784a2cce3b&amp;dn=Stranger+and+the+Gunfighter+%28Western%29+%7BLee+Van+Cleef%7D+%5B1974%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"alien99","files":-1,"time":1356441753,"description":"could pass maybe for the Italian version of Blazing Saddles, if you need a smile watch this one  \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071784/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071784/?ref_=fn_al_tt_1&lt;/a&gt;\n\nStoryline\n\nDuring a hold-up in the Wild West, Dakota kills a rich old Chinese man, Wang. Later, he is captured, sentenced, and is about to be hanged - and he never profitted from Wang's death, has he buried him with the photographs of his four widows, and a few worthless papers. Meanwhile, Ho comes to America in search of his uncle's fortune, and must get Dakota free, as he his the only man who can lead him to Wang's tomb. They open the tomb, retaking the pictures of Wang's widows. It happens he reads the papers and knows that Wang had one quarter of a map tattooed in each of his women's buttocks. Now, the difficult part will really start... Treasure hunt.\n\nUser Review\n\nIt looks and feels more like a western than a chop-socky movie, but THE STRANGER AND THE GUNFIGHTER is worth the admission in the sea of obscure cinema. Those who like the Shaw Brothers martial arts movies will notice that the western setting is a drawback, but thanks to star Lo Lieh, it won't be all too disappointing. He provides enough blow-by-blow techniques to make it worthwhile. Actually, the studio known for Asian martial arts films teamed up with another company in the making of this. It may be the raciest western I've ever seen as the pair must search for clues in finding the treasure by.....looking at the butts of beautiful broads!!! Somehow, it all makes sense with the story. The mighty Lo Lieh is funny at wanting to see a female's backside, but it's Lee Van Cleef who keeps his personality as a solid spaghetti western star, and both pair well. Plenty of gunslinging, kung fu, cheesecake, and laughs await in this odd, unusual, but greatly entertaining western. This one is getting too tough to find nowadays as it hasn't been currently available again in years. I'm willing to cross my fingers on a re-released special edition that could come up any time soon (i.e. FIVE DEADLY VENOMS). Highly recommended!\n","torrent":{"xt":"urn:btih:07cd08406a6f72cb274a06cb12635b784a2cce3b","amp;dn":"Stranger+and+the+Gunfighter+%28Western%29+%7BLee+Van+Cleef%7D+%5B1974%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07cd08406a6f72cb274a06cb12635b784a2cce3b","infoHashBuffer":{"type":"Buffer","data":[7,205,8,64,106,111,114,203,39,74,6,203,18,99,91,120,74,44,206,59]},"announce":[],"urlList":[]}}