{"title":"TTC - Symphonies of Beethoven","uid":6645270,"size":1410785048,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:082d77b8eea94c9dfb36e1e607e49d7a0cad681d&amp;dn=TTC+-+Symphonies+of+Beethoven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"procul9","files":33,"time":1314920408,"description":"TTC - Symphonies of Beethoven\nBy Robert Greenberg\n\n\nFormat: MP3\n\n\n\nWhy is Beethoven one of the most revered composers in the history of Western music?\n\nProfessor Robert Greenberg answers: ''Beethoven possessed a unique gift for communication. He radiated an absolute directness that makes his music totally accessible. The sheer emotional power of his music is readily understood. His revolutionary compositional ideas are easily appreciated.\n\n''And his nine symphonies are among the greatest achievements of the human spirit.\n\n''They were revolutionary on every level: harmonic, melodic, rhythmic, formal, dramatic, self-expressive, and emotional. Beethoven led the charge to a totally new era. He threw out the restraint of 18th-century classicism and ushered in romantic self-expression. His symphonic offspring were the first statesmen of this new, musical democracy.''\n\nBeethoven's artistic progress is historically measured in three periods:\n\n1- The Viennese period, 1792-1802. Symphonies nos. 1 and 2 are composed in this decade. In them, Beethoven innovates within the Classical style.\n\n2- The Heroic period, 1803-1815. Symphonies nos. 3, 4, 5, 6, 7, and 8 are composed during this time. With these symphonies, Beethoven makes revolutionary breaks away from the Classical style.\n\n3- The Late period, 1820-1826. This period is dominated by the most revolutionary and influential composition of Beethoven's career: Symphony no. 9. Here Beethoven fuses all art forms into one monumental work and heralds a new era of unfettered musical expression. \n\nOver the course of these 32 lectures on the history and analysis of Beethoven's nine symphonies, we see how he revolutionized musical composition and created works of unique beauty, power, and depth.\n\n\n\n32 Lectures\n45 minutes / lecture ","torrent":{"xt":"urn:btih:082d77b8eea94c9dfb36e1e607e49d7a0cad681d","amp;dn":"TTC+-+Symphonies+of+Beethoven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082d77b8eea94c9dfb36e1e607e49d7a0cad681d","infoHashBuffer":{"type":"Buffer","data":[8,45,119,184,238,169,76,157,251,54,225,230,7,228,157,122,12,173,104,29]},"announce":[],"urlList":[]}}