{"title":"[Dvx-ITA- ENG-FRA-SPA] Vacanze Romane - Roman Holidays [koller92","uid":4678446,"size":917447172,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:087163988547390e603213e3a22671b08af5b6aa&amp;dn=%5BDvx-ITA-+ENG-FRA-SPA%5D+Vacanze+Romane+-+Roman+Holidays+%5Bkoller92&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"koller92","files":6,"time":1232985523,"description":"ENG\nPrincess Anne embarks on a highly publicized tour of Europian capitals. When she and her royal entourage arrive in Rome, she begins to rebel against her restricted, regimented schedule. One night Anne sneaks out of her room, hops into the back of a delivery truck and escapes her luxurious confinement. However, a sedative she was forced to take earlier starts to take effect, and the princess is soon fast asleep on a public bench. She is found by Joe Bradley, an American newspaper reporter stationed in Rome. He takes her back to his apartment. The next morning Joe dashes off to cover the Princess Anne press conference, unaware that she is sleeping on his couch! Once he realizes his good fortune, Joe promises his editor an exclusive interview with the princess. Written by filmfactsman\n\nITA\nUna principessa in visita ufficiale a Roma si sottrae alla sorveglianza dei dignitari e se ne va in incognito per la cittÃƒÂ  in compagnia di un giornalista che fiuta il grande colpo. ÃƒË† il film che fece di A. Hepburn una star-grissino, premiata con l'Oscar insieme a Ian McLellan Hunter, autore del soggetto (e, con John Deighton, anche della sceneggiatura che fu poi riscritta da Ennio Flaiano e Suso Cecchi D'Amico), e a Edith Head per i costumi. ÃƒË† un Accadde una notte in chiave monarchica. Prima commedia di W. Wyler dopo il '35: vispa, piacevole, con qualche eccesso di sciroppo e troppe preoccupazioni turistiche.\n\n\nkoller92\n &lt;a href=&quot;\nhttp://colombo-reloaded.org/index.php?&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://colombo-reloaded.org/index.php?&lt;/a&gt;","torrent":{"xt":"urn:btih:087163988547390e603213e3a22671b08af5b6aa","amp;dn":"%5BDvx-ITA-+ENG-FRA-SPA%5D+Vacanze+Romane+-+Roman+Holidays+%5Bkoller92","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087163988547390e603213e3a22671b08af5b6aa","infoHashBuffer":{"type":"Buffer","data":[8,113,99,152,133,71,57,14,96,50,19,227,162,38,113,176,138,245,182,170]},"announce":[],"urlList":[]}}