{"title":"A Tribe Called Quest - Midnight Marauders VO","uid":3857692,"size":87595182,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:08aa5a3c62295ffbfe079848baf3c42dff6de8aa&amp;dn=A+Tribe+Called+Quest+-+Midnight+Marauders+VO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"shdwwarlord","files":15,"time":1193296494,"description":"From AllMusic:\n&quot;Though the abstract rappers finally betrayed a few commercial ambitions for Midnight Marauders, the happy result was a smart, hooky record that may not have furthered the jazz-rap fusions of The Low End Theory, but did merge Tribe-style intelligence and reflection with some of the most inviting grooves heard on any early-&amp;#039;90s rap record. The productions, more funky than jazzy, were tighter overall ? but the big improvement, four years after their debut, came with Q-Tip&amp;#039;s and Phife Dawg&amp;#039;s raps. Focused yet funky, polished but raw, the duo was practically telepathic on &quot;Steve Biko (Stir It Up)&quot; and &quot;The Chase, Pt. 2,&quot; though the mammoth track here was the pop hit &quot;Award Tour.&quot; A worldwide call-out record with a killer riff and a great pair of individual raps from the pair, it assured that Midnight Marauders would become A Tribe Called Quest&amp;#039;s biggest seller. The album didn&amp;#039;t feature as many topical tracks as Tribe was known for, though the group did include an excellent, sympathetic commentary on the question of that word (&quot;Sucka Nigga,&quot; with a key phrase: &quot;being as we use it as a term of endearment&quot;). Most of the time, A Tribe Called Quest was indulging in impeccably produced, next-generation games of the dozens (&quot;We Can Get Down,&quot; &quot;Oh My God,&quot; &quot;Lyrics to Go&quot;), but also took the time to illustrate sensitivity and spirituality (&quot;God Lives Through&quot;). A Tribe Called Quest&amp;#039;s Midnight Marauders was commercially successful, artistically adept, and lyrically inventive; the album cemented their status as alternative rap&amp;#039;s prime sound merchants, authors of the most original style since the Bomb Squad first exploded on wax. &quot;","torrent":{"xt":"urn:btih:08aa5a3c62295ffbfe079848baf3c42dff6de8aa","amp;dn":"A+Tribe+Called+Quest+-+Midnight+Marauders+VO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08aa5a3c62295ffbfe079848baf3c42dff6de8aa","infoHashBuffer":{"type":"Buffer","data":[8,170,90,60,98,41,95,251,254,7,152,72,186,243,196,45,255,109,232,170]},"announce":[],"urlList":[]}}