{"title":"[SoM]Una poltrona per due[DvdRip-DivX5-Ita-AC3]","uid":4504609,"size":832280576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:094aca10e8829b33ed187d959d4c147a111f201c&amp;dn=%5BSoM%5DUna+poltrona+per+due%5BDvdRip-DivX5-Ita-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mitimex","files":1,"time":1226540329,"description":"Due fratelli - avari e spregiudicati finanzieri di Filadelfia - Randolph e Mortimer Duke, dilettanti di filosofie, scommettono (un dollaro!) la dimostrazione pratica di una tesi marxista: l&amp;#039;ambiente fa l&amp;#039;uomo, distruggendo - con un espediente cinico - il nome e la professionalitÃƒÂ  del borioso giovane manager della loro finanziaria, Louis Winthorpe, che sta per sposarne l&amp;#039;erede, e lo sostituiscono con Billy, un mariuolo negro, specialista in trucchi per &quot;arrangiarsi&quot;. Preso il posto di Louis nella lussuosa abitazione con maggiordomo, Billy si abilita - a tempo di record - non solo a muoversi con disinvolta signorilitÃƒÂ  nell&amp;#039;inconsueto habitat residenziale, ma anche in quello rischioso e imprevedibile della finanza, con incredibile successo; mentre Louis, jellato, si degrada di giorno in giorno ignominiosamente. Quando perÃƒÂ² Billy si accorge di essere usato dai Duke, nÃƒÂ¨ piÃƒÂ¹ nÃƒÂ© meno dello sfortunato Louis, per un puro gioco cerebrale e maligno dei due, si allea allo sconfitto per prendersi una altrettanto spregiudicata rivincita sui due finanzieri, autopremiandosi poi insieme al socio con una favolosa vacanza alle Bahamas, le tasche gonfie di dollari.","torrent":{"xt":"urn:btih:094aca10e8829b33ed187d959d4c147a111f201c","amp;dn":"%5BSoM%5DUna+poltrona+per+due%5BDvdRip-DivX5-Ita-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"094aca10e8829b33ed187d959d4c147a111f201c","infoHashBuffer":{"type":"Buffer","data":[9,74,202,16,232,130,155,51,237,24,125,149,157,76,20,122,17,31,32,28]},"announce":[],"urlList":[]}}