{"title":"The Breathtaking Respiratory System - Lainna Callentine MD","uid":11773240,"size":33872387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09d8358524ac4f884fe403a54a55e894bfa345fb&amp;dn=The+Breathtaking+Respiratory+System+-+Lainna+Callentine+MD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"starxteel","files":1,"time":1427159698,"description":"\n\nA pair of human lungs have around 700 million balloon-like structures called alveoli. These exchange the carbon-dioxide waste in your blood of osygen!\n\n-An elementary-level exploration of the human body?s respiratory system, focused on structures, function, diseases, and God?s wonderful designs\n-Fast facts and important discoveries that help medical professionals understand the mechanisms of our lungs, sinus cavities, and diaphragms\n-Find out why the common cold isn?t so common after all. Hundreds of viruses can cause the over 1 billion cases of the ?common? cold each year!\n\nWith a loud piercing wail, most of us entered this world as a crying baby taking in our first big breath of air. Breathe in. Breath out. You hardly notice you respiratory system at work every minute, day and night, awake or asleep, without fail. From our first breath to our last, breathing is truly essential to life. Come on a captivating odyssey through the wind tunnels of the body and be prepared to be amazed!\n\nWhat happens when we hold our breath? What powers the over 23,000 breaths each of us take daily? The surface area of the alveoli in your lungs alone could cover the surface of an entire tennis court! Breeze in and learn more about these and the other incredible examples in the God?s Wondrous Machine series with The Breathtaking Respiratory System.\n\n\nAbout the author:\nDr. Lainna Callentine, M.Ed, MD, is a physician, instructor, writer, speaker, and creator at Sciexperience, as well as pediatrician at Bolingbrook Christian Health Center. She left formal medicine in the E.R. to homeschool her three children, and she currently does popular workshops at various homeschool conventions","torrent":{"xt":"urn:btih:09d8358524ac4f884fe403a54a55e894bfa345fb","amp;dn":"The+Breathtaking+Respiratory+System+-+Lainna+Callentine+MD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09d8358524ac4f884fe403a54a55e894bfa345fb","infoHashBuffer":{"type":"Buffer","data":[9,216,53,133,36,172,79,136,79,228,3,165,74,85,232,148,191,163,69,251]},"announce":[],"urlList":[]}}