{"title":"Mouthwatering Vegan - Over 130 Irresistible Recipes for Everyone","uid":8622417,"size":33463578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ab55d9034c2ff3fc7805d8cc83dbb899d9b8f02&amp;dn=Mouthwatering+Vegan+-+Over+130+Irresistible+Recipes+for+Everyone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1372411735,"description":"Mouthwatering Vegan: Over 130 Irresistible Recipes for Everyone \nby Miriam Sorrell \nAppetite/Random House | June 2013 | eISBN: 978-0-449-01566-7 | ePUB | 31.9 mb &lt;a href=&quot;\nhttp://www.amazon.com/Mouthwatering-Vegan-Irresistible-Recipes-Everyone/dp/0449015653&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mouthwatering-Vegan-Irresistible-Recipes-Everyone/dp/0449015653&lt;/a&gt;\n\nFrom the author of the successful blog, mouthwateringvegan.com, comes over 130 incredible recipes to showcase how accessible, varied, delicious and nutritious vegan eating can be.\nIn this book you'll find recipes for your favourite comfort foods in all their vegan glory. Here are meat-free, egg-free and dairy-free recipes that combine the idea of eating healthily, with food that is immediately satisfying, tastes great and is easy to prepare. From delicious dips, appetizers and soups; to main courses including curries, pastas, stews, burgers and salads. There are a whole host of recommended juices and smoothies and--at the sweeter end of scale--cookies, cakes and desserts. Mouthwatering Vegan transforms home cooking classics into vegan-accessible, delicious dishes.\nMiriam challenges herself to replicate dishes that are usually impossible to include in a vegan diet and opens up the scope for what vegan eating can be. Included in the book are recipes for vegan cheese, cream and mayonnaise; Chilli Con 'Carne', Shepherd's Pie, Mince &amp; Ale Pie, Stroganoff Supreme and the Perfect Roast. As well as delicious dishes that celebrate pulses and vegetables, such as Aubergine, Chickpea and Potato Curry; Stuffed Tomatoes and Zucchini Casserole; Red Bean Nut Burgers; Spicy Rice &amp; Quinoa Eggplant Bake; and Super Mushroom &amp; Walnut Loaf.\nMany of Miriam's recipes are inspired by the Mediterranean and the Far East, and all of them have the health benefits of vegan cooking without sacrificing the taste. Mouthwatering Vegan opens up new possibilities for vegan eating that will make you rethink vegan cuisine.\n\nAbout the Author &lt;a href=&quot;\nhttp://mouthwateringvegan.com/wp-content/uploads/2008/02/DSC_0196_2_2_2-265x300.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mouthwateringvegan.com/wp-content/uploads/2008/02/DSC_0196_2_2_2-265x300.jpg&lt;/a&gt;\nMiriam Sorrell is the blogger behind www.mouthwateringvegan.com.Born in London, Miriam is the creator and face of Mouthwatering Vegan, the enormously popular vegan food blog, and her Mouthwatering Vegan cookbook is published by Appetite (a Random House Canada imprint) in Spring 2013. Her food is all about enticing the senses, and in particular taking taste to another dimension. This is not altogether surprising, since she is also a photographer (and shoots all her own food pics), an established abstracts artist, and a jewelry designer. Miriam enjoys humour, creative thinking, good movies, music, photography, and, in her spare time, she is a compulsive bookworm. She has a 6 year old daughter and 4 cats, and currently resides in Malta with her husband Jonathan, a music composer and pianist.","torrent":{"xt":"urn:btih:0ab55d9034c2ff3fc7805d8cc83dbb899d9b8f02","amp;dn":"Mouthwatering+Vegan+-+Over+130+Irresistible+Recipes+for+Everyone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab55d9034c2ff3fc7805d8cc83dbb899d9b8f02","infoHashBuffer":{"type":"Buffer","data":[10,181,93,144,52,194,255,63,199,128,93,140,200,61,187,137,157,155,143,2]},"announce":[],"urlList":[]}}