{"title":"CreativeLIVE - Intro to Logic Pro X with Travis Kasperbauer","uid":9630003,"size":7456383534,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0b0aa23b7e2ed0aa70198964d0d9ce66f3936235&amp;dn=CreativeLIVE+-+Intro+to+Logic+Pro+X+with+Travis+Kasperbauer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"kr33","files":3,"time":1392775167,"description":"Intro to Logic Pro X with Travis Kasperbauer\n\nThere's a reason Logic Pro X is the go-to recording tool for the music industry's most-respected bands. It's a powerful, easy to use program for creating professional-quality music on your Mac from scratch. Join world-class producer Travis Kasperbauer for the world's first free live exploration of everything Logic Pro X has to offer.\n\nThis three-day workshop will teach you everything you need to know about recording awesome music in Logic Pro X. You'll explore the basics of the Logic workspace and learn tips and shortcuts for navigating the interface. Travis will also teach you how to record with microphones and instruments, use MIDI, arrange and edit music, and mix multitrack projects. By the end of this course, you'll be ready to record a full song with vocals, guitars, and drums.\n\nWhether you're a beginner or a professional, this course will give you a Logic Pro X playbook for unlocking your full potential as a producer and artist.\n","torrent":{"xt":"urn:btih:0b0aa23b7e2ed0aa70198964d0d9ce66f3936235","amp;dn":"CreativeLIVE+-+Intro+to+Logic+Pro+X+with+Travis+Kasperbauer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b0aa23b7e2ed0aa70198964d0d9ce66f3936235","infoHashBuffer":{"type":"Buffer","data":[11,10,162,59,126,46,208,170,112,25,137,100,208,217,206,102,243,147,98,53]},"announce":[],"urlList":[]}}