{"title":"Simon Dupree &amp; The Big Sound - Part Of My Past (1967-69 Psychede","uid":4915229,"size":381205533,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0b18b10f55a1b950237ffa2db855f8b10716afe3&amp;dn=Simon+Dupree+%26+The+Big+Sound+-+Part+Of+My+Past+%281967-69+Psychede&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Iron_Horse","files":67,"time":1243387172,"description":"Simon Dupree &amp; The Big Sound - Part Of My Past (1967-69 Psychedelic, British R&amp;B and Soul)\nCD (2004) To Mp3 320 mbit/s\nIncluded: CD Covers, Booklet and this Info\n\nReview  by Bruce Eder  allmusic.com\nThis is an amazing CD reissue, three times over -- for psychedelic music buffs, British R&amp;B and soul enthusiasts, and fans of the progressive rock band Gentle Giant (which evolved out of Simon Dupree &amp; the Big Sound). And it's also incredibly long overdue. Best-known for their Oriental ersatz pop-psychedelic classic &quot;Kites,&quot; Simon Dupree &amp; the Big Sound actually started out as a blues and R&amp;B-based outfit, not too different from the Spencer Davis Group. This double-CD set covers their complete EMI output, most of which has never been reissued, and almost all of which is very impressive (and even manages to intersect obliquely with Apple Records' orbit). The group's early soul-oriented sides are killers, exciting, totally convincing pieces of British-made R&amp;B that, in the case of &quot;Love&quot; and &quot;Medley: 60 Minutes of Your Love/A Lot of Love,&quot; should have placed them head-to-head with the likes of Steve Winwood and the Spencer Davis Group. Even when they move into a slightly trippier sound, on &quot;There's a Little Picture Playhouse,&quot; the group still utilizes a basic soul backing. And &quot;Kites,&quot; coming along in the middle of the first disc, is such a radical departure from everything before it, that it's astonishing to hear in this context, even knowing the song well -- the rest of the CD is made up of trippy psychedelic ballads with Mellotron accompaniment, often with punchy acoustic rhythm guitars. It's all very pretty and inventive in a pop context, and rivals or surpasses the psychedelic sides of Rainbow Ffolly and most other EMI artists of the era this side of the Beatles and maybe the Move. The highlight of the group's post-&quot;Kites&quot; output was the single &quot;Part of My Past,&quot; which was recorded during sessions for what was to have been their second album, Once More Unto the Breach, Dear Friend. That entire unreleased album is here, as the first 16 tracks on Disc Two, and they are a wonder -- the best parts include a gorgeous pop-psych ballad called &quot;What in This World&quot; that doesn't even have a songwriting credit; &quot;Wha Cha Gonna Do,&quot; with its &quot;Strawberry Fields Forever&quot; opening and impassioned vocals; the almost-lewd &quot;Don't Make It So Hard (On Me Baby),&quot; with a vocal that was a holdover from the group's soul era; the bouncy, vaguely Bee Gees-like &quot;Kindness&quot;; and the trippy, spacey &quot;Castle in the Sky,&quot; one of the finest pieces of psychedelic pop/rock ever to come out of EMI (or, more properly, never to come out from EMI -- until now). The latter should have been another &quot;King Midas in Reverse,&quot; but thanks to the failure of &quot;Part of My Past,&quot; the whole LP was shelved. The rest of the second disc is comprised of a short string of disappointing pop/rock singles -- vaguely reminiscent of the late-'60s Hollies -- imposed upon the group by their management, concluding with their extrovert rendition of the James Taylor-authored &quot;Something in the Way She Moves Me,&quot; backed with a progressive-sounding, organ-heavy B-side, &quot;I'm Going Home,&quot; authored by Reginald Dwight in the period before he became Elton John. This is followed by the complete contents of the group's only released LP, Without Reservations, which repeats the same R&amp;B-era singles and B-sides (i.e., their pre-&quot;Kites&quot; work) from Disc One, only in their punchier mono mixes. The remastering is impeccable, the packaging beautifully illustrated with period photos of the band, and thorough annotation by David Wells.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Simon_Dupree_%26_The_Big_Sound&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Simon_Dupree_%26_The_Big_Sound&lt;/a&gt;\nSimon Dupree and the Big Sound was a British pop band formed by three brothers, Derek Shulman, born 1947 (vocals), Phil Shulman, born 1937 (vocals, saxophone, trumpet), and Ray Shulman, born 1949 (guitar, violin, trumpet, vocals).\n\nCareer\nThey started as The Howling Wolves, and then became The Road Runners, playing R&amp;B around the Portsmouth area, home of the Shulman brothers. Making up the rest of the group were Peter O'Flaherty (bass guitar) (born 8.5.1944, in Gosport, Hampshire), Eric Hine (keyboards) (born Eric Raymond Lewis Hines, 4.9.1944, in Portsmouth, Hampshire), and Tony Ransley (drums) (born Anthony John Ransley, 17.5.1944, in Portsmouth, Hampshire). Those early group names aside, their repertory was focused a lot more on the songs of Wilson Pickett, Don Covay, and Otis Redding, than on the Howlin' Wolf or Bo Diddley. 'Simon Dupree and the Big Sound' came about in the course of their search for a flashy name.\n\nThe group were signed to EMI's Parlophone label, under producer Dave Paramor. Their first few singles, notably &quot;I See The Light&quot; (1966), failed to chart, then in October 1967, the group's management and their record label decided to try moving Simon Dupree and the Big Sound in the direction of psychedelia.\n\nThey only broke through at the end of 1967 with the psychedelic &quot;Kites&quot;, a Top 10 hit in the UK Singles Chart. Regarding themselves as blue-eyed soul brothers, they hated it as it was so unrepresentative of their usual style. The follow-up, &quot;For Whom The Bell Tolls&quot;, was only a minor hit, and a subsequent single &quot;Broken Hearted Pirates&quot;, featuring an uncredited Dudley Moore on piano, made no headway at all.\n\nA then unknown keyboard player by the name of Reginald Dwight was hired to fill in for an ill Eric Hine and he joined them on a 1967 tour in Scotland. They were asked to allow him to stay on, and he was almost recruited as a permanent member. They politely rejected the chance to record any of his compositions (although they did ultimately record &quot;I'm Going Home&quot; as the B-side of their final (contractually obligated) single,) and laughed when he told them he was adopting the stage name of Elton John. On 5 April 1968, Simon Dupree and the Big Sound appeared alongside Amen Corner, Gene Pitney, Don Partridge and Status Quo at The Odeon Theatre, Lewisham, London, on the first night as part of a twice nightly UK tour.\n\nThe group released one studio album; Without Reservation, on Parlophone Records (1967), and a compilation Amen (1980). A more recent set, Part Of My Past (2004), includes all their singles, album tracks and previously unreleased material prepared for their second album, release of which was cancelled at the time.\n\nLate 1968, they released a single We Are The Moles (part 1)/(part 2) under the moniker The Moles. Released on the Parlophone label, the single did not give any hint towards the identity of the artists, claiming that both songs were written, performed and produced by The Moles. Rumours began to spread that it was an obscure output by The Beatles, who also were under contract at Parlophone, with Ringo Starr on lead vocals. When interest began to rise concerning the release, Syd Barrett stated that Simon Dupree &amp; The Big Sound were the faces behind The Moles. Confronted with this, the band admitted.\n\nFrustrated as being seen as one-hit wonders being pushed by their record label as a pop group rather than the soul band they had always intended to be, they disbanded in 1969 and the Shulman brothers went on to form the successful progressive rock group Gentle Giant.\n\nTracklist:\nCD 1\n01. I See The Light\n02. It Is Finished\n03. Reservations\n04. You Need A Man\n05. Day Time, Night Time\n06. I've Seen It All Before\n07. Medley: a) 60 Minutes Of Your Love b) Lot Of Love\n08. Love\n09. Get Off My Bach\n10. There's A Little Picture Playhouse\n11. What Is Soul\n12. Teacher, Teacher\n13. Amen\n14. Who Cares\n15. Kites\n16. Like The Sun Like The Fire\n17. For Whom The Bell Tolls\n18. Sleep\n19. Part Of My Past\n20. This Story Never Ends\n21. Thinking About My Life\n22. Velvet &amp; Lace\n23. We Are The Moles (Part 1) (As The Moles)\n24. We Are The Moles (Part 2) (As The Moles)\n25. Broken Hearted Pirates\n26. She Gave Me The Sun\n27. Eagle Flies Tonight\n28. Give It All Back\nCD 2\n01. Stained Glass Window (Previously Unreleased)\n02. Please Come Back (Previously Unreleased)\n03. Light On Dark Water (Previously Unreleased)\n04. What In The World (Previously Unreleased)\n05. What Cha Gonna Do (Previously Unreleased)\n06. Don't Make It So Hard (On Me Baby) (Previously Unreleased)\n07. Kindness (Previously Unreleased)\n08. Castle In The Sky (Previously Unreleased)\n09. Loneliness Is Just A State Of Mind (Previously Unreleased)\n10. Laughing Boy From Nowhere (Previously Unreleased)\n11. You (Previously Unreleased)\n12. Can't You See (Previously Unreleased)\n13. Now (Previously Unreleased)\n14. Rain (Previously Unreleased)\n15. Something In The Way She Moves (Previously Unreleased)\n16. I'm Going Home (Previously Unreleased)\n17. Medley: a) 60 Minutes Of Your Love b) Lot Of Love (Mono)\n18. Love (Mono)\n19. Get Off My Bach (Mono)\n20. There's A Little Picture Playhouse (Mono)\n21. Day Time, Night Time (Mono)\n22. I See The Light (Mono)\n23. What Is Soul (Mono)\n24. Teacher, Teacher (Mono)\n25. Amen (Mono)\n26. Who Cares (Mono)\n27. Reservations (Mono)","torrent":{"xt":"urn:btih:0b18b10f55a1b950237ffa2db855f8b10716afe3","amp;dn":"Simon+Dupree+%26+The+Big+Sound+-+Part+Of+My+Past+%281967-69+Psychede","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b18b10f55a1b950237ffa2db855f8b10716afe3","infoHashBuffer":{"type":"Buffer","data":[11,24,177,15,85,161,185,80,35,127,250,45,184,85,248,177,7,22,175,227]},"announce":[],"urlList":[]}}