{"title":"The Monkees - Missing Links, Vol. 2 (1990)","uid":8428621,"size":307070413,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0bdd8bc63f0b0939211f37187c324531a7a378a9&amp;dn=The+Monkees+-+Missing+Links%2C+Vol.+2+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":26,"time":1367428295,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Monkees - Missing Links, Volume 2 (1990)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51AVP1VY2SL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51AVP1VY2SL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Mark Deming):\n\n&quot;Hey hey, we are the Monkees/You know we love to please/A manufactured image/With no philosophies.&quot; In 1968, the Monkees addressed their own reputation in the song &quot;Ditty Diego (War Chant),&quot; which summed up the bad rap they'd received in the music press since they first emerged in the summer of 1966. The Monkees were talented singers, musicians, and songwriters who made a handful of the finest pop singles of their day (as well as a few first-rate albums) and delivered exciting, entertaining live shows. But at a time when rock music was becoming more self-conscious and &quot;serious,&quot; the hipper echelons of the music press often lambasted the Monkees, largely because they didn't come together organically but through the casting process for a television series, and they initially didn't write the bulk of their own material or play all the instruments on their records. The fact they later took creative control of their music was often overlooked, and the quality of their music, which featured the work of some of the finest session players and songwriters of the 1960s, often seemed to be beside the point. Time has ultimately vindicated the Monkees, and their music still sounds fresh and engaging decades after it was recorded, but in some circles they never fully shook being branded as &quot;the Pre-Fab Four,&quot; no matter how far they moved from the circumstances that brought them together.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/the-monkees-p4940/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/the-monkees-p4940/biography&lt;/a&gt;\n\nAll Music Album Review (by Richie Unterberger):\n\nNineteen rare and unreleased tracks that, like the rest of the Monkees' output, ranges from excellent to insufferable, with plenty of mediocre material between. The highlights are the sprightly pop-rocker &quot;All the King's Horses&quot; (a 1966 Mike Nesmith original) and alternate versions of two of the group's best singles, &quot;Words&quot; and &quot;Valleri.&quot; These alternate takes aren't exactly better, but they are definitely different and less elaborately produced. Most of the rest is either lightweight 1966 pop/rock or weedy 1968 Mike Nesmith country-rock tunes that foreshadow his solo work; several cuts are alternate versions of songs that were hardly notable efforts in the first place. An exception is the live 1968 recording of the unusually forceful Nesmith original &quot;Circle Sky,&quot; which was featured in their movie Head (although a studio version was substituted on the actual soundtrack album). Odds and ends like an instrumental banjo piece by Peter Tork and a Spanish Christmas carol are pleasant but inessential. A thoughtfully compiled CD, it nonetheless really gives this group more respect than they're due by treating these artifacts with such importance.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/missing-links-vol-2-r13328&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/missing-links-vol-2-r13328&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B0000032QI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000032QI&lt;/a&gt;\n\nTrack List:\n\n01. All The King's Horses\n02. Valleri\n03. St. Matthew\n04. Words\n05. Some Of Shelly's Blues\n06. I Wanna Be Free\n07. If I Ever Get To Saginaw Again\n08. Come On In\n09. I'll Be Back Up On My Feet\n10. Michigan Blackhawk\n11. Hold On Girl\n12. The Crippled Lion\n13. Changes\n14. Mr. Webster\n15. You Just May Be The One\n16. Do Not Ask For Love\n17. Circle Sky\n18. Seeger's Theme\n19. Riu Chiu\n","torrent":{"xt":"urn:btih:0bdd8bc63f0b0939211f37187c324531a7a378a9","amp;dn":"The+Monkees+-+Missing+Links%2C+Vol.+2+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bdd8bc63f0b0939211f37187c324531a7a378a9","infoHashBuffer":{"type":"Buffer","data":[11,221,139,198,63,11,9,57,33,31,55,24,124,50,69,49,167,163,120,169]},"announce":[],"urlList":[]}}