{"title":"The Seven Military Classics of Ancient China -epub","uid":9431101,"size":5783839,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ca1eeade7531c6f98b717ae41cfda3fe77d148b&amp;dn=The+Seven+Military+Classics+of+Ancient+China+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1388803299,"description":"The Seven Military Classics is one of the most profound studies of warfare ever written. Here translated in their entirety for the first time, the seven separate essays in this volume (written between 500 b.c. and a.d. 700) include Sun Tzus famous Art of War. This is the definitive English-language edition of a unique contribution to military literature and essential reading for anyone interested in the rich cultural heritage of China.\n\n\nOnly one of these seven essays, Sun Tzus famous Art of War, has been readily available in the West. Thanks to this faithful translation of the complete Seven Military Classics, the insights of these ancient Chinese texts are now accessible in their entirety.Its not uncommon to see a salaryman on a crowded Tokyo subway studying one of the many popular Japanese editions of these essays. But why do so many businesspeople in Japan, Korea, and Taiwan study a 2,000-year-old military text? Because it embodies the strategic tradition of outwitting an opponent through speed, stealth, flexibility, and a minimum of effort. These principles have been proven both on the battlefield and in the marketplace. Now they are available in the West for the first time in their entirety.The lessons found in this book were exploited by such pivotal Asian war leaders as Japans Yamamoto, Chinas Mao Tse-tung, and Vietnams Giap to inflict terrible defeats on their enemies. And in more recent times, when Japan and others have decided to win their laurels on the field of international economic competition, these principles have been a key to the achievements of many Asian corporations. Executives in Japan, Korea, and Taiwan regularly study the Seven Military Classics. Unfortunately, even those far-sighted Western business leaders who have read Sun Tzu have glimpsed only a fraction of the knowledge their best Asian competitors use to plan corporate strategyuntil now.Those who appreciate Chinese literature and philosophy will also discover much that is new in these pages. Here is a substantial but previously inaccessible body of thought that stands in contrast to Confucianism, which deprecated the military sphere in favor of self-cultivation and the ethical life. The Seven Military Classics of Ancient China remedies a serious gap in Western knowledge of Asian thought. This accurate translation is based on the best available classical Chinese manuscripts, some only recently discovered by archaeologists. It is a uniquely important contribution to the worlds military literature and is essential reading for anyone interested in Chinas rich cultural heritage or in the timeless principles of successful strategy.","torrent":{"xt":"urn:btih:0ca1eeade7531c6f98b717ae41cfda3fe77d148b","amp;dn":"The+Seven+Military+Classics+of+Ancient+China+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ca1eeade7531c6f98b717ae41cfda3fe77d148b","infoHashBuffer":{"type":"Buffer","data":[12,161,238,173,231,83,28,111,152,183,23,174,65,207,218,63,231,125,20,139]},"announce":[],"urlList":[]}}