{"title":"The Chronicles Of Zanthora by Ben Cassidy","uid":9646910,"size":4041231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cb8749560b4413efa21a4a70b4d1c7bc779c482&amp;dn=The+Chronicles+Of+Zanthora+by+Ben+Cassidy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":15,"time":1393018177,"description":"\nBen Cassidy lives in Vancouver, WA, with his wife and three children. He pursued graduate studies in history for several years until he decided that reading six scholarly books a week was not challenging enough for him, and so switched to being a stay-at-home dad. \n\nHe has been writing since he was in third grade, though now he is able to bribe other people to do all his illustrating for him. He has the uncanny habit of writing of himself in the third person, and is disturbed by how easily his whole life can be summed up in four sentences. Or even five.\n\nGenre: Fantasy\n\n\n#1 Ghostwalker\nKendril is a Ghostwalker, a man who is dead to his former life and bound by a solemn vow to seek penance for some mysterious dark sin in his past. When a chance encounter in the forest leads him to inadvertently rescue a woman named Jade, a woman who claims not to remember anything about who she is or what has happened to her, Kendril becomes her reluctant guardian. But after a gang of ruthless bounty hunters comes after Jade, Kendril finds himself thrown into a deadly game of cat and mouse where one wrong step will be his last. Now he must use every ounce of daring and cunning he has to escape with his life and to protect the woman he is growing to love, a woman with no past.\n\nBut can he trust Jade, or will her secrets lead to his undoing?\n\nGhostwalker is an action-packed novel of suspense set in the fantasy world of Zanthora. Filled with dark humor and a cast of diverse characters, it is the first book in the Chronicles of Zanthora, the relation of the Fourth War of Despair.\n\n#2 Throne of Llewyllan\nHaving escaped the dangers of the bandit-infested Howling Woods, Kendril and his companions find themselves guests of honor in the small nation of Llewyllan. But he and his friends soon find that the glittering palace rooms of Llewyllan can be as just as perilous as the murky depths of the Howling Woods. When a conspiracy is discovered in the capital city of Balneth, Kendril lands himself right in the middle of an attempt to overthrow the government. Now scheming nobles, a treacherous witch, and an army of screaming barbarians are just the beginning of Kendril's problems. For underneath the chaos in Balneth lies the work of dark powers, forces which seek the overthrow of Llewyllan for their own purposes. But to save the kingdom, Kendril finds he must make the hardest choice of all. He must give up the woman he loves.\n\nIf, that is, he survives at all...\n\n#3 Soulbinder\nOut of luck and money in the tiny border town of Stefgarten, Kendril and his friends reluctantly take a well-paying job that involves escorting a Baderan priest into the icy woods of Merewith. When their trip takes an unexpected detour into an ancient temple, an artifact of dark and malevolent power is uncovered amidst the ruins: a Soulbinder. As Kendril races to recover the artifact before it falls into the wrong hands, he learns the terrible secret behind the Soulbinder, a secret that could mean the beginning of a new dark age for all of Zanthora. Now Kendril finds himself pitted against a deadly assassin, a power-hungry Baron, and a dangerous enemy from his past.\n\nCan Kendril find the Soulbinder in time? Or will Despair return to Zanthora?\n\n#4 Demonbane\nEvil has come to the city of Vorten. The Seteru, the ancient gods of Zanthora, are rising again, and they are determined to bring death and destruction in their wake. The Fourth Despair is at hand. As hidden enemies are revealed and cultists rise up throughout the city, Kendril and his unlikely band of allies race against time to stop the coming of the ancient gods. But as Vorten burns around him, Kendril realizes that the cost to stop this ancient evil may be higher than he ever imagined. Now he must see just how much he is willing to sacrifice.\n\nEven if that means one of his closest friends.\n\n#5 Oracle\nThe ghosts of Kendril's past have finally caught up with him. As he races to find the witch Bronwyn and discover what she knows of the Fourth Despair, he finds himself returning to the last place he expected to go...home. In the frontier town of Redemption, Kendril discovers that the past can be a bitter enemy indeed.\n\nMeanwhile Joseph and Maklavir find that bringing their friend Kara back from her living death will be more costly than they could have ever imagined. Risking everything they have in an attempt to save her, the two friends must battle not only the city gendarmes, but also each other. And as for Kendril, he will soon find that some ghosts have a nasty way of staying unburied....","torrent":{"xt":"urn:btih:0cb8749560b4413efa21a4a70b4d1c7bc779c482","amp;dn":"The+Chronicles+Of+Zanthora+by+Ben+Cassidy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb8749560b4413efa21a4a70b4d1c7bc779c482","infoHashBuffer":{"type":"Buffer","data":[12,184,116,149,96,180,65,62,250,33,164,167,11,77,28,123,199,121,196,130]},"announce":[],"urlList":[]}}