{"title":"Historical Controversies and Revisionism - Collection 8","uid":15315033,"size":228482567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cffbb99880a687e1b9d77348232b78b70d4725b&amp;dn=Historical+Controversies+and+Revisionism+-+Collection+8&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"moman73","files":30,"time":1468610730,"description":"Historical Controversies and Revisionism - Collection 8:\r\n\r\nWe have 30 titles here:\r\n\r\n-  Baigent - Ancient Traces; Mysteries in Ancient and Early History (1998)\r\n\r\n-  Barber &amp; Peniston-Bird (Eds.) - History Beyond the Text; a Student's Guide to Approaching Alternative Sources (2009)\r\n\r\n-  Barham - Napoleon wasn't Short and St. Patrick wasn't Irish; When History Get it Wrong (2014)\r\n\r\n-  Burke - The French Historical Revolution; the Annales School, 1929-89 (1990)\r\n\r\n-  Davies &amp; Edelman (Eds.) - The Historian and the Bible; Essays in Honour of Lester L. Grabbe (2010)\r\n\r\n-  Davis - America's Hidden History; Untold Tales of the First Pilgrims, Fighting Women, and Forgotten Founders Who Shaped a Nation (2008)\r\n\r\n-  Dean - How Myth Became History; Texas Exceptionalism in the Borderlands (2016)\r\n\r\n-  Duke - The Secret Behind Communism; the Ethnic Origins of the Russian Revolution &amp; the Greatest Holocaust in the History of Mankind (2013)\r\n\r\n-  Farquhar - A Treasury of Deception; Liars, Misleaders, Hoodwinkers and the Extraordinary True Stories of History's Greatest Hoaxes, .. (2005)\r\n\r\n-  Fortenberry - Hidden Facts of the Founding Era (2012)\r\n\r\n-  Fuentes - Race, Monogamy, and Other Lies They Told You; Busting Myths about Human Nature (2012)\r\n\r\n-  Joseph - The Lost Treasure of King Juba; the Evidence of Africans in America before Columbus (2003)\r\n\r\n-  King - The Real Roosevelts; an Omitted History (2015)\r\n\r\n-  Kross - The Secret History of the United States; Conspiracies, Cobwebs and Lies (2013)\r\n\r\n-  Leavy - Oral History; Understanding Qualitative Research (2011)\r\n\r\n-  Lieberman (Ed.) - History in Dispute, Vol. 19; The Red Scare After 1945 (2005)\r\n\r\n-  Linebaugh &amp; Rediker - The Many-Header Hydra; Sailors, Slaves, Commoners, and the Hidden History of the Revolutionary Atlantic (2000)\r\n\r\n-  Little - New Contributions to the Philosophy of History (2010)\r\n\r\n-  Marriott - They Got It Wrong, History; All the Facts That Turned Out to Be Myths (2013)\r\n\r\n-  McConnell (Ed.) - History in Dispute, Vol. 11; The Holocaust, 1933-1945 (2003)\r\n\r\n-  Mowat - The Farfarers; a New History of North America (2002)\r\n\r\n-  Pappe - The Forgotten Palestinians; a History of the Palestinians in Israel (2011)\r\n\r\n-  Piper - Ye Shall Know the Truth; 101 Books American Nationalists Need to Read and Understand Before 'They' Burn Them (2013)\r\n\r\n-  Ramirez - Inside the Historical Film (2014)\r\n\r\n-  Rodda - Liars for Jesus; the Religious Right’s Alternate Version of American History, Vol. I (2006)R\r\n\r\n-  Smart - A Search for the Truth; the Bolshevik Revolution, World War 1, World War 2 and Germany, the Holocaust Myth (2016)\r\n\r\n-  Steers - Hoax; Hitler's Diaries, Lincoln's Assassins, and Other Famous Frauds (2013)\r\n\r\n-  Stone &amp; Kuznick - The Untold History of the United States; Young Readers Edition, Vol. 1, 1898-1945 (2014)\r\n\r\n-  Winkler - The Age of Catastrophe; a History of the West, 1914-1945 (2015)\r\n\r\n-  Wittakers - Holocaust; the Greatest Lie Every Told (2016)","torrent":{"xt":"urn:btih:0cffbb99880a687e1b9d77348232b78b70d4725b","amp;dn":"Historical+Controversies+and+Revisionism+-+Collection+8","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cffbb99880a687e1b9d77348232b78b70d4725b","infoHashBuffer":{"type":"Buffer","data":[12,255,187,153,136,10,104,126,27,157,119,52,130,50,183,139,112,212,114,91]},"announce":[],"urlList":[]}}