{"title":"Todd Rundgren: Time for the Music Industry to Evolve","uid":4693539,"size":83957336,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0d018e0d1cf4ffa8ce909583ef8f6e45d579bbf1&amp;dn=Todd+Rundgren%3A+Time+for+the+Music+Industry+to+Evolve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1233478570,"description":"The Entertainment Gathering 2008\nMonterey, CA\nDec 13th, 2008\n\nHighlighting the flaws of the music industry, musician and computer programmer Todd Rundgren says, &quot;music is a service, not a product&quot; and should be marketed accordingly.\n\nEG is the celebration of the American entertainment industry. Since 1984, Richard Saul Wurman has created extraordinary gatherings about learning and understanding. EG is a rich extension of these ideas - a conference that explores the attitude of understanding in music, film, television, radio, technology, advertising, gaming, interactivity and the web - The Entertainment Gathering\n\nTodd Rundgren's is a multi-faceted artist: he is a songwriter, video pioneer, producer, recording artist, computer software developer, conceptualist, interactive artist, and CEO, Rundgren has made a lasting impact on the form, content, and delivery of popular music.Born and raised in Philadelphia, Rundgren began playing guitar as a teenager, going on to found and front quintessential '60s cult group The Nazz. In 1969 he left the band to pursue a solo career, recording his debut offering, the legendary &quot;Runt&quot;. But it was 1972's seminal &quot;Something/Anything?&quot;, on which he played all the instruments, sang all the vocal parts and acted as his own producer, that catapulted Rundgren into the superstar limelight, prompting the press to unanimously dub him &quot;Rock's New Wunderkind.&quot; This was followed by such landmark LPs as &quot;The Hermit of Mink Hollow&quot;, &quot;A Wizard, A True Star&quot; and such hit singles as I Saw The Light, Hello It's Me, Can We Still Be Friends, and Bang The Drum.Additionally, as a producer, Rundgren has brought his creativity to bear on albums by Patti Smith, Cheap Trick, The Psychedelic Furs, The Tubes, MeatLoaf, XTC, Grand Funk Railroad, Hall &amp; Oates, Paul Shaffer, and many other artists. He is also highly regarded as a film/TV composer having scored projects ranging from &quot;Pee Wee's Playhouse&quot; to &quot;Crime Story&quot; to &quot;Dumb and Dumber&quot; for which he received BMI's 'Film Composer of the Year' accolades.In 1974 Rundgren formed Utopia, an entirely new approach to the concept of musical high adventure, and embarked on an extensive round of recording and touring that continued throughout much of the '70s and '80s. Utopia combined technical virtuosity and creative passion to create music that, for millions, defined the term 'progressive rock'.By the late '70s Rundgren began programming personal computers and since then he has been involved in the development of products ranging from digital artist's tools (Utopia Graphic Tablet System) to computer generated kinetic art (FlowFazer, GrokGazer) to interactive music (No World Order) to enhanced CD (The Individualist). His skills have been applied as a consultant to companies in diverse areas such as communications (General Magic) and digital video (NewTek).Rundgren continued with his groundbreaking efforts in converging media and technology. In 1993, he established a new musical genre when he composed, produced and performed the world's first interactive audio-only CD-ROM project, &quot;No World Order&quot;, which was licensed to both Philips Interactive Media and Electronic Arts, and was released simultaneously with his record company's release of the traditional non-interactive, linear version of the album. In 1994, &quot;No World Order&quot; won &quot;Best Composition/Arrangement&quot; from the Academy of Interactive Arts &amp; Sciences, and the &quot;Best Interactive Disc of the Year&quot; Award from Video Magazine.A unique validation of Rundgren's many contributions to the arts came in May 1995 when he received the prestigious Berkeley Lifetime Achievement Award from the Popular Culture Society at UC Berkeley along with fellow recipients Robert Altman, Maya Angelou, Aretha Franklin, David Hockney, Liza Minelli and Brian Wilson. Bestowed annually, the awards &quot;honor artists who re-define a genre, show excellence through diversity in their art, communicate the essence of a time period, or work towards positive social change.&quot; In March of 1996 Rundgren received further recognition at the 19th Annual Bay Area Music Awards with a Lifetime Service Award.\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law) &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it... &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog... &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:0d018e0d1cf4ffa8ce909583ef8f6e45d579bbf1","amp;dn":"Todd+Rundgren%3A+Time+for+the+Music+Industry+to+Evolve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d018e0d1cf4ffa8ce909583ef8f6e45d579bbf1","infoHashBuffer":{"type":"Buffer","data":[13,1,142,13,28,244,255,168,206,144,149,131,239,143,110,69,213,121,187,241]},"announce":[],"urlList":[]}}