{"title":"La storia in giallo 139 - Frida Kahlo [Mp3 Ita] [TNTvillage]","uid":6611743,"size":70367735,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0d1bfc789c53adc89f48a0283d1a940fe9f2ceb5&amp;dn=La+storia+in+giallo+139+-+Frida+Kahlo+%5BMp3+Ita%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"darayava","files":1,"time":1313618513,"description":"La storia in giallo 139 - Frida Kahlo [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 19/11/2005\n\nFRIDA KAHLO\n\n\nPittrice appassionata e tormentata, Frida Kahlo ha conosciuto sin da bambina il sapore della tragedia. Da quando un terribile incidente in autobus ha dato inizio a un lungo calvario. Moglie di Diego Rivera, uno degli artisti piÃƒÂ¹ rappresentativi del Messico post rivoluzionario, ha vissuto una storia d'amore altalenante, fatta di continui abbandoni e riavvicinamenti, segnata dal desiderio mai realizzato di diventare madre.\nGrazie alla pittura ÃƒÂ¨ riuscita ogni volta a rialzarsi in piedi, esorcizzando le sue sofferenze e lasciando emergere nelle sue tele gli aspetti oscuri di un animo inquieto. Ammirata dai piÃƒÂ¹ grandi artisti del suo tempo, non lasciÃƒÂ² indifferente neanche Picasso, che di lei disse: &quot;Nessuno sa dipingere una testa come Frida Kahlo!&quot;\nAntonella Ferrera, ospita il critico d'arte Prof. Vittorio Sgarbi.\nLa voce di Frida Kahlo ÃƒÂ¨ quella di Emanuela Rossi.\nLIBRO CONSIGLIATO: Inquiete, storie di artiste sublimi e femmine dannate di Antonella Ferrera, Rai Eri.\n\nAVI File Details\n========================================\nName..........: 2005 - Frida Kahlo.mp3\nFilesize......: 67Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:0d1bfc789c53adc89f48a0283d1a940fe9f2ceb5","amp;dn":"La+storia+in+giallo+139+-+Frida+Kahlo+%5BMp3+Ita%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d1bfc789c53adc89f48a0283d1a940fe9f2ceb5","infoHashBuffer":{"type":"Buffer","data":[13,27,252,120,156,83,173,200,159,72,160,40,61,26,148,15,233,242,206,181]},"announce":[],"urlList":[]}}