{"title":"Lynda- Teach Kids Programming with iOS","uid":9571145,"size":159345736,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0d54d7defb2fdbb8c6b88ec16f7a0134ece3889e&amp;dn=Lynda-+Teach+Kids+Programming+with+iOS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"3ljust","files":36,"time":1391636192,"description":"Teach Kids Programming with iOS\n\n1h 2m Beginner Jan 17, 2014\n\nProgramming is a great way to teach a child problem-solving skills and introduce them to the inner workings of technology. And iOS highlights the usefulness of programming via the immediacy of the iPhone and iPad. In this course, Todd Perkins helps parents, mentors, and educators who are experienced with Objective-C and Xcode pass their coding skills on to a student. Each inquiry-oriented chapter consists of seven parts:\n\n    Teacher's Guide: Introduces the concepts in the chapter and preps the adult on places where the student might get stuck\n    Try It: Immediately engages the student, showing working code in action\n    Check It Out: Encourages the adult and student to engage with and edit some existing code\n    The Facts: A lecture for the student to watch\n    Extend It: An exploration of expanded and extended concepts\n    Challenge: A hands-on coding challenge for the student\n    Solution: A step-by-step solution presented by the author\n\n\n\nThis course is designed to help you, an expert, help a beginner learn about the code, logic, and interface elements that lie behind iOS apps and games. The structured curriculum supports those who have a solid understanding of the iOS SDK, but don't necessarily know how to teach it effectively to kids.","torrent":{"xt":"urn:btih:0d54d7defb2fdbb8c6b88ec16f7a0134ece3889e","amp;dn":"Lynda-+Teach+Kids+Programming+with+iOS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d54d7defb2fdbb8c6b88ec16f7a0134ece3889e","infoHashBuffer":{"type":"Buffer","data":[13,84,215,222,251,47,219,184,198,184,142,193,111,122,1,52,236,227,136,158]},"announce":[],"urlList":[]}}