{"title":"Magicians - Mel Mellers - Modern Marvels vol.1 - DVDRip Xvid","uid":7539998,"size":733531059,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0e0989c28328f700b5f6203d10e7ccd3ff387904&amp;dn=Magicians+-+Mel+Mellers+-+Modern+Marvels+vol.1+-+DVDRip+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MagicManPC","files":4,"time":1345190037,"description":"\n\nMel Mellers - Modern Marvels vol.1 - DVDRip Xvid\n &lt;a href=&quot;\nhttp://www.llpub.com/zenshop/index.php?main_page=product_info&amp;cPath=27&amp;products_id=2676&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.llpub.com/zenshop/index.php?main_page=product_info&amp;cPath=27&amp;products_id=2676&lt;/a&gt;\n\nJoin your host Mel Mellers and his crew as they travel the length and breadth of the UK to bring you seven brand new routines on this superb new DVD set. Over a year in the making, you'll watch Mel perform in various live shows and then explain everything that you need to know in the studio.\n\nMel performs a 6 Card Repeat in a truly international way, a feat of number manipulation despite overriding distraction, a Plume routine that gets huge laughs, an underwater escape that has no water (!), a superb mindreading stunt in which he predicts a genuinely random set of numbers, manipulates his own eyeball, vanishes and reappears a borrowed watch and for his grand finale uses a flea and a feather (don't ask!\n\nAs fans will know, Mel is a hilarious magician and all of these brilliant routines can be adapted to be used by all performers. As usual Mel takes an effect and turns it upside down with a unique and original twist!\n\nContents:\n\nINTERNATIONAL 6 CARDS OF MYSTERY - The 6 card repeat presented in a new and refreshing way.\n\nDISTRACTION - Two audience members choose two random numbers. Mel then manipulates them in an amazing performance based around mathematics and a sense of overriding distraction! Hilarious results ensue along the way in a stage filling routine that you will use.\n\nDO AS I DO PLUMES - The ideal routine for adults and kids alike. Taking an old favorite, Mel dresses it up and takes it to a whole new level in this superb piece of comedy magic. You'll even learn how to make the props yourself for only a few dollars.\n\nTHE NO WATER UNDERWATER ESCAPE - Houdini watch out! Mel Mellers attempts his most dangerous stunt yet, attempting to recreate Houdini's world famous Water Torture Escape... on a budget! Magic, laughs and comedy. What more could you want?\n\nEYEBALL - A super-fast comedy piece in which Mel Removes his eye manipulates it on the stage and puts it back into place in just a few seconds. The perfect opening!\n\nWATCH THIS - The watch routine that you will USE! Borrow ANY watch, make it disappear and reappear WHERE and WHEN you want. Simple, easy and fun to do!\n\nFEATHER FLEA FINALE - A Flea (Invisible to the human eye) lifts a large feather before his audience. No flea training required and works every time\n\nRunning Time: Approximately 1hr 27mins\n\nYou can download the full DVDs and the rest of the series on Usenet at alt.binaries.magic (see the included pdf in this download).\n\nEnjoy","torrent":{"xt":"urn:btih:0e0989c28328f700b5f6203d10e7ccd3ff387904","amp;dn":"Magicians+-+Mel+Mellers+-+Modern+Marvels+vol.1+-+DVDRip+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e0989c28328f700b5f6203d10e7ccd3ff387904","infoHashBuffer":{"type":"Buffer","data":[14,9,137,194,131,40,247,0,181,246,32,61,16,231,204,211,255,56,121,4]},"announce":[],"urlList":[]}}