{"title":"Erykah Badu Discography","uid":6618922,"size":3300971007,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0e11d9d7cf695d8f73ec24fd0d7a02e5b534d250&amp;dn=Erykah+Badu+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1313912299,"description":"\nErykah Badu Discography:\n\n[1997] Baduizm\n[1997] Live\n[2000] Mama's Gun\n[2003] Worldwide Underground\n[2008] New Amerykah, Pt. 1: 4th World War\n[2010] New Amerykah, Pt. 2: Return of the Ankh\n\n\nSingles:\n\n[1999] Southern Gul\n\n\nAllmusic Biography:\n\nBorn Erica Abi Wright on Feb 26, 1971 in Dallas, TX \n\nShe grew up listening to '70s soul and '80s hip-hop, but Erykah Badu drew more comparisons to Billie Holiday upon her breakout in 1997, after the release of her first album, Baduizm. The grooves and production on the album are bass-heavy R&amp;B, but Badu's languorous, occasionally tortured vocals and delicate phrasing immediately removed her from the legion of cookie-cutter female R&amp;B singers. A singer/songwriter responsible for all but one of the songs on Baduizm, she found a number 12 hit with her first single, &quot;On &amp; On,&quot; which pushed the album to number two on the charts.\n\nBorn Erica Wright in Dallas in 1971, Badu attended a school of the arts and was working as a teacher and part-time singer in her hometown when she opened for D'Angelo at a 1994 show. D'Angelo's manager, Kedar Massenburg, was impressed with the performance and hooked her up with the singer to record a cover of the Marvin Gaye/Tammi Terrell duet &quot;Precious Love.&quot; He also signed Badu to his recently formed Kedar Entertainment label, and served as producer for Baduizm, which also starred bassist Ron Carter and members of hip-hop avatars the Roots on several tracks. The first single, &quot;On &amp; On,&quot; became a number one R&amp;B hit in early 1997, and Baduizm followed it to the top of the R&amp;B album charts by March. Opening for R&amp;B acts as well as rap's Wu-Tang Clan, Erykah Badu stopped just short of number one on the pop album charts in April. Her Live album followed later in the year. \n\nIn 2000 she returned with her highly anticipated second studio album, Mama's Gun, which was co-produced by Badu, James Poyser, Bilal, and Jay Dee and contained the hit single &quot;Bag Lady.&quot; Worldwide Underground, a loose affair billed as an EP despite being longer than many full-lengths, was released in 2003. Her next step, 2008's New Amerykah, Pt. 1: 4th World War, was a heavy and abstract release featuring collaborations with the members of Sa-Ra and Georgia Anne Muldrow; it reached number two on the Billboard 200 and Hot R&amp;B/Hip-Hop Albums charts. New Amerykah, Pt. 2: Return of the Ankh, looser and more playful than Pt. 1, followed in 2010.","torrent":{"xt":"urn:btih:0e11d9d7cf695d8f73ec24fd0d7a02e5b534d250","amp;dn":"Erykah+Badu+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e11d9d7cf695d8f73ec24fd0d7a02e5b534d250","infoHashBuffer":{"type":"Buffer","data":[14,17,217,215,207,105,93,143,115,236,36,253,13,122,2,229,181,52,210,80]},"announce":[],"urlList":[]}}