{"title":"BBC.Natural.History.Expedition.Borneo.2of3.XviD.AC3..avi","uid":6414150,"size":923011072,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0e4b4a94add108f8b8b761e0254963b9b72db9a4&amp;dn=BBC.Natural.History.Expedition.Borneo.2of3.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"DocFreak08","files":-1,"time":1306107623,"description":"The Borneo rainforest is 130 million years old, making it the oldest rainforest in the world and 70 million years older than the Amazon rainforest. Borneo is very rich in biodiversity compared to many other areas, there are about 15,000 species of flowering plants with 3,000 species of trees (267 species are dipterocarps), 221 species of terrestrial mammals and 420 species of resident birds in Borneo. It is also the centre of evolution and radiation of many endemic species of plants and animals. Subject to mass deforestation, the remaining Borneo rainforest is one of the only remaining natural habitat for the endangered Bornean Orangutan. It is also an important refuge for many endemic forest species, as the Asian Elephant, the Sumatran Rhinoceros, the Bornean Clouded Leopard, and the Dayak Fruit Bat.\n\nIt is one of the most biodiverse places on earth. The World Wildlife Fund has stated that 361 animal and plant species have been discovered in Borneo since 1996, underscoring its unparalleled biodiversity. In the 18 month period from July 2005 until December 2006, another 52 new species were found.\n\nBBC Wildlife adventure series following now a team of explorers in the heart of the tropical island of Borneo, a lost world of unexplored jungle protected by a fortress of impenetrable mountains. Borneo has a breathtaking landscape with a chain of remote, steep mountains and gorges running down the centre of the country. Expedition Borneo looks at the huge expanse of wilderness, where only a few tribes live and which is teeming with rare and previously undiscovered wildlife. A team of biologists, anthropologists and climbers explore this new terrain in this fascinating series from the BBC Natural History Unit. Their aim is to find evidence that will help the area to be preserved forever.\n\nNarrated by Alisdair Simpson\nExecutive Producer Tim Martin\nSeries Producer Tim Greenwood\n\nA BBC/Discovery Channel Co-Production (2007)\n\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2167 kbps\nVideo Resolution: 656x384\nVideo Aspect Ratio: 1.708:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 52:01.080\nNumber Of Parts: 3\nPart Size: 923,031,552 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:0e4b4a94add108f8b8b761e0254963b9b72db9a4","amp;dn":"BBC.Natural.History.Expedition.Borneo.2of3.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e4b4a94add108f8b8b761e0254963b9b72db9a4","infoHashBuffer":{"type":"Buffer","data":[14,75,74,148,173,209,8,248,184,183,97,224,37,73,99,185,183,45,185,164]},"announce":[],"urlList":[]}}