{"title":"What Should We Be Worried About? (2014) epub","uid":9646871,"size":789724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ecea340e39a5ee2ca7acffe01eba17de9ff15af&amp;dn=What+Should+We+Be+Worried+About%3F+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1393017006,"description":"What Should We Be Worried About?: Real Scenarios That Keep Scientists Up at Night\n\n\n\nDrawing from the horizons of science, today's leading thinkers reveal the hidden threats nobody is talking about-and expose the false fears everyone else is distracted by.\n\n What should we be worried about? That is the question John Brockman, publisher of Edge.org (&quot;The world's smartest website&quot;-The Guardian), posed to the planet's most influential minds. He asked them to disclose something that, for scientific reasons, worries them-particularly scenarios that aren't on the popular radar yet. Encompassing neuroscience, economics, philosophy, physics, psychology, biology, and more-here are 150 ideas that will revolutionize your understanding of the world.\n\n Steven Pinker uncovers the real risk factors for war * Mihaly Csikszentmihalyi peers into the coming virtual abyss * Nobel laureate Frank Wilczek laments our squandered opportunities to prevent global catastrophe * Seth Lloyd calculates the threat of a financial black hole * Alison Gopnik on the loss of childhood * Nassim Nicholas Taleb explains why firefighters understand risk far better than economic &quot;experts&quot; * Matt Ridley on the alarming re-emergence of superstition * Daniel C. Dennett and george dyson ponder the impact of a major breakdown of the Internet * Jennifer Jacquet fears human-induced damage to the planet due to &quot;the Anthropocebo Effect&quot; * Douglas Rushkoff fears humanity is losing its soul * Nicholas Carr on the &quot;patience deficit&quot; * Tim O'Reilly foresees a coming new Dark Age * Scott Atran on the homogenization of human experience * Sherry Turkle explores what's lost when kids are constantly connected * Kevin Kelly outlines the looming &quot;underpopulation bomb&quot; * Helen Fisher on the fate of men * Lawrence Krauss dreads what we don't know about the universe * Susan Blackmore on the loss of manual skills * Kate Jeffery on the death of death * plus J. Craig Venter, Daniel Goleman, Virginia Heffernan, Sam Harris, Brian Eno, Martin Rees, and more","torrent":{"xt":"urn:btih:0ecea340e39a5ee2ca7acffe01eba17de9ff15af","amp;dn":"What+Should+We+Be+Worried+About%3F+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ecea340e39a5ee2ca7acffe01eba17de9ff15af","infoHashBuffer":{"type":"Buffer","data":[14,206,163,64,227,154,94,226,202,122,207,254,1,235,161,125,233,255,21,175]},"announce":[],"urlList":[]}}