{"title":"The Dude Abides - The Gospel According to Coen Brothers by Cathl","uid":7943995,"size":2902466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f8772f1ccd9043d7148324af4af4151a16271e1&amp;dn=The+Dude+Abides+-+The+Gospel+According+to+Coen+Brothers+by+Cathl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KatQwerty","files":3,"time":1356083489,"description":"Join award-winning author and columnist Cathleen Falsani as she explores the serious existential questions raised in the movies of the wildly popular and always irreverent Coen brothers. Coen fans and film lovers will appreciate Falsani's unique blend of contemporary insight and spiritual discernment that is both entertaining and illuminating.\n\nIt must be true that God can be found even in the quirkiest of places. Chicago Sun-Times religion journalist Falsani mined the 14 films (since 1984) of Joel and Ethan Coen to find God and to articulate their spiritual and religious questions and challenges. The Coen brothers have a reputation for injecting a lot of dark humor into their movies, but as the author illustrates, the comedy is an avenue to deeper issues. Death, betrayal, greed, the seeming absence of God and the dire consequences of one's choices are the complex themes expertly handled by the filmmakers. Falsani does not posit that these films are overtly religious, but she does successfully convey their spiritual insights about the human condition. Each chapter provides a movie plot summary and concludes with an insightful segment dubbed 'The Moral of the Story.' Falsani is an expert at pop culture analysis and her love for the celluloid arts shines forth brightly---her interpretations are nuanced and sophisticated without being pretentious. Film lovers, whether religious or not, will be pleased.","torrent":{"xt":"urn:btih:0f8772f1ccd9043d7148324af4af4151a16271e1","amp;dn":"The+Dude+Abides+-+The+Gospel+According+to+Coen+Brothers+by+Cathl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f8772f1ccd9043d7148324af4af4151a16271e1","infoHashBuffer":{"type":"Buffer","data":[15,135,114,241,204,217,4,61,113,72,50,74,244,175,65,81,161,98,113,225]},"announce":[],"urlList":[]}}