{"title":"I Was Monty's Double - (1958).avi","uid":6450222,"size":773442560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0fbeadc31c12fb88c1a1662730a3f54c72235e0d&amp;dn=I+Was+Monty%5C%27s+Double+-+%281958%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"darrencaf","files":-1,"time":1307398932,"description":"I Was Monty's Double is a book by M. E. Clifton James, first published in London in 1954. It was made into a film in 1958, directed by John Guillermin, from a screenplay adapted by Bryan Forbes. James had an uncanny resemblance to Field Marshal Montgomery in real life, and he was used to impersonate Montgomery to confuse the Germans.\n[edit]Film vs book\n\nThe film broadly follows the account by James in his book of the same name, but according to James, there was no attempt to kidnap him. The German High Command did plan to have him killed, but Hitler vetoed the plan until he could be sure where the landings would actually take place.\nGibraltar was in reality a hotbed of German agents, and James/Montgomery was spied on by several operatives who were smuggled into Gibraltar specifically to discover what &quot;Monty&quot; was up to. James/Montgomery deliberately talked nonsense about non-existent operations and plans, in the hope that the spies would overhear and take such information seriously.\nThe intelligence officer who initially recruited James was David Niven, at that time serving as a Lieutenant-Colonel at the War Office.\nThe film also includes well-received performances by Leslie Phillips, Michael Hordern as the Governor of Gibraltar, &quot;Rusty&quot; Eastwood, Marius Goring as Karl Nielson and Barbara Hicks as Logan's formidable but highly competent secretary, Hester Baring. In common with many British films from the period Sam Kydd makes a brief appearance. Bryan Forbes appears as a young officer co-opted to help intercept the kidnappers.","torrent":{"xt":"urn:btih:0fbeadc31c12fb88c1a1662730a3f54c72235e0d","amp;dn":"I+Was+Monty%5C%27s+Double+-+%281958%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fbeadc31c12fb88c1a1662730a3f54c72235e0d","infoHashBuffer":{"type":"Buffer","data":[15,190,173,195,28,18,251,136,193,161,102,39,48,163,245,76,114,35,94,13]},"announce":[],"urlList":[]}}