{"title":"Blackwater_by_Jeremy_Scahill.pdf","uid":7322938,"size":1568826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fcc366f942b11b1c267bed77886d0c81c927c3a&amp;dn=Blackwater_by_Jeremy_Scahill.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"liberal42","files":-1,"time":1338670867,"description":"Meet Blackwater USA, the powerful private army that the U.S. government has quietly hired to operate in international war zones and on American soil. With its own military base, a fleet of twenty aircraft, and twenty-thousand troops at the ready, Blackwater is the elite Praetorian Guard for the &quot;global war on terror&quot;-- yet most people have never heard of it. It was the moment the war turned: On March 31, 2004, four Americans were ambushed and burned near their jeeps by an angry mob in the Sunni stronghold of Falluja. Their charred corpses were hung from a bridge over the Euphrates River. The ensuing slaughter by U.S. troops would fuel the fierce Iraqi resistance that haunts occupation forces to this day. But these men were neither American military nor civilians. They were highly trained private soldiers sent to Iraq by a secretive mercenary company based in the wilderness of North Carolina. Blackwater: The Rise of the World's Most Powerful Mercenary Army is the unauthorized story of the epic rise of one of the most powerful and secretive forces to emerge from the U.S. military-industrial complex, hailed by the Bush administration as a revolution in military affairs, but considered by others as a dire threat to American democracy.","torrent":{"xt":"urn:btih:0fcc366f942b11b1c267bed77886d0c81c927c3a","amp;dn":"Blackwater_by_Jeremy_Scahill.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fcc366f942b11b1c267bed77886d0c81c927c3a","infoHashBuffer":{"type":"Buffer","data":[15,204,54,111,148,43,17,177,194,103,190,215,120,134,208,200,28,146,124,58]},"announce":[],"urlList":[]}}