{"title":"Soft Machines - Nanotechnology and Life - Richard A. L. Jones","uid":15506246,"size":2879268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fef1dfe69774b5cd65524cd50ad5a8b06da544e&amp;dn=Soft+Machines+-+Nanotechnology+and+Life+-+Richard+A.+L.+Jones&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1470588309,"description":"Soft Machines - Nanotechnology and Life - Richard A. L. Jones (OUP, 2004).pdf\r\n\r\nEnthusiasts look forward to a time when tiny machines reassemble matter and process information with unparalleled power and precision. But is their vision realistic? Where is the science heading? As nanotechnology (a new technology that many believe will transform society in the next on hundred years) rises higher in the news agenda and popular consciousness, there is a real need for a book which discusses clearly the science on which this technology will be based. Whilst it is most easy to simply imagine these tiny machines as scaled-down versions of the macroscopic machines we are all familiar with, the way things behave on small scales is quite different to the way they behave on large scales. Engineering on the nanoscale will use very different principles to those we are used to in our everyday lives, and the materials used in nanotehnology will be soft and mutable, rather than hard and unyielding.\r\n\r\nSoft Machines explains in a lively and very accessible manner why the nanoworld is so different to the macro-world which we are all familiar with. Why does nature engineer things in the way it does, and how can we learn to use these unfamiliar principles to create valuable new materials and artefacts which will have a profound effect on medicine, electronics, energy and the environment in the twenty-first century. With a firmer understanding of the likely relationship between nanotechnology and nature itself, we can gain a much clearer notion of what dangers this powerful technology may potentially pose, as well as come to realize that nanotechnology will have more in common with biology than with conventional engineering","torrent":{"xt":"urn:btih:0fef1dfe69774b5cd65524cd50ad5a8b06da544e","amp;dn":"Soft+Machines+-+Nanotechnology+and+Life+-+Richard+A.+L.+Jones","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fef1dfe69774b5cd65524cd50ad5a8b06da544e","infoHashBuffer":{"type":"Buffer","data":[15,239,29,254,105,119,75,92,214,85,36,205,80,173,90,139,6,218,84,78]},"announce":[],"urlList":[]}}