{"title":"George Winston - Complete Solo Piano Recordings 1972 - 1996 TQMP","uid":4876846,"size":1394555778,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0ffb58cc1374beeb50c150ae67587666d447f179&amp;dn=George+Winston+-+Complete+Solo+Piano+Recordings+1972+-+1996+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"zootallure","files":184,"time":1241175955,"description":"George Winston, best known for his melodic rural folk piano style, has always acknowledged that his main piano influences are the great New Orleans R&amp;B pianists.\nHe is an American pianist who was born in Michigan, and grew up in Miles City, Montana, and Mississippi. He lives in San Francisco, California. Many of his pieces, self-described as &quot;rural folk piano&quot;, evoke the essence of a season and reflect natural landscapes. He also is known for his tribute album of Vince Guaraldi's compositions for the Peanuts animations.\nWinston dresses unassumingly for his shows, playing in stocking feet, stating that it quiets his &quot;hard beat pounding&quot; left foot. For years, the balding, bearded Winston would walk out on stage in a flannel shirt and jeans, and the audience would think he was a technician, coming to tune the 9-foot Steinways that are his piano of choice.\n\nHere are his complete recordings from '72 to '96. Every album has a jewel case and its own artwork, and a separate folder in the torrent. They are put together in a gift box. There is another booklet in this giftbox and I also scaned the front of the gift box, so If one decide, can make also the box for this seven gems.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:0ffb58cc1374beeb50c150ae67587666d447f179","amp;dn":"George+Winston+-+Complete+Solo+Piano+Recordings+1972+-+1996+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ffb58cc1374beeb50c150ae67587666d447f179","infoHashBuffer":{"type":"Buffer","data":[15,251,88,204,19,116,190,235,80,193,80,174,103,88,118,102,212,71,241,121]},"announce":[],"urlList":[]}}