{"title":"Amie Kaufman, Jay Kristoff - Illuminae (The Illuminae Files #1)","uid":12685616,"size":337313695,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:10192cfb4862bf91dbed249850260a8e5b7bffca&amp;dn=Amie+Kaufman%2C+Jay+Kristoff+-+Illuminae+%28The+Illuminae+Files+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":11,"time":1446602954,"description":"For fans of Marie Lu and James Dashner comes the first book in an epic new series.\r\n\r\nThis morning, Kady thought breaking up with Ezra was the hardest thing she'd have to do.\r\n\r\nThis afternoon, her planet was invaded.\r\n\r\nThe year is 2575, and two rival mega-corporations are at war over a planet that's little more than an ice-covered speck at the edge of the universe. Too bad nobody thought to warn the people living on it. With enemy fire raining down on them, Kady and Ezra - who are barely even talking to each other - are forced to fight their way onto one of the evacuating fleet, with an enemy warship in hot pursuit.\r\n\r\nBut their problems are just getting started. A deadly plague has broken out and is mutating, with terrifying results; the fleet's AI, which should be protecting them, may actually be their enemy; and nobody in charge will say what's really going on. As Kady hacks into a tangled web of data to find the truth, it's clear only one person can help her bring it all to light: the ex-boyfriend she swore she'd never speak to again.\r\n\r\nTold through a fascinating dossier of hacked documents - including emails, schematics, military files, IMs, medical reports, interviews, and more - Illuminae is the first book in a heart-stopping, high-octane trilogy about lives interrupted, the price of truth, and the courage of everyday heroes.\r\n\r\n\r\nRead by Olivia Taylor Dudley, Lincoln Hoppe, Jonathan McClain, Full Cast\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged\r\n\r\nLength: 11 hrs and 41 mins\r\nUnabridged Audiobook\r\nRelease Date:10-20-15","torrent":{"xt":"urn:btih:10192cfb4862bf91dbed249850260a8e5b7bffca","amp;dn":"Amie+Kaufman%2C+Jay+Kristoff+-+Illuminae+%28The+Illuminae+Files+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10192cfb4862bf91dbed249850260a8e5b7bffca","infoHashBuffer":{"type":"Buffer","data":[16,25,44,251,72,98,191,145,219,237,36,152,80,38,10,142,91,123,255,202]},"announce":[],"urlList":[]}}