{"title":"Jimmy Page and Robert Plant - Most High [promo].VOB","uid":11624527,"size":245196800,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:112065b14f58961af01141a08b8bb92677bcb27d&amp;dn=Jimmy+Page+and+Robert+Plant+-+Most+High+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1417603299,"description":"Jimmy Page and Robert Plant - Most High [promo].VOB\n\n\nVery HQ rare promo music video from a promo DVD. &quot;Most High&quot; is a song by Jimmy Page and Robert Plant from the studio album Walking into Clarksdale, released through Atlantic Records in 1998. In 1999, the song won Page and Plant the Grammy Award for Best Hard Rock Performance. It reached number one on the Billboard Mainstream Rock chart in May 1998.\n\nWalking into Clarksdale is a studio album by Jimmy Page and Robert Plant, both formerly of English rock band Led Zeppelin. It was released by Atlantic Records on 21 April 1998. Walking into Clarksdale took 35 days to record. The album was recorded and mixed by Steve Albini. The single &quot;Most High&quot; was awarded a Grammy Award for Best Hard Rock Performance in 1999.\n\nClarksdale is a town in the Mississippi Delta, a historical home of Delta blues music.\n\nThe album debuted on the Billboard's Billboard 200 album chart at No. 8, while reaching No. 3 on the UK Album Chart. The single &quot;Most High&quot; reached No. 1 on Billboard's Mainstream Rock Tracks chart.\n\n\nJimmy Page and Robert Plant, both formerly of the English hard rock band Led Zeppelin, recorded and toured in the mid-1990s under the title Page and Plant. The pair re-united in 1994 and, after recording a highly successful first album, they embarked on a world tour. They then recorded a second album, followed by another world tour, before disbanding at the end of 1998. They later briefly reunited in 2001. \n\nThe initial plans for a reunion were made in 1993, with discussions between the two of collaborating emerging from casual small talk and then an invitation to perform on MTV Unplugged. Music producer Bill Curbishley, who had been managing Plant since the 1980s and who assumed management of Page in 1994, was integral in the reuniting of Page and Plant. Despite failed attempts by others to reunite the pair, Curbishley was able to persuade the previously reluctant Plant into working with Page again. In an interview he gave in 2004, Page recounted the background:\n\n\nI was going to play in Japan with David, the only time we played live, and I had a call from Robert's management to pop in and see Robert in Boston on the way to LA to rehearse. Robert said, &quot;I've been approached by MTV to do an Unplugged and I'd really like to do it with you&quot;, so I said OK. It gave us a chance to revisit some numbers and use that same picture with a very, very different frame.\n\n\nPlant's recollection of the reunion was as follows:\n\n\nBy that time I didn't feel like I was even a rock singer anymore ... Then I was approached by MTV to do an Unplugged session. But I knew that I couldn't be seen to be holding the flag for the Zeppelin legacy on TV. Then mysteriously Jimmy turned up at a gig I was playing in Boston and it was like those difficult last days of Led Zep had vanished. We had this understanding again without doing or saying anything. We talked about the MTV thing and decided to see where we could take it.\n#video does not have any logos#\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Walking_into_Clarksdale&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Walking_into_Clarksdale&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/iAIlNaaGa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iAIlNaaGa&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 #4:3# 25fps 9800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 256kbps\n   Duration: 00:04:26\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee #Sgt.R.Lee#","torrent":{"xt":"urn:btih:112065b14f58961af01141a08b8bb92677bcb27d","amp;dn":"Jimmy+Page+and+Robert+Plant+-+Most+High+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"112065b14f58961af01141a08b8bb92677bcb27d","infoHashBuffer":{"type":"Buffer","data":[17,32,101,177,79,88,150,26,240,17,65,160,139,139,185,38,119,188,178,125]},"announce":[],"urlList":[]}}