{"title":"Depression in Adults with a Chronic Physical Health Problem - Pd","uid":9379910,"size":2316879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:129bf0a4edb9c4b205e8cec34f232a51d85ba7ac&amp;dn=Depression+in+Adults+with+a+Chronic+Physical+Health+Problem+-+Pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KhushSidhu","files":1,"time":1387695091,"description":"\n\nDepression in Adults with a Chronic Physical Health Problem: The NICE Guideline on Treatment and Management (National Clinical Practice Guideline) \n\nBy National Collaborating Centre for Mental Health (section of the Colleges Research Unit)\n\n300 pages - Publisher: RCPsych Publications; 1 Pap/Com edition\nYear - 2010 - Language: English\nISBN-10: 1904671861 - ISBN-13: 978-1904671862\n\nPeople with a chronic physical health problem (e.g. cancer, diabetes) are three times more likely to develop depression. When they do, it is much more severe.\n\nSets out clear recommendations for healthcare staff (based on the best available evidence) on how to diagnose and manage adults with a chronic physical health problem who have depression, in order to significantly improve their treatment and care.\n\nGuideline specifically recognises the dual-condition problems and places emphasis on interactions between antidepressants and other prescribed medication.\n\nCommissioned by the National Institute for Health and Clinical Excellence (NICE).\n\nThe CD-ROM contains all of the evidence on which the recommendations are based, presented as profile tables (that analyse quality of data) and forest plots (plus, info on using/interpreting forest plots). This material is not available anywhere else.\n\nReadership\n\nBoth hospital-based physical practitioners and general practitioners.\n\nRelated titles\n\nThis has a sister title Depression (Updated edition), ISBN 9781904671855, due out May 2010. Most recent in the NICE guides series is Attention Deficit Hyperactivity Disorder, ISBN 9781854334718, from 2009.\n\nRCPsych Publications is the publishing arm of the Royal College of Psychiatrists (based in London, United Kingdom), which has been promoting excellence in mental health care since 1841. Produced by the same editorial team who publish The British Journal of Psychiatry, they sell books for both psychiatrists and other mental health professionals; and also many written for the general public. Their popular series include the College Seminars Series, the NICE mental health guidelines and the Books Beyond Words series for people with intellectual disabilities.\n\nRCPsych publishes in all areas of psychiatry and mental health, including but not limited to:\nClinical psychiatric practice\nIntellectual disability\nMental health services for children, adolescents, adults and the elderly\nPsychopharmacology\nPsychotherapy\nRehabilitation psychiatry\nFamily mental health\nService provision\n\nRCPsych Publications books can help with the following disorders:\nAddictions\nAffective disorders\nAttention deficit hyperactivity disorder (ADHD)\nBereavement\nBorderline personality disorder\nCognitive-behavioral therapy (CBT)\nDementia\nDepression\nEating disorders\nPerinatal psychiatric disorder\nPost-traumatic stress disorder (PTSD)\nPsychosis\nSchizophrenia\nSleep problems","torrent":{"xt":"urn:btih:129bf0a4edb9c4b205e8cec34f232a51d85ba7ac","amp;dn":"Depression+in+Adults+with+a+Chronic+Physical+Health+Problem+-+Pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"129bf0a4edb9c4b205e8cec34f232a51d85ba7ac","infoHashBuffer":{"type":"Buffer","data":[18,155,240,164,237,185,196,178,5,232,206,195,79,35,42,81,216,91,167,172]},"announce":[],"urlList":[]}}