{"title":"[Audiobook] Jon Krakauer - Under The Banner of Heaven {on the Mo","uid":3976222,"size":361319408,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:12aee549b3c572836f2df2474638af3a3e760f27&amp;dn=%5BAudiobook%5D+Jon+Krakauer+-+Under+The+Banner+of+Heaven+%7Bon+the+Mo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rjeong","files":10,"time":1200286297,"description":"Please seed me!\n\nJon Krakauer, Under The Banner of Heaven - 10 Discs (on the Mormon Church aka LDS)  &lt;a href=&quot;\nhttp://www.amazon.com/Under-Banner-Heaven-Story-Violent/dp/0739323660&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Under-Banner-Heaven-Story-Violent/dp/0739323660&lt;/a&gt;\n\nIn 1984, Ron and Dan Lafferty murdered the wife and infant daughter of their younger brother Allen. The crimes were noteworthy not merely for their brutality but for the brothers&amp;#039; claim that they were acting on direct orders from God. In Under the Banner of Heaven, Jon Krakauer tells the story of the killers and their crime but also explores the shadowy world of Mormon fundamentalism from which the two emerged. The Mormon Church was founded, in part, on the idea that true believers could speak directly with God. But while the mainstream church attempted to be more palatable to the general public by rejecting the controversial tenet of polygamy, fundamentalist splinter groups saw this as apostasy and took to the hills to live what they believed to be a righteous life. When their beliefs are challenged or their patriarchal, cult-like order defied, these still-active groups, according to Krakauer, are capable of fighting back with tremendous violence. While Krakauer&amp;#039;s research into the history of the church is admirably extensive, the real power of the book comes from present-day information, notably jailhouse interviews with Dan Lafferty. Far from being the brooding maniac one might expect, Lafferty is chillingly coherent, still insisting that his motive was merely to obey God&amp;#039;s command. Krakauer&amp;#039;s accounts of the actual murders are graphic and disturbing, but such detail makes the brothers&amp;#039; claim of divine instruction all the more horrifying. In an age where Westerners have trouble comprehending what drives Islamic fundamentalists to kill, Jon Krakauer advises us to look within America&amp;#039;s own borders.\n\n audiobooks\naudio","torrent":{"xt":"urn:btih:12aee549b3c572836f2df2474638af3a3e760f27","amp;dn":"%5BAudiobook%5D+Jon+Krakauer+-+Under+The+Banner+of+Heaven+%7Bon+the+Mo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12aee549b3c572836f2df2474638af3a3e760f27","infoHashBuffer":{"type":"Buffer","data":[18,174,229,73,179,197,114,131,111,45,242,71,70,56,175,58,62,118,15,39]},"announce":[],"urlList":[]}}