{"title":"Webb Wilder - Acres Of Suede  [1996]  [Robbie60] [FLAC]","uid":6172492,"size":357122241,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:12b42e3228979f37e9f38acfbfb3a6c5f33a71c5&amp;dn=Webb+Wilder+-+Acres+Of+Suede++%5B1996%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297638179,"description":"Webb Wilder\nAcres Of Suede\n\nLabel: Watermelon Records\nReleased: 1996\nSource: Original CD \nSize Torrent: 340 MB\nFormat: FLAC\n\n\n\n\n\n\n\n\nWebb Wilder is the last of the full grown men. Webb Wilder is an electrifying artist. Webb Wilder is not only a man but a band. Actually, Webb Wilder and his band, the Nashvegans, recorded a new album called &quot;Acres Of Suede&quot;. With long time producer R.S. &quot;Bobby&quot; Field AKA The Ionizer (John Mayall, Sonny Landreth) at the helm, Webb Wilder has once again boldly gone where no man has gone before. While combining the best of two kinds of music, Rock and Roll, fans will rejoice when they listen to this masterpiece.\n\nThe Nashvegans, led by George Bradfute &quot;The Tone Chaperone&quot; and Les James Lester (drums), along with a host of guests like David Grissom (guitar), Rick &quot;Casper&quot; Rawls (guitar), Scott Baggett (guitars, bass, organ), K.K. Falkner (background vocals), Steve Conn (keyboards), Joe Pisapia (background vocals), and R.S. Field (guitars, organ, vocals), lay down some serious music that allows us to hear the full, unadulterated sounds of Webb Wilder.\n\nIn today's world, a sense of humor is a must. In today's music, a sense of humor should be required. Webb uses his comedic charm on the track &quot;The Ole' Elephant Man&quot; as well as reading his &quot;Tips For Teens Manifesto&quot; which was originally longer than the Unabomber's Manifesto yet had to be condensed for inclusion on the new album.\n\nThe ultimate combination of roots rock, blues, and even alternative music are visited on this album as Webb covers some new ground with the addition of keyboards and female backing vocals to add to the unique sound Webb has carved out over the past ten years. Although the last record, &quot;Town and Country&quot; - a collection of cover songs, had some relatively unknown songs on it that Webb made sound like they were originally written by him, &quot;Acres Of Suede&quot; is completely new, original material. The lone exception is the Dave Grissom track &quot;Loud Music&quot;.\n\nPersonally, I enjoyed the entire album. Especially, &quot;Carrying The News To Mary&quot;, &quot;No Great Shakes&quot;, the a fore mentioned &quot;Loud Music&quot;, and &quot;Fall In Place&quot;. A song that both the Ioizer and Webb played way back at the start of their collaboration, &quot;Rocket To Nowhere&quot;, finally is committed to the digital media with this effort. &quot;Scattered, Covered, and Smothered&quot; is difficult to describe. I like to say it is Webb's version of a B-52's song- it is another amazing song. Webb told me that The Ionizer and he had been working on that song for years and finally finished it.\n\nThe tour that never ends will continue and you can bet that Webb Wilder will be near your town sometime in the future. Do yourself a favor and get out of the rut that radio has put you in. Reall people are out there and they are playing real music. You just need to find them. Webb Wilder is not only real but excellent as well. Check it out- you will not be disappointed.  Ken Drew\n\n\nPersonnel\n\n\nWebb Wilder - guitar, lead vocals; \nLes James Lester - drums; \nKelly Looney - bass, vocals; \nGeorge Bradfute - guitars, vocals.\n\n\n\nTrack Listing\n\n\n1 The Olde Elephant Man \n2 No Great Shakes \n3 Loud Music \n4 Fall in Place \n5 Flat Out Get It \n6 Soul Mate \n7 Scattered Smothered and Covered \n8 Tell Me Why Charlene \n9 Why Do You Call? \n10 Carryin' The News to Mary \n11 Lost In The Shuffle \n12 Rocket to Nowhere \n","torrent":{"xt":"urn:btih:12b42e3228979f37e9f38acfbfb3a6c5f33a71c5","amp;dn":"Webb+Wilder+-+Acres+Of+Suede++%5B1996%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12b42e3228979f37e9f38acfbfb3a6c5f33a71c5","infoHashBuffer":{"type":"Buffer","data":[18,180,46,50,40,151,159,55,233,243,138,207,191,179,166,197,243,58,113,197]},"announce":[],"urlList":[]}}