{"title":"Inherit the wind (Spencer Tracy) English or French audio, multis","uid":5168662,"size":910124608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1322553ca3a1c2618227ff9763fd586c287df0f5&amp;dn=Inherit+the+wind+%28Spencer+Tracy%29+English+or+French+audio%2C+multis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1258563136,"description":"We are maintaining our seeding focus on &quot;The Sound of music 4.35GB DVD\ntorrent we recently posted, all the way to Christmas and beyond. Please join\nus to give some kid in your own backyard a nicer christmas!&quot;\n\nEnglish or French audio (appropriate bitrate for content) and subtitles\nembedded in French or Spanish. This movie was made in 1960 (seventy years\nago) and belongs in the public domain by our own valued estimation of its\ncontent (and at the outset for that matter).\n\nThis is a re-launch of this movie file, please join this seed if you were\none of the hundreds of downloaders in the initial days when we first uploaded\nit a year ago. (Use the torrent re-check facility to addthe jpgs which are part\nof this torrent update).\n\nThis movie is focused on what were referred to as the &quot;monkey trials&quot;.\nThe question to be decided is whether it is legitimate in the sense of\nthe observance of law, and in addition, moral, indeed - to be preaching\nalternatives to the biblical version of how creation unfolded on our\nplanet (at the outset in any event).\n\nThe theories being advanced are those in particular of Mr. Charles Darwin\nwho thought that man evolved from a lower order of species, that all\nforms of life on earth evolve from other forms etc. Those that preach\nthe &quot;big bang&quot; theory suggest that all that is on earth came out of no\nwhere, and indeed Darwin's suggestion that &quot;the survival of the species&quot;\ncame from the notion of &quot;survival of the fittest&quot; is just as speculative\nin a moral sense as the former is scientifically.\n\nSt. Thomas Aquinas was a great thinker involved with the church while\nactive in the practice of philosophical argument and published his views\nthat are taught at most universities today in this area of continued\nspeculation and debate. He advances several important arguments to negate\nany notion for a rightly thinking man to accept that something came from\nnothing in what the world is today. after all, as the theory goes (David\nHume), if you take a hundred pieces of metal and throw them together\nrepeatedly, they will never collide in such manner as to form a precision\nwatch (in the form of an accurate timepiece) since that would be beyond\nreason to expect. You would have to design the outcome and go about bringing\nyour results to fruition methodically in this respect. Those who teach the\n&quot;big bang&quot; theory, therefore are simply those that choose to reject a notion\nof a creator with nothing more than an obvious inanity fit for their needs\nbut is just as incredulous as anything you could imagine in the way of an\nexplanation for how we came to be, in a world with so much order and obvious\nevidence of having been built to a design of a creative force as it were, no\nmatter what you understand it to be.\n\nThen again those that seek to relate man to ape, are no doubt bringing about\nas notion that if that is our roots, then perhaps we are entitled to return to\nthem in some way, in such a way as to perhaps pursue a parallel existence even\nas we are made in human form and nothing more than that makes us a different\nform of being. This to me is equally incredible to suggest although there is\nsome physical resemblance that is a bit of a stretch to take too far, let alone\nsuggesting that one form of being led to the other by some form of miracle. It\nis idle speculation of a mind that seeks comfort in such ideas as they tend to\nlower the playing field in our expectation of what makes man truly better than\nthat.\n\nThat all said, the movie is very much telling us that religion practices it own\nform of repression, of cruelty of the inane that follow in a way that is blind\nto the spirit of those that would preach the bible, as we are told in what the\nmovie is about. If religion is used to stifle the real spirit of what a loving\nexistence of right minded folks should be based on our own faculties to reason\n(contemporary philosopher Walter Stace says that if you think that &quot;god is\ndead&quot; and that you therefore don't have to be moral, then you aren't genuinely\ncivilized) then it isn't being practiced by certain folk in a way as to do\njustice to what should have been intended when it was considered a reasonable\nway to pursue the best possible aims. Is the alternative a rejection then of\nreligion, and if so, should we altogether negate all that would be sane to\nthink, by such flights of idle fantasy as is taught by &quot;big bang&quot; theorists?\nOr Darwin's ideas in addition?\n\nId like to think that man will find that he can be a moral person by &quot;looking\nwithin&quot; as is Immanuel Kant's teachings on the matter. And if so, he may stray\nfrom religion and he mat reject &quot;Darwinism&quot; even more, while still being able\nto call himself morally upright and correct in his dealings and aims in his\nterrestrial walk among men.\n\nI personally suggest that the measure of any society is its ability to treat\nwell those spirits that are sensitively and genuinely Christianly and in need\nof right care to survive and flourish. The character played by Ms. Donna\nAnderson in the movie is constantly being cruelly mistreated by a bigoted\nmindset that fails to see the real reason you would want to preach anything\nat all. It is to see that loving people get their due. As such I say that both\nsides of this debate fail in the most fundamental test of what they exist for,\nas is the message of this movie for us all.\n\nMichael Rizzo Chessman\nSee my movie reviews at moviesbyrizzo.info","torrent":{"xt":"urn:btih:1322553ca3a1c2618227ff9763fd586c287df0f5","amp;dn":"Inherit+the+wind+%28Spencer+Tracy%29+English+or+French+audio%2C+multis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1322553ca3a1c2618227ff9763fd586c287df0f5","infoHashBuffer":{"type":"Buffer","data":[19,34,85,60,163,161,194,97,130,39,255,151,99,253,88,108,40,125,240,245]},"announce":[],"urlList":[]}}