{"title":"Max.And.Paddys.Box.Set.DVDRip.H264-BINGO","uid":7754579,"size":7187062741,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1346ffffa2d77e48729bde9b56de47c0a3b14965&amp;dn=Max.And.Paddys.Box.Set.DVDRip.H264-BINGO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":".BONE.","files":27,"time":1351058052,"description":"Release Title: Max.And.Paddy's.Box.Set.DVDRip.H264(BINGOWINGZ-UKB-RG)\nDVD Release Date: 2005\nGenre: TV Series/Comedy\nRunTime: Loads Of Minutes\n\nThe Max &amp; Paddy's Box Set includes the Complete Series of\nPeter Kay and Patrick McGuinness' multi-award winning\ncomedy &quot;Road to Nowhere&quot;, plus their hilarious full fitness\nprogramme, &quot;The Power of Two&quot; &amp; &quot;Phoenix Nights&quot;.\n\nPhoenix Nights\nSeries 1\nCreated by and starring Bolton-born comic Peter Kay, Phoenix Nights\nis one of those rare gems that few saw on first showing but that\neveryone was soon talking about. The first series introduces\nwheelchair-bound Brian Potter (Kay), who runs the titular Phoenix,\na shabby social club populated by an assortment of wonderfully\nobserved characters. It's grim up North and despite the best efforts\nof the staff to inject life into the proceedings--be it an\nalternative comedy night, a version of Robot Wars in Potter's beloved\nPennine Suite or a Wild West extravaganza--each evening's entertainment\nalways ends badly. Undaunted, the Phoenix denizens continue to strive\nfor their dream: a world in which &quot;clubland never dies&quot;.\n\nSeries 2\nThe beginning of the second series sees Brian Potter's beloved\nPhoenix Club lying in ashes and the staff scattered to the four\nwinds. Even club compere Jerry St Clair is reduced to singing\n&quot;Come get your black bin bags&quot; to the tune of Men in Black in\nthe local supermarket. But not even being barred from having a\nlicence for the rest of his natural life can deter the northern\nSvengali from reopening the club and making it bigger and better\nthan before--even if that means making Jerry the licensee and\noffering up-market Chinese nosh.\n\n\nRoad to Nowhere\nMax &amp; Paddy's &quot;Road to Nowhere&quot; is the much-loved sequel\nto Peter Kay's critically-acclaimed comedy series,\n&quot;Phoenix Nights&quot;. Written by and starring Peter Kay and\nPatrick McGuinness, this six-part comedy/drama series is\nthe story of clueless Phoenix Club bouncers Max (Kay)\nand Paddy (McGuinness), as they escape clubland in their\nprized motor-home and take to the open highway.\n\n\nThe Power of Two\nMax &amp; Paddy decide to venture into the lucrative world\nof the fitness videos. Their full fitness programme--which\ntruly is an extraordinary workout for ordinary people--even\nincludes a special guest appearance from the &quot;Phoenix Nights&quot;\ncharacter Brian Potter. With Max's strict army training and\nPaddy's intricate knowledge of (and limited experience with)\nsex-ercise, &quot;The Power of Two&quot; will leave viewers aching...\nboth from the exercise and the laughter! What else could\nanyone possibly need to get into shape?\n\n\nPeter Kay ... Max Bygraves\nPaddy McGuinness ... Paddy O'Shea\n\nORiGiNAL Source: DVDR\nVideo: MP4/720*400/25fps\nAudio: AAC/2ch/128Kbps\nSize Of File: 6.69GB\nSample Included: Yes","torrent":{"xt":"urn:btih:1346ffffa2d77e48729bde9b56de47c0a3b14965","amp;dn":"Max.And.Paddys.Box.Set.DVDRip.H264-BINGO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1346ffffa2d77e48729bde9b56de47c0a3b14965","infoHashBuffer":{"type":"Buffer","data":[19,70,255,255,162,215,126,72,114,155,222,155,86,222,71,192,163,177,73,101]},"announce":[],"urlList":[]}}