{"title":"Graham and Dodd - Securities analysis.PDF","uid":6836006,"size":2956414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13d8e0bda174b6abb976bda8d92a23c13d5c092a&amp;dn=Graham+and+Dodd+-+Securities+analysis.PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"boo_ronan","files":1,"time":1322025380,"description":"Benjamin Graham and David Dodd's classic; Security Analysis\nOriginal publishing in 1934\nISBN 978-0070244962\n\n\nShamelessly taken from a leading online retailer;\n\n'Continuously in print through five editions, for more than 60 years, and through nearly a million copies, the primer for many of America's most illustrious investors--and the wellspring of Graham and Dodd's Wall Street Immortality--Security Analysis is indisputably the most influential book on investing ever written. Still the investors' bible, it's as frequently consulted today as it was when it first appeared in 1934.\n\nOf course, over the years and over five editions, Security Analysis changed. Its language was modernized. New material was added. Metaphors and examples were brought up to date. In the light of changing times, these alterations were necessary and appropriate.\n\nBut what of the original book? The very durability of this work arouses our curiosity. And what we discover when we return to the original is very simply a classic, a work whose uncompromising worth has not paled since it first saw the light of day in 1934.\n\nThe original words of Benjamin Graham and David Dodd--put to paper not long after the disastrous Stock Market Crash of 1929--still have the mesmerizing qualities of rigorous honesty and diligent scrutiny, the same riveting power of disciplined thought and determined logic that gave the work its first distinction and began its illustrious career.\n\nThe words you will read here are eloquent. Not only a financial genius and a man of high repute for honorable dealings, Graham was a man of letters invited to teach in the literature department at Columbia University (as well as in the economics and philosophy departments).\n\nBut this reproduction is far more than a historical curiosity, an interesting object, and a delightful read. It presents the original Graham/Dodd method of investing--told in their own words as they first described it in the 1930s.\n\nWhat exactly is this method that has drawn such longterm devotion in the notably fickle reaches of Wall Street?\n\nGraham and Dodd were Wall Street's first bargain shoppers. In this book they first explain their methods for locating bonds and stocks &quot;which are selling well below the levels apparently justified by a careful analysis of the relevant facts.&quot; In this book, they tell you precisely how to find these undervalued securities and analyze those &quot;relevant facts.&quot;\n\nAre these methods still practical and usable today? The great fortunes created by value investors Warren Buffett, Mario Gabelli, John Neff, Michael Price, and John Bogle testify that they certainly are.\n\nIn their preface to this book, Graham and Dodd write that they hope their work &quot;will stand the test of the ever enigmatic future.&quot; There is no doubt that it has.'\n\n\n---\nFrom Amazon\nSecurity Analysis is the bible of fundamental analysis. Originally published in 1934, the tome systematically lays bare the science of security analysis. Written with the assistance of cowriter David Dodd, Benjamin Graham's intellectual tour de force has yet to be equaled in the annals of investing. Written only a few years after the devastating stock market crash of 1929, Graham had one objective--to make the investment process as safe as possible using knowledge of key factors about the business. \nBeginning with bonds and moving quickly to stocks, Graham and Dodd go over all of the angles. Articulating a comprehensive theory of fixed-value and common stock investment, they examine in detail the various factors that one should consider when valuing securities. Dividends, extraordinary items, depreciation, amortization, capital structure and balance sheet analysis are all described and defined in lurid detail. It is impossible to read Security Analysis and not come away with a deeper understanding of corporate finance and how it relates to investing. \n\nOn the downside, let's be frank--Security Analysis is not an easy book to read. However, it remains one of the key textbooks for communicating fundamental analysis to millions of MBAs, in spite of the fact that it first saw print 63 years ago. I personally believe that reading and understanding most of Security Analysis would make a great benchmark for determining whether or not you are ready to start investing your money in specific investments. Sure, Graham is very value-biased in his investment philosophy, but looking for growth without focusing on the price you are paying is the golden road to underperformance\n\n","torrent":{"xt":"urn:btih:13d8e0bda174b6abb976bda8d92a23c13d5c092a","amp;dn":"Graham+and+Dodd+-+Securities+analysis.PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d8e0bda174b6abb976bda8d92a23c13d5c092a","infoHashBuffer":{"type":"Buffer","data":[19,216,224,189,161,116,182,171,185,118,189,168,217,42,35,193,61,92,9,42]},"announce":[],"urlList":[]}}