{"title":"Obscure GOG","uid":8079643,"size":2807505293,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1448ad463ee66cb58574698c951f42ad6c4d3696&amp;dn=Obscure+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1359470775,"description":"Genre: Mystery / Horror / Action\nRelease date: October 1, 2004\nCompatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit)\nDeveloper / Publisher: Hydravision Entertainment / DreamCatcher Interactive\nGame modes: single-player / co-op\nESRB Rating: Mature with Blood, Violence and Bad Language\n\n\nAs many high schools, Leafmore High is no longer the place it used to be. Its walls are moldering, its books are outdated, and its teachers have lost their faith. Following the disappearance of one of their friends, a group of students decide to investigate their high school. This brave step will lead them into a hell they will never forget.\n\nIn Obscure, players can assume the role of five different students, alone or in cooperation, with every one of them having their own special aptitude. Billed as &quot;Survival horror for a new generation,&quot; the game supports two-player cooperative adventuring and boasts a special new visual effect known as &quot;Black Aura&quot; that modifies the decors around various creatures in real time.\n\nFeatures:\n* Teen horror-movie setting: all characters and environments are inspired by movies and television shows such as &quot;Scream,&quot; &quot;Buffy.&quot; and &quot;The Faculty.&quot;\n* Five playable characters; five lives: you are free to play as the character of your choice and change at any point throughout the game, unless one of them dies...\n* Single or team play: In solo mode, your teammates are controlled by A.I. In cooperative mode, a second player can take control of another student.\n* Black aura: imminent dangers are visible on screen through real-time graphic changes (black aura), intensifying the players stress level.\n* Total freedom of movement: character movements are achieved through dynamic camera settings making it possible for players to shoot and move at the same time.\n* Physical interaction with the environment: elements in the environment react realistically to players actions intensifying the feeling of being immersed in a real world environment.\n* Light as a weapon: the presence of artificial or natural light sources increase the vulnerability of monsters and intensifies game-play combat levels as players must combine conventional weapons with light for better results.\n* The game's soundtrack includes music by [Edit: apparently not so] heavy metal group Sum 41.\n\n===\n\nMinimum system requirements:\n\n== Since it is no longer listed the GOG requirements are a guess based on other games from the same period ==\n\nWindows XP or Windows Vista\n1.8 GHz Processor\n512MB RAM (1 GB recommended)\n3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended)\n\n===\n\nInstall:\n1) Run setup_obscure.exe\n2) start installation\n3) Play!\n\n===\n\nIncludes:\n  * manual (27 pages)\n  * OST + 2 music vids by Sum41 and Span\n  * 'making of' vid\n  * wallpapers","torrent":{"xt":"urn:btih:1448ad463ee66cb58574698c951f42ad6c4d3696","amp;dn":"Obscure+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1448ad463ee66cb58574698c951f42ad6c4d3696","infoHashBuffer":{"type":"Buffer","data":[20,72,173,70,62,230,108,181,133,116,105,140,149,31,66,173,108,77,54,150]},"announce":[],"urlList":[]}}