{"title":"Stossel.2014.03.27.[Government Bullies].Fox Business.CF.avi","uid":9846337,"size":345606912,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1489b54ba5306bb7ef3edaa48ba66fff7e6fc26f&amp;dn=Stossel.2014.03.27.%5BGovernment+Bullies%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1396082420,"description":"----------\n\nSTOSSEL - [Government Bullies] - Fox Business Network\n2014, March 27, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nFDA DELAYS: It costs a billion dollars to get a new drug approved by the FDA and can take up to 15 years. I debate former congressman Dennis Kucinich, who supports these onerous regulations.\n\nFDA VICTIMS: Jenn McNary's two sons suffer from the same life-threatening disease but only one is allowed an experimental drug that so far, has helped him. McNary joins Darcy Olsen of the Goldwater Institute, who argues that people who are dying should have the right to try any drug, even if it's not government approved.\n\nBAD INCENTIVES: Every year, police seize over $1 billion in assets without any proof of guilt. They keep much of the loot. Eapen Thampy of Americans for Forfeiture Reform explains why this is a scam.\n\nREGULATOR BULLIES: The FTC accused music teachers of &quot;anti-competitive practices.&quot; Gary Ingle of The Music Teacher's National Association says it's &quot;very difficult&quot; for a small organization like his to take on the government and win.\n\nCHARTER SCHOOLS: I say NYC Mayor Bill de Blasio is a cruel bully because he resists charter schools. Kevin Chavous of American Federation for Children agrees. Noah Gotbaum of NYC Community Education Council says charter schools' bosses are bullies.\n\nDRONES: Adam Thierer of the Mercatus Center says that despite the perception of drones as &quot;nefarious things used to rain death and destruction,&quot; they actually have many positive commercial and peaceful uses. But the FAA wants to ban these good things.\n\nMY TAKE: Government is so big that is has 22 million employees. 22 million government workers ban medical devices that might make our lives better, take about half our money, and jail more citizens than even China and Russia do. This is not a good thing. Voluntary is better than force. Free is better than coerced. We're better off when government is small and people are left to do as they please, unbullied.","torrent":{"xt":"urn:btih:1489b54ba5306bb7ef3edaa48ba66fff7e6fc26f","amp;dn":"Stossel.2014.03.27.%5BGovernment+Bullies%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1489b54ba5306bb7ef3edaa48ba66fff7e6fc26f","infoHashBuffer":{"type":"Buffer","data":[20,137,181,75,165,48,107,183,239,62,218,164,139,166,111,255,126,111,194,111]},"announce":[],"urlList":[]}}