{"title":"John Stuart Mill - Collected Works","uid":10247756,"size":1208220239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14eb88874171d1e11ec7c0d011f56a8df38cb7c6&amp;dn=John+Stuart+Mill+-+Collected+Works&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FFlintston","files":34,"time":1401314569,"description":"John Stuart Mill - Collected Works\nIn 32 volumes, plus one volume containing introductions\n\nThe Collected Works of John Stuart Mill consists of 33 volumes which contain the writings of one of the leading classical liberals of the 19th century. Mill wrote works of political economy, philosophy, history, political theory, and corresponded with many of the leading figures of his day. The collection also includes the speeches he gave as a member of parliament and many volumes of his newspaper articles and letters.\n\nThe Collected Works was produced by an editorial committee appointed from the Faculty of Arts and Science of the University of Toronto, and from the University of Toronto Press. The primary aim of the edition is to present fully collated texts of those works which exist in a number of versions, both printed and manuscript, and to provide accurate texts of works previously unpublished or which have become relatively inaccessible. An Editorial Committee under the direction of John M. Robson (1927-1995) oversaw the project over a period stretching from 1963 to 1991.\n\nEach volume (or the first of a series of related volumes) was preceded by a lengthy introduction written by a leading scholar in the field of Mill studies. We have gathered all 19 of these introductions into one book in order to make this extraordinary scholarly work more easily accessible to the reader.\n\nList of Volumes\n\nThe Introductions to the Robson Edition of the Collected Works of J.S. Mill.\n\nVolume I - Autobiography and Literary Essays: Introduction by Lord Robbins.\n\nVolume II - The Principles of Political Economy. Introduction by V.W. Bladen.\n\nVolume IV - Essays on Economics and Society Part I. Introduction by Lord Robbins.\n\nVolume VI - Essays on England, Ireland, and the Empire. Introduction by Joseph Hamburger.\n\nVolume VII - A System of Logic Ratiocinative and Inductive. Introduction by R.F. McRae.\n\nVolume IX - An Examination of William Hamilton's Philosophy. Introduction by Alan Ryan.\n\nVolume X (1) - Essays on Ethics, Religion, and Society. Introduction by F.E.L. Priestley.\n\nVolume X (2) - Essays on Ethics, Religion, and Society. &quot;Essay on Mill's Utilitarianism&quot; by D.P. Dryer.\n\nVolume XI - Essays on Philosophy and the Classics. Introduction by F.E. Sparshott.\n\nVolume XII - The Earlier Letters of John Stuart Mill 1812-1848 Part I. Introduction by F.A. Hayek.\n\nVolume XIV - The Later Letters of John Stuart Mill 1849-1873 Part I. Introduction by Francis E. Mineka and Dwight N. Lindley.\n\nVolume XVIII - Essays on Politics and Society Part I. Introduction by Alexander Brady.\n\nVolume XX - Essays on French History and Historians. Introduction by John C. Cairns.\n\nVolume XXI - Essays on Equality, Law, and Education. Introduction by Stefan Collini.\n\nVolume XXII - Newspaper Writings December 1822 - July 1831 Part I. Introduction by Ann P. Robson and John M. Robson.\n\nVolume XXVI - Journals and Debating Speeches Part I. Introduction by John M. Robson.\n\nVolume XXVIII - Public and Parliamentary Speeches Part I November 1850 - November 1868. Introduction by Bruce L. Kinzer.\n\nVolume XXX - Writings on India. Introduction by Martin Moir.\n\nVolume XXXI - Miscellaneous Writings. Introduction by John M. Robson.\n\nVolume XXXII - Additional Letters of John Stuart Mill. Introduction by Marion Filipiuk.","torrent":{"xt":"urn:btih:14eb88874171d1e11ec7c0d011f56a8df38cb7c6","amp;dn":"John+Stuart+Mill+-+Collected+Works","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14eb88874171d1e11ec7c0d011f56a8df38cb7c6","infoHashBuffer":{"type":"Buffer","data":[20,235,136,135,65,113,209,225,30,199,192,208,17,245,106,141,243,140,183,198]},"announce":[],"urlList":[]}}