{"title":"The All American Vegan Cookbook by Ivy Hunter","uid":11759948,"size":423905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14ecbdf5f25a7e31065ec1816dec4a7750fa7c29&amp;dn=The+All+American+Vegan+Cookbook+by+Ivy+Hunter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1426551504,"description":"Basic Vegan cooking for beginners using All-American favorites and all the stuff I cooked for my daughter for the past 14 years while she was growing up. These comfort foods are now without the ingredients I no longer choose to eat. \n\nThe detailed instructions allow for a flawless result as of yet. I've even included those variations between what we serve during the day, suggesting beverages are included with the times of day for serving them. \n\nA lot of detailed instruction goes in the chapters before the recipes, which teach you how to meal-prep, and the rest of your foundational kitchen skills. I want this to be an outline for my own daughter to use when going back to an old recipe or comfort food. You will also enjoy snack dinners, vegan nacho cheese, and over 100 recipes. \n\nEverything is healthier than what I was doing before going vegan, so this serves as a first-step cookbook as well. You will understand the foods, and enjoy the fermentation section that will teach you about probiotics, fermented foods, and more.\n\nGenre: Food and Cooking","torrent":{"xt":"urn:btih:14ecbdf5f25a7e31065ec1816dec4a7750fa7c29","amp;dn":"The+All+American+Vegan+Cookbook+by+Ivy+Hunter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14ecbdf5f25a7e31065ec1816dec4a7750fa7c29","infoHashBuffer":{"type":"Buffer","data":[20,236,189,245,242,90,126,49,6,94,193,129,109,236,74,119,80,250,124,41]},"announce":[],"urlList":[]}}