{"title":"Van Morrison Poetic Champions Compose","uid":4922711,"size":57935562,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15162afef164f26fca8103dc2c32755ef6f0785b&amp;dn=Van+Morrison+Poetic+Champions+Compose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"rogercc","files":11,"time":1243727822,"description":"Track Listings\n1. Spanish Steps  \n2. Mystery  \n3. Queen Of The Slipstream  \n4. I Forgot That Love Existed  \n5. Sometimes I Feel Like A Motherless Child  \n6. Celtic Excavation  \n7. Someone Like You  \n8. Alan Watts Blues  \n9. Give Me My Rapture  \n10. Did Ye Get Healed  \n11. Allow Me  \n\n\n\nAmazon.co.uk Review\nIf his albums are anything to go by, Van Morrison seems to bounce between religions like a demented pinball. Amazingly, for a decade that saw the Belfast enigma get through Christianity and Scientology before returning, on Avalon Sunset, to Christianity again, Poetic Champions Compose serves as a reminder that Van managed to even cram in an agnostic phase along the way. With this in mind, a desperately bleak version of folk standard &quot;Sometimes I Feel Like A Motherless Child&quot; somewhat lacerates the heartstrings. However, it shouldn't be assumed that this is by any means a depressing affair. Three saxophone instrumentals, including the Miles Davis influenced &quot;Spanish Steps&quot; lend a crisp Sunday morning feel to much of the proceedings, whilst &quot;Queen Of The Slipstream&quot; and live favourite &quot;Did Ye Get Healed&quot; suggest however bad the crisis of faith was--and the quite awesome preceding album No Guru No Method No Teacher suggests it was pretty bad--here is a man ultimately happy to find redemption in a love song. And who would blame him? --Peter Paphides \n\nCD Description\nWith as self-explanatory a title as this, it seems there's little need to elaborate. For what it's worth, this is Morrison at the height of his '80s spiritual phase, and he delvesdeeply and poignantly into the twin rivers of theology and mysticism. Ever the spiritual nomad, Morrison's worldview combines his Catholic upbringing with the Buddhism that was a key element of the Beat writers who were among his early inspirations. Thus, we have Morrison waxing reverential like some blues-driven preacher on the redemptive &quot;Did Ye Get Healed?&quot; and digging deeper into the mystic on &quot;Alan Watts Blues&quot;, whose title refers to the Buddhism-based British author/philosopher. Typical of his recordings from this period, Morrison shies away from his R&amp;B roots in favour of a kind of Celtic/New Age/Pop amalgam. And it's only a musical master as adept as Morrison that's capable of making such a confluence intriguing. \n","torrent":{"xt":"urn:btih:15162afef164f26fca8103dc2c32755ef6f0785b","amp;dn":"Van+Morrison+Poetic+Champions+Compose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15162afef164f26fca8103dc2c32755ef6f0785b","infoHashBuffer":{"type":"Buffer","data":[21,22,42,254,241,100,242,111,202,129,3,220,44,50,117,94,246,240,120,91]},"announce":[],"urlList":[]}}