{"title":"Chris Thile And Michael Dawes-Sleep With One Eye Open-2011-404","uid":6497616,"size":93643582,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15f354fb84d696cdec4547e8d8ddd117ba49b7a3&amp;dn=Chris+Thile+And+Michael+Dawes-Sleep+With+One+Eye+Open-2011-404&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"soupucia","files":-1,"time":1309129246,"description":"Artist: Chris Thile &amp; Michael Dawes\nAlbum: Sleep With One Eye Open\nBitrate: 247kbps avg\nQuality: EAC Secure Mode / LAME 3.98.4 / -V0 / 44.100Khz\nLabel: Nonesuch\nGenre: Bluegrass\nSize: 93.25 megs\nPlayTime: 0h 50min 11sec total\nRip Date: 2011-06-26\nStore Date: 2011-05-10\n\nTrack List:\n--------\n01. Rabbit In The Log                2:41\n02. Cry, Cry Darliung                3:04\n03. Loneliness And Desperation       2:26\n04. Tennessee Blues                  3:02\n05. 20/20 Vision                     3:15\n06. You're Running Wild              2:35\n07. Ookpik Waltz                     3:42\n08. My Little Girl In Tennessee      2:50\n09. Sleep With One Eye Open          3:18\n10. Rain And Snow                    3:33\n11. Mississippi Waltz                2:27\n12. Bury Me Beneath The Willow       3:46\n13. Roll In My Sweet Baby's Arms     3:11\n14. Billy In The Lowground           3:17\n15. It Takes One To Know One         3:17\n16. If I Should Wander Back Tonight  3:47\n\nRelease Notes:\n--------\nSleep with One Eye Open is an impassioned collaboration/conversation between\nmandolin virtuoso Chris Thile and guitarist Michael Daves, in which the subject\nis bluegrass, specifically how this upstart duo can acknowledge history and\ntradition while exuberantly defying convention. Though it was recorded in four\nfeverish days of sessions at Jack White's Third Man studio in Nashville, the\nalbum has deep roots in a serendipitous side of New York City that reveals\nitself at certain times of the night, when strangers become kindred spirits as\nclubs empty out, and only the hardiest souls stick around to keep the music\nplaying. It's a story that begins, like so many, with a guy walking into a bar.\n\nOn Sleep with One Eye Open, Thile and Daves acknowledge history and tradition\nwhile they exuberantly defy convention; they balance the tender with the\ndevil-may-care, emphasizing, as Thile puts it, &quot;the slightly delinquent side of\nbluegrass.&quot; Recording live to two-inch analog tape and singing into one vintage\nmicrophone, the duo cut 16 tracks at Third Man, claiming the honor of being the\nfirst artists White has allowed to record there on their own. (He also let them\nborrow his house engineer, Vance Powell.)\n\nSongs like &quot;Loneliness and Desperation&quot; and the title track emphasize\nrollicking, rapid-fire arrangements that often serve, in tried-and-true\nbluegrass fashion, to mask the most sorrowful of feelings. Daves and Thile's\nvoices blend as seamlessly and, on tracks like &quot;Bury Me Beneath the Willow,&quot; as\nplaintively-as their instruments. As Thile explains, &quot;Mandolin and guitar and\ntwo male voices - it's such a good sound. What was important for us was to get\nthat brother duet thing, but with this Lower East Side punk energy.&quot;\n\nThough the sessions themselves have an appealing air of spontaneity, Sleep with\nOne Eye Open was a project literally years in the making. As Thile explains,\n&quot;All the work for this record had already been done at the jam sessions and at\nthe shows we put on at the Rockwood Music Hall; we just had to take a snapshot\nof it. I think we found a way to maintain our wide-eyed wonder about this stuff\nand deliver it with the sincerity of people who need to play this music to feel\ngood.&quot; Fans will no longer have to scour Facebook or Myspace hoping for news of\nan impromptu, semi-secret gig from this pair: Thile and Daves are finally taking\ntheir show on the road this spring, starting in May with a three-night stand at\nRockwood.\n","torrent":{"xt":"urn:btih:15f354fb84d696cdec4547e8d8ddd117ba49b7a3","amp;dn":"Chris+Thile+And+Michael+Dawes-Sleep+With+One+Eye+Open-2011-404","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f354fb84d696cdec4547e8d8ddd117ba49b7a3","infoHashBuffer":{"type":"Buffer","data":[21,243,84,251,132,214,150,205,236,69,71,232,216,221,209,23,186,73,183,163]},"announce":[],"urlList":[]}}