{"title":"Nerf Gun","uid":8816465,"size":34663384,"categoryP":"other","categoryS":"physibles","magnet":"?xt=urn:btih:16b1cd5aea9f190ec807c0afe5a643b54bf0cce6&amp;dn=Nerf+Gun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mindcrasher","files":12,"time":1376597759,"description":"Instructions Print a copy of each part except for the piston rod. Only one rod is necessary, and should be chosen based upon the desired power of the blaster (high, mid) \n\nThe piston and piston rod should ideally be printed in ABS due to high impact loading, and the catch should be printed in PLA to improve friction and wear. The other parts can be made from either material, though ABS generally works better with support material. \n\nThe blaster shells, piston rod, piston head, and catch should all be at 100% density. The trigger and barrel can be printed with sparse infill and 2-3 loops. \n\nTotal print time is around 12 hours. \n\nMost of the printed pieces need some amount of support material. With good settings, it can be easily removed with a pointy pliers, razor blade (careful!) and some sand paper. \n\n\nNon-printed Components: \n\nMost of these parts come in multiples from mcmaster. One pack of each appears sufficient to make 6 blasters)\n\nQty, McMaster part number, description\n\n(1) 9657K434 \nPrimary Spring 3&quot; long, .660 OD, .062&quot; wire\n(9657K428 or 9657K432 can likely be substituted for a less powerful and more child friendly blaster, though this is currently untested) \n\n(1) 9657K51 \nCatch Spring 1.375 Long, .187 OD, .02&quot; wire\n\n(1) 9657K51 \nTrigger Spring (same as catch, cut to .75in long)\n\n(8) 90380A110 \n1/2in long #4-20 plastic screws \n\n(1) 9452K26 \n#114 Buna-N O-ring\n\n(1) 1378K31 \nPTFE Grease (or similar)\n\n(1) 48925K92\n3/4&quot; Sch 40 PVC 4in long\n\n\nAssemble as per the pictures, and try not to let the springs fly across the room during assembly. The o-ring and piston will need to be lubricated. \n\nDo NOT fire the blaster without the barrel fully installed. Without it, the piston rod can impact the rear of the blaster, causing mayhem. \n\nFoam darts will need to be acquired. Nearly every toy store has them, and usually under the brand name NERF. Velcro or suction cup darts are highly recommended. \n\nSAFETY NOTE: Do not fire darts at people's faces. This blaster can be substantially more powerful than the store bought NERF blasters.\n\nSECOND SAFETY NOTE: The LF1 has no mechanism preventing non-foam items from being propelled from the barrel at high speed. Therefore, it's not a good idea to give this to a 5 year old.\t\t","torrent":{"xt":"urn:btih:16b1cd5aea9f190ec807c0afe5a643b54bf0cce6","amp;dn":"Nerf+Gun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b1cd5aea9f190ec807c0afe5a643b54bf0cce6","infoHashBuffer":{"type":"Buffer","data":[22,177,205,90,234,159,25,14,200,7,192,175,229,166,67,181,75,240,204,230]},"announce":[],"urlList":[]}}