{"title":"Lessons From Fukushima - Japanese Case Studies on Science, Techn","uid":12690972,"size":4302441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1749e5ea3c0ba656fffbf25f7078d4b1883d32f3&amp;dn=Lessons+From+Fukushima+-+Japanese+Case+Studies+on+Science%2C+Techn&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1446671696,"description":"Lessons From Fukushima - Japanese Case Studies on Science, Technology and Society - Yuko Fujigaki (Springer, 2015).pdf\r\n\r\nISBN 978-3-319-15352-0\r\n\r\nThis book is about the consequences of the Fukushima disaster in light of their technological, societal, political, cultural and environmental origins. The magnitude of the nuclear accident is investigated in this book in the contexts of politics, economy, and society. The authors scrutinize the relationships between science, technology and society leading to this accident. Further, the authors reveal how these relationships were constructed historically.\r\n\r\nThis book provides a case analysis on the Fukushima disaster in political, societal, economic and cultural dimensions. In addition, analyses for historically grown relationships between different societal spheres mouthing into disasters are presented using examples of the Minamata disease (Mercury pollution), Itai-Itai Disease (Cadmium pollution), BSE, and GMOs.\r\n\r\nWith this book, Yuko Fujigaki achieves to connect local and cultural peculiarities with generalized scientific information and practices in a coherent, logical fashion to a comprehensive volume on a very actual topic of global significance. In light of a globally increasing energy gap, this book has a distinct global relevance, providing an honest account on different triggers mouthing into the nuclear disaster. This book not only gives a scientific account. It also can also contribute to prevent future disasters starting from similar vectors","torrent":{"xt":"urn:btih:1749e5ea3c0ba656fffbf25f7078d4b1883d32f3","amp;dn":"Lessons+From+Fukushima+-+Japanese+Case+Studies+on+Science%2C+Techn","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1749e5ea3c0ba656fffbf25f7078d4b1883d32f3","infoHashBuffer":{"type":"Buffer","data":[23,73,229,234,60,11,166,86,255,251,242,95,112,120,212,177,136,61,50,243]},"announce":[],"urlList":[]}}