{"title":"Ursula K. Le Guin - Malafrena (pdf)","uid":8078134,"size":7114359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:177866d2d1ebcebc9ac03d173be222d195f4c993&amp;dn=Ursula+K.+Le+Guin+-+Malafrena+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":3,"time":1359430529,"description":"Malafrena by Ursula K. Le Guin. Berkley, 1980. 343 pages.\n\nNew scan. Good quality clearscan pdf with bookmarked chapters, accurate pagination, etc.\n\nAs far as I know this novel has never appeared on the torrent sites or other ebook sources, and last time I checked it's out of print.\n\nPlease understand: this is is HISTORICAL FICTION. It's not science fiction or fantasy. I think the publisher doomed the book because they couldn't decide how to market it, so the cover looks like it might a sort of historical fantasy. It's not. But like everything by Le Guin, it's worth reading.\n\nPlanning also to scan Orsinian Tales (which has the same setting) in the near future.\n\n\npublisher description:\n\nFirst paperback publication of Le Guin's historical novel, set in the fictional country of her &quot;Orsinian Tales.&quot; &quot;Malafrena&quot; tells the story of Itale Sorde, the son of the owner of an estate on a lake called Malafrena in a valley of the same name. Itale leaves the estate, against his father's will, to seek adventure. He becomes engaged in nationalistic and revolutionary politics in the Austrian Empire of the early 1800's. Perhaps an homage to 19th century Russian literature, the story shares themes with the author's previous sf novel, &quot;The Dispossessed.&quot;","torrent":{"xt":"urn:btih:177866d2d1ebcebc9ac03d173be222d195f4c993","amp;dn":"Ursula+K.+Le+Guin+-+Malafrena+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"177866d2d1ebcebc9ac03d173be222d195f4c993","infoHashBuffer":{"type":"Buffer","data":[23,120,102,210,209,235,206,188,154,192,61,23,59,226,34,209,149,244,201,147]},"announce":[],"urlList":[]}}