{"title":"Justice League 1-7 (1987) (Complete) (DobisP.R.-Novus-HD) [NVS-D","uid":9131554,"size":297721772,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:17a789f87537254c609a2d1a9a164bd59fb57e91&amp;dn=Justice+League+1-7+%281987%29+%28Complete%29+%28DobisP.R.-Novus-HD%29+%5BNVS-D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackcanary","files":-1,"time":1383330564,"description":"English | CBZ | 6 Issues\n\nJustice League v1 #1-7\nPublisher:  DC Comics\nPublication Date:  May - October 1987\n\nWriters:  Keith Giffen and J.M. DeMatteis\nPencillers:  Keith Giffen and Kevin Maguire\nInkers:  Terry Austin and Al Gordon\nColorist:  Gene D'Angelo\nLetterer:  Bob Lappan\nCover:  Kevin Maguire, Terry Austin, and Al Gordon\n\nThe Justice League was floundering. With most of its fan-favorite characters on extended sabbaticals, and little more than minor heroes making up its roster, it was clear that the team needed a major overhaul. But no-one quite expected how drastic the transformation would truly be in the hands of writers Keith Giffen and J.M. DeMatteis and artist Kevin Maguire. Instead of embracing the grim and gritty tone set by Frank Miller's &quot;Batman: The Dark Knight Returns&quot; from the previous year and its countless imitators, Giffen and Dematteis decided to do a complete turnaround and crafted a super hero sit-com.\n\nWhile their collaboration resulted in a sophisticated series of well thought out fiction, the emphasis was placed on humor over drama, and characterization over violence. Nonetheless, amid the absurd situation and over-the-top super villains, the pair's humanity shone through brilliantly. With just the right touch of action, the resulting Justice League title was a smash success of a comic, a page turner of a different ilk, and DC's original team franchise was restored to its rightful place as king of the mountain.\n\nSpinning out of the events of &quot;Legends&quot; the Justice League reformed, dropping the &quot;of America&quot; part of its name at the insistence of manipulative new backer Maxwell Lord. Comprised of the Martian Manhunter, Black Canary, Captain Marvel, Batman, Green Lantern Guy Gardner, Dr. Fate, Mr. Miracle, Dr. Light, and Blue Beetle, and eventually media promoter Booster Gold, the Justice League battled the likes of the Royal Flush Gang, the Rocket Red Brigade, as well as each other, changing and shifting their roster, and later adding members Fire and Ice to their ranks. A wonderful example of intriguing storytelling outside of the realm of the norm. this new incarnation of the Justice League ran for 113 issue and spawned several spin-off titles in the process.\n\nThanks goes to DobisP.R. for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8956400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8956400&lt;/a&gt;","torrent":{"xt":"urn:btih:17a789f87537254c609a2d1a9a164bd59fb57e91","amp;dn":"Justice+League+1-7+%281987%29+%28Complete%29+%28DobisP.R.-Novus-HD%29+%5BNVS-D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17a789f87537254c609a2d1a9a164bd59fb57e91","infoHashBuffer":{"type":"Buffer","data":[23,167,137,248,117,55,37,76,96,154,45,26,154,22,75,213,159,181,126,145]},"announce":[],"urlList":[]}}