{"title":"Rocco.Ravishes.Czech.Republic.XXX.DVDRip.x264-RedSecTioN","uid":11355978,"size":2135989012,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:17be94845dc6555d9284a48601dbba29add8d5ad&amp;dn=Rocco.Ravishes.Czech.Republic.XXX.DVDRip.x264-RedSecTioN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":6,"uploader":"xxxlavalxxx","files":8,"time":1414941343,"description":"Category\tAll Sex, Anal, Foreign, Czech\n\nStarring\tRocco Siffredi, Sabrina, Nataly, Omar Galanti, Viki, Defrancesca Gallardo, Alexa Bold, Tina Gabriel, Nessa Devil, Lelloy, Evelina Marvellou\n\nWith only &quot;Crazy&quot; Omar Galanti as his wingman, a randy and exuberant Rocco goes on a fuck-happy working holiday in Rocco Ravages the Czech Republic. Rocco is received like the King of Smut that he is, and the local agents all bring out their best sluts for the Italian Stallion to ravage. Alexa Bold brings over blonde teenage spinner Sabrina, who accepts candy from Rocco in exchange for flashing &quot;your little, little titties,&quot; which of course leads to his first conquest, barely in the door of his rented apartment. When his horny exuberance ruffles the feathers of his MILFy landlady Evelina Marvellou, who claims to be a virgin, Rocco seduces her with his big dick and fucks the asses of all three women. Meanwhile, Omar's out on a boat ride to watch a photo shoot with Defrancesca Gallardo and Nataly, with strict orders not to paw either lass. Needless to say, he fails miserably, but manages to sodomize each of them quite successfully! Rocco goes strolling around the city with Viki, who comes back to the apartment for an ass-stuffing session with a quart of fresh strawberries; when Tina Gabriel shows up she's freaked by all the red stains on Rocco's t-shirt: &quot;Did you kill Viki???&quot; When she sniffs his dick, she realizes it's only fruit, and proceeds to get the - literally - banana treatment from Rocco, as well as some anal bead and ass-fucking action. Viki rejoins them, and tries to quell their jealousy: &quot;I am enough for both, no?&quot; As the menage a trois that follows proves... yes! Finally, a nighttime seduction in the backseat of a limo leads Rocco into a surreal sideways with the kinky - and possibly deranged -- Nessa Devil and Lelloy.\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=75325498617443512473.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=75325498617443512473.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=96133245298878716258.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=96133245298878716258.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=06827013729291010704.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=06827013729291010704.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:17be94845dc6555d9284a48601dbba29add8d5ad","amp;dn":"Rocco.Ravishes.Czech.Republic.XXX.DVDRip.x264-RedSecTioN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17be94845dc6555d9284a48601dbba29add8d5ad","infoHashBuffer":{"type":"Buffer","data":[23,190,148,132,93,198,85,93,146,132,164,134,1,219,186,41,173,216,213,173]},"announce":[],"urlList":[]}}