{"title":"The Other Missiles of October - Eisenhower, Kennedy, and the Jup","uid":10941728,"size":1778447,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17de7c1e6c050e8c831487206f1dcb711c1ed794&amp;dn=The+Other+Missiles+of+October+-+Eisenhower%2C+Kennedy%2C+and+the+Jup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tmcnl","files":-1,"time":1409540611,"description":"The Other Missiles of October: Eisenhower, Kennedy, and the Jupiters, 1957-1963\n\nby Philip Nash\n\n\nShedding important new light on the history of the Cold War, Philip Nash tells the story of what the United States gave up to help end the Cuban missile crisis of 1962. By drawing on documents only recently declassified, he shows that one of President Kennedy's compromises with the Soviets involved the removal of Jupiter missiles from Italy and Turkey, an arrangement concealed from both the American public and the rest of the NATO allies. Nash traces the entire history of the Jupiters and explores why the United States offered these nuclear missiles, which were capable of reaching targets in the Soviet Union, to its European allies after the launch of Sputnik. He argues that, despite their growing doubts, both Eisenhower and Kennedy proceeded with the deployment of the missiles because they felt that cancellation would seriously damage America's credibility with its allies and the Soviet Union. The Jupiters subsequently played a far more significant role in Khrushchev's 1962 decision to deploy his missiles in Cuba, in U.S. deliberations during the ensuing missile crisis, and in the resolution of events in Cuba than most existing histories have supposed.\n\n1997\nEPUB","torrent":{"xt":"urn:btih:17de7c1e6c050e8c831487206f1dcb711c1ed794","amp;dn":"The+Other+Missiles+of+October+-+Eisenhower%2C+Kennedy%2C+and+the+Jup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17de7c1e6c050e8c831487206f1dcb711c1ed794","infoHashBuffer":{"type":"Buffer","data":[23,222,124,30,108,5,14,140,131,20,135,32,111,29,203,113,28,30,215,148]},"announce":[],"urlList":[]}}