{"title":"Back.Home.with.the.Neelys.Comfort.Food.from.Our.Southern.Kitchen","uid":11445073,"size":15533642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17f7af14da35dc2466beac6e987883884907ec77&amp;dn=Back.Home.with.the.Neelys.Comfort.Food.from.Our.Southern.Kitchen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"wildturkey00","files":2,"time":1415842603,"description":"Format: EPUB\nGenre: COOKBOOK/tutorial\nPublished: 2014\n\nAS USUAL IF YOU ARE HAVING TROUBLE OPENING UP MY EBOOK FILES USE CALIBRE, IT IS FREE, AND OPENS ANY FORMAT... IF YOU CANT OPEN IT WITH CALBIRE, IT WILL CONVERT THE EBBOK TO WHATEVER FORMAT YOU WANT (example: EPUBtoPDF, PDFtoMOBI....ect)\n\nBook Description: For Pat and Gina Neely the secret to a truly happy home is a lively mix of food and family. In their new book, the best-selling authors draw on their down-home roots and revisit the classic Southern recipes that have been passed down through generations. We're drawn into the kitchens of their mothers and grandmothers and back to a time when produce was picked in the backyard garden and catfish was caught on afternoon fishing trips with Grandpa. In their signature style, Pat and Gina have taken the dishes they were raised on and updated them for today's kitchens.\nInside you'll find 100 recipes, including Small Batch Strawberry Jam (best when eaten with Easy Buttermilk and Cream Biscuits), Bourbon French Toast, Crunchy Fried Okra, Skillet Corn Bread, Grilled Succotash, Skillet Roasted Chicken, and Brunswick Stew (which combines a little of everything in your fridge).\n\nPat and Gina believe good food leads to good times and Back Home with the Neelys is sure to bring back fond memories of the tradition, history, and flavors that are present in every family","torrent":{"xt":"urn:btih:17f7af14da35dc2466beac6e987883884907ec77","amp;dn":"Back.Home.with.the.Neelys.Comfort.Food.from.Our.Southern.Kitchen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17f7af14da35dc2466beac6e987883884907ec77","infoHashBuffer":{"type":"Buffer","data":[23,247,175,20,218,53,220,36,102,190,172,110,152,120,131,136,73,7,236,119]},"announce":[],"urlList":[]}}