{"title":"7 The Hard Way 2 (Vince Voyeur) 2003 - Split Scenes","uid":14744366,"size":1928513536,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:185296356129c24732c5ef5190200508b8d74331&amp;dn=7+The+Hard+Way+2+%28Vince+Voyeur%29+2003+-+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"distinc","files":3,"time":1464710059,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=1346696602\r\n \nhttp://imagedisco.net/?g=9430053317\r\n\r\n\r\nPlot:\r\n\r\nBody of Review: 7 The Hardway #2 is the second in the well known gangbang series by Red Light District that tests both the skill and stamina of young, attractive gals and their male associates (7 each time, each getting to drop 3 loads of semen on their galpal per scene). Oral, vaginal, and lots of anal are on the menu here. If you're looking for circus act sex, with no condoms and few limits, you've definitely come to the right place. Here's a breakdown of the scenes by female cast:\r\n\r\nScene One: After seeing the ending of the video for Young Ripe Mellons #2, which starred herself, Alicia took on 7 guys in every way possible. Alicia is a curvy bleached blonde from England with a bit of her baby fat that gave her a nicely plump set of breasts to look at (and play with). She started off by getting them hard using her impressive oral skills and then the fun really began. After lots of anal and vaginal sex she gets more advanced and starts with the DP action (and gapes). To top that off, she took a double anal and this is, of course, no condom action, before she took a massive amount of semen to her lovely young face. I have to hand it to her ability to take it all with a smile and it seemed as though she enjoyed being their receptacle here.\r\n\r\nScene Two: Jackie, a lean and attractive gal with brown hair, pranced around a bit to tease the audience before her session with 7 guys. The action was similar to the first scene except her gaping ability was more pronounced (and she had a couple of nasty blemishes around her crotch). This scene had a double vaginal and some choking action rather than the DAP but she didn't seem to miss it. Not bad if you like gangbangs. Oh, and her ability to take a facial was just as solid as Alicia.\r\n\r\nScene Three: Angel, a blonde from England that has some of the longest legs to go with her nasty dirty talk, took on her set of guys this time. In terms of sheer enjoyment, I think Angel took the prize this time as she rode those guys like her life depended upon it. She took double anal and had some ass to mouth action before the facials and creampie stuff. Whew!\r\n\r\nSummary: If you're looking for the most hardcore dvd on the domestic market, you should at least consider this one. I'm suggesting it as a Highly Recommended for those of you who've become jaded to regular porn. At least when their make-up is fresh, these gals are attractive and they have no limits to interfere with your viewing pleasure but those who are happy with good looking gals having oral and vaginal sex only, with nothing more wanted, will want to avoid this one at all costs. Lots to like for raincoaters","torrent":{"xt":"urn:btih:185296356129c24732c5ef5190200508b8d74331","amp;dn":"7+The+Hard+Way+2+%28Vince+Voyeur%29+2003+-+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"185296356129c24732c5ef5190200508b8d74331","infoHashBuffer":{"type":"Buffer","data":[24,82,150,53,97,41,194,71,50,197,239,81,144,32,5,8,184,215,67,49]},"announce":[],"urlList":[]}}