{"title":"Altai by Wu Ming","uid":9723674,"size":450145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18ca2852f21dd05d84b14c69c547d6514f254b24&amp;dn=Altai+by+Wu+Ming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1394269399,"description":"\nAltai is a great historical thriller and the prose has all the surface glitter of the Grand Canal or the Golden Horn. For a city break in Venice, Dubrovnik or Istanbul, this is perfect read. --Edward Stourton, Financial Times\n\nAltai is a captivating story of betrayal, beliefs and the clash of civilizations. When a fire breaks out in the Arsenal of Venice in 1569, everyone suspects Joseph Nasi, number-one enemy of the republic. But it is the enigmatic Emmanuele De Zante, spy catcher and agent of the Venetian secret service, who finds himself in jail accused of treason, having been betrayed by his lover. \n\nWhen De Zante is offered the chance to escape, he embarks on an odyssey that takes him to Salonica, the Jerusalem of the Balkans, and from there, all the way to the Sultan's palace in Constantinople. Spiraling through a series of deadly political games, De Zante's voyage will test his loyalty and force him to question even his own identity. Together, De Zante and his companions head toward a conflict that threatens the very nature of civilization.\n\nA historical epic spanning a continent scarred by war, Altai went straight into the bestsellers list when first published in Italy. It is a coruscating portrait of the divided world - east meets west - in the sixteenth century, where the great empires of the Republic of Venice and the Ottomans are on the verge of an epoch-making conflict. In this dramatic landscape, the authors' collective Wu Ming has created a powerful narrative of danger, identity, and adventure.\n\nGenre: Fiction/Historical","torrent":{"xt":"urn:btih:18ca2852f21dd05d84b14c69c547d6514f254b24","amp;dn":"Altai+by+Wu+Ming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18ca2852f21dd05d84b14c69c547d6514f254b24","infoHashBuffer":{"type":"Buffer","data":[24,202,40,82,242,29,208,93,132,177,76,105,197,71,214,81,79,37,75,36]},"announce":[],"urlList":[]}}