{"title":"Kanji de Manga Series","uid":8152623,"size":86832556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18db7ffdda0697f3b7d987caa1002f7d6e6e4955&amp;dn=Kanji+de+Manga+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1361088095,"description":"KANJI DE MANGA The Comic Book That Teaches You How To Read And Write Japanese!\nby Glenn Kardy, Chihiro Hattori (Illustrator) \n\nContains the following titles:\n1. Kanji De Manga Volume 1\n   The comic book that teaches you how to read and write Japanese! This brand-new series from Manga University uses original comic artwork to teach readers how to identify and write the most common Japanese kanji ideographs. Volume 1 introduces 80 basic kanji that all Japanese schoolchildren are required to learn before entering the third grade. Subsequent volumes in the series will focus on more difficult kanji and kanji compounds. Each page features its own comic strip, kanji pronunciation guide, stroke order, and English explanations.\n\n2. Kanji de Manga Volume 2\n   The second volume in an exciting new series from Manga University - using original comic artwork to teach readers how to identify and write the most common Japanese kanji ideographs - introduces 80 kanji that all Japanese school children are required to learn by the time they graduate from sixth grade. Each page features its own comic strip, kanji pronunciation guide, stroke order, and English explanations.\n\n3. Kanji de Manga Volume 3\n   These books use original comic artwork to teach readers how to identify and write the most common Japanese kanji ideographs. Volume 2 introduces 80 kanji that Japanese students are required to learn by the time they graduate from sixth grade. Each page features its own comic strip, kanji pronunciation guide, stroke order, and English explanations.\n\n4. Kanji de Manga Volume 4\n   The popular Kanji de Manga series continues with an all-new selection of 80 kanji geared toward English-speaking manga fans who want to learn how to read, write and speak Japanese. Original manga characters help students identify the most common kanji characters used in everyday Japanese. Includes definitions, pronunciations and sample compounds, all in a fun, friendly and familiar format.\n\n5. Kanji de Manga Volume 5\n   The llustrated Kanji de Manga series continues with an all-new selection of 80 kanji geared toward intermediate learners of the language. Upon completion of this and the previous four volumes, students will have learned a total of 400 kanji, enough to prepare them for the advanced levels of the official Japanese Language Proficiency Test.\n\n6. Kanji de Manga Volume 6\n   The fun, easy way to learn Japanese! The sixth volume in the award-winning Kanji de Manga series offers students 80 more kanji characters to explore and memorize. Manga artist Chihiro Hattori's funny, familiar drawings make it a breeze to remember kanji that are among the most common in everyday Japanese.\n\n7. Kana de Manga\n   American pop culture is turning Japanese. Every day, millions of kids spend hours watching anime on Cartoon Network and reading telephone book-sized comics called manga. From &quot;Spirited Away&quot; to Shonen Jump, if the label says &quot;Made in Japan&quot; it's considered cool. \n\n But what if you want to enjoy anime and manga in its original language? Written Japanese consists of three scripts: the phonetic hiragana and katakana syllabaries, each comprised of 46 characters (collectively known as kana); and kanji, a complex set of characters based on Chinese ideographs. \n\nHiragana and katakana are the true &quot;ABCs of Japanese,&quot; as they can be used to write complete sentences. Children in Japan learn to read and write hiragana and katakana long before they are introduced to kanji. Most manga targeted toward the youngest readers in Japan are also written completely in kana. \n\n&quot;Kana de Manga&quot; makes learning kana easy and fun for students who already enjoy Japanese comics. Each page has a humorous manga illustration representing a word that begins with the hiragana or katakana character featured prominently at the top. A brief explanation accompanies each drawing; the English equivalent of the word is given; and there is a work area where students can practice writing the characters. \n\nIs the anime-and-manga boom just a fad? Perhaps. But if it inspires young people to want to learn about the Japanese language and culture, then it is a fad educators and students alike should embrace.\n ","torrent":{"xt":"urn:btih:18db7ffdda0697f3b7d987caa1002f7d6e6e4955","amp;dn":"Kanji+de+Manga+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18db7ffdda0697f3b7d987caa1002f7d6e6e4955","infoHashBuffer":{"type":"Buffer","data":[24,219,127,253,218,6,151,243,183,217,135,202,161,0,47,125,110,110,73,85]},"announce":[],"urlList":[]}}