{"title":"Teen Japan 4 (2009, DVD.xvid) - young Asian teenies, uncensored","uid":5113386,"size":1188892070,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:18e71692f2749c20fe1a969b1309b11a0b5388f9&amp;dn=Teen+Japan+4+%282009%2C+DVD.xvid%29+-+young+Asian+teenies%2C+uncensored&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"pure_screens","files":1,"time":1254933741,"description":"Teen Japan 4 \n\n\n\nscreens (+ DVD-covers): &lt;a href=&quot;\nhttp://www.cmylink.com/TeenJapan4screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/TeenJapan4screens&lt;/a&gt;\n\n\n\n\nA good word to describe Japanese teens today is &quot;Genki.&quot; Genki means happy and fun loving; a quality that J-chicks all seem to share. They are very cute and a bit shy as well, which makes their sexuality even more erotic and mysterious too!!!!!\n\nAya Seto is our Cover Girl and one very sweet little love machine. She strips out of her school dress for a photo shoot, before getting fully molested by our local stud on the scene. He sticks his tongue down her throat and gropes her smaller, yet fully formed and lusciously lovely little breasts, as she moans and begs for even more. She sucks up a good helping of cock with her mouth, before a tiny blue vibrator makes its way to her already seeping wet and soggy slice. A little 69 readies her hole for a cock ramming, which she handles very well, with her loose school socks on the entire time. Her soft titties jiggle as she screams more and more, finally stifled with a respectable sized load in her young and very hungry mouth.\n\nRui Aikawa is young and a little dumb looking, but very cute overall. It takes very little effort to talk this girl into showing off her J-vag for our camera. Her legs are long, her skin is white and her pink nipples and well defined, wet asian flower are filled with slippery J-sap. Her pink to orange-ish colored hole squirts on our camera lens, as she gets off over and over again with a huge J-vibe stimulating her. She teases cock with her tongue and manages to get some far down her throat as well, but seems to prefer things better on her back while getting long-shafted in a variety of positions. She cums over and over again, screaming and shouting her way to a large deposit on her left tit.   \n\nAya Fujii is a cute little doll who has the pleasure of meeting veteren J-man- Chocoball Mukai. He warms her up well, enjoying her youth and freshness as he goes.   Her large breasts are very tight and firm and her young J-cunt still smells of fresh albacore. He licks her juicy sea-creature and works up plenty of squirt deep inside, flushing it out of her to water her thick pubic pasture. She works his cock over well with her mouth, before bending over for a doggie style pounding followed by a thorough hard fucking, that sets her boobs spinning in circles and Chocoball finally offloading a thick one across her mouth and chin.\n\nAiri Nakajima is wearing a sexy long dress with no bra on, as her highly stimulated nipples pop out at our camera and say &quot;Konichiwa&quot; (Hello) to us all. She giggles and laughs as she talks about her sex life. She requests two guys to fill her fantasies. They each pull and tug on her already well stretched J-flaps. Her thick lips open like a pink clam shell that instantly fills with ample quantities of J-juice. She loves to get her asshole fondled and fingers deep inside her pussy, as the boys start to work her over well. Her pointy nipple tips stand on end as 2 cocks enter her mouth and one makes its move over to penetrate her pretty fuck hole as well. Her lips flex and her clit swells, as her screams are only stifled with another dong in her mouth. They switch things up and toss her around for a while, before she swallows one load in her mouth and another gets planted on her dark pubic patch, all around her mashed up flower lips and J-ass as well.\n\n\nStarring:\nAiri Nakajima, Aya Fujii, Aya Seto, Rui Aikawa\n\nCategory:        JAV, Asian, Teen, Hairy pussy, 1on1, Toys, Threesome\nStudio:          Third World Media / Asian Eyes\nReleased:        09/2009\nFormat:          Xvid\nLanguage:        Japanese\nRated:           XXX, uncensored\n\n\n640 x 480\navi\n02:19:08\n\n\n\n3,800+ porn torrents: &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n(ALWAYS with honest screens &amp; detailed info)\n\n\n","torrent":{"xt":"urn:btih:18e71692f2749c20fe1a969b1309b11a0b5388f9","amp;dn":"Teen+Japan+4+%282009%2C+DVD.xvid%29+-+young+Asian+teenies%2C+uncensored","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18e71692f2749c20fe1a969b1309b11a0b5388f9","infoHashBuffer":{"type":"Buffer","data":[24,231,22,146,242,116,156,32,254,26,150,155,19,9,177,26,11,83,136,249]},"announce":[],"urlList":[]}}