{"title":"Stress, Health and Well-Being: Thriving in the 21st Century","uid":8005663,"size":40699176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:199b8d59b122bd61bc031cdf75124c36b38ec537&amp;dn=Stress%2C+Health+and+Well-Being%3A+Thriving+in+the+21st+Century+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Jenson100","files":-1,"time":1357877859,"description":"\nOverview -\nStress, Health and Well-Being\nProduct Details\n\n    Pub. Date: January 2012\n    Publisher: Cengage Learning\n    Sales Rank: 498,600\n\n    ISBN-13: 9781111831615\n    ISBN: 1111831610\n    Edition Description: New Edition\n\nSynopsis\n\nDiscover the science that underlies one of the most pervasive forces in modern life with STRESS, HEALTH, AND WELL-BEING: THRIVING IN THE 21st CENTURY. With research findings and coping strategies integrated throughout, this text is a useful tool for helping you understand and approach stress effectively.\nBiography\n\nDr. Rick Harrington has been a faculty member at the University of Houston, Victoria (UHV), since 1987. His specialty areas include health psychology/behavioral medicine and social psychology. He obtained his doctorate in social psychology and psychophysiology from the University of Texas at Arlington and completed a post-doctoral fellowship in behavioral medicine/social psychology at the University of Houston. Dr. Harrington is a licensed psychologist who received his licensing supervision at Houston's Methodist Hospital's Institute for Preventive Medicine. He practiced psychology in Houston at the Methodist Hospital, in private practice, and also worked as a Research Associate for the Baylor College of Medicine. Dr. Harrington has been teaching at the college level for over 25 years and is a past recipient of UHV's Teaching Excellence Award. He has also been honored by &quot;Who's Who Among America's Teachers&quot; (1996, 2007) as one of the &quot;best teachers in America selected by the best students.&quot; Dr. Harrington initiated the UHV Psi Chi chapter and is a former president of the Victoria Area Psychological Association. His research endeavors have included work in biofeedback, smoking cessation, personality, and life satisfaction.\n","torrent":{"xt":"urn:btih:199b8d59b122bd61bc031cdf75124c36b38ec537","amp;dn":"Stress%2C+Health+and+Well-Being%3A+Thriving+in+the+21st+Century+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"199b8d59b122bd61bc031cdf75124c36b38ec537","infoHashBuffer":{"type":"Buffer","data":[25,155,141,89,177,34,189,97,188,3,28,223,117,18,76,54,179,142,197,55]},"announce":[],"urlList":[]}}