{"title":"Leisure Suit Larry GOG","uid":8040506,"size":570477348,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:19b64389be9b8cc6a70cbd1443b86ad004fd16ba&amp;dn=Leisure+Suit+Larry+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1358618482,"description":"What's cool about it:\n\nIncludes Leisure Suit Larry 1-6, the VGA remake of Leisure Suit Larry 1, and Softporn Adventure. The (in)famous missing floppies containing Leisure Suit Larry 4 are still missing. No, we are not hiding them, either.\nPlay as one of gaming longest lasting legends: Leisure Suit Larry!\nAl Lowe famously risque humor and bodacious babes that are waiting to work out with you!\n\nOverview:\n\nWhat your sign, baby? -Leisure Suit Larry\nWrong Way. -any woman.\n\nLeisure Suit Larry has done it longer, deeper, and stronger. He been around the block , so to speak. It quite an accomplishment for a man wearing a suit that been out of style long before it was manufactured. He seen it all, from sleazy nightclubs and seedy bars with alleys that should be avoided at all times. He even gone native for a bit and grabbed a piece of the island life. His life has been full of tight spots and pulsating pectorals. His lizard always lounging and looking for love in several wrong places, the more the merrier! Always willing and able to perform some undercover work, our man Larry is a swingin single guy out for some action! His lines are as groovy as a record and his strut is something to be seen!\n\nLeisure Suit Larry Greatest Hits and Misses features the loveable loser Larry Laffer in five complete adventures with throbbing suspense, pulchritudinous point-and-click action, and some parsing on the side! Hubba hubba! Help Larry score as you hit the town of Lost Wages, Nevada which looks like a huge neon dinosaur making it with 6,000 acres of electrified sequins , the scintillating sandy shores of Nontoonyt Island, and go to Los Angeles and paint the town red. Celebrate Larry finest years and remember, big things come in small packages!\n\nMinimum system requirements: Windows XP / Vista / 7 / 8, 1 GHz Processor (1.4 GHz recommended), 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), Mouse, Keyboard.\n\nInstall, play.","torrent":{"xt":"urn:btih:19b64389be9b8cc6a70cbd1443b86ad004fd16ba","amp;dn":"Leisure+Suit+Larry+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19b64389be9b8cc6a70cbd1443b86ad004fd16ba","infoHashBuffer":{"type":"Buffer","data":[25,182,67,137,190,155,140,198,167,12,189,20,67,184,106,208,4,253,22,186]},"announce":[],"urlList":[]}}