{"title":"Bob Hope Collection - Nothing but the Truth (1941) Xvid 1cd - Pa","uid":9963298,"size":1125414912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19d921992bb17f8ed8d202d453e354b5f985ceac&amp;dn=Bob+Hope+Collection+-+Nothing+but+the+Truth+%281941%29+Xvid+1cd+-+Pa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SaM","files":-1,"time":1397542371,"description":"Bob Hope Collection - Nothing but the Truth (1941) Xvid 1cd - Paulette Goddard [DDR]\n\nNothing But the Truth (1941) is a comedy film starring Bob Hope and Paulette Goddard, their third movie together in three years. The movie was directed by Elliott Nugent.\nThe premise of the film, that the protagonist must tell the truth for the next 24 hours, is a remake of the 1929 film of the same name starring Richard Dix and Wynne Gibson.\nTwenty years later, this similar plot was used in The Twilight Zone's episode The Whole Truth and later still in Liar Liar (1993 film starring Jim Carrey).\nThe film lay unseen for years after its 1941 release due to legal tangles, but was finally made available again through the auspices of film historian Leonard Maltin in the early 1980s\n\n    CAST:-\n    Bob Hope as Steve Bennett\n    Paulette Goddard as Gwen Saunders\n    Edward Arnold as T.R. Ralston\n    Leif Erickson as Van\n    Helen Vinson as Linda Grahm\n    Willie Best as Samuel\n    Glenn Anders as Dick Donnelly\n    Grant Mitchell as Mr. Bishop\n    Catherine Doucet as Mrs. Van Dusen\n    Rose Hobart as Mrs. Donnelly\n    Clarence Kolb as Mr. Van Dusen\n    Mary Forbes as Mrs. Ralston\n    Leon Belasco as Dr. Zarak\n    Helene Millard as Miss Turner\n\nDirected by Elliott Nugent\nProduced by Arthur Hornblow, Jr.\nWritten by Ken Englund\nRunning time 90 minutes\n\nSYNOSIS:- Nothing But the Truth (1941)\nSteve Bennett (Bob Hope) is a stockbroker in Miami, fresh out of school, working for a man named T.R. Ralston (Edward Arnold). He is persuaded by Ralston to invest a sum of $10,000 for Ralston's beautiful niece Gwen Saunders (Paulette Goddard). Ralston has promised his niece that the money will be doubled in a short period of time.\n\nIt turns out Steve's honesty gets in the way of business, when his boss Ralston makes him sell wothless stocks, and he cannot keep his mouth shut to the clients, revealing the fact that the investment is a dead end.\n\nRalston and his partners Tom van Dusen and Dick Donnelly bet with that Steve that he can't be completely honest for twenty-four hours straight. Steve bets the $10,000 he got from Gwen. One of the conditions is that no one can reveal the bet to an outsider and it can't be cancelled.\n\nSteve is meticulously watched by the three men during the next twenty-four hours. They are entertaining guests and clients on Ralston's yacht during most of this time, and when Steve is honest with everyone he meets, he manages to insult most of them. In the late evening, an exotic dancer named Linda Graham enters the yacht, looking for Dick. He has pledged Steve's money to her show. Linda meets and talks to Steve, telling him about the show. Mrs. ralston and another distinguished woman overhears the conversation and mistakenly believes Linda is Steve's wife.\n\nDuring the night, the partners steal Steve's clothes to prevent him from leaving the ship, but he borrows a dress from Linda. In disguise, Steve sneaks into Gwen's room at her invitation. He tells her that he isn't married to Linda and that he is in love with her.\n\nThe next day Steve gets heat from every direction. Gwen finds out that he has been in Linda's room during the night, the ladies sees him as indecent, and Tom because he is in love with Gwen and jealous. On top of this Linda is telling everyone that she is indeed married to Steve and that they have a child together, being in cahoots with Dick to make things harder for Steve.\n\nClose to when the twenty-four hours are up, a man named Mr. Bishop enters the ship. He is the head of the charity organization which Gwen intended to give the $10,000 to. Mr. Bishop asks to see the money, and Gwen who has learned about the bet, tries to keep the man occupied, buying some extra time to help Steve win the bet.\n\nThe clocks on the boat have been put forward by the partners, and when they strike four Steve is able to lie to Mr. Bishop about the money. The partners celebrate since they have won the bet, but it turns out someone wound the clocks back again while they weren't watching. Thus, Steve wins the bet, and has managed to double Gwen's money after all. He tells everyone on the yacht that he had made a bet that he would lie for the past twenty-four hours, and his honor is restored. Gwen takes a liking to him and awards him a kiss.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nAudio Languages: English\nRunTime 90 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 90 mins","torrent":{"xt":"urn:btih:19d921992bb17f8ed8d202d453e354b5f985ceac","amp;dn":"Bob+Hope+Collection+-+Nothing+but+the+Truth+%281941%29+Xvid+1cd+-+Pa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19d921992bb17f8ed8d202d453e354b5f985ceac","infoHashBuffer":{"type":"Buffer","data":[25,217,33,153,43,177,127,142,216,210,2,212,83,227,84,181,249,133,206,172]},"announce":[],"urlList":[]}}