{"title":"BBC Documentary - Are We Alone in the Universe?","uid":4591177,"size":669573950,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:19f40ef81949247a44d5bb99f4d1de2e7fa5c073&amp;dn=BBC+Documentary+-+Are+We+Alone+in+the+Universe%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"FreedomLover","files":1,"time":1229837463,"description":"BBC Horizon: Are We Alone in the Universe?\n\nThis program explores the possibility of life on other planets. What is the answer? Well, of course, we're not alone! The laughable Christian idea of Adam and Eve and a creator god who made us in his image is and - for that matter never has been - tenable in view of the vastness of the universe. There are billions of stars out there with billions of planets. Who are we but a speck of dust!\n\nJust imagine when we do find intelligent life on other planets maybe hundreds of years from now in the future: will we preach the gospel to the aliens? Will we tell them about the rantings of that ignorant Arab nomad who preached the Kingdom of God thousands of years ago? Will we translate the bible for them and set up missionary schools? I think not! It's time that mankind grew up and abandoned all childish ideas about some god creating the universe!\n\nAlso check out my other torrents: A War on Science by Richard Dawkins, The God Delusion by Richard Dawkins, Debunking Christianity by Derren Brown, and the highly entertaining short videos by British comedian Pat Condell.\n\nAnyhow, what we little human beings think may soon be irrelevant anyway since we're in the process of destroying our own planet (watch: 'An Inconvenient Truth by Al Gore').\nOr if pollution doesn't destroy the planet surely the USA's endless wars of aggression will finally wipe out humanity or throw it back to the Stone Age. Some, of course, argue that Bush and his cronies are already there! (watch: 'Breaking the Silence by John Pilger' and 'Fighting the Taleban by Sean Langan').\n\nAlso watch the film 'Contact' (based on famous astronomer Carl Sagan's novel) starring Jodie Foster, which explores the SETI program from Hollywood's perspective.\n","torrent":{"xt":"urn:btih:19f40ef81949247a44d5bb99f4d1de2e7fa5c073","amp;dn":"BBC+Documentary+-+Are+We+Alone+in+the+Universe%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19f40ef81949247a44d5bb99f4d1de2e7fa5c073","infoHashBuffer":{"type":"Buffer","data":[25,244,14,248,25,73,36,122,68,213,187,153,244,209,222,46,127,165,192,115]},"announce":[],"urlList":[]}}