{"title":"Beyond Sol v1.0.5","uid":12799516,"size":474538400,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:19f545cbc48226152faf7d2f3c7895b8e5ba4434&amp;dn=Beyond+Sol+v1.0.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dauphong","files":1,"time":1448029719,"description":"About This Game\r\nBeyond Sol is a unique blend of action space combat and grand strategy empire building in a procedurally generated open world. Collect resources, build your city, upgrade your ships and weapons, and cultivate relationships or wage wars with rival cities in your quest to dominate the solar system. Play by yourself or invite your friends to your world and play cooperatively or competitively.\r\nKey Features\r\n\r\n    Build a grand orbital city and establish outposts to expand your territory and claim precious resources.\r\n    Assemble and customize your fleet of warships and lead it in epic space battles.\r\n    Trade and forge relationships with other cities or wage war and take their territory.\r\n    Pilot your personal command cruiser and customize it with a suite of weapons and equipment.\r\n    Unlock and upgrade new ships, weapons, and equipment for your ships and defensive structures.\r\n    Dynamic and procedurally generated – AI opponents, world layout, and random events are different each time.\r\n    Persistent player profile – carry your ship progression across both singleplayer and multiplayer games.\r\n    Singleplayer or multiplayer – generate a world, play by yourself, or let your friends join at any time to play with or against you","torrent":{"xt":"urn:btih:19f545cbc48226152faf7d2f3c7895b8e5ba4434","amp;dn":"Beyond+Sol+v1.0.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19f545cbc48226152faf7d2f3c7895b8e5ba4434","infoHashBuffer":{"type":"Buffer","data":[25,245,69,203,196,130,38,21,47,175,125,47,60,120,149,184,229,186,68,52]},"announce":[],"urlList":[]}}