{"title":"By All Means Necessary - How China's Resource Quest Is Changing ","uid":9540169,"size":7059623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a1e72f03347c02ac6ab26eb04c9b1654926f7d6&amp;dn=By+All+Means+Necessary+-+How+China%27s+Resource+Quest+Is+Changing+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391024780,"description":"By All Means Necessary: How China's Resource Quest is Changing the World by Elizabeth C. Economy and Michael Levi\n\n\nFormat: mobi/epub/azw3\nLength: 289 pages\nGenre: Non-Fiction/China\nDate: 7 January 2014\n\nClear, authoritative, and provocative, By All Means Necessary is a sweeping account of where China's pursuit of raw materials may take the country in the coming years and what the consequences will be--not just for China, but for the whole world. \n\nIn By All Means Necessary, Elizabeth C. Economy and Michael Levi explore the unrivaled expansion of the Chinese economy and the global effects of its meteoric growth. China is now engaged in a far-flung quest, hunting around the world for fuel, ores, water, and land for farming, and deploying whatever it needs in the economic, political, and military spheres to secure the resources it requires. Chinese traders and investors buy commodities, with consequences for economies, people, and the environment around the world. \n\nMeanwhile the Chinese military aspires to secure sea lanes, and Chinese diplomats struggle to protect the country's interests abroad. And just as surely as China's pursuit of natural resources is changing the world--restructuring markets, pushing up commodity prices, transforming resource-rich economies through investment and trade--it is also changing China itself. As Chinese corporations increasingly venture abroad, they must navigate various political regimes, participate in international markets, and adopt foreign standards and practices, which can lead to wide-reaching social and political ramifications at home. \n\nAuthor:\n\nElizabeth C. Economy is the C.V. Starr Senior Fellow and Director of Asia Studies at the Council on Foreign Relations. An expert on Chinese domestic and foreign policy, her most recent book was The River Runs Black: The Environmental Challenge to China's Future. Michael Levi is the David M. Rubenstein Senior Fellow and Director of the Program on Energy Security and Climate Change at Council on Foreign Relations. An expert on the global politics and economics of energy, resources, and the environment, his most recent book was The Power Surge: Energy, Opportunity, and the Battle for America's Future.","torrent":{"xt":"urn:btih:1a1e72f03347c02ac6ab26eb04c9b1654926f7d6","amp;dn":"By+All+Means+Necessary+-+How+China%27s+Resource+Quest+Is+Changing+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1e72f03347c02ac6ab26eb04c9b1654926f7d6","infoHashBuffer":{"type":"Buffer","data":[26,30,114,240,51,71,192,42,198,171,38,235,4,201,177,101,73,38,247,214]},"announce":[],"urlList":[]}}