{"title":"Heat Transfer Handbook - Adrian Bejan","uid":12003155,"size":22080647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a55d48c80226e5ed946ddce5ec870ab6fc0c25c&amp;dn=Heat+Transfer+Handbook+-+Adrian+Bejan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1433819636,"description":"ISBN: 0471390151\n\nThe most thorough and up-to-date coverage of heat transfer concepts and applications\n\nThe Heat Transfer Handbook provides succinct hard data, formulas, and specifications for the critical aspects of heat transfer, offering a reliable, hands-on resource for solving day-to-day issues across a variety of applications.\n\nFrom the basics to the state of the art, this authoritative reference is the complete single-source handbook of need-to-know information in the industry. With today's professionals in mind, thirty world-renowned experts contribute cutting-edge concepts and applications, as well as insights into the current state of the field and the latest technologies. Standout features of the handbook include the most comprehensive coverage available on contact resistance, and well-conceived, timely material on heat transfer in electronic components.\n\nThe book includes access to a website containing the NIST Thermodynamic and Transport Properties of Pure Fluids Database: Version 5.1, which provides computer formulations with the most up-to-date values for thermophysical properties of fluids and materials.\n\nFor busy engineers and researchers, the Heat Transfer Handbook is the fast and accurate solution to their everyday needs","torrent":{"xt":"urn:btih:1a55d48c80226e5ed946ddce5ec870ab6fc0c25c","amp;dn":"Heat+Transfer+Handbook+-+Adrian+Bejan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a55d48c80226e5ed946ddce5ec870ab6fc0c25c","infoHashBuffer":{"type":"Buffer","data":[26,85,212,140,128,34,110,94,217,70,221,206,94,200,112,171,111,192,194,92]},"announce":[],"urlList":[]}}