{"title":"The Incredibles - SPANISH Only - Los Increibles  en Espanol","uid":4286775,"size":903295266,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a721be585d8585929a7f88c91e5719541371b54&amp;dn=The+Incredibles+-+SPANISH+Only+-+Los+Increibles++en+Espanol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"TheLabMan","files":1,"time":1215744828,"description":"Mr. Incredible (A.K.A. Bob Parr), and his wife Helen (A.K.A. Elastigirl), are the world&amp;#039;s greatest famous crime-fighting superheroes in Metroville. Always saving lives and battling evil on a daily basis. But fifteen years later, they have been forced to adopt civilian identities and retreat to the suburbs where they have no choice but to retire of being a superhero and force to live a &quot;normal life&quot; with their three children Violet, Dash and Jack-Jack (who were secretly born with superpowers). Itching to get back into action, Bob gets his chance when a mysterious communication summons him to a remote island for a top secret assignment. He soon discovers that it will take a super family effort to rescue the world from total destruction.  Written by Anthony Pereyra {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;274f5e5742555448494e441e16675e464f48480944484a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nMr. Incredible is a superhero; or he used to be, until a surge of lawsuits against superheroes submitted by the people they&amp;#039;ve saved forced the government to hide them in witness protection programs so they could lead normal, anonymous lives. Now known exclusively by his secret identity, Bob Parr, he lives with his wife Helen, formerly Elastigirl, and their three children Violet, Dash, and Jack Jack. He works as an insurance claims specialist, and he&amp;#039;s fed up with his pushy boss and his immoral profession, but his wife&amp;#039;s worked too hard to build a normal life for her family to abide his nostalgia for heroism. When Mr. Incredible&amp;#039;s offered the chance to play the role of hero again by a mysterious informant, he jumps at the opportunity, but when it turns out to be a trap set by an old nemesis he had a hand in corrupting, the whole family must reveal themselves to save Mr. Incredible and countless innocents. Written by Michael Loughrin\n\nFifteen years ago, superheroes walked the streets of Metroville, performing acts of great heroism and inspiring many to follow their example. But a string of lawsuits by disgruntled people they&amp;#039;d helped lead to political and public outcry, and the Supers were forced into retirement and government-funded anonymity. Bob Parr used to be Mr. Incredible, one of the greatest and strongest Supers; now, he lives a mundane life as a suburban insurance agent. Although his wife Helen (formerly Elastigirl) has moved on and is more concerned with raising their children Dashiell (who is super-fast and super-confident), Violet (who can turn invisible - and is super-shy) and baby Jack-Jack than battling evil, Bob still yearns for the good old days - and his chance comes when he is approached by a shadowy government organization and asked to join their numbers. But all is not as it seems, and Bob will find himself trapped by Syndrome, an embittered enemy who in his youth once idolized Mr. Incredible - and only his family will be able to save him now... Written by Scott Nisbet\n\nMetroville was once flooded with superheroes saving the day. One of the greatest was Mr. Incredible, who found himself annoyed by the young chatterbox fanatic of his, Buddy Pine, who referred to himself as &amp;#039;Incrediboy.&amp;#039; As Mr. Incredible fought crime, he met another legendary hero, Elastigirl and the two superheroes wed. shortly afterward, a string of lawsuits banned superheroes from ever saving the day again! 15 years later, Mr. Incredible, now known as Bob Parr is itching to become a superhero again. Mrs. Incredible, or Helen Parr, is trying to persuade him not to. Their son, Dash, who has the ability to run extremely quickly, wants to try out for sports, but he can&amp;#039;t because of his powers being revealed. Violet, the Parr&amp;#039;s daughter, wants to be normal and fit in as a teen. And the baby, Jack-Jack is only itching for a good time. Then, Bob hears about a top secret assignment regarding a powerful machine attacking Nomanisan Island. Thinking this is his way to become a superhero again, Bob accepts and yet again becomes Mr. Incredible...however, this anonymous villain has a grudge... Written by theoneandonlyultiman ","torrent":{"xt":"urn:btih:1a721be585d8585929a7f88c91e5719541371b54","amp;dn":"The+Incredibles+-+SPANISH+Only+-+Los+Increibles++en+Espanol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a721be585d8585929a7f88c91e5719541371b54","infoHashBuffer":{"type":"Buffer","data":[26,114,27,229,133,216,88,89,41,167,248,140,145,229,113,149,65,55,27,84]},"announce":[],"urlList":[]}}