{"title":"Drzewiecki Design EETN Tallinn V1.3","uid":11103549,"size":463524180,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1ab4f2e01e0aa457fbe35c7c809be435177a35ea&amp;dn=Drzewiecki+Design+EETN+Tallinn+V1.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"romanasul","files":1,"time":1411697386,"description":"This is Tallinn airport in Estonia by Drzewiecki Design. It's a really nice detailed airport with many animations. I hope you guys enjoy this. \nInstallation is very simple just double click the installer and install.\nHere is a brief description:\n\nEETN Tallinn X is a highly detailed scenery of EETN Lennart Meri Tallinn Airport in Tallinn, Estonia. The product also includes the city of Tallinn with its landmarks. EETN Tallinn 2014 is a payware scenery however there is a fully functional demo scenery provided that you can use for any online and multiplayer flying.\n \nEstonia is a country in the Baltic region of Northern Europe. It is bordered to the north by the Gulf of Finland, to the west by the Baltic Sea, to the south by Latvia, and to the east by Lake Peipus and Russia. Across the Baltic Sea lies Sweden in the west and Finland in the north. The territory of Estonia covers 45.227 km2 (17.462 sq mi), and is influenced by a humid continental climate.\n \nTallinn is the capital and largest city of Estonia. It occupies an area of 159,2 km2 (61,5 sq mi) and has a population of over 431.000. It is situated on the northern coast of the country, on the shore of the Gulf of Finland, 80 km (50 mi) south of Helsinki, east of Stockholm and west of Saint Petersburg. Tallinn's Old Town is listed as a UNESCO World Heritage Sites. It is ranked as a global city and has been listed among the top 10 digital cities in the world. The city was a European Capital of Culture for 2011, along with Turku in Finland. 32.7% of Estonia's total population lives in Tallinn.\n","torrent":{"xt":"urn:btih:1ab4f2e01e0aa457fbe35c7c809be435177a35ea","amp;dn":"Drzewiecki+Design+EETN+Tallinn+V1.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ab4f2e01e0aa457fbe35c7c809be435177a35ea","infoHashBuffer":{"type":"Buffer","data":[26,180,242,224,30,10,164,87,251,227,92,124,128,155,228,53,23,122,53,234]},"announce":[],"urlList":[]}}