{"title":"Jools Holland's Rythm and Blues Orchestra Sex and Jazz and Rock","uid":5980225,"size":340261981,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ac5f1d4cc19ce915e623888e20a186e6821c016&amp;dn=Jools+Holland%5C%27s+Rythm+and+Blues+Orchestra+Sex+and+Jazz+and+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"rogercc1","files":20,"time":1290563806,"description":"JOOLS HOLLANDS RHYTHM AND BLUES ORCHESTRA\nSEX &amp; JAZZ &amp; ROCK &amp; ROLL\nReleased:1996\nLabel: Warner ESP\nFormat:Flac\n\n\n\nJools Holland was a founding member of thepop band, Squeeze, formed in March 1974. Holland played keyboards with Squeeze till 1981, after which he pursued a solo career. His first studio session was with Wayne County &amp; the Electric Chairs in 1976.\nHolland began issuing solo records in 1978, his first EP being Boogie Woogie '78. He continued his solo career through the early 1980s, releasing an album and several singles between 1981 and 1984. He branched out into TV, co-presenting the Newcastle-based TV music show The Tube with Paula Yates. Holland achieved notoriety by inadvertently using the phrase &quot;groovy fuckers&quot; in a live, early evening TV trailer for the show, causing it to be suspended for three weeks. He referred to this in his sitcom &quot;The Groovy Fellers&quot; with Rowland Rivron.\nIn 1983 Holland played an extended piano solo on The The's re-recording of &quot;Uncertain Smile&quot; for the album Soul Mining. In 1985, Squeeze (which had continued in Holland's absence through to 1982) unexpectedly regrouped. Holland was again the keyboard player for the band until 1990. At that point, he again departed Squeeze on amicable terms to resume his solo career as a musician and a TV host.\nIn 1987, Holland formed The Jools Holland Big Band which consisted of himself and Gilson Lavis from Squeeze. This gradually became his 18-piece Rhythm &amp; Blues Orchestra.\nBetween 1988 and 1990 he performed and co-hosted along with David Sanborn during the two seasons of the music performance program Sunday Night on NBC late-night television. Since 1992 he has presented the eclectic music program Later... with Jools Holland, plus an annual New Year's Eve &quot;Hootenanny&quot;.\nIn 1996 Holland signed a record deal with Warner Bros. Records and his records are now marketed through Rhino Records.\nHolland has a touring band, The Rhythm And Blues Orchestra, which often includes singers Sam Brown and Ruby Turner. In January 2005 Holland and his band performed with Eric Clapton as the headline act of the Tsunami Relief Cardif\n\n\n\nTracklist\n01 - Jubals Discovery - 0:16\n02 - Hamsters Wheel - 2:49\n03 - Waiting Game - 4:12\n04 - Able Mabel - 3:34\n05 - uj - 0:50\n06 - I, is All I Ever Hear - 3:47\n07 - Instrumental Love - 2:49\n08 - Atom Bomb - 5:50\n09 - Rab Elpmet - 0:22\n10 - Scorpio Rising - 4:10\n11 - Well Alright - 3:10\n12 - Count To Ten - 4:09\n13 - Escaped Stripe - 0:53\n14 - I Love a Train - 3:35\n15 - Wang Dang Doodle - 4:05\n16 - Martians Playing Boogie Woogie - 0:16\n17 - Lonesome Joe - 4:51\n18 - Absit Invidia - 0:27\n\n\n","torrent":{"xt":"urn:btih:1ac5f1d4cc19ce915e623888e20a186e6821c016","amp;dn":"Jools+Holland%5C%27s+Rythm+and+Blues+Orchestra+Sex+and+Jazz+and+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac5f1d4cc19ce915e623888e20a186e6821c016","infoHashBuffer":{"type":"Buffer","data":[26,197,241,212,204,25,206,145,94,98,56,136,226,10,24,110,104,33,192,22]},"announce":[],"urlList":[]}}