{"title":"PGP Desktop Version 8.0.3 (w/ serial)","uid":4080202,"size":9974602,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1b1ccb184581e5204fa2ae0f09ae8b029f405f31&amp;dn=PGP+Desktop+Version+8.0.3+%28w%2F+serial%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":9,"time":1205525353,"description":"I felt the obligation to add this because all the other torrents I tried prior to finding a copy elsewhere were corrupt, or had zero seeders.  This indeed is a working copy of PGP Desktop 8.0.3, with serial and registration information included.  May I add, this exact copy works completely for me, and works for others, so it will certainly work for you.  I say this due to the fact many people sabotage torrents by saying &quot;Don&amp;#039;t download,&quot; &quot;virus,&quot; etc, and its unfair to the other people who can actually use this software.\n\nAnyways.  If you are unfamiliar with PGP, google PGP, and go to their wikipedia page.  It is an extremely secure encryption program, which works with your hard drive, files, and sending messages.\n\nAlong with the program and serial, there is also a small &quot;PGP for Dummies&quot; .pdf file, which outlines the basics, and teaches you how to initially set everything up.  PGP honestly can be a bit diffult understanding it at first, but with a bit of reading it will be easy.  Such a program like this is extremely valuable in this coming day and age\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world&amp;#039;s longest running largest explosives and weapons forum on the web!\t","torrent":{"xt":"urn:btih:1b1ccb184581e5204fa2ae0f09ae8b029f405f31","amp;dn":"PGP+Desktop+Version+8.0.3+%28w%2F+serial%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1ccb184581e5204fa2ae0f09ae8b029f405f31","infoHashBuffer":{"type":"Buffer","data":[27,28,203,24,69,129,229,32,79,162,174,15,9,174,139,2,159,64,95,49]},"announce":[],"urlList":[]}}