{"title":"David Jason, My Life, Autobiography 2013 epub dovah","uid":9101383,"size":2539435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c2674f5eba4928b3742431df144215cf64d0d27&amp;dn=David+Jason%2C+My+Life%2C+Autobiography+2013+epub+dovah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dovah12","files":-1,"time":1382775659,"description":"David Jason: My Life\n\n\nAuthor : David Jason\n\n\nFormat : ebook\nPublished October 10th 2013 by Cornerstone Digital\nISBN : 1448164206\n\n\n\nThe long-awaited autobiography of one of Britain's best-loved actors.Born the son of a Billingsgate market porter at the height of the Second World War, David Jason spent his early life dodging bombs and bullies, both with impish good timing.\nGiving up on an unloved career as an electrician, he turned his attention to acting and soon, through a natural talent for making people laugh, found himself working with the leading lights of British comedy in the 1960s and '70s: Eric Idle, Michael Palin, Bob Monkhouse and Ronnie Barker.\nBarker would become a mentor to David, leading to hugely successful stints in Porridge and Open All Hours. It wasn't until 1981, kitted out with a sheepskin jacket, a flat cap, and a clapped-out Reliant Regal, that David found the part that would capture the nation's hearts: the beloved Derek 'Del Boy' Trotter in Only Fools and Horses.\nNever a one-trick pony, he had an award-winning spell as TV's favourite detective Jack Frost, took a country jaunt as Pop Larkin in the Darling Buds of May, and even voiced a crime-fighting cartoon rodent in the much-loved children's show Danger Mouse.\nBut life hasn't all been so easy: from missing out on a key role in Dad's Army to nearly drowning in a freak diving accident, David has had his fair share of ups and downs, and has lost some of his nearest and dearest along the way.\nDavid's is a touching, funny and warm-hearted story, which charts the course of his incredible five decades at the top of the entertainment business. He's been a shopkeeper and a detective inspector, a crime-fighter and a market trader, and he ain't finished yet. As Del Boy would say, it's all cushty. With an introduction narrated by David himself\n================\n\nDovah","torrent":{"xt":"urn:btih:1c2674f5eba4928b3742431df144215cf64d0d27","amp;dn":"David+Jason%2C+My+Life%2C+Autobiography+2013+epub+dovah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c2674f5eba4928b3742431df144215cf64d0d27","infoHashBuffer":{"type":"Buffer","data":[28,38,116,245,235,164,146,139,55,66,67,29,241,68,33,92,246,77,13,39]},"announce":[],"urlList":[]}}