{"title":"It's Not Rocket Science - Ben Miller","uid":11155790,"size":713051,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c6b03b7d19bb26f817e8392ed4271c418af9ccb&amp;dn=It%27s+Not+Rocket+Science+-+Ben+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1412419110,"description":"Black holes. DNA. The Large Hadron Collider. Ever had that sneaking feeling that you are missing out on some truly spectacular science?\n\nYou do? Well fear not, for help is at hand.\n\nBen Miller was working on his Physics PhD at Cambridge when he accidentally became a comedian. But first love runs deep, and he has returned to his roots to share with you all his favourite bits of science. This is the stuff that you really need to know, not only because it matters, but because it will quite simply amaze and delight you.\n\n'Let me show you another, perhaps less familiar side of Science; her beauty, her seductiveness and her passion. And let's do it quickly, while Maths isn't looking' Ben Miller\n\nReview\n\nBen Miller has made a successful career out of concealing his intellect, but in this book he fails to obscure his scientific credentials beautifully. It's a fun and insightful ride through the whole of science - it's almost as if he'd finished his PhD! -- Professor Brian Cox This book makes climate change actually seem interesting. Not just important - it's obviously important - but interesting. As a result I bought lots of other books about climate change, something I now regret -- David Mitchell","torrent":{"xt":"urn:btih:1c6b03b7d19bb26f817e8392ed4271c418af9ccb","amp;dn":"It%27s+Not+Rocket+Science+-+Ben+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c6b03b7d19bb26f817e8392ed4271c418af9ccb","infoHashBuffer":{"type":"Buffer","data":[28,107,3,183,209,155,178,111,129,126,131,146,237,66,113,196,24,175,156,203]},"announce":[],"urlList":[]}}