{"title":"Open OFFICE 2010 3.2.0 FULL (The Complete Office Suite)","uid":5676574,"size":154982507,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c81519900a28fe3584ff5e0fd1fdd6a34a057fa&amp;dn=Open+OFFICE+2010+3.2.0+FULL+%28The+Complete+Office+Suite%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mollatira","files":1,"time":1278554974,"description":"A credible rival to MS Office, OpenOffice.org includes powerful applications for making text documents, spreadsheets, presentations, diagrams, and databases, as well as HTML and XML documents. Not only does it let you edit basic documents, such as letters and faxes, it also handles equations and complex and multipart documents with bibliographies, reference tables, and indexes.\n\nThe interface is similar to that of MS Office, and even advanced Office users will find almost everything they're used to: templates, collaborative features (versions, recording changes), macros, and even a programming language. OOo, as it's known, lets you open and save documents in formats as diverse as MS Office formats, PDF, HTML, and XML. It can also import files from those formats, as well as WordPerfect and others. However, it normally saves files in the open-standard Oasis OpenDocument XML format, for maximum compatibility with other applications.\n\nThe latest versions of OpenOffice have seen a spurt of growth in the extensions available for the program. These include templates for professional writers, an export tool for bidirectional functionality with Google Docs, blog publishing, and others. Blog publishing assistance especially strikes us as a natural area for word processing to grow toward.\n\nWe were pleased to find that stability has improved too. No doubt about it, the multilingual and crossplatform OpenOffice.org is a compelling option for anyone in search of an alternative office suite.\n\n\n","torrent":{"xt":"urn:btih:1c81519900a28fe3584ff5e0fd1fdd6a34a057fa","amp;dn":"Open+OFFICE+2010+3.2.0+FULL+%28The+Complete+Office+Suite%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c81519900a28fe3584ff5e0fd1fdd6a34a057fa","infoHashBuffer":{"type":"Buffer","data":[28,129,81,153,0,162,143,227,88,79,245,224,253,31,221,106,52,160,87,250]},"announce":[],"urlList":[]}}