{"title":"Painted Palms - Forever (2014) [FLAC]","uid":9490746,"size":286913940,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1c9a0968292c193282bd43a063c87c8f7cedb9f0&amp;dn=Painted+Palms+-+Forever+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1389990361,"description":"\n  Painted Palms - Forever (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Electronic, Experimental, Chillwave\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Too High\n  02 Here It Comes\n  03 Hypnotic\n  04 Forever\n  05 Soft Hammer\n  06 Carousel\n  07 Not Really There\n  08 Hope That You See It Now\n  09 Spinning Signs\n  10 Sleepwalking\n  11 Empty Gun\n  12 Angels \n \n  Made up of cousins Reese Donahue and Chris Prodhomme, San Francisco duo Painted Palms began when the two were living thousands of miles away from each other and would exchange ideas for the band online. They pieced together an early EP this way, and even when that EP got them noticed and invited on various tours, the two ultimately ended up both living blocks away from each other in San Francisco but working on ideas in isolation in their time-honored fashion, trading files online to complete work on debut album Forever. The bedroom approach comes through loud and clear throughout the album, which never sounds cold but has a discernible tone of distance infused to its summery electro-pop beats. Painted Palms' sound draws heavily on the warm but perfectly constructed production of Animal Collective circa Merriweather Post Pavilion, or Of Montreal's most lucid moments of snarky, catchy indie rock. \n\n  The vocals on all the songs meet a pleasant midpoint between Panda Bear's drawn-out croon and the jumpy falsetto of the Shins' James Mercer. Tunes like the hyper-catchy &quot;Not Really There&quot; and bounding album-opener &quot;Too High&quot; strike a perfect balance between these three main influences, meticulously composed computer beats meeting with watery samples and washed-out vocal harmonies. This formula makes the album run by in a pleasant blur for the first few listens, melodies blending into each other and gooey electronics all taking on similar colors. Eventually certain tracks begin to stand out more, like title track &quot;Forever&quot; with its sharp guitar riff and Bowie undercurrents and the synthy click-clack keyboards and tense dynamics of &quot;Spinning Signs.&quot; As warm and happy as the songs can be, there's a strange sense of loneliness that runs through Forever. You can hear the isolated perspectives that it was made in creep into the finished products, which doesn't take away from the songs but adds a feeling of being stuck in some faraway dream to even the most immediate of the band's glowing pop tunes.","torrent":{"xt":"urn:btih:1c9a0968292c193282bd43a063c87c8f7cedb9f0","amp;dn":"Painted+Palms+-+Forever+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c9a0968292c193282bd43a063c87c8f7cedb9f0","infoHashBuffer":{"type":"Buffer","data":[28,154,9,104,41,44,25,50,130,189,67,160,99,200,124,143,124,237,185,240]},"announce":[],"urlList":[]}}