{"title":"Milosh - Jetlag (2013) [FLAC]","uid":9253917,"size":270656232,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1cbd9437e0b91b05d0d1e72382fd2e8542aa1460&amp;dn=Milosh+-+Jetlag+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1385517918,"description":"\n  Milosh - Jetlag (2013) [FLAC]\n\n  Genre: Pop/Rock, Electronic\n  Styles: Ambient, Downtempo, Indie, Experimental\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Do You Want What I Need\n  02 Hear In You\n  03 Skipping\n  04 Don't Call It\n  05 Jetlag\n  06 Stakes Ain't High\n  07 Hold Me\n  08 Slow Down\n  09 Water\n  10 This Time\n\n  When he and Robin Hannibal released Rhye's Woman, Mike Milosh had three of his own albums to his credit. Although Milosh was established, some writers who covered Rhye were unsure of the vocalist's identity and even gender. Backed by a major label, Woman debuted at number 55 on the Billboard 200 and instantly gave Milosh and Hannibal the most commercial exposure either had experienced. Jet Lag, the fourth album from the duo's Canadian half, trails Woman by only eight months, but it's the singer, songwriter, multi-instrumentalist, and producer's first solo release since 2008. It doesn't have the elegant, intricately garnished touch of Woman, yet it is Milosh's smoothest and most focused solo work. Rather than a reference to the fact that Milosh has made his albums in several very different locations, the album's title refers to the contrasting feelings of elation and wistfulness that came from embracing a different life with his collaborator and new wife, actor Alexa Nikolas. \n\n  Jet Lag is nearly as nuanced as Woman, with a bathtub, kitchen utensils, and Nikolas' stomach all used as percussion, while cushiony synthesizer patterns -- some as melodic as Milosh's voice -- steadily swarm throughout. Milosh's rhythms are softer, more supple, and they suit his voice more than before. As on Woman, much of Jet Lag's lyrics slide between romantic and erotic, full of longing, discreetly laced with sexually suggestive content. It all adds up to a sophisticated electronic pop album with a serious lingering effect.","torrent":{"xt":"urn:btih:1cbd9437e0b91b05d0d1e72382fd2e8542aa1460","amp;dn":"Milosh+-+Jetlag+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cbd9437e0b91b05d0d1e72382fd2e8542aa1460","infoHashBuffer":{"type":"Buffer","data":[28,189,148,55,224,185,27,5,208,209,231,35,130,253,46,133,66,170,20,96]},"announce":[],"urlList":[]}}