{"title":"[SEWING] The Dolls' Clothes Storybook Collection: 10 Character C","uid":11147557,"size":63309308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d2540893fb387890ba8fb505b6494f9855bd0ee&amp;dn=%5BSEWING%5D+The+Dolls%27+Clothes+Storybook+Collection%3A+10+Character+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"KnitLady","files":-1,"time":1412280951,"description":"Ten much-loved characters taken from classic stories and fairytales have inspired this delightful collection of storybook dolls? clothes. Christina Harris? eye for detail and concern for period accuracy reproduced in miniature, make this collection of clothes to sew particularly rewarding for any doll collector. The patterns are designed to fit dolls sized from 17 to 24 inches and there are simple guidelines on how to adapt the patterns to fit any size of doll. The general dressmaking instructions for making the garments are collected together at the start of the book with clear diagrams illustrating the stitches and techniques used. Each outfit is described step-by-step and there are also instructions for making all the accessories for each of the characters, including hats and shoes, and a full set of underwear. Photographs show both the front and back of each outfit as well as details of the costumes. Each pair of characters is set in a scene from their story; who could resist creating the costumes of Alice and the Queen of Hearts playing that chaotic game of croquet, or Rapunzel letting down her hair to let the Prince climb up and rescue her?","torrent":{"xt":"urn:btih:1d2540893fb387890ba8fb505b6494f9855bd0ee","amp;dn":"%5BSEWING%5D+The+Dolls%27+Clothes+Storybook+Collection%3A+10+Character+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d2540893fb387890ba8fb505b6494f9855bd0ee","infoHashBuffer":{"type":"Buffer","data":[29,37,64,137,63,179,135,137,11,168,251,80,91,100,148,249,133,91,208,238]},"announce":[],"urlList":[]}}