{"title":"Self-Sufficiency (Preparedness eBook and Resource Collection) cr","uid":7169882,"size":13573640088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d3e8f66509e80586457270addba726eabf5d1a5&amp;dn=Self-Sufficiency+%28Preparedness+eBook+and+Resource+Collection%29+cr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Fearsaor","files":1002,"time":1333926642,"description":"This torrent is a compilation of books (mainly) on aspects of living off the grid and survival in the high likelyhood of civilisational collapse. It covers a wide range of subjects, many of which overlap, and includes:\n\n\n* Apiculture (beekeeping).\n* Archery (mainly recurve bow).\n* Brewing and Distillation.\n* Bushcraft.\n* Construction of just about anything (from homes, greenhouses and gers) from just about anything (bamboo, earth, straw, mud bricks, stone, stuff you obtained from a skip!).\n* Crafts and Skills (lots of crafts and skills, such as woodcarving, candlemaking, spinning, weaving, leatherwork, metalwork, ropes/splices etc....). This includes an AVI on wood carving.\n* Electronics and Alternative Energy (production, storage and maintenance).\n* Flora and Fauna.\n* Food and Gardening, from growing (including lots on permaculture), to preservation, storage and cooking as well as aquaponics and green roofs.\n* Medicine, including wilderness medicine.\n* Navigation and Orientation (includes navigation by the stars).\n* Community planning.\n* Alternative energy, including ground-source heating.\n* Recipes and processes for soap, dyes, candles, bread and so on, with some conceptual overlap into Crafts and Skills!\n* Reforestation.\n* General Self-Reliance, again with lots of overlap, mainly into food, gardening and water conservation. \n* Tools, mainly sharp ones, including how to keep them that way.\n* Tracking.\n* Transport (carts, boats, etc).\n* Water and Sewage.\n\nClassifying some of this without overlap proved difficult. It is a portion of a much bigger collection. I have created this torrent in the hope that it will help others to learn how to be prepared and survive, but also so that some of our oldest skills are no forgotten.\n\nKnowledge must be shared. For something to become knowledge it has to be known to many.\n\nIf you have any questions please leave a comment below.\n\nPlease seed. We reap what we sow.\n\nFearsaor","torrent":{"xt":"urn:btih:1d3e8f66509e80586457270addba726eabf5d1a5","amp;dn":"Self-Sufficiency+%28Preparedness+eBook+and+Resource+Collection%29+cr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d3e8f66509e80586457270addba726eabf5d1a5","infoHashBuffer":{"type":"Buffer","data":[29,62,143,102,80,158,128,88,100,87,39,10,221,186,114,110,171,245,209,165]},"announce":[],"urlList":[]}}