{"title":"Glorious French Food","uid":4798498,"size":7069143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d68d627a67ca88de309bf5717a190d239e96a2d&amp;dn=Glorious+French+Food&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"philmccrevice","files":1,"time":1237964433,"description":"In Glorious French Food, James Peterson argues that once you understand a recipe's &quot;logic and context,&quot; and the techniques required to follow it, you actually have something much more valuable than the recipe itself--you have the knowledge to create variations, make simplifications, and cook with spontaneity. Although French cuisine is often accused of being fussy and time-consuming, Peterson's clear instructions demystify many traditionally finicky recipes, and in the process, teach us how to cook anything.\nThe hundreds of recipes presented here are a pleasure to peruse; kitchen novices can work their way through this hefty volume and come out the other end accomplished cooks. Peterson details necessary equipment, techniques, and ingredients for each recipe so that by the time you start making it, you're fearless. Some of his dishes are remarkably simple, like the beautifully fresh, ready-in-minutes Shaved Fennel Salad, or the richly aromatic French Onion Soup. Others are more complicated, but all teach a lesson: In the Roast Chicken chapter, learn to roast without a thermometer, truss without a needle, make gravy, and then succeed at Roast Chicken Stuffed Under the Skin with Spinach and Ricotta. Learn to make pasta dough, and then re-present leftover ProvenÃƒÂ§al Lamb Stew (if there's any of this heavenly, melt-in-your-mouth tender, orange-scented stew left) as Meat-Filled Ravioli. Perfect for fans of French cuisine, this is also a remarkably handy reference guide for any kitchen.\n","torrent":{"xt":"urn:btih:1d68d627a67ca88de309bf5717a190d239e96a2d","amp;dn":"Glorious+French+Food","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d68d627a67ca88de309bf5717a190d239e96a2d","infoHashBuffer":{"type":"Buffer","data":[29,104,214,39,166,124,168,141,227,9,191,87,23,161,144,210,57,233,106,45]},"announce":[],"urlList":[]}}