{"title":"KARADAYI BOLUM 54 HDTVRIP GR SUBS","uid":9625143,"size":1037086013,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:1d7b79abc731a7b66716404ed69e427ef19897eb&amp;dn=KARADAYI+BOLUM+54+HDTVRIP+GR+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mamaka25","files":2,"time":1392578339,"description":"DISCLAIMER\nTo paron arxeio den exei kamia sxesh me ta DVD pou pwlountai apo gnwsto periodiko. To video einai eleu8era dianemomeno apo thn tourkikh etaireia paragwghs kai oi ypotitloi apoteloun proswpikh apodosh twn dialogwn. \nProorizetai gia idiwtikh xrhsh tou ka8e downloader.\n\n\n\nKARADAYI BOLUM 54\n\nDIARKEIA: 02:01:21\n\nANALYSH 1280 x 720 (HD)\n\nYPOTITLOI: ELLHNIKOI \n\nExei ginei epimeleia oson afora th swsth apodosh sta ellhnika, th grammatikh to syntaktiko ktl. Epishs exei ginei swstos sygxronismos. Paizoun se pc kai tv.\n\n\n\nAnaforika me ton ypotitlismo ths seiras genika, 8elw na pw oti epeidh ginetai apo agglikh metafrash, an kapoios den 3erei kai liga tourkika, h apodosh 8a einai sigoura problhmatikh. Epishs o metafrasths prepei na 3erei kai poly kala agglika, giati to google translate einai gia mia dyo fraseis to poly. An kati apo auta ta dyo den isxyei, to apotelesma 8a einai na katalavainei o 8eaths to 50% apo auta pou lene oi hrwes. \n\nO ka8enas ennoeitai exei to dikaiwma na anevazei o,ti 8elei k na 3odeuei ton eleu8ero xrono tou opws 8elei gia opoio logo exei. Ofeilei omws na enhmerwnei gia to apotelesma twn prospa8eiwn tou, kai gia tis gnwseis tou, giati an to kanei mono gia na perasei ton kairo tou kai oxi gia na voh8hsei kai osous 8eloun na doun th seira, as to krathsei gia ton eauto tou efoson den einai h monadikh (h kaluterh) epilogh. To apotelesma 8a einai to idio, 8a exei ena wraio hobby. \n\nH eleu8eria tou ka8e uploader den 8a eprepe na katapata thn eleu8eria poly perissoterwn downloaders. \n\nEpishs, ta sxolia yparxoun oxi mono gia euxaristies, alla kai (kyriws) gia enhmerwsh autwn pou 8A katevasoun ena arxeio apo autous pou HDH to exoun katevasei. Se ola ta mhkh kai plath tou Internet isxyei auto to a3iwma. Apo th stigmh pou kapoios den einai prosvlhtikos, ofeilei na enhmerwsei tous ypoloipous an yparxei kapoio problhma.\n\nDen anaferomai se kapoia sygekrimenh prospa8eia, giati den katevazw alles metafraseis, apla sxoliazw ta diafora fainomena pou exw parathrhsei 6 mhnes twra vasei sxoliwn allwn xrhstwn.\n\nEidika gia th dikh mas prospa8eia, 8a pw oti epeidh akrivws prospa8oume na eimaste akriveis, den boroume na vgazoume epeisodio se 2 meres, kai oute 8a hmastan euxaristhmenoi apo to apotelesma an to kaname. Se kamia periptwsh, den einai teleio to apotelesma mas giati e3artatai apolyta apo thn akriveia ths agglikhs metafrashs, thn opoia den boroume na eleg3oume panta me ta vasika tourkika pou gnwrizoume. \nProswpika pantws, de nomizw oti ka8ysteroume kai toso poly se sxesh me th metafrash pou kanoume kai th diarkeia twn epeisodiwn.\nDe metafrazoume opote exoume xrono h kefi, alla exoume synexh parousia apo to Septemvrio para ton polemo pou dexthkame gia ena diasthma. De mas peirazei na exoume estw kai mono 50 seeders, giati eimaste perhfanoi gia thn poiothta ths douleias mas.\nSas euxaristoume poly.","torrent":{"xt":"urn:btih:1d7b79abc731a7b66716404ed69e427ef19897eb","amp;dn":"KARADAYI+BOLUM+54+HDTVRIP+GR+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d7b79abc731a7b66716404ed69e427ef19897eb","infoHashBuffer":{"type":"Buffer","data":[29,123,121,171,199,49,167,182,103,22,64,78,214,158,66,126,241,152,151,235]},"announce":[],"urlList":[]}}