{"title":"Diane Schuur and Maynard Ferguson - 2001 - Swingin' For Schuur F","uid":8493097,"size":355197093,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1de620a713de01c1f6b979c9d5fa4faeefbb7d3f&amp;dn=Diane+Schuur+and+Maynard+Ferguson+-+2001+-+Swingin%27+For+Schuur+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1369057201,"description":"Diane Schuur &amp; Maynard Ferguson - 2001 - Swingin' For Schuur\n\nWell regarded as one of our greatest living jazz singers, Schuur seems to enjoy album titles created out of puns of her name -- prior to this there was Friends for Schuur -- but don't let the novelties distract you from this sassy, explosively brassy swing project blending her inventive vocals with Ferguson's blistering trumpet and the ensemble energy of his Big Bop Nouveau Band. Aside from crisp performances by both, the real key to the success here is the unexpected arrangements of standards by various members of Ferguson's band. Two classics generally rendered as intimate ballads -- &quot;Autumn Leaves&quot; and &quot;My Romance&quot; -- are rendered as easy swaying, frisky finger-snapping romps. The interlude after the first verse on &quot;Autumn Leaves&quot; typifies the way Ferguson lets his guys jam before he steps up and challenges them with a powerful wailing flurry of high notes. &quot;My Romance&quot; finds Schuur moving out of her crystal clear midrange safety zone and reaching the high registers, with a few vocal notes matched at the end by the trumpet. Many of the arrangements are like baritone saxman Denis DiBlasio's twist on &quot;East of the Sun and West of the Moon&quot; -- Schuur gliding over a snappy but subdued jazz trio before Ferguson and company burst in with increasingly muscular horn textures, which then push her to emotional heights. Most of the songs incorporate such mood swings, but &quot;Deep Purple&quot; stays a slow, seductive, and subdued ballad the whole way through. Schuur once again proves she's an amazing vocalist who can sing along with the best of them. Is there another singer who's made duet recordings with both Ferguson and B.B. King? (AllMusic)\n\nTrack list:\n01 - Just One Of Those Things\n02 - Besame Mucho\n03 - Deep Purple\n04 - Autumn Leaves\n05 - My Romance\n06 - Love Letters\n07 - East Of The Sun And West Of The Moon\n08 - Midnight Sun\n09 - I Fall In Love Too Easily\n10 - Lush Life\n11 - Just Friends\n12 - Let's Fall In Love\n\nEnjoy and share!","torrent":{"xt":"urn:btih:1de620a713de01c1f6b979c9d5fa4faeefbb7d3f","amp;dn":"Diane+Schuur+and+Maynard+Ferguson+-+2001+-+Swingin%27+For+Schuur+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1de620a713de01c1f6b979c9d5fa4faeefbb7d3f","infoHashBuffer":{"type":"Buffer","data":[29,230,32,167,19,222,1,193,246,185,121,201,213,250,79,174,239,187,125,63]},"announce":[],"urlList":[]}}