{"title":"Atlas Genius - When It Was Now (2013) [FLAC]","uid":8159557,"size":279328904,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e15bde3265c0306289b69acb205960f990079c8&amp;dn=Atlas+Genius+-+When+It+Was+Now+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1361224905,"description":"\n  Atlas Genius - When It Was Now (2013) [FLAC]\n\n  Released: 2013\n  Duration: 37:46\n  Genre: Pop/Rock\n  Style: Indie Pop\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  01 Electric\n  02 If So \n  03 Back Seat\n  04 Trojans\n  05 Through The Glass \n  06 On A Day \n  07 Centred On You\n  08 Don't Make A Scene \n  09 All These Girls \n  10 When It Was Now \n  11 Symptoms \n\n  Atlas Genius first came to attention with &quot;Trojans,&quot; and it's easy to hear why this song - which the band recorded in their own studio - became a hit: it's glossy but earnest, pairing a familiar-sounding melody with subtly changing guitars and keyboards that weave in and out between Keith Jeffery's vocals. &quot;Trojans&quot; is also the best song on Atlas Genius' full-length debut When It Was Now, largely because its songwriting is so direct and intimate. That strength sets them apart from many of their contemporaries, who helped make the mix of chugging guitars and sparkling synths nigh-on ubiquitous by the time When It Was Now arrived. \n\n  At times, the band's fondness for keyboards suggests a more macho Phoenix or a less arty Gotye, but the anthemic, heartfelt thrust to songs such as &quot;If So&quot; and the title track puts them closer to Kings of Leon or even the Killers (minus the fanciful tangents that band takes). There might even be some arena rock deep in their music's DNA; the chorus on the prior single &quot;Through the Glass&quot; could easily fill a stadium. While Atlas Genius throw in a few musical twists here and there, like the bubbly synth intro to &quot;On a Day,&quot; their focus is on getting their songs across in the biggest way possible. When the writing doesn't match the standard set by the strongest songs, the album lags a little, and sometimes it's hard to tell whether Atlas Genius is a stylish band with a heartfelt undercurrent or a straightforward one gussied up with fashionable sonics. Either way, When It Was Now is a solid debut that proves &quot;Trojans&quot; wasn't a fluke.","torrent":{"xt":"urn:btih:1e15bde3265c0306289b69acb205960f990079c8","amp;dn":"Atlas+Genius+-+When+It+Was+Now+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e15bde3265c0306289b69acb205960f990079c8","infoHashBuffer":{"type":"Buffer","data":[30,21,189,227,38,92,3,6,40,155,105,172,178,5,150,15,153,0,121,200]},"announce":[],"urlList":[]}}