{"title":"The London Rock and Roll show","uid":7299866,"size":3873016398,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1e701e2d310cbbd6ff1d431df8dadee49b0ace15&amp;dn=The+London+Rock+and+Roll+show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"GRNS3","files":-1,"time":1337996324,"description":"Another awesome music documentary from the archive, sharing it here as a thank you to all music loving friends over the glove. Please enjoy, share and seed :)\n\n\nFrom Wikipedia, the free encyclopedia\n\nJump to: navigation, search\n\n\nThe London Rock and Roll Show\nDirected by \tPeter Clifton\nProduced by \tPeter Clifton\nEditing by \tThomas Schwalm\nRelease date(s) \t1973\nCountry \tUnited Kingdom UK\nLanguage \tEnglish\n\nThe London Rock and Roll Show was a 1973 British-produced concert film directed by Peter Clifton chronicling a Rock and Roll Revival concert held at Wembley Stadium in London, England in August 1972.\n\nFrom the late 1960s to the early 1970s, many rock and roll performers from the 1950s experienced major career revivals due to a temporary upswing of interest in their form of music. The Revival was marked by a series of major concerts in the United States, and also spread to Europe where events such as the Wembley concert attracted thousands of fans who came out to see the performers behind the music.\n\nLondon Rock and Roll Show begins with excerpts from numerous &quot;warm-up&quot; performers shown singing either covers of 1950s hits, or original tunes, including a performance by Screaming Lord Sutch that threatens to end the concert prematurely when he brings a stripper on stage.\n\nThe main concert segment begins with Bo Diddley and continues with a string of other major performers including Jerry Lee Lewis, Little Richard, and Bill Haley and His Comets. The concert ends with an extended performance by Chuck Berry, who at the time was enjoying major chart success in Britain and the US with his &quot;My Ding-a-Ling&quot; (although he does not perform that song in this film). Mick Jagger also appears in several non-musical interludes in which he is interviewed about the performers.\n\nAlthough no soundtrack release occurred at the time the film was made, one was finally issued in the early 2000s, followed by several different DVD releases with different combinations of performances.\n\ni'll put the setlist in the comments :)\n","torrent":{"xt":"urn:btih:1e701e2d310cbbd6ff1d431df8dadee49b0ace15","amp;dn":"The+London+Rock+and+Roll+show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e701e2d310cbbd6ff1d431df8dadee49b0ace15","infoHashBuffer":{"type":"Buffer","data":[30,112,30,45,49,12,187,214,255,29,67,29,248,218,222,228,155,10,206,21]},"announce":[],"urlList":[]}}