{"title":"Miniature Gardens (gnv64)","uid":10199326,"size":44031764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ec2af07d81fb05c371f8d1e38f7a3d89e03e6e4&amp;dn=Miniature+Gardens+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1400747313,"description":"Miniature Gardens - Design and create miniature fairy gardens, dish gardens, terrariums and more-indoors and out\nby Katie Elzer-Peters\nCool Springs Press | March 2014 | ISBN-10: 1591865751 | ePUB | 106 pages | 41.9 mb\n\nA revealing peek into the captivating world of gardening in miniature, complete with inspiring photos and practical step-by-step instructions. A delightful, fun, and endlessly creative new trend is sweeping the gardening world: miniature gardening! With your imagination as the only limit to this infinitely customizable technique, miniature gardening showcases your individuality. Once you've learned how to design, create, and grow tiny plant combinations successfully, you'll be able to let your creativity loose indoors and out. In Miniature Gardens, gardening expert Katie Elzer-Peters demonstrates the latest in plant options and designs through her gorgeous color photography and laser-focused Do-It-Yourself advice. Plenty of great tips and idea-generating information on small-scale furnishings are included as well. Where other books on this popular subject offer run-of-the-mill images and only limited how-to information, Miniature Gardens gives you a thorough and beautiful window into this tiny world, from fairy gardening to dish gardening, terrariums, and even a miniature water garden project. From cute home tabletop designs to elaborate mini-villages and everything in between, miniature gardening is a pastime that can be enjoyed by hobbyists and families of all ages and in all sizes of living space. With Miniature Gardens, you're just a lightning strike of inspiration away from bringing to life the endless creations unique to your own imagination.\n\nAbout the Author &lt;a href=&quot;\nhttp://s9.postimg.org/odqjdnw73/katie.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s9.postimg.org/odqjdnw73/katie.jpg&lt;/a&gt;\nKatie Elzer-Peters has been gardening since she could walk. She turned that hobby into a career by first pursuing her Bachelor of Science in Horticulture at Purdue University and then her Master of Science in Horticulture through the Longwood Graduate Program at the University of Delaware. After school, Katie managed botanical gardens around the United States. Now she runs a garden marketing and pr business, The Garden of Words, LLC and an online Speaker's Bureau, GreatGardenSpeakers.com.\nKatie's two earliest memories take place in the garden. One is picking green beans with her dad in a patch that seemed enormous, but that was probably because she was three or four years old at the time. The other memory is taking sand from her sandbox to add to the flowerbeds to &quot;improve drainage.&quot;\n\nCONTENTS\nIntroduction\nPART 1: MINIATURE GARDENING BASICS\nChapter 1: Design\nChapter 2: Plants\nChapter 3: Containers\nChapter 4: Accessories and Themes\nChapter 5: Growing the Miniature Garden\nPART 2: CREATING MINIATURE AND FAIRY GARDEN PROJECTS\nChapter 6: Indoor Miniature &amp; Fairy Gardens\nChapter 7: Terrariums and Aeriums\nChapter 8: Outdoor Miniature and Fairy Gardens\nPART 3: PLANT PROFILES\nResources\nIndex\nMeet Katie Elzer-Peters","torrent":{"xt":"urn:btih:1ec2af07d81fb05c371f8d1e38f7a3d89e03e6e4","amp;dn":"Miniature+Gardens+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ec2af07d81fb05c371f8d1e38f7a3d89e03e6e4","infoHashBuffer":{"type":"Buffer","data":[30,194,175,7,216,31,176,92,55,31,141,30,56,247,163,216,158,3,230,228]},"announce":[],"urlList":[]}}