{"title":"The Band - Music From Big Pink (1968) 2009 MFSL-SACD-DFF","uid":11559712,"size":1728526334,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f2d2274b2b790400bda82b3b9bc0e05c0ca7432&amp;dn=The+Band+-+Music+From+Big+Pink+%281968%29+2009+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"hal4000","files":-1,"time":1416867262,"description":"The Band was a Canadian-American roots rock group that originally consisted of Rick Danko (bass guitar, double bass, fiddle, trombone, vocals), Levon Helm (drums, mandolin, guitar, vocals), Garth Hudson (keyboard instruments, saxophones, trumpet), Richard Manuel (piano, drums, baritone saxophone, vocals) and Robbie Robertson (guitar, vocals). The members of the Band first came together as they joined rockabilly singer Ronnie Hawkins' backing group The Hawks one by one between 1958 and 1963.\n\nNone of the Band's previous work gave much of a clue about how they would sound when they released their first album in July 1968. As it was, Music from Big Pink came as a surprise. At first blush, the group seemed to affect the sound of a loose jam session, alternating emphasis on different instruments, while the lead and harmony vocals passed back and forth as if the singers were making up their blend on the spot. In retrospect, especially as the lyrics sank in, the arrangements seemed far more considered and crafted to support a group of songs that took family, faith, and rural life as their subjects and proceeded to imbue their values with uncertainty. Some songs took on the theme of declining institutions less clearly than others, but the points were made musically as much as lyrically. Tenor Richard Manuel's haunting, lonely voice gave the album much of its frightening aspect, while Rick Danko's and Levon Helm's rough-hewn styles reinforced the songs' rustic fervor. The dominant instrument was Garth Hudson's often icy and majestic organ, while Robbie Robertson's unusual guitar work further destabilized the sound. The result was an album that reflected the turmoil of the late '60s in a way that emphasized the tragedy inherent in the conflicts. Music from Big Pink came off as a shockingly divergent musical statement only a year after the ornate productions of Sgt. Pepper, and initially attracted attention because of the three songs Bob Dylan had either written or co-written. However, as soon as &quot;The Weight&quot; became a minor singles chart entry, the album and the group made their own impact, influencing a movement toward roots styles and country elements in rock. Over time, Music from Big Pink came to be regarded as a watershed work in the history of rock, one that introduced new tones and approaches to the constantly evolving genre.\n\nTracklist: \t\n1. &quot;Tears of Rage&quot;   \t    5:16\n2. &quot;To Kingdom Come&quot;   \t    3:16\n3. &quot;In a Station&quot;   \t    3:27\n4. &quot;Caledonia Mission&quot;      2:52\n5. &quot;The Weight&quot;   \t    4:31 \t\n6. &quot;We Can Talk&quot;   \t    3:00\n7. &quot;Long Black Veil&quot;   \t    2.58\n8. &quot;Chest Fever&quot;   \t    5:10\n9. &quot;Lonesome Suzie&quot;   \t    3.57\n10. &quot;This Wheel's on Fire&quot;  3:08\n11. &quot;I Shall Be Released&quot;   3:11 \n\nDSD-DFF files extracted with Scarletbook\nfrom the 2009 Mobile Fidelity Sound Lab SACD\n\nMFSL-SACD-ISO-DFF-1Bit-2.8Mhz","torrent":{"xt":"urn:btih:1f2d2274b2b790400bda82b3b9bc0e05c0ca7432","amp;dn":"The+Band+-+Music+From+Big+Pink+%281968%29+2009+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f2d2274b2b790400bda82b3b9bc0e05c0ca7432","infoHashBuffer":{"type":"Buffer","data":[31,45,34,116,178,183,144,64,11,218,130,179,185,188,14,5,192,202,116,50]},"announce":[],"urlList":[]}}