{"title":"A Touch of Frost - Season 10","uid":8531480,"size":1941882710,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f808996f947d4a7a8195c27a48fe93b853e68b7&amp;dn=A+Touch+of+Frost+-+Season+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sneesh","files":10,"time":1370163781,"description":"The series stars David Jason as Detective Inspector William Edward &quot;Jack&quot; Frost, an experienced and dedicated detective who frequently clashes with his superiors. In his cases, Frost is assisted by a variety of different detective sergeants, with each bringing a different slant to the particular case. Comic relief is provided by Frost's interactions with the bureaucratically-minded Superintendent Norman Mullett, played by Bruce Alexander.\n\nThe series is set in the fictional South-Midlands town of Denton, and is marked by a gritty tone. It is believed that Denton is in Oxfordshire, with many references to Reading, Oxford, and in particular, Swindon, especially in the earlier episodes, as the M4 and A417 are often seen, and the map of Swindon was seen in the control room, although a map of Reading was used occasionally. The programme is produced by ITV in Leeds, and most of the outdoor locations are shot in West Yorkshire. Several scenes are filmed in and around the city and district of Wakefield and neighbouring small towns of Pontefract and Castleford, West Yorkshire.[3] The role of Frost was notable in changing the public perception of David Jason from a predominantly comic actor to a dramatic actor.\n\nSeason 10\n\nS10, Ep1 - Jan. 19, 2003 - Hidden Truth\nFrost misplaces a winning lottery ticket while trying to find a security leak that lead to the murder of two key witness in a supposed safe house.\n \nS10, Ep2 - Mar. 3, 2003 - Close Encounters\nFrost investigates the murder of a security guard at a quarry with an autistic teenager the only witness while DS Williams helps Frost with an unusual series of burglaries.\n \nS10, Ep3 - Sep. 14, 2003 - Held in Trust\nAS Frost has mixed emotions about promotion, a young boy is reported missing and the malnourished corpse of another youngster is presumed to be his.\n\nThis torrent includes the .xml and .jpg files for the WDTV Live SMP media library feature.","torrent":{"xt":"urn:btih:1f808996f947d4a7a8195c27a48fe93b853e68b7","amp;dn":"A+Touch+of+Frost+-+Season+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f808996f947d4a7a8195c27a48fe93b853e68b7","infoHashBuffer":{"type":"Buffer","data":[31,128,137,150,249,71,212,167,168,25,92,39,164,143,233,59,133,62,104,183]},"announce":[],"urlList":[]}}