{"title":"Plumbing Electricity Acoustics Architecture Norbert M. Lechner","uid":14221637,"size":113950457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ff3ee7c886157e33ca056476181e905fc329c78&amp;dn=Plumbing+Electricity+Acoustics+Architecture+Norbert+M.+Lechner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"shailab","files":3,"time":1460049605,"description":"AMAZON - amazon/Plumbing-Electricity-Acoustics-Sustainable-Architecture/dp/1118014758\r\n\r\nWILEY - as.wiley/WileyCDA/WileyTitle/productCd-1118014758.html\r\n\r\nPlumbing, Electricity, Acoustics: Sustainable Design Methods for Architecture\r\n\r\nNorbert M. Lechner\r\n\r\nPublisher: Wiley; 1 edition (November 29, 2011)\r\nLanguage: English\r\nISBN-10: 1118014758\r\nISBN-13: 978-1-118-01475-2\r\n\r\nDescription\r\n\r\nDiscover sustainable methods for designing crucial building systems for architects.\r\nThis indispensable companion to Norbert Lechner's landmark volume Heating, Cooling, Lighting: Sustainable Design Methods for Architects, Third Edition completes the author's mission to cover all topics in the field of sustainable environmental control. It provides knowledge appropriate for the level of complexity needed at the schematic design stage and presents the most up-to-date information available in a concise, logical, accessible manner and arrangement. Although sustainability deals with many issues, those concerning energy and efficiency are the most critical, making an additional goal of this book one of providing architects with the skills and knowledge needed to create buildings that use electricity and water efficiently. Guidelines and rules-of-thumb are provided to help designers make their buildings use less energy, less water, and less of everything else to achieve their primary objectives.\r\n\r\nIn addition, this book:\r\n\r\nAddresses ways to reduce electricity usage through more efficient lighting systems and appliances and by incorporating automatic switches and control systems that turn off systems not in use.\r\nCovers the design of well-planned effluent treatment systems that protect against potential health hazards while also becoming a valuable source of reclaimed water and fertilize.r\r\nProvides coverage of fire protection and conveyance systems, including very efficient types of elevators and escalators and designs that encourage the use of stairs or ramps.\r\nComplete with case studies that illustrate how these systems are incorporated into large-project plans, Plumbing, Electricity, Acoustics is an indispensable resource for any architect involved in a sustainable design project.\r\n\r\n\r\nBTC - 1CZ4nTozpgfgqufWhiXDtBu9pVurd41SPz\r\n\r\nenjoy...\r\n\r\nYOURs INsincerely...\r\n\r\n---------------------------------------------------------------------------------------\r\n\r\n.:.Shailab.:.\r\n \nhttps://thepiratebay.se/user/shailab/\r\n \nhttps://kat.cr/user/shailab/","torrent":{"xt":"urn:btih:1ff3ee7c886157e33ca056476181e905fc329c78","amp;dn":"Plumbing+Electricity+Acoustics+Architecture+Norbert+M.+Lechner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff3ee7c886157e33ca056476181e905fc329c78","infoHashBuffer":{"type":"Buffer","data":[31,243,238,124,136,97,87,227,60,160,86,71,97,129,233,5,252,50,156,120]},"announce":[],"urlList":[]}}