{"title":"Brantley Gilbert - Just As I Am [2014] [EAC/FLAC]","uid":10226772,"size":336077852,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:205b273fb8978930bc902a2d12529689bfa2c99a&amp;dn=Brantley+Gilbert+-+Just+As+I+Am+%5B2014%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":15,"time":1401097151,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Valory #VMCBG 0200 A\nCountry: USA\nYear: May 19, 2014\nGenre: Country,americana\nFormat: CD,Album\n\n\n1. If You Want a Bad Boy\n2. 17 Again\n3. Bottoms Up\n4. That Was Us\n5. I'm Gone\n6. My Baby's Guns n' Roses\n7. Lights of My Hometown\n8. One Hell of an Amen\n9. Small Town Throwdown (feat. Justin Moore &amp; Thomas Rhett)\n10. Let It Ride\n11. My Faith In You\n\n\nIts title is a shrug, but it's also defiant, an admission that Brantley Gilbert can't be anything but who he is -- a stance adopted by outlaw country singers since the early '70s, or perhaps earlier. Gilbert does welcome comparisons to Waylon and Willie -- the former more than the latter; he does really like such niceties as swing or jazz -- but he's a child of the '80s, raised on arena rock and volume; the first Hank he knew was Jr., not Sr. That may mean he favors amplification -- every song on Just as I Am feels cranked to 11, even the heartbroken ballads -- but he's not a guy who lives in the suburbs, strutting in tight jeans as he sings about trucks. He may live in the same world as Luke Bryan, but he's not pining for a past he never experienced, not even when he's singing about how his baby is Guns N' Roses, a band who had their breakthrough two years after his birth -- he's a sober-minded singer whose breakthrough hit &quot;Bottoms Up&quot; marched to a minor-key riff that echoes throughout Just as I Am, Gilbert's second major-label album. It's a muscular and knowing collection of contemporary country -- country that feels rooted in wayward traditions while still nodding at the conventions of Nashville. Unlike Eric Church -- a singer who certainly influenced this 2014 set -- Gilbert neither favors the sheer noise of arena rock nor celebrates the swaggering outsider stance of Church. Gilbert doesn't romanticize, which is what gives Just as I Am its resonance: he's an unfussy songwriter, a singer without affection, a musician with good instincts that never celebrate his taste. He soldiers on, playing music that seems grounded and present in its era, even as it references older sounds, perhaps even styles he's never grasped. He's not carrying the torch for any specific singer or songwriter but rather an attitude, standing for the guy who'd rather tear things up than recede into the corner. He's big, strong, and muscular, creating a roar grounded in '70s outlaw and '80s arena rock, but Gilbert is nervy, loving his well-known heritage but never wanting to succumb to the quirks everybody else knows. This tension gives Just as I Am energy, but its endurance is due to his craft; he's smart and sharp, playing with conventions and revealing the truths in their cliches, perhaps not even wittingly. Gilbert is hardly a savant -- there's a clear indication he knows what he's doing -- but he's not writing for an audience, he's inhabiting his time and speaking plainly and clearly, and that's why Just as I Am works so well; he's an outlaw with no desire to rebel, an insider who doesn't belong, so his music exists just outside of the perimeters of what is accepted and is all the more powerful for it.","torrent":{"xt":"urn:btih:205b273fb8978930bc902a2d12529689bfa2c99a","amp;dn":"Brantley+Gilbert+-+Just+As+I+Am+%5B2014%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205b273fb8978930bc902a2d12529689bfa2c99a","infoHashBuffer":{"type":"Buffer","data":[32,91,39,63,184,151,137,48,188,144,42,45,18,82,150,137,191,162,201,154]},"announce":[],"urlList":[]}}