{"title":"The Book of PF: A No-Nonsense Guide to the OpenBSD Firewall","uid":6600998,"size":6864856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:206a253b164fe641e4699c512ed981306802d902&amp;dn=The+Book+of+PF%3A+A+No-Nonsense+Guide+to+the+OpenBSD+Firewall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheBookie","files":-1,"time":1313207757,"description":"The Book of PF, 2nd Edition: A No-Nonsense Guide to the OpenBSD Firewall\n\n\nThis second edition of The Book of PF has been completely updated and revised. Based on Peter N.M. Hansteen's popular PF website and conference tutorials, this no-nonsense guide covers NAT and redirection, wireless networking, spam fighting, failover provisioning, logging, and more. Throughout the book, Hansteen emphasizes the importance of staying in control with a written network specification, keeping rule sets readable using macros, and performing rigid testing when loading new rules.\n\nThe Book of PF tackles a broad range of topics that will stimulate your mind and pad your resume, including how to:\nCreate rule sets for all kinds of network traffic, whether its crossing a simple LAN, hiding behind NAT, traversing DMZs, or spanning bridges or wider networks\nCreate wireless networks with access points, and lock them down with authpf and special access restrictions\nMaximize flexibility and service availability via CARP, relayd, and redirection\nCreate adaptive firewalls to proactively defend against would-be attackers and spammers\nImplement traffic shaping and queues with ALTQ (priq, cbq, or hfsc) to keep your network responsive\nMaster your logs with monitoring and visualization tools (including NetFlow)\nThe Book of PF is for BSD enthusiasts and network administrators at any skill level. With more and more services placing high demands on bandwidth and an increasingly hostile Internet environment, you can't afford to be without PF expertise.\n\n","torrent":{"xt":"urn:btih:206a253b164fe641e4699c512ed981306802d902","amp;dn":"The+Book+of+PF%3A+A+No-Nonsense+Guide+to+the+OpenBSD+Firewall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"206a253b164fe641e4699c512ed981306802d902","infoHashBuffer":{"type":"Buffer","data":[32,106,37,59,22,79,230,65,228,105,156,81,46,217,129,48,104,2,217,2]},"announce":[],"urlList":[]}}