{"title":"Textured Stitches: Knitted Sweaters with Smart Details","uid":9217306,"size":44925617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:208204260b2685904b7ce7747305fca13215b549&amp;dn=Textured+Stitches%3A+Knitted+Sweaters+with+Smart+Details&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1384881008,"description":"Beloved knitwear designer Connie Chang Chinchio presents for the first time a complete collection of twenty brand-new designs.\n\nKnitters know Connie Chang Chinchio's wildly popular patterns from Knitscene and Interweave Knits and will be clamoring for this book of original projects. Textured Stitches brings her trademark combination of simple knitting with lovely patterned stitches to flattering, wearable garments and accessories. The patterns are fun to knit, mixing quick and easy stockinette stitch with more involved stitch patterns like lattice, knitted pleats, cables, twisted stitches, and ribbing. The textured stitches help create a tailored fit, while classic stockinette lends drape and polished finish. Knitters will also learn how textured stitches affect gauge, how yarn choices influence the look of patterned stitches, shaping, and special cast-on and bind-off techniques.\n\nThe result is a wardrobe full of stylish and smart sweaters, tanks, tees, and accessories that you'll love to make and wear.","torrent":{"xt":"urn:btih:208204260b2685904b7ce7747305fca13215b549","amp;dn":"Textured+Stitches%3A+Knitted+Sweaters+with+Smart+Details","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"208204260b2685904b7ce7747305fca13215b549","infoHashBuffer":{"type":"Buffer","data":[32,130,4,38,11,38,133,144,75,124,231,116,115,5,252,161,50,21,181,73]},"announce":[],"urlList":[]}}