{"title":"Udemy - The Complete Cyber Security Course  Hacking Exposed","uid":15897878,"size":10375468995,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:20bcfc66f0ae9995e0db8a7b81f53b9a8d58ee1d&amp;dn=Udemy+-+The+Complete+Cyber+Security+Course++Hacking+Exposed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":11,"uploader":"Zaffera","files":1,"time":1474978034,"description":"Volume 1 : Learn how to stop hackers, prevent tracking, advanced anonymous browsing and counter government surveillance\r\n\r\nLearn a practical skill-set in defeating all online threats, including – advanced hackers, trackers, malware, zero days, exploit kits, cyber criminals and more.\r\n\r\nGo from a beginner to advanced in this easy to follow expert course.\r\n\r\nCovering all major platforms – Windows 7, Windows 8, Windows 10, Mac OS X and Linux.\r\n\r\nThis course covers the fundamental building blocks of your required skillset – You will understand the threat and vulnerability landscape through threat modelling and the risk assessment.\r\n\r\nWe explore the Darknet and mind-set of the cyber criminal. Covering malware, exploit kits, phishing, zero day vulnerabilities and much more.\r\n\r\nYou will learn about the global tracking and hacking infrastructures that nation states run. Covering the NSA, FBI, CIA, GCHQ, China’s MSS and other intelligence agencies capabilities.\r\n\r\nYou will understand the foundations of operating system security and privacy functionality. A close look at the new Windows 10 privacy issues and how to best mitigate them.\r\n\r\nThere is a complete easy to follow crash course on encryption, how encryption can be bypassed and what you can do to mitigate the risks.\r\n\r\nMaster defences against phishing, SMShing, vishing, identity theft, scam, cons an other social engineering threats","torrent":{"xt":"urn:btih:20bcfc66f0ae9995e0db8a7b81f53b9a8d58ee1d","amp;dn":"Udemy+-+The+Complete+Cyber+Security+Course++Hacking+Exposed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20bcfc66f0ae9995e0db8a7b81f53b9a8d58ee1d","infoHashBuffer":{"type":"Buffer","data":[32,188,252,102,240,174,153,149,224,219,138,123,129,245,59,154,141,88,238,29]},"announce":[],"urlList":[]}}