{"title":"Scott Henderson - 1994 - Dog Party TQMP","uid":4375885,"size":388760219,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21064fb0ec80f008c1f9eb5e19c85b97d0a02cbd&amp;dn=Scott+Henderson+-+1994+-+Dog+Party+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"downup","files":14,"time":1220401850,"description":"TQMP (The Quality Music Project).\n\nAlbum review\tby Vincent Jeffries\n\nThis collection of ten blues and blues-rock tracks represents jazz guitarist Scott Henderson&amp;#039;s tribute (if not complete return) to the emotive guitar playing of his early guitar influences: Jimmy Page and Albert King. Released in 1994 after a string of highly acclaimed jazz fusion recordings, Dog Party won equal approval from the fickle guitar virtuoso press and fan base, winning every important magazine readers poll for best blues recording. Accompanying Henderson on drums and vocals is drummer, vocalist, and fellow Tribal Tech member Kirk Covington; bassist Richard Ruse; and a host of heavyweight guest guitarists, vocalists, keyboard players, and other instrumentalists. The music is comparatively direct relative to Henderson&amp;#039;s fusion work, but the guitarist&amp;#039;s chord and phrasing mastery is plenty evident throughout Dog Party. Choice tracks include the vibrant &quot;Milk Bone,&quot; the fuzzed-out and excessive &quot;Hound Dog&quot; cover, and the furious opener, &quot;Hole Diggin&amp;#039;.&quot; These stretched-out tracks are pure musical treats, while the more pop- and rock-structured cuts have an effect that might leave fans feeling as if something (specifically, the guitarist&amp;#039;s tasty soloing) is being unduly held back. Smart, syncopated, and snappy, Dog Party is a feast of stylish blues served with grace and feeling.\n\n\nPlease feel free to join TQMP!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980&amp;#039;s cassettetapes or vinylrips please!) in lossless format (flac is preferable) AND include artwork. Include the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n","torrent":{"xt":"urn:btih:21064fb0ec80f008c1f9eb5e19c85b97d0a02cbd","amp;dn":"Scott+Henderson+-+1994+-+Dog+Party+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21064fb0ec80f008c1f9eb5e19c85b97d0a02cbd","infoHashBuffer":{"type":"Buffer","data":[33,6,79,176,236,128,240,8,193,249,235,94,25,200,91,151,208,160,44,189]},"announce":[],"urlList":[]}}