{"title":"The Walking Dead - Season 4","uid":14544162,"size":9279172828,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:21186f38a88f7226c66240130c8685f2a6045fab&amp;dn=The+Walking+Dead+-+Season+4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"POtHS11","files":31,"time":1462557044,"description":"The Walking Dead - Season 4\r\n\r\n\r\nPlot\r\nSome months after bringing in the remaining survivors of Woodbury to the prison, Rick has stepped down as leader of the group. A flu-like contagion breaks out in the prison, fatal to many and compounding the problem when those that die reanimate as walkers and attack the others. The infected are isolated as the survivors seek medical help. Carol purposely murders two of the infected and burns their bodies to protect the group, but Rick banishes her for this decision. Eventually, they are able to treat the contagion, though have suffered great losses.\r\n\r\nMeanwhile, the Governor is abandoned by his henchmen Martinez and Shumpert following the prison attack. He discovers the Chamblers, consisting of sisters Tara and Lilly, Lilly's daughter Meghan who reminds the Governor of his daughter Penny, and their dying father. The Governor adopts a new identity, befriends the family, and helps to deal with their father when he dies and reanimates. When the Governor leaves, the Chamblers decide to stay with him. They eventually come onto a well-armed camp run by Martinez (who later reveals that he killed Shumpet after the latter got bitten unseen). The Governor kills Martinez, takes over control of the camp, and considers using their armory, including a functional tank, to take back the prison as a place for the Chamblers to stay. As he leaves with army, Meghan is attacked and killed by a walker much to Lilly's horror.\r\n\r\nAt the prison, the Governor finds Michonne and Hershel outside the fence and captures them. He uses the two as hostages to demand Rick's group leave the prison, and refuses to accept Rick's offer of co-existence. Lilly runs up with Meghan's body, and the Governor, no longer interested in simply taking the prison, decapitates Hershel and orders a full-on assault of the prison. The battle is bloody, and Rick's group is forced to scatter, with Rick and Carl distraught they cannot find their infant Judith. The Governor's militia are killed and the prison is overrun with walkers. At which point, The Governor comes close to killing Rick after pinning him down in a fistfight, but gets mortally stabbed by Michonne before being confronted by a silent Lilly while dying. Without hesitation or saying, Lily fatally executes the Governor, who finally gets his comeuppance for what he previously did and committed just moments ago.\r\n\r\nThough splintered, the members of Rick's group all start seeing signs directing them to following train tracks to Terminus with the offer of shelter and safety. Rick and Carl reunite with Michonne and have a run in with a group of bandits known as the Claimers, led by a man name Joe. Daryl protects Beth while she helps him to open up about his tragic past and overcome the death of his brother Merle. However, while fighting off walkers, Beth is abducted by men in a car, and Daryl finds himself captured by the same Claimers Rick faced. Daryl and Rick are able to overpower the Claimers by murdering Joe and his entire group. After the massacre, Rick, Daryl, Michonne and Carl continue their journey towards Terminus. Tyreese is shown to have rescued Judith along with young sisters Lizzie and Mika; they come across Carol who joins them. They discover that Lizzie has an unhealthy fascination with the walkers, and when she kills Mika to see her reanimate as one, they are forced to kill her. Glenn has rescued Tara who had hidden herself away during the prison attack, and they join up with Abraham and Rosita who are escorting Eugene, a scientist, to Washington, D.C. as he claims to know how to stop the walkers. Maggie, Sasha, and Bob eventually join them, with Maggie and Glenn elated to find each other again","torrent":{"xt":"urn:btih:21186f38a88f7226c66240130c8685f2a6045fab","amp;dn":"The+Walking+Dead+-+Season+4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21186f38a88f7226c66240130c8685f2a6045fab","infoHashBuffer":{"type":"Buffer","data":[33,24,111,56,168,143,114,38,198,98,64,19,12,134,133,242,166,4,95,171]},"announce":[],"urlList":[]}}