{"title":"Francis and Clare: The Complete Works (Classics of WS) (pdf)","uid":8196661,"size":2862707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2180bc5ce4d4c51e1091479061543e853e726489&amp;dn=Francis+and+Clare%3A+The+Complete+Works+%28Classics+of+WS%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361927563,"description":"Francis and Clare: The Complete Works (Classics of Western Spirituality series). Translation and introduction by Regis J. Armstrong OFM Cap and Ignatius C. Brady OFM; preface by John Vaughn OFM. (Paulist Press, 1982) 256 pages.\n\n\n\nFrancis, &quot;The Little Poor Man&quot; of Assisi and Clare, the woman who lived out her vision with heroic simplicity, together shaped the spirituality of early thirteenth-century Europe. Each gathered communities of like-minded persons to live out a radical commitment to the Gospel message of poverty and in the process left a legacy that has captured the imagination of both believer and non-believer throughout the ages.\n\nHere for the first time in English the complete writings of both Francis and Clare have been brought together in one volume. The book represents the first English translation based on the critical texts of the writings of Francis assembled by Kajetan Esser in his 1976 Opuscula des Heiligen Franziskus von Assisi, and the critical texts of Clare's writings done by Ignatio Omachevarria.\n\nWriting in the preface to this volume, John Vaughn, Minister General of the Friars Minor, sums up the relevance of Francis's and Clare's vision for today: &quot;[It] calls us to revitalize our lives and those of others, and indeed to renew the very life of the Church in these times of crisis.&quot;","torrent":{"xt":"urn:btih:2180bc5ce4d4c51e1091479061543e853e726489","amp;dn":"Francis+and+Clare%3A+The+Complete+Works+%28Classics+of+WS%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2180bc5ce4d4c51e1091479061543e853e726489","infoHashBuffer":{"type":"Buffer","data":[33,128,188,92,228,212,197,30,16,145,71,144,97,84,62,133,62,114,100,137]},"announce":[],"urlList":[]}}