{"title":"Lucy Pearl - Lucy Pearl","uid":5744406,"size":409072291,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:218518ff54a6da2e8ffaacd7070cd568dff3ebec&amp;dn=Lucy+Pearl+-+Lucy+Pearl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ddawg","files":-1,"time":1281147347,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/9b/1b/2378228348a0ef45c94f3110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/9b/1b/2378228348a0ef45c94f3110.L.jpg&lt;/a&gt;\n\n\nTitle: Lucy Pearl\nArtist: Lucy Pearl\nAudio CD (October 3, 2004) \nOriginal Release Date: May 23, 2000 \nNumber of Discs: 1\nGenre: R&amp;B\nFormat: flac\n\n\nTrack Listing:\n\n01. Lucy Pearl's Way\n02. Trippin'\n03. Dance Tonight\n04. LaLa\n05. Everyday \n06. Can't Stand Your Mother\n07. Good Love\n08. Without You\n09. Don't Mess with My Man\n10. Hollywood\n11. Remember the Times\n12. They Can't\n13. Do It for the People\n14. You [Feat. Snoop Dogg &amp; Q-Tip]\n15. Lucy Pearl Tells\n\n\nAmazon Review:\nWhile its songs aren't always as memorable as those of Tony Toni TonÃƒÂ© -- the million-selling but still underappreciated band that spawned singer Raphael Saadiq -- the debut of R&amp;B trio Lucy Pearl does flash some of the same smart, unpredictable spirit. Along with ex-En Voguer Dawn Robinson and former Tribe Called Quest beatmaster Ali Shaheed Muhammad, Saddiq brings his trademark eye for detail to the funky party anthem &quot;Dance Tonight,&quot; the school-days nostalgia of &quot;Remember the Times,&quot; and the self-explanatory rager &quot;Can't Stand Your Mother.&quot; Guests Q-Tip and Snoop Dogg are slyly affectionate on the love-jones celebration &quot;You.&quot; Finally, it's certain that Lucy Pearl will be remembered as 2000's only neo-soul album to include both a hard-rock workout (&quot;Hollywood&quot;) and a college marching band. \n\nAllmusic Review:\nFor many years, there has been a glut of slick, soulless R&amp;B and hip-hop where talent is obscured by the canned packaging. Members of three bands who broke from that stale scene -- En Vogue, Tony! Toni! Tone!, and A Tribe Called Quest -- have formed the alter ego Lucy Pearl. With rock star makeovers gracing the cover and good press, you'd expect some crossbred, innovative results. But the new hip-hop, soul, rock, and R&amp;B adventures are buried in the last third of the album. Until then, Dawn Robinson's rock hard vocals, Raphael Saadiq's melodic and guitar talents, and Ali Shaheed Muhammad's knack for intricate beats seem lost in a gloss of overproduction, forgettable lyrics, and cookie-cutter melodies, despite some trippy jazz beats and the witty &quot;I Can't Stand Your Mother.&quot; The groove finally gets hot with the Chic-inspired &quot;Don't Mess With My Man&quot; and blasts into the scathing music biz attack &quot;Hollywood&quot; -- is this the real Lucy Pearl? Drawing samples from Albert Collins and Notorious B.I.G., the trio mixes up a super-loose feel, acoustic guitars, old-school machine beats, and guest raps from Snoop Dogg and Q-Tip. The inventive, witty &quot;Lucy Pearl Tells&quot; looks back on college and growing up in the '80s, even calling up the Alabama A&amp;M Marching Band covering the first Lucy Pearl single &quot;Dance Tonight.&quot; \n \nAllmusic Biography:\nHip-hop/urban soul supergroup Lucy Pearl was formed in the summer of 1999 as the brainchild of Tony! Toni! TonÃƒÂ© multi-instrumentalist and vocalist Raphael Saadiq (formerly known as Raphael Wiggins), who left the band he co-founded with his brother D'Wayne in 1998. Saadiq first contacted DJ Ali Shaheed Muhammad of A Tribe Called Quest, which had disbanded after their 1998 LP The Love Movement, and then ex-En Vogue member Dawn Robinson, who had originally departed that group for a solo career in 1997 but jumped at the chance to work with Saadiq and Muhammad. Relying a great deal on live instrumentation in addition to samples and turntable work (Muhammad even plays bass and guitar), Lucy Pearl issued its self-titled debut album in the spring of 2000. \n \n","torrent":{"xt":"urn:btih:218518ff54a6da2e8ffaacd7070cd568dff3ebec","amp;dn":"Lucy+Pearl+-+Lucy+Pearl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"218518ff54a6da2e8ffaacd7070cd568dff3ebec","infoHashBuffer":{"type":"Buffer","data":[33,133,24,255,84,166,218,46,143,250,172,215,7,12,213,104,223,243,235,236]},"announce":[],"urlList":[]}}