{"title":"Dream Night Pro Live Wallpaper v1.2.8 APK (Android)","uid":11496272,"size":4635744,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:21b9c79be1a5c040c77fc6e554a4541e773b743b&amp;dn=Dream+Night+Pro+Live+Wallpaper+v1.2.8+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Pahly","files":1,"time":1416297624,"description":"This live wallpaper features a relaxing night scene, with dreamy blue color tone, sparkling and shooting stars and tree silhouette.\n\nSame as in the Sun Rise app: each morning and each night, a flock of birds will fly out and form a greeting message, and you can touch to chase them away.\n\nThe scene has full parallax effect: when you swipe to change between home screens, the scene will scroll with parallax effect. ***NOTE: if you do not like this behavior, you can disable it in the Pro version by going to Settings --&gt; Camera (Parallax) Speed --&gt; Select Stay still (no parallax) option.\n\nSounds (New Feature!):\nIn the Pro version, you can now turn on chirping sounds for birds and greeting birds.\n\nMoon:\nThe moon can be set to indicate battery level (full, half, crescent), or to show the moon in real life (calculated from the current lunar time), or it can be set to always display a shape that you like (full moon, half moon, crescent moon).\n\nStars:\nShooting stars can be set to appear more often.\nIt can also appear when you tap the screen three times (triple tap)\n\nTrees:\nIn the Pro version, the trees are fully interactible. You can touch to pull the branches, release the sleeping birds.\n\nGreeting:\nIn the Pro version, the greeting birds show on both mornings and nights.\nYou can choose to have them stay on the screen for a while after being touched.\nOr you can disable them if you don't like.\n\nOther Settings:\nAnimations can be reduced to save battery when battery is low and not charging.\nParallax scrolling effect can be tuned according to what you like.\nThere are various other settings for stars, leaves, bird, deer, swiping speed.\n\nTO USE:\nHome -&gt; Press Menu -&gt; Select Wallpapers -&gt; Select Live Wallpapers -&gt; Select Dream Night Pro from the list.\n\nWhat's in this version : (Updated : Nov 17, 2014)\nBug Fixes.\nOptimize performance and improve screen rotating speed\nBird sounds to use Ringing volume (so you can change it using Volume +/- buttons)\nImprove loading screen\nRequired Android O/S : 2.2+","torrent":{"xt":"urn:btih:21b9c79be1a5c040c77fc6e554a4541e773b743b","amp;dn":"Dream+Night+Pro+Live+Wallpaper+v1.2.8+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21b9c79be1a5c040c77fc6e554a4541e773b743b","infoHashBuffer":{"type":"Buffer","data":[33,185,199,155,225,165,192,64,199,127,198,229,84,164,84,30,119,59,116,59]},"announce":[],"urlList":[]}}