{"title":"Mary Duprie - Photographing Models","uid":5534550,"size":732778543,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:220d65174ba7491a92abac87344c7faf8f9a11f4&amp;dn=Mary+Duprie+-+Photographing+Models&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kingtux","files":-1,"time":1273026504,"description":"This video is a foundational instruction on how to work with models from the ground up. Starting with the basics of wardrobe selection, Mary points out what is important in order to fulfill the objective of a good model photo session.\n\nThis two hour journey covers all the basics and then Mary imposes her wonderful insight which she is so willing to impart. She walks the viewer through her own methods of putting a session together, styling and designing the shoot to fit a particular model and individual direction.\n\nBut there is so much more to this video, she also reveals all of her wonderful little tips and tricks using backgrounds, props, communication, methods of instructing a model, model direction, body language, hand placement, and so much more. Her powerful observation of how important hand placement is for the model is reason enough to have this instruction, in her words, &quot;I have seen so many wonderful images ruined just because of the hands.&quot;\n\nMary also uses her own prescription in using this directive tool: &quot;I now have beginner models, or models I am shooting for the first time sit and watch this video, they are so much stronger, more confident when we enter the studio.&quot;\n\nAlthough this video shows some lighting setups while Mary shoots, it is not a lighting instruction.","torrent":{"xt":"urn:btih:220d65174ba7491a92abac87344c7faf8f9a11f4","amp;dn":"Mary+Duprie+-+Photographing+Models","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"220d65174ba7491a92abac87344c7faf8f9a11f4","infoHashBuffer":{"type":"Buffer","data":[34,13,101,23,75,167,73,26,146,171,172,135,52,76,127,175,143,154,17,244]},"announce":[],"urlList":[]}}