{"title":"AutoCAD 2014 Essentials - Scott Onstott [Epub] Ehhhh","uid":8727337,"size":51512323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:220e93596d374f65e8cd3b62f281df49fd6311ec&amp;dn=AutoCAD+2014+Essentials+-+Scott+Onstott+%5BEpub%5D+Ehhhh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374533401,"description":"Overview\n\nLearn crucial AutoCAD tools and techniques with this Autodesk Official Press Book\n\nQuickly become productive using AutoCAD 2014 and AutoCAD LT 2014 with this full color Autodesk Official Press guide. This unique learning resource features concise, straightforward explanations and real-world, hands-on exercises and tutorials. Following a quick discussion of concepts and goals, each chapter moves on to an approachable hands-on exercise designed to reinforce real-world tactics and techniques. Compelling, full-color screenshots illustrate tutorial steps, and chapters conclude with related and more open-ended projects to further reinforce the chapter's lessons.\n\nStarting and ending files for the exercises are also available for download, so you can compare your results with those of professionals. You'll follow a workflow-based approach that mirrors the development of projects in the real world, learning 2D drawing skills, editing entities, working with splines and polylines, using layers and objects, creating and editing text, dimensioning, modeling in 3D, and much more.\n\nHands-on exercises and their downloadable tutorial files are based on the real-world task of drawing a house\nCovers crucial features and techniques, including 2D drawing working with layers, organizing objects with groups and blocks, using hatch patterns and gradients, using constraints and layouts, importing data, 3D modeling, and\nIncludes content to help prepare you for Autodesk's AutoCAD certification program\n\n\nProduct Details\n\nISBN-13: 9781118710357\nPublisher: Sybex, Incorporated\nPublication date: 6/28/2013\nPages: 432\n\nMeet the Author\n\nScott Onstott is a consultant, lecturer, author, and independent video producer with 15 years of experience teaching and writing about architectural and design visualization software. He is the author of the two previous editions of AutoCAD and AutoCAD LT Essentials and Enhancing Architectural Drawings and Models with Photoshop, and coauthor of AutoCAD: Professional Tips and Techniques.","torrent":{"xt":"urn:btih:220e93596d374f65e8cd3b62f281df49fd6311ec","amp;dn":"AutoCAD+2014+Essentials+-+Scott+Onstott+%5BEpub%5D+Ehhhh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"220e93596d374f65e8cd3b62f281df49fd6311ec","infoHashBuffer":{"type":"Buffer","data":[34,14,147,89,109,55,79,101,232,205,59,98,242,129,223,73,253,99,17,236]},"announce":[],"urlList":[]}}