{"title":"Christopher Moore - The Serpent of Venice.epub","uid":10055003,"size":528112,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:220fa801f78ffa656810354ef3d06943086617ca&amp;dn=Christopher+Moore+-+The+Serpent+of+Venice.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DavidTenn","files":-1,"time":1398649653,"description":"New York Times bestselling author Christopher Moore channels William Shakespeare and Edgar Allan Poe in this satiric Venetian gothic that brings back the Pocket of Dog Snogging, the eponymous hero of Fool, along with his sidekick, Drool, and pet monkey, Jeff\n\nVenice, a long time ago. Three prominent Venetians await their most loathsome and foul dinner guest, the erstwhile envoy of Britain and France, and widower of the murdered Queen Cordelia: the rascal-Fool Pocket.\n\nThis trio of cunning plotters-the merchant, Antonio; the senator, Montressor Brabantio; and the naval officer, Iago-have lured Pocket to a dark dungeon, promising an evening of sprits and debauchery with a rare Amontillado sherry and Brabantio's beautiful daughter, Portia.\n\nBut their invitation is, of course, bogus. The wine is drugged. The girl isn't even in the city limits. Desperate to rid themselves once and for all of the man who has consistently foiled their grand quest for power and wealth, they have lured him to his death. (How can such a small man, be such a huge obstacle?). But this Fool is no fool . . . and he's got more than a few tricks (and hand gestures) up his sleeve.\n\nEPub","torrent":{"xt":"urn:btih:220fa801f78ffa656810354ef3d06943086617ca","amp;dn":"Christopher+Moore+-+The+Serpent+of+Venice.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"220fa801f78ffa656810354ef3d06943086617ca","infoHashBuffer":{"type":"Buffer","data":[34,15,168,1,247,143,250,101,104,16,53,78,243,208,105,67,8,102,23,202]},"announce":[],"urlList":[]}}