{"title":"Forest Kingdom Series","uid":9499987,"size":5644513462,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2246c790a569f62175af5d4d505c195a9287b2fb&amp;dn=Forest+Kingdom+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"k1ll3rc0w80y","files":-1,"time":1390202166,"description":"-----------------------------------------------------------------------------------\n\nBlue Moon Rising\n\n-----------------------------------------------------------------------------------\n\n    Rupert didn't especially want to be a prince. And he certainly never asked to be the second son of a royal line that really didn't need a spare. So he was sent out to slay a dragon and prove himself-a quest straight out of legend. But he also discovered the kinds of things legends tend to leave out, as well as the usual demons, goblins, the dreaded Night Witch-and even worse terrors hidden in the shadows of Darkwood.\n\nRupert did find a fiery dragon-and a beautiful princess to rescue. But the dragon turned out to be a better friend than anyone back at the castle and with the evil of Darkwood spreading, Rupert was going to need all the friends he could get.\n\n-----------------------------------------------------------------------------------\n\nBlood and Honor\n\n-----------------------------------------------------------------------------------\n\n    King Malcom of the kingdom of Redhart is dead. The kingdom has been overrun by the forces of the Unreal. Statues live, corpses walk and nothing is as it seems. One of Malcom's three sons may assume the throne, but two will have to die. Jordan, the great actor, is hired to impersonate Prince Viktor, who is ill, but can't be seen in public as weak. Jordan's skills are great, but there is much he doesn't know about the prince and his ignorance could kill him if he doesn't acquire allies and learn the truth about life at Castle Midnight. He has to trust an insider and the castle Steward, Catriona Taggert, is his best hope for saving the kingdom from falling into the Unreal nightmare forever.\n\n-----------------------------------------------------------------------------------\n\nHawk and Fisher 1\n\n-----------------------------------------------------------------------------------\n\n    In the city of Haven, no one is safe. Hawk and Fisher do their best to enforce what law there is, but swords and battle-axes are sometimes no match for the supernatural. When an important politician dies behind a door locked from the inside, Captain Hawk and his wife and partner, Captain Isobel Fisher, must seek the truth amid suspects that include a sorcerer, a witch, the otherworldly creatures they can command and worse: the dead man's political rivals. Magic and corruption combine in a city where everything is for sale - except justice.\n\n-----------------------------------------------------------------------------------\n\nHawk and Fisher 2: Winner Takes all\n\n-----------------------------------------------------------------------------------\n\n    Hawk and Fisher, captains of the City Guard of Haven, are assigned to be bodyguards for a Reform candidate during an election campaign. Candidate James Adamant is beset from all sides by enemies - political, personal and supernatural. Keeping him alive long enough to count the ballots could cost the lives of both Hawk and Fisher, in a deadly game where the winner takes all.\n\n-----------------------------------------------------------------------------------\n\nHawk and Fisher 3: The God Killer\n\n-----------------------------------------------------------------------------------\n\n    Murders are taking place on Haven's Street of Gods - the gods themselves are being killed. Hawk and Fisher are assigned to work with a Seer, a Sorcerer and a Swordsman, a peacekeeping team known as the God Squad. Together, their task is to bring the killer to justice before the mounting panic erupts into an all-out War of the Gods, which could destroy the city of Haven.\n\n-----------------------------------------------------------------------------------\n\nHawk and Fisher 4: Wolf in The Fold\n\n-----------------------------------------------------------------------------------\n\n    A spy has hidden himself in Tower MacNeil and ancient castle high above the city of Haven. The lord of the manor, Duncan MacNeil has died. His son Jamie is now head of the family and his relatives have gathered for the reading of the will. But not all of the heirs will survive. Hawk and Fisher go undercover to find the spy and solve the mystery of the Tower, as death comes at them from three sides.\n\n-----------------------------------------------------------------------------------\n\nHawk and Fisher 5: Guard Against Dishonor\n\n-----------------------------------------------------------------------------------\n\n    Amid top-level peace talks between the Low Kingdoms and Outremer, the streets of Haven are ravaged by a new drug, which brings out the vicious animal instincts of its victims. The distributors always seem to be one step ahead of the City Guard force. Someone may be revealing the Guards' plans. Could Isobel Fisher be the informant? Hawk and Fisher are pulled apart by circumstance as a political truce is threatened and the death toll climbs.\n\n-----------------------------------------------------------------------------------\n\nHawk and Fisher 6: Bones of Haven\n\n-----------------------------------------------------------------------------------\n\n    As peace talks proceed between the Low Kingdoms and the country of Outremer, Hawk and Fisher are assigned to work with the Guards SWAT (Special Wizardry And Tactics) team to stop a riot in Haven's largest prison. The riot turns out to be a cover for something much more elaborate and dangerous, involving a renegade sorcerer, a terrorist who will stop at nothing to undermine the peace negotiations and an ancient magical secret.\n\n-----------------------------------------------------------------------------------\n\nBeyond The Blue Moon\n\n-----------------------------------------------------------------------------------\n\n    The city of Haven has changed Hawk and Fisher from what they once were...but what, or who, were they? Discontent and a political assassination draw them to the Forest Kingdom. King Harald is dead and the kingdom is in turmoil. The King's Questor seeks out Hawk and Fisher to find the killer break some spells and help restore a kind of peace.\n\n-----------------------------------------------------------------------------------\n\nDown Among The Dead Men\n\n-----------------------------------------------------------------------------------\n\n    There is a part of the Forest where it is always night, where the tall trees bow together to shut out the light. Men call it the Darkwood. The border fort on the edge of the Darkwood had been built to keep the peace. So far it had, but after delivery of a large consignment of gold it falls silent, answering neither natural nor supernatural communication. When the Forest King sends a small force, combining sorcerous and military skills, they find a deserted fortress soaked in blood. Magic reveals something malevolent and unreachable somewhere in the fort. But Duncan MacNeil and his company have human foes, greedy for gold, to deal with before they can take on the inhuman...\n\n-----------------------------------------------------------------------------------\n\n\n\n       _   __    __ _____   __    ___  ___  __    __ ___   ___      \n  / // | / /   / /|___ /  /__  / __/ _ / / /  ( _ ) / _ /_/\n / //_/| |/ /   / /   |_  / // / /  | | |  /  / / _ | | | _ _/\n/ __  | / /___/ /______) / _  / /___| |_| |  /  / (_) | |_| |/  \n/  / |_____/____/____// _/____/ ___/  /  / ___/ ___/ _/ ","torrent":{"xt":"urn:btih:2246c790a569f62175af5d4d505c195a9287b2fb","amp;dn":"Forest+Kingdom+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2246c790a569f62175af5d4d505c195a9287b2fb","infoHashBuffer":{"type":"Buffer","data":[34,70,199,144,165,105,246,33,117,175,93,77,80,92,25,90,146,135,178,251]},"announce":[],"urlList":[]}}