{"title":"Classic TV Serials: Yes Minister, Season Two","uid":4375328,"size":1284677615,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:22977b422ebd897bd2895e91db73f27593c1f907&amp;dn=Classic+TV+Serials%3A+Yes+Minister%2C+Season+Two&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dnayak","files":8,"time":1220380162,"description":"Classic TV Serials: Yes Minister, Season Two \n\nYes Minister is a multi-award winning satirical British sitcom written by Antony Jay and Jonathan Lynn that was first transmitted by BBC television and radio between 1980 and 1984, split over three seven-episode series. \n\nSet in the private office in Whitehall of a British government cabinet minister, the series follows the ministerial career of Jim Hacker MP, played by Paul Eddington. His various struggles to formulate and enact legislation or effect departmental changes are opposed by the will of the British Civil Service, in particular his Permanent Secretary (senior civil servant), Sir Humphrey Appleby, played by Nigel Hawthorne. His Principal Private Secretary Bernard Woolley, played by Derek Fowlds is usually caught between the two, although heavily influenced by Sir Humphrey. \n\nVideo size: 512x384 \nAudio: 32000hz, 16bps, 2ch \n\nSeries Two (1981) \n01. The Compassionate Society - Hacker is concerned about a brand new, fully staffed hospital that has no patients. \n\n02. Doing The Honours - Hacker plans to withhold honours for civil servants who do not reduce their budgets. \n\n03. The Death List - The Minister is forced to re-appraise his views on bugging and phone tapping after a death threat. \n\n04. The Greasy Pole - Plans for a new chemical factory hinge on the outcome of a so-called &quot;independent&quot; report. \n\n05. The Devil You Know - A Cabinet reshuffle coincides with a vacancy in Brussels. Hacker wonders whom the PM has in mind to fill it. \n\n06. The Quality Of Life - Hacker vows to keep open a city farm that Sir Humphrey has enabled to be bulldozed to make way for a car park for inland revenue inspectors. \n\n07. A Question Of Loyalty - Hacker and Sir Humphrey are tested by a Select Committee on their commitment to ridding wasted government expenditure. \n[Wikipedia]\n\nEnjoy! and please SEED!! Thanks.\n\nMy other torrents: http://thepiratebay.se/user/dnayak/","torrent":{"xt":"urn:btih:22977b422ebd897bd2895e91db73f27593c1f907","amp;dn":"Classic+TV+Serials%3A+Yes+Minister%2C+Season+Two","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22977b422ebd897bd2895e91db73f27593c1f907","infoHashBuffer":{"type":"Buffer","data":[34,151,123,66,46,189,137,123,210,137,94,145,219,115,242,117,147,193,249,7]},"announce":[],"urlList":[]}}