{"title":"Chronicle of a Disappearance (Elia Suleiman, 1996)","uid":4028712,"size":734472602,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:239e2f51011674d6315da9893e88eabfe68b8583&amp;dn=Chronicle+of+a+Disappearance+%28Elia+Suleiman%2C+1996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SocialTranslation","files":3,"time":1203054301,"description":"&quot;With a strong sense of irony and a deadpan visual style&quot; (Janet Maslin, The New York Times), Chronicle of a Disappearance unfolds in a series of seemingly unconnected cinematic tableaux, each of them focused on incidents or characters which seldom reappear later in the film. Among the many unrelated scenes, there is a Palestinian actress struggling to find an apartment in West Jerusalem, the owner of the Holy Land souvenir shop preparing merchandise for incoming Japanese tourists, a group of old women gossiping about their relatives, and an Israeli police van which screeches to a halt so several heavily armed soldiers can get off the car and urinate.\n\nDefined by writer/producer/director Elia Suleiman as a &quot;search for what it means to be Palestinian,&quot; this &quot;beautiful and understated&quot; film is &quot;a triumph of succinct images and adroit structure&quot; (Kevin Thomas, The Los Angeles Times). Split in two parts, &quot;Nazareth Personal Diary&quot; and &quot;Jerusalem Political Diary,&quot; Chronicle features outstanding performances by a cast of non-professional actors and combines a sarcastic sense of humor with moments of silent contemplation; it speaks of the absurdity and complexity of a people without a land.\n","torrent":{"xt":"urn:btih:239e2f51011674d6315da9893e88eabfe68b8583","amp;dn":"Chronicle+of+a+Disappearance+%28Elia+Suleiman%2C+1996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"239e2f51011674d6315da9893e88eabfe68b8583","infoHashBuffer":{"type":"Buffer","data":[35,158,47,81,1,22,116,214,49,93,169,137,62,136,234,191,230,139,133,131]},"announce":[],"urlList":[]}}