{"title":"Railworks TS2014 Just Trains Romantic Railroads - The German BR9","uid":10554698,"size":162816448,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:240d92b57485aa2f40ba107059bd710cb8503183&amp;dn=Railworks+TS2014+Just+Trains+Romantic+Railroads+-+The+German+BR9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tygn547","files":-1,"time":1405374294,"description":"This instalment in the Romantic Railroads series features the German DRG Class 95. This ten-coupled tank locomotive with a 2-10-2 wheel arrangement was procured by the Deutsche Reichsbahn (also referred to later as the Deutsche Reichsbahn-Gesellschaft, or DRG) in 1922 for hauling heavy goods trains on steep main lines. Because development of this class was begun by the Prussian state railways, it was designated as the Prussian Class T 20.\n\nThe included BR95 locomotive 'The Mountain Queen' comes in the following variants, with three versions of each locomotive included: a 'Standard' version, a 'Simple' version for easy driving and a more complex 'Expert' version that requires more skill to stop priming and even boiler explosion! \n\n77 002 (Epoch II) Grey photo-livery\n95 019 (Epoch II) Green Prussian livery\n95 010 (Epoch III) Coal burning - clean\n95 015 (Epoch III) Coal burning - rusty\n95 0022-4 (Epoch IV) Oil burning, includes the German AWS-system 'Indusi I60'\nAll the locomotives, tenders and wagons have many animated features such as opening smokeboxes with visible interiors and animated water hatches. They all feature extensive scripting to make the driving experience as authentic as possible.\n\nThe BR 95 comes ready for Quick Drive and four immersive scenarios are complete with many animated period custom objects.\n\nSee the detailed Description below for more details. \n\nImportant! Please note that this BR95 add-on is currently only compatible with Train Simulator 2014 that was upgraded from Train Simulator 2012 on 20th September 2012 or with Train Simulator 2014 brought after that date in which user have installed the European Asset pack (currently available to purchase via STEAM).","torrent":{"xt":"urn:btih:240d92b57485aa2f40ba107059bd710cb8503183","amp;dn":"Railworks+TS2014+Just+Trains+Romantic+Railroads+-+The+German+BR9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"240d92b57485aa2f40ba107059bd710cb8503183","infoHashBuffer":{"type":"Buffer","data":[36,13,146,181,116,133,170,47,64,186,16,112,89,189,113,12,184,80,49,131]},"announce":[],"urlList":[]}}