{"title":"Iron Men and Saints - History of the Crusades  (Unabridged)","uid":7377464,"size":512976253,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:24564d707641b2c24296ec6f243bfff9ecc52793&amp;dn=Iron+Men+and+Saints+-+History+of+the+Crusades++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lucybabe","files":25,"time":1340398771,"description":"Iron Men and Saints\nUNABRIDGED\nby Harold Lamb\nNarrated by Charlton Griffin\n\nThe first crusade of 1096 unleashed a wave of impassioned, personally felt, deeply pious Christian fury that was expressed in a mass movement centered in France and spreading to other European kingdoms, including Flanders, German speaking principalities, and Italy. Master historian Harold Lamb tells the incredible story of how Pope Urban II fanned the sparks of Christian anger into a mighty conflagration of righteous indignation with his speech of 1095 in Clermont. It was a speech that would occupy the hearts and minds of Europeans for over 200 years.\n\nTens of thousands of peasants, both men and women, simply left their fields and workshops and joined knights and monks on a journey to take back holy Jerusalem from the infidel Muslims. A river of humanity, often hostile and destructive, flowed across Europe and into Byzantium and Asia. Led by baronial leaders like Godfrey of Bouillon, Baldwin of Flanders, Raymond of Toulouse, Robert of Normandy, and the mighty Bohemond of Taranto, their confrontation with Islamic armies would soon follow. The results of those armed clashes produced some of the most amazing stories you will ever hear. ","torrent":{"xt":"urn:btih:24564d707641b2c24296ec6f243bfff9ecc52793","amp;dn":"Iron+Men+and+Saints+-+History+of+the+Crusades++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24564d707641b2c24296ec6f243bfff9ecc52793","infoHashBuffer":{"type":"Buffer","data":[36,86,77,112,118,65,178,194,66,150,236,111,36,59,255,249,236,197,39,147]},"announce":[],"urlList":[]}}