{"title":"Black Masculinities and Schooling: How Black Boys Survive Modern","uid":8807217,"size":1060856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:246a1f933d95d81118245116b09bef7cd4e4cd89&amp;dn=Black+Masculinities+and+Schooling%3A+How+Black+Boys+Survive+Modern&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1376366781,"description":"Black Masculinities and Schooling: How Black Boys Survive Modern Schooling | filetype: pdf\n\n\n\nThe author's ethnographic study of an inner city boys' comprehensive school reveals the positioning of Afro-Caribbean students by their teachers, peers and white students. School standards, along with the influence of the music/fashion culture outside of school, have led some boys to reappropriate sexist and racist perceptions of black masculinity. The influence of these multiple pressures on a sample group of Afro-Caribbean boys is the focus of this book. This focus can provide an understanding of the complex, contextual and shifting sites that we call 'school' and argues for more sophisticated notions of pluralism.\n\n\n\nPaperback: 220 pages\nPublisher: Trentham Books Ltd (December 1997)\nLanguage: English\nISBN-10: 1858560403\nISBN-13: 978-1858560403\n\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Black-Masculinities-Schooling-Survive-Modern/dp/1858560403/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Black-Masculinities-Schooling-Survive-Modern/dp/1858560403/&lt;/a&gt;\n\n\n\n\n\nTags: carib, social, issues, school, teacher, education, school, form, high scool, upper form, GRE, college, university, learn, learning, pedagogy, discrimination, miseducation, inner, city, poverty, ignorance, mentality, self-hate, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery,education, school, at - risk, inner, city, public, schools, disparity, economy, leader, leadership, pedagogy, educators, NCLB, schooling, kids, primary, second, higher education, college, community, PTA, homeschool, minority, black, african, american, usa, latin, latino, hispanic, asian, native american, teacher, teach, test, standard, standardized testing, \t","torrent":{"xt":"urn:btih:246a1f933d95d81118245116b09bef7cd4e4cd89","amp;dn":"Black+Masculinities+and+Schooling%3A+How+Black+Boys+Survive+Modern","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"246a1f933d95d81118245116b09bef7cd4e4cd89","infoHashBuffer":{"type":"Buffer","data":[36,106,31,147,61,149,216,17,24,36,81,22,176,155,239,124,212,228,205,137]},"announce":[],"urlList":[]}}