{"title":"VxWorks","uid":8594257,"size":1307178291,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24e8e81281744b0398e806db9ef38851009a75fb&amp;dn=VxWorks+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"erwin001","files":2,"time":1371717914,"description":"VxWorks for ARM &amp; Pentium\n\n\nDescription: VxWorks - Real Time Operating System (RTOS), developed by Wind River Systems (USA), focused on the use of embedded computers that are in hard real-time systems. VxWorks is a system with cross-development tools software application. In other words, development is happening on the computer tool called the host, for later use it on the target machine - target.\nLike most other real-time OS, VxWorks includes a multitasking kernel with preemptive scheduler and a fast response to interrupts, inter-process communication and synchronization, as well as the file system and the network subsystem (protocol stack TCP / IP). The package includes tools for cross-compiling, monitoring performance (WindView), a remote symbolic debugging, and emulation of different processors. Additionally provided significant number of different protocol stacks, graphics and other subsystems as most of Wind River Systems, and by a third party. The set of supported VxWorks embedded platform is one of the most extensive of real-time operating systems.","torrent":{"xt":"urn:btih:24e8e81281744b0398e806db9ef38851009a75fb","amp;dn":"VxWorks+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24e8e81281744b0398e806db9ef38851009a75fb","infoHashBuffer":{"type":"Buffer","data":[36,232,232,18,129,116,75,3,152,232,6,219,158,243,136,81,0,154,117,251]},"announce":[],"urlList":[]}}