{"title":"Law and the Humanities: An Introduction (2009)","uid":8390678,"size":2830679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:253bf45ef823d2120c72bdaedd23895002090208&amp;dn=Law+and+the+Humanities%3A+An+Introduction+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"workerbee","files":-1,"time":1366421128,"description":"Austin Sarat, Matthew Anderson, and Cathrine O. Frank, editors - Law and the Humanities: An Introduction (Cambridge University Press, 2009).\n\nISBN: 9780521899055 | 552 pages | PDF\n\nLaw and the Humanities: An Introduction brings together a distinguished group of scholars from law schools and an array of the disciplines in the humanities. Contributors come from the United States and abroad in recognition of the global reach of this field. This book is, at one and the same time, a stock taking both of different national traditions and of the various modes and subjects of law and humanities scholarship. It is also an effort to chart future directions for the field. By reviewing and analyzing existing scholarship and providing thematic content and distinctive arguments, it offers to its readers both a resource and a provocation. Thus, Law and the Humanities marks the maturation of this &quot;law and&quot; enterprise and will spur its further development.\n\nContributors: Austin Sarat, Matthew Anderson, Cathrine Frank, Costas Douzinas, Kathryn Abrams, Steven L. Winter, Chaya Halberstam, Matthew Smith, Susan Sage Heinzelman, Richard Sherwin, Susanna Lee, Christine Farley, Penny Pether, Ravit Reichman, Harriet Murav, Ariela Gross, Lindsay Farmer, Jan-Melissa Schramm, Desmond Manderson, Karl Shoemaker.\n","torrent":{"xt":"urn:btih:253bf45ef823d2120c72bdaedd23895002090208","amp;dn":"Law+and+the+Humanities%3A+An+Introduction+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"253bf45ef823d2120c72bdaedd23895002090208","infoHashBuffer":{"type":"Buffer","data":[37,59,244,94,248,35,210,18,12,114,189,174,221,35,137,80,2,9,2,8]},"announce":[],"urlList":[]}}