{"title":"Batman &amp; Robin v1 01-26 (2009-2011, Digital, Zone-Empire)","uid":9536046,"size":845838947,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:25474869fafef9d273abf45a7881545ad0785aa1&amp;dn=Batman+%26amp%3B+Robin+v1+01-26+%282009-2011%2C+Digital%2C+Zone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1390935203,"description":"For more information on this series, please visit the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Batman_and_Robin_(comic_book)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Batman_and_Robin_(comic_book)&lt;/a&gt;\n\nGrant Morrison's epic, re-defining Batman run continued with this spectacular series, of which he wrote the first 16 issues. With Bruce Wayne seeingly dead due to the events of Final Crisis, Dick Grayson finally assumed the mantle of Batman - only to find himself paired with an ambitious and impetuous upstart Robin in Damian Wayne that he certainly didn't expect to work with, let alone mentor. The inverson of the relationship between Batman and Robin is exceptionally well-written, along with the dialogue that highlights Damian's youth and inexperience along with his arrogance, disobedience, with and lethality. Grayson's doubts and fears in his new role are emotional to behold for anyone who is aware of his history and especially his sometimes contentious but often-times respected and successful partnership with Bruce Wayne. Some of my favorite moments are the quiet ones, such as Commissioner Gordon recognizing this Batman as familiar - but different then the one he is used to. Or Damian relentless pressing his luck and ignoring all advice only to find himself developing a rapport with Grayson such as when his life is saved. There is plenty of bombast and action as well; the Dynamic Duo has rarely been as dynamic on the page. The encounters with Professor Pyg are frenetic and tense (while also featuring a healty dose of humor AND macabre), and the battles with the resurrected Jason Todd are an immense challenge to both Dick and Damian, physically and emotionally. The &quot;Blackest Night&quot; tie-in issues (7-9) are superb and both are forced to directly confront the immediate reality of Bruce's &quot;death&quot; - but things are not what they seem and Morrison is weaving a much larger story within this Final Crisis-related framework. The conclusion of Morrison's work here resolves plot threads from the beginning of his run while giving Batman &amp; Robin a very unexpected partner, along with a wild and tense climax. The work after Morrison is also great, with the new dynamic of exploring father and son as they learn to work and live together, and trust each other - not an easy task for either. The art is regularly stunning, especially the early work of Frank Quitely and Phillip Tan, and these new digital copies show everything off crisply and cleanly. Thanks to Zone-Empire for the scans - please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:25474869fafef9d273abf45a7881545ad0785aa1","amp;dn":"Batman+%26amp%3B+Robin+v1+01-26+%282009-2011%2C+Digital%2C+Zone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25474869fafef9d273abf45a7881545ad0785aa1","infoHashBuffer":{"type":"Buffer","data":[37,71,72,105,250,254,249,210,115,171,244,90,120,129,84,90,208,120,90,161]},"announce":[],"urlList":[]}}