{"title":"A Series of Unfortunate Events by Lemony Snicket RELOADED","uid":8246589,"size":2724712,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:254ecf31173fd6991dc2dee6e15817e42281e427&amp;dn=A+Series+of+Unfortunate+Events+by+Lemony+Snicket+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"NewSky000","files":14,"time":1363075121,"description":"Title: A Series of Unfortunate Events\n\nAuthor: Lemony Snicket\n\nBook(s): 13\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Mystery, Humour, Fantasy, Children, Young Adult\n\nSummary:\n\nDear Reader, \n\nI'm sorry to say that the book you are holding in your hands is extremely unpleasant. It tells an unhappy tale about three very unlucky children. Even though they are charming and clever, the Baudelaire siblings lead lives filled with misery and woe. From the very first page of this book when the children are at the beach and receive terrible news, continuing on through the entire story, disaster lurks at their heels. One might say they are magnets for misfortune.\n\nIn this short book alone, the three youngsters encounter a greedy and repulsive villain, itchy clothing, a disastrous fire, a plot to steal their fortune, and cold porridge for breakfast.\n\nIt is my sad duty to write down these unpleasant tales, but there is nothing stopping you from putting this book down at once and reading something happy, if you prefer that sort of thing. \n\nWith all due respect,\nLemony Snicket - Goodreads Summary of The Bad Beginning (A Series of Unfortunate Events #1)\n\nNote: Recommendable for a younger audience, but open to readers of all ages. Beware, keep in mind that Lemony had warned you once you finish the series, and reflect on how horribly cheated you felt of a good book to read. But recommendable to those looking for a good book to read. :P\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nRELOADED: This torrent is a reload of the original for the purpose that it had belonged to the first generation of torrents MastermindTTA had uploaded. It lacked quality, and this torrent is improved with unique and new covers, fixed the missing chapters, included good metadata and a [helpful] readme file. Enjoy!\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:254ecf31173fd6991dc2dee6e15817e42281e427","amp;dn":"A+Series+of+Unfortunate+Events+by+Lemony+Snicket+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"254ecf31173fd6991dc2dee6e15817e42281e427","infoHashBuffer":{"type":"Buffer","data":[37,78,207,49,23,63,214,153,29,194,222,230,225,88,23,228,34,129,228,39]},"announce":[],"urlList":[]}}