{"title":"American Farmer - The Heart of Our Country (Society Photography ","uid":9061682,"size":112295879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2669cbe549742fe113460a94dceee952a3d5db3f&amp;dn=American+Farmer+-+The+Heart+of+Our+Country+%28Society+Photography+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1382050865,"description":"American Farmer: The Heart of Our Country\nWelcome Books | Katrina Fried | 2008 | HQ PDF | ISBN: 1599620472 | 278 pages | 107 Mb\n\nWhen photographer Paul Mobley set out to capture the soul of America's farming communities, he discovered a culture defined by tradition, integrity, and hard work, and comprised of the most authentic and generous individuals he's ever encountered. Traveling across the country from Tennessee to Montana, Mobley and his camera were welcomed into the homes of over one hundred farming families, who graciously shared their personal histories along with the fruits of their labor. To spend time with them was to turn back the clock--to an era when there were no locks on doors, no urban sprawl, and no virtue more prized than common decency. Children still move across the street and not across the state when they grow up, and parents move back in with their children whern they grow old. Story after story, visit after visit, Mobley slowly came to know the independent farmer's spirit both from behind the lens and over the dinner table.\n\nThe result is a stunning series of portraits and direct quotes that collectively chronicle the life of the American farmer. Each image offers an unvarnished and intimate look inside the hardships and joys of a quickly disappearing lifestyle--one that once defined our national identity and now struggles just to keep a foothold. And even as encroaching cities threaten their livelihoods, these men and women continue to find sustenance in the same basic human values they were raised with. American Farmer is an inspirational reminder of what it means to live with simplicity and contentment, in a world that is driven by excess. This vivid portfolio is accompanied by anecdotes and memories in the farmer's own words that are both a testament to their enduring hospitatlity and a moving glimpse into their daily routines and family histories. But what you will read first, and foremost, are their faces. From Bruce Crump, a citrus farmer in Florida; to Patsy Fribley, a stockyard dealer from Montana; to Thurston Wilber, a Maine lobsterman, Mobley's intense and beautiful portraits capture the furrows of fields lining their brows, the crevices of drought creasing the corners of their mouths, and the grains of truth in their squinted eyes.\n\n35 states included: Alabama, Alaska, Arizona, Arkansas, California, Colorado, Florida, Georgia, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Michigan, Mississippi, Missouri, Montana, Nebraska, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon.","torrent":{"xt":"urn:btih:2669cbe549742fe113460a94dceee952a3d5db3f","amp;dn":"American+Farmer+-+The+Heart+of+Our+Country+%28Society+Photography+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2669cbe549742fe113460a94dceee952a3d5db3f","infoHashBuffer":{"type":"Buffer","data":[38,105,203,229,73,116,47,225,19,70,10,148,220,238,233,82,163,213,219,63]},"announce":[],"urlList":[]}}