{"title":"Dizzy Gillespie - On the french Riviera [EAC FLAC]","uid":9548858,"size":264542145,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:269d77ced16c6c222c3d0c47cc597d293f8d850a&amp;dn=Dizzy+Gillespie+-+On+the+french+Riviera+%5BEAC+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"jamezua","files":-1,"time":1391191738,"description":"&quot;Dizzy on the French Riviera&quot; combines music from two of Gillespie's 1962 small-group sessions, a June session recorded in France (Juan-Les-Pins) that reportedly produced tracks 1, 5 &amp; 7 and a May session actually recorded in NYC that produced the remainder. The recordings are unified, though, by the presence of two unique soloists sharing the limelight with Dizzy -- Texan Leo Wright on woodwinds and South American composer Lalo Schifrin on piano, both of whom would be replaced in Gillespie's entourage within the year -- as well as by a decidedly exotic flavor combining bossa nova composition, multiple percussionists, and occasional gypsy-jazz guitar with Gillespie's growing tendency toward Afro-Cuban flavors in his soloing.\n\nThe sound of waves and childrens voices at the start and finish of the album conjure sunshine and good feelings, and frame some of the best jazz ever. This is an enchanting album, and contains the best versions of some of Dizzy finest compositions, played by a group that really feels like it's together... Dizzy plays with heart, eschewing his all too typical excess showmanship, Lalo Schifrin plays some his best piano solos, foregoing movie cliches, Leo Wright's flute and sax are splendid, Pepito Riestria's percussion and the rhythm section of Rudy Collins and Chris White really move, and as a special bonus, a couple of tracks feature neglected Hungarian gypsy jazz guitarist Elek Bacsik.\n\nTrack Listings\n\n1. No More Blues\n2. Long, Long Summer\n3. I Waited for You\n4. Desafinado\n5. Here It Is\n6. Pau de Arara\n7. For the Gypsies ","torrent":{"xt":"urn:btih:269d77ced16c6c222c3d0c47cc597d293f8d850a","amp;dn":"Dizzy+Gillespie+-+On+the+french+Riviera+%5BEAC+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"269d77ced16c6c222c3d0c47cc597d293f8d850a","infoHashBuffer":{"type":"Buffer","data":[38,157,119,206,209,108,108,34,44,61,12,71,204,89,125,41,63,141,133,10]},"announce":[],"urlList":[]}}