{"title":"Western Pulp Magazines Update 1","uid":12132889,"size":7690492740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28a890b156552a872d53b42a58701974c119d4f6&amp;dn=Western+Pulp+Magazines+Update+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Gorgon776","files":204,"time":1437090261,"description":"These magazines and books were scanned by members of pulpscans, pbscans and many others in an effort to preserve our cultural heritage. Many of them have donated countless hours scanning, editing and posting these magazines because we love them and don't want them to crumble to dust and be forgotten.\n\nFeel free to use these collections in any way you want. All we ask is that you leave the scanner tags intact.\n\nIf you would like to help scan every magazine and book ever printed (or just get the scans as they are released), join pulpscans at:\n &lt;a href=&quot;\nhttps://groups.yahoo.com/neo/groups/pulpscans/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://groups.yahoo.com/neo/groups/pulpscans/&lt;/a&gt;\n\nand\n &lt;a href=&quot;\nhttps://groups.yahoo.com/neo/groups/pbscans/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://groups.yahoo.com/neo/groups/pbscans/&lt;/a&gt;\n\nand post a message saying hello. You'll need a yahoo email account (free) to join the groups.\n\nSay hello, let us know your interests and don't be shy about offering to help. Many older magazines and pulps can be scanned with little or no damage to the paper copies and we're happy to help a new scanner along. Other ways to help include distributing the scans, helping to seed torrents (or donating a seedbox), donating to group buys of pulps in bulk, or donating your pulps and magazines to the group for scanning. Condition of the magazines is not important so if you have a box of &quot;reading copies&quot; you want out of the house, here's your chance :)\n\nAll genres are welcome.\n\nA note about the torrents:\n\nWe're seeding collections of magazines sorted by genre. The total for all the collections (Books, Counter Culture (hippie 60's stuff), Detective-Mystery, Dime Novels, Fanzines, General Fiction, Hero Pulps, Horror, Humor, Men's Magazines (which will be broken into sub-genre collections), Misc, Music, Newspapers, News &amp; Review, Romance, SF, Story Papers, True Crime, Western, and Women's Magazines) comes to a little more than 5 TB of data and contains approximately 16,000 individual magazines and 11,000 books. The scans are almost all in cbr/cbz format, with some pdf and a very few html versions. Scanning the material in this way preserves the layout of the material, advertising, illustrations, etc and we believe it is the best way to make this material available for future generations.\n\nThe collections will be torrented in pieces. When the entire collection is out there a torrent will be created and seeded of the entire collection. Folder structures will be maintained, so if you have any of the pieces just point your torrent client to the appropriate folder when downloading the entire collection and whatever you have will be available for seeding.Special thanks go to Carlo, who maintains a list of the scanned magazines (Without that list, these torrents would not be possible), Lenny Silver (who donated his collection for scanning), members of pulpscans and pbscans who funded the distribution of The Lenny Silver collection (which, I am told, involved renting a truck and a lot of shipping fees), Dave Reeder for starting pulpscans, and all the scanners who have shared.\n\nFilenames in the collection will be harmonized with Carlo's list.If a different filename, or a different file, is used han the one on Carlo's list, the changes will be documented in the &quot;filename changes.txt&quot; included in each individual magazine folder.\n\nThe Elves","torrent":{"xt":"urn:btih:28a890b156552a872d53b42a58701974c119d4f6","amp;dn":"Western+Pulp+Magazines+Update+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28a890b156552a872d53b42a58701974c119d4f6","infoHashBuffer":{"type":"Buffer","data":[40,168,144,177,86,85,42,135,45,83,180,42,88,112,25,116,193,25,212,246]},"announce":[],"urlList":[]}}