{"title":"Jodi Taylor - Happy Father's Day, Daddy 720p","uid":12402207,"size":1039729272,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:29196f790742b41fcb7fdb65f7c1732f353af779&amp;dn=Jodi+Taylor+-+Happy+Father%27s+Day%2C+Daddy+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TKTh3K1ng","files":2,"time":1442044344,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/CMj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/CMj&lt;/a&gt;\n\nJodi Taylor - A Special Father's Day Surprise: Every year, my daughter and my wife get me some cheesy tie for Father's Day. But with my wife out of town for this year's special day, my little girl has decided to take the gift giving into her own hands. I find her sprawled out on my bed, wearing nothing but one of my work shirts and a tie. She tells me how badly she's been wanting to do this, and her Mom being gone is the perfect time. She slowly strips and teases me, showing off her gorgeous young body. Then she starts playing with her pussy, never taking her eyes off of me. After she cums, still wearing my tie, she tells me she did it to get herself nice and wet for Daddy's dick...\n\nJodi - Daddy's Girl Has New Curves: Jodi is running late for dance class. I'm paying a small fortune for her to take these lessons, so there's no way she's just going to lay in bed all day. But when I insist that she get up, she tells me that the other girls make fun of her for how big her butt looks in her tights. I reassure her that the tights are appropriate, and that the other girls are just jealous of her new curves. I help her out of her clothes so she can change into something she feels more comfortable in. But when she starts grinding her ass against me, I just can't hold back any longer","torrent":{"xt":"urn:btih:29196f790742b41fcb7fdb65f7c1732f353af779","amp;dn":"Jodi+Taylor+-+Happy+Father%27s+Day%2C+Daddy+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29196f790742b41fcb7fdb65f7c1732f353af779","infoHashBuffer":{"type":"Buffer","data":[41,25,111,121,7,66,180,31,203,127,219,101,247,193,115,47,53,58,247,121]},"announce":[],"urlList":[]}}