{"title":"Fiebre del Sabado Noche","uid":4300362,"size":734111744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:294002cbae265ce89a388fae0f141ac1c96d3ed9&amp;dn=Fiebre+del+Sabado+Noche&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jurimu","files":1,"time":1216240868,"description":"Fiebre del SÃƒÂ¡bado Noche\nDirector John Badham\nActores John Travolta, Karen Lynn Gorney, Barry Miller, Joseph Cali, Paul Pape, Donna Pescow, Bruce Ornstein, Julie Bovasso, Martin Shakar, Sam Coppola\nDuraciÃƒÂ³n 114 min\nDistribuidor Paramount\nVideo Pal\nIdioma EspaÃƒÂ±ol\nSinopsis\nVuelve a descubrir la popular pelÃƒÂ­cula que convirtiÃƒÂ³ a John Travolta en una estrella internacional e hizo que el mundo entero volviera a los trajes de poliÃƒÂ©ster, los zapatos de plataformas y a las discos.\nFiebre del SÃƒÂ¡bado Noche es mucho mÃƒÂ¡s que una celebraciÃƒÂ³n del ambiente disco, tambiÃƒÂ©n narra la emocionante historia de un joven que lucha para salir de los lÃƒÂ­mites que le impone su rutinaria existencia. Travolta fue nominado al Premio de las Academia (R) por su sensible interpretaciÃƒÂ³n de Tony Manero, empleado de unos almacenes en Brooklyn que sÃƒÂ³lo logra escapar de su monÃƒÂ³tona vida en la pista de la discoteca. Con una banda sonora ya clÃƒÂ¡sica de los Bee Gees, Fiebre del SÃƒÂ¡bado Noche es un legendario icono de la cultura y cine norteamericanos.\nDesde la electrizante actuaciÃƒÂ³n nominada al Oscar de John Travolta hasta sus coreografÃƒÂ­as inolvidables, pasando por su triunfal banda sonora de los Bee Gees, Fiebre del SÃƒÂ¡bado Noche es un hito del cine que logrÃƒÂ³ captar la atenciÃƒÂ³n del mundo entero. Ahora puedes volver a sentir la fiebre con esta EdiciÃƒÂ³n Especial para Coleccionistas del 30 Aniversario que se adentra en los secretos del mito, con materiales extra sobre la historia, cultura y la moda disco, el ÃƒÂ©xito de su banda sonora, un reportaje exclusivo sobre Travolta, toda una leyenda de Hollywood, y mucho mÃƒÂ¡s. Hoy mÃƒÂ¡s que nunca, Fiebre del SÃƒÂ¡bado Noche es la ÃƒÂºnica pelÃƒÂ­cula que te harÃƒÂ¡ sentir desde lo mÃƒÂ¡s profundo el baile","torrent":{"xt":"urn:btih:294002cbae265ce89a388fae0f141ac1c96d3ed9","amp;dn":"Fiebre+del+Sabado+Noche","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"294002cbae265ce89a388fae0f141ac1c96d3ed9","infoHashBuffer":{"type":"Buffer","data":[41,64,2,203,174,38,92,232,154,56,143,174,15,20,26,193,201,109,62,217]},"announce":[],"urlList":[]}}