{"title":"Night of the Living Dead (01 - 05 + Aftermath (01 - 12) + Extras","uid":10697801,"size":1070050096,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2975ea4fc64fcd4b8bfcd38924bd4ca5496705fa&amp;dn=Night+of+the+Living+Dead+%2801+-+05+%2B+Aftermath+%2801+-+12%29+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"nemesis43","files":58,"time":1407194147,"description":"Night of the Living Dead (01 - 05 + Aftermath (01 - 12) + Extras) (2006 - 2013) (Digital) (Minutemen &amp; Empire) \n\n\nFans have demanded it, the most unprecedented and horrifying night in American history continues as the next chapter of Night of the Living Dead is revealed at last!\n\nSet on that fateful evening in 1968, shocking reports from rural areas continue to flood the airwaves with accounts of the recently deceased rising up to kill the living. Now government officials begin counter-measures to calm an increasingly panic-stricken public. Questioning whether or not the unbelievable stories are truth or simply an elaborate hoax perpetrated by militants opposed to the Vietnam War, the attention of the nation's Capitol is focused on a threat more believable, as thousands of protesters converge on Capitol Hill to voice their opposition to the War.\n\nBut with National Guard forces spread impossibly-thin to deal with civil unrest, Washington D.C. is completely unprepared for an event that will forever change the course of the country, and perhaps the world, as an unstoppable army of the undead begins to flood the city, bringing their blood-thirsty reign of terror to the very steps of the White House!\n\nWritten by the smash duo of Mike Wolfer and John Russo, the original film co-writer, this blood-drenched five-issue series features new artist Tomas Aira. Don't miss all the terrifying covers, Paul (Freakangels) Duffield provides the Regular edition, Raulo (Cpt Swing) Caceres melts eyeballs with the Wraparound cover, and twisted Matt Martin splatters the Gore covers all over the page.","torrent":{"xt":"urn:btih:2975ea4fc64fcd4b8bfcd38924bd4ca5496705fa","amp;dn":"Night+of+the+Living+Dead+%2801+-+05+%2B+Aftermath+%2801+-+12%29+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2975ea4fc64fcd4b8bfcd38924bd4ca5496705fa","infoHashBuffer":{"type":"Buffer","data":[41,117,234,79,198,79,205,75,139,252,211,137,36,189,76,165,73,103,5,250]},"announce":[],"urlList":[]}}