{"title":"Railworks TS2016 DTG  Semmeringbahn Route Add-on","uid":13012048,"size":1099097849,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:29f8b86a0cfb020d209029109b6368494604cf76&amp;dn=Railworks+TS2016+DTG++Semmeringbahn+Route+Add-on&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TS2015","files":1,"time":1450262149,"description":"The picture postcard scenery of the Austrian Alps dominate the stunning new Semmeringbahn: Mürzzuschlag to Gloggnitz route for Train Simulator. \r\n\r\nBuilt by more than 20,000 worked between 1848 and 1854, the 41km (25 mile) Semmeringbahn (Semmering Railway) was the first standard gauge mountain railway ever constructed and is considered the first ‘true’ mountain railway, due to its immense change in altitude and challenging terrain it traverses throughout the route. \r\n\r\nConnecting the Austrian towns of Mürzzuschlag and Gloggnitz in the east of the country, the Semmeringbahn features some of the most stunning railway scenery seen anywhere in the world – two-storey high viaducts, more than 100 stone bridges, 16 tunnels and 11 iron bridges are prominent throughout the route. The line itself sees a 457m altitude difference in its 41km in length, and 60% of the track is on a 2-2.5% (around 1:40) gradient, with as much as 16% featuring very tight radius curves at only 190m. \r\n\r\nFrom Gloggnitz in the east, the line passes through a number of small hamlets high in the mountainous Alps to Payerbach-Reichenau, where local passenger services from Vienna terminate. It is here that one of the Alps’ major ski resorts is located, as well as a heritage railway running in the mountains. Heading southwards, the line crosses the stunning Schwarza Viaduct before Küb and Klamm-Schottwein, where the landscape is most famous for the expansive S6 motorway viaduct. \r\n\r\nBetween Klamm-Schottwein and Breitenstein, trains pass through probably the most famous part of the route, The Viaduct – a spectacular open-sided tunnel that provides a photographer’s dream setting. From Semmering (the highest point on the route), the line heads downhill towards Mürzzuschlag, where large freight yards and a locomotive maintenance and servicing yard dominate. \r\n\r\nAt the time of opening, the incredible grades and tight curves resulted in the need for new locomotives that could more easily handle the task. Thus, a competition was held to find traction that was able to traverse the grades and curves while maintaining a minimum speed of 11.5km/h (7mph). \r\n\r\nEventually, the railway settled for the Engerth locomotive, a unique articulated tender locomotive that had a top speed of 19km/h (11mph) up the steepest gradients thanks to the weight of the fuel and water being spread across all the axles, providing more traction. \r\n\r\nThe increased accessibility to the mountains thanks to the railway saw a number of purpose-built Alpine resorts, with parts of the railway becoming known for their summer orientated architecture such as hotels and villas. It also lead to the construction of residential areas, creating a new form of landscape not usually seen on mountainous terrain.\r\n\r\nToday, the line is owned and operated by the Austrian Federal Railways some 160 years after its construction and plays a key role in connecting Vienna and Graz as part of the ÖBB Southern Railway. It was also listed as a UNESCO World Heritage site in 1998. \r\n\r\nHowever, despite the fantastic scenery, towering bridges, challenging grades and rich history, a new 27.3km (16 mile) tunnel is being constructed under the mountains to bypass the Semmeringbahn, and is expected to open in 2024. \r\n\r\nIncluded with this primarily freight route is a Class 1116 in ÖBB Livery, Habbins bogie van wagons, Zags bogie tanker wagons, SGGRSS container wagons, TDRRS two-axle hopper wagons and Bmz Eurofima coaches.\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:29f8b86a0cfb020d209029109b6368494604cf76","amp;dn":"Railworks+TS2016+DTG++Semmeringbahn+Route+Add-on","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29f8b86a0cfb020d209029109b6368494604cf76","infoHashBuffer":{"type":"Buffer","data":[41,248,184,106,12,251,2,13,32,144,41,16,155,99,104,73,70,4,207,118]},"announce":[],"urlList":[]}}