{"title":"The Silk Road in World History (The New Oxford World History)","uid":5806633,"size":3414985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ae2c8681967f25e19e24102ae201d9321777b5c&amp;dn=The+Silk+Road+in+World+History+%28The+New+Oxford+World+History%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1283465849,"description":"\n\nPublisher: Oxford University Press, USA \nNumber Of Pages: 168 \nPublication Date: 2010-07-09  \n\nThe Silk Road was the contemporary name for a complex of ancient trade routes linking East Asia with Central Asia, South Asia, and the Mediterranean world. This network of exchange emerged along the borders between agricultural China and the steppe nomads during the Han Dynasty (206BCE-220CE), in consequence of the inter-dependence and the conflicts of these two distinctive societies. In their quest for horses, fragrances, spices, gems, glassware, and other exotics from the lands to their west, the Han Empire extended its dominion over the oases around the Takla Makan Desert and sent silk all the way to the Mediterranean, either through the land routes leading to the caravan city of Palmyra in Syria desert, or by way of northwest India, the Arabian Sea and the Red Sea, landing at Alexandria. The Silk Road survived the turmoil of the demise of the Han and Roman Empires, reached its golden age during the early middle age, when the Byzantine Empire and the Tang Empire became centers of silk culture and established the models for high culture of the Eurasian world. The coming of Islam extended silk culture to an even larger area and paved the way for an expanded market for textiles and other commodities. By the 11th century, however, the Silk Road was in decline because of intense competition from the sea routes of the Indian Ocean.\n\nUsing supply and demand as the framework for analyzing the formation and development of the Silk Road, the book examines the dynamics of the interactions of the nomadic pastoralists with sedentary agriculturalists, and the spread of new ideas, religions, and values into the world of commerce, thus illustrating the cultural forces underlying material transactions. This effort at tracing the interconnections of the diverse participants in the transcontinental Silk Road exchange will demonstrate that the world had been linked through economic and ideological forces long before the modern era.\n\n\n\n","torrent":{"xt":"urn:btih:2ae2c8681967f25e19e24102ae201d9321777b5c","amp;dn":"The+Silk+Road+in+World+History+%28The+New+Oxford+World+History%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ae2c8681967f25e19e24102ae201d9321777b5c","infoHashBuffer":{"type":"Buffer","data":[42,226,200,104,25,103,242,94,25,226,65,2,174,32,29,147,33,119,123,92]},"announce":[],"urlList":[]}}