{"title":"GoldenEye Source v4.1 full","uid":6039843,"size":1253512146,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2ae393592c8d2330d9cf565e941901eb6667fa0d&amp;dn=GoldenEye+Source+v4.1+full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"theanykey","files":2,"time":1292344155,"description":"GoldenEye: Source is a total conversion modification of Half-Life 2. It is a fan made recreation, released for free, with only one goal in mind; to bring the memories and experiences from the original GoldenEye64 back to life using Source Technology. We want you to look at this mod and remember the first best multiplayer first-person shooter ever made. We are doing our best to bring in the opinions of the community to create a game that everyone is going to enjoy. But, we are not here to recreate the game exactly how it was in GE64, a lot of things have changed since they first designed that game, mainly in technology and gamers experiences. We are here to take the game even further but at the same time provide a lot of those fun elements that hardcore GE64 fans will enjoy. We've got experienced team members all across the board, from professional level, to amateurs looking to make it into the business working hard to make this dream a reality.\n\nWe are bringing GoldenEye: Source out of Beta status with this update. This is the full installation for players. This installation will remove your existing Beta 4.0 installation if it exists as this update is not compatible with previous versions. Your achievements will be backed up automatically, but we suggest you back them up yourselfs by copying 'gesource/gamestate.txt' to your desktop PRIOR to installation of v4.1! \n\nRequires ownership of a Source Engine game to play.","torrent":{"xt":"urn:btih:2ae393592c8d2330d9cf565e941901eb6667fa0d","amp;dn":"GoldenEye+Source+v4.1+full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ae393592c8d2330d9cf565e941901eb6667fa0d","infoHashBuffer":{"type":"Buffer","data":[42,227,147,89,44,141,35,48,217,207,86,94,148,25,1,235,102,103,250,13]},"announce":[],"urlList":[]}}