{"title":"Power Rangers Time Force (Legacy Collection and Beyond)","uid":11740456,"size":15379758733,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2aea64617ca00475004d170e2919ceaebb174ad5&amp;dn=Power+Rangers+Time+Force+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":7,"uploader":"CeraKesh","files":41,"time":1425774438,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette3.wikia.nocookie.net/powerrangers/images/e/e0/Poster-prtf.jpg/revision/latest?cb=20120120090205[/img]\nPower Rangers: Time Force (often abbreviated as PRTF) or Time Force is the ninth season of the Power Rangers franchise, based on the Super Sentai series Mirai Sentai Timeranger (Future Squadron Timeranger). It ran with a total of 40 half-hour episodes from February to November of 2001 and was the last full season to completely air on Fox Kids following the sale of Fox Family Worldwide, which included Fox Family, Fox Kids and Saban Entertainment being purchased by The Walt Disney Company. Time Force was the last season to be produced by the defunct Saban Entertainment group. 10 years later Saban re-emerged as Saban Brands and announced Power Rangers Samurai.\n\nTime Force's plot and structure follows similar themes established by In Space and Lost Galaxy before it, employing what many fans considered to be &quot;darker&quot; and more &quot;mature&quot; themes (such as death, implied racism and morally gray characters). Because of this, it is often compared to the precedessor of the season before it. Time Force is also the first of many Power Rangers seasons to adapt the original plot of its Sentai counterpart almost to the letter, with only minor changes to suit its characters.\n\nThis was the final Power Rangers season that Judd Lynn collaborated on until Power Rangers RPM. His writing partner at the time, Jackie Marchand, likewise departed for a year before returning to work on Power Rangers Ninja Storm.\n\nIn the year 3000 humankind has evolved into a utopia where a police organization called Time Force has tracked down every single criminal - except for Ransik, who hijacks a prison full of cryogenically frozen convicts and escapes to the year 2001 in the hopes of altering the course of history, but not before fatally striking down the Red Time Force Ranger, Alex. The four Time Force officers responsible for Ransik's escape, including Alex's fiance, Jen, pursue him through time and end up in the fictional city of Silver Hills, where they are acquainted with the 21st century by Wesley Collins, the son of a rich industrialist and a dead ringer for Alex, due to him being Alex's distant, but still direct, ancestor. Despite Jen's initial reluctance, Wes eventually joins the team as the 5th member and new Red Ranger. The Time Force Rangers both defend Silver Hills from the onslaught of Ransik's Mutants and attempt to keep the original timeline from drastically altering","torrent":{"xt":"urn:btih:2aea64617ca00475004d170e2919ceaebb174ad5","amp;dn":"Power+Rangers+Time+Force+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aea64617ca00475004d170e2919ceaebb174ad5","infoHashBuffer":{"type":"Buffer","data":[42,234,100,97,124,160,4,117,0,77,23,14,41,25,206,174,187,23,74,213]},"announce":[],"urlList":[]}}