{"title":"Serani - No Games  (Xvid-2nafish)","uid":5027674,"size":63546758,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2b0a6dfa618ae6076c873b01b7370b768ce5da69&amp;dn=Serani+-+No+Games++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"2nafish","files":-1,"time":1248778417,"description":"Source: TV\n\nFile Info:\n\nDuration : 00:03:10\n\n[Video]\nResolution : 640x480\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1126 Kbps\nQuality Factor : 0.13 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 1536 Kbps\n\n\n&quot;No Games&quot; is a new single by singer and producer, Serani.\n\nThe success of No Games has fast forwarded plans for the release of Serani's debut album. The album according to the artiste, is almost complete. &quot;We haven't yet decided on the next single, but the album is almost complete. Right now, we are in discussions with major record labels with the view of hammering out a deal soon. But we are not yet finished with No Games because right now its locking down the North East in America and we still have the rest of the world to deal with,&quot; said Serani.\n\nNo Games not only figured high on several charts here in Jamaica, but it reached the number one spot in the British Virgin Islands, Trinidad and Tobago, and St Lucia. It is currently making major moves on the New York Reggae chart.\n\n&quot;No Games&quot; was produced by Linton 'TJ' White and featured on the Unfinished Business Riddim. The song made its debut at number 55 on Billboard's Hot R&amp;B Hip Hop Singles and Tracks chart. Over on Billboard's Hot R&amp;B Hip Hop Airplay chart, it is the hot shot debut at number 53.\n\nAccording to Serani, No Games was inspired by a need for mutual respect from females. &quot;It's a real life thing. If I take something serious like a relationship, I would like mutual respect. I would like her to take me seriously. I am not into playing any games.&quot;\n\nHe pointed out that Dancehall selectors took a while to catch on to the song, but he knew it had the potential to be a hit. &quot;From the girls like the song, I knew it was going to be something big,&quot; said Serani.\n\nA new video for No Games - which is one of the songs on the Tads Records recently released compilation, Reggae Jammin Vol One - will be shot on film shortly to capitalize on the mainstream success.\n\n&quot;I am not sure if we are going to shoot the video in Jamaica or overseas, but it won't be a Jamaican director,&quot; Serani added.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2b0a6dfa618ae6076c873b01b7370b768ce5da69","amp;dn":"Serani+-+No+Games++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0a6dfa618ae6076c873b01b7370b768ce5da69","infoHashBuffer":{"type":"Buffer","data":[43,10,109,250,97,138,230,7,108,135,59,1,183,55,11,118,140,229,218,105]},"announce":[],"urlList":[]}}