{"title":"InterracialBlowBang - Katie Summers","uid":11846957,"size":434397947,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2b375eb8b5b1c6dbdeeb88db7887133f5db16c53&amp;dn=InterracialBlowBang+-+Katie+Summers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"chkm8te","files":1,"time":1429922550,"description":"InterracialBlowBang - Katie Summers\n\nOne of our brothers down south has felt the white man's racism despite the number of 0's in his bank account. A 3 million dollar house isn't enough to keep the white man's evil from trying to put a choke hold on the black race. Things can not stand the way they currently are and Katie Summers has graciously offered herself in order to lower our anger and blood pressure levels. The milky white skin on Katie was barely covered by the hot outfit she had on. Katie went down the row of black guys and gave a little tease. The constant oppression by the white man was about to be temporarily forgotten as Katie Summers took each of my brotha's big, black cock in her mouth. Katie used her free hands to rub and tug on any black meat in her immediate radius....this girl's head game was not to be outdone. Katie Summer's wasn't naked fast enough and we each took turns making her choke on our big black cocks. We had no idea that she was that into interracial sex but that doubt was soon removed when we bent her over the garbage. Katie's ass was in the air and we nearly fought to see who would fuck that pussy first. Katie's screams were halted since her mouth was never void of a big, black cock. Black balls were slapping her chin and her clit and all our frustration was taken out on her 100 lb., sexy white body. We beat that white pussy until she begged us to coat her face with our black nut sauce. One by one, each agitated black man dumped his spunk on her face until each sack had been fully drained. We might keep this bitch around for a while since she can't live without interracial sex. We're happy to oblige.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7rkdmyjwq7heziu1nk8b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7rkdmyjwq7heziu1nk8b.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8mcuzo7bg67ivlgkhsjx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8mcuzo7bg67ivlgkhsjx.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2b375eb8b5b1c6dbdeeb88db7887133f5db16c53","amp;dn":"InterracialBlowBang+-+Katie+Summers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b375eb8b5b1c6dbdeeb88db7887133f5db16c53","infoHashBuffer":{"type":"Buffer","data":[43,55,94,184,181,177,198,219,222,235,136,219,120,135,19,63,93,177,108,83]},"announce":[],"urlList":[]}}