{"title":"Thief Update v1.2 icl.DLC - RELOADED","uid":9729361,"size":569792392,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2b42f5855c63cc0d8e515b372941c7a857bed6ba&amp;dn=Thief+Update+v1.2+icl.DLC+-+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Taker009","files":9,"time":1394345545,"description":"nERv \n\nThief Update v1.2 with DLC (c) SQUARE ENIX \n\n03/2014: RELEASE.DATE .. PROTECTION: Steam: DISC(S) .. GAME.TYPE: Action, Adventure\nNote: this releases updates your game to v1.2 (build 4116.4). A list of\nupdates is included within the pack. You do not need any other update\nFor some reason this patch moves game exe to the Binaries2 dir, if you need\nto change your custom shortcuts or run it manually \n\nThe following DLCs are also unlocked: \n\n* The Bank Heist\n* The Predator Booster Pack\n* The Opportunist Booster Pack\n* The Ghost Booster Pack\n* The Moira Asylum Challenge \n\nIf you're having trouble getting the DLCs to work, read the instructions\nbelow carefully \n\nGarrett, the Master Thief, steps out of the shadows into the City. In this\ntreacherous place, where the Baron's Watch spreads a rising tide of fear\nand oppression, his skills are the only things he can trust. Even the most\ncautious citizens and their best-guarded possessions are not safe from his\nreach \n\nAs an uprising emerges, Garrett finds himself entangled in growing layers of\nconflict. Lead by Orion, the voice of the people, the tyrannized citizens\nwill do everything they can to claim back the City from the Baron's grasp\nThe revolution is inevitable. If Garrett doesn't get involved, the streets\nwill run red with blood and the City will tear itself apart \n\nGarrett never paid the price for anything. until now \n\n1. Unrar\n2. Install the update to where you installed the game\n3. Copy over the cracked content from the /Crack directory to your game\ninstall directory\n4. Play the game \n\nAdditional DLC instructions: \n\nIf you're having trouble getting DLCs to work, perform the following steps:\n1. Delete file Profile.sav (c:ProgramDataSteamRLD!239160storage)\n2. Use the registry editor (start regedit.exe) to remove the following key:\nHKEY_CURRENT_USERSoftwareEidos MontrealThiefInstalledDLC\n3. Firewall the game exe(s) or otherwise prevent the game from going online\n4. Start the game. The DLCs should appear. If not, go to 1. This game is\npretty buggy \n\nEnjoy!\n\n\nChangelog:\n\n\nWe have just made public a new version of the PC version of Thief, v1.2 build 4116.4 \nThis patch will be applied by Steam automatically when you next start the game. \nIf your game does not update, please restart the Steam client.\n\nThis patch will address the following issues.\n\n- Fixed an issue where, for some users, controller right stick would not turn \n  the camera and controller hints would not appear.\n- Fixed an issue where, for some users, the keyboard mapping menu would \n   immediately map a key and then hang.\n- Fixed an issue with the fog when SSAA was enabled that was introduced in v1.1.\n- Fixed a crash when the user had 99 saves and tried to access the save menu in game.\n- Added an option to the launcher configuration dialog to run the 32-bit version on a \n  64-bit machine. The 32-bit version has several features disabled causing it to use \n  less memory, providing a smoother experience for users with lower spec machines. \n  The checkbox for this option can be found in the display tab of the launcher \n  options dialogue.\n- Update: Deploy additional DLLs with the game to avoid issues with corrupt \n  DLLs on user machines, which could cause the game to not start at all.\n- Update: Moved Lockpick and Frame Search helper to the HUD menu and \n  will now also affect mouse/keyboard.\n  WARNING: Disabling Frame Search helper while playing with mouse/keyboard could \n   make it very hard, if not impossible, to find the button.\n- Various performance improvements.\n- Various crash fixes.","torrent":{"xt":"urn:btih:2b42f5855c63cc0d8e515b372941c7a857bed6ba","amp;dn":"Thief+Update+v1.2+icl.DLC+-+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b42f5855c63cc0d8e515b372941c7a857bed6ba","infoHashBuffer":{"type":"Buffer","data":[43,66,245,133,92,99,204,13,142,81,91,55,41,65,199,168,87,190,214,186]},"announce":[],"urlList":[]}}