{"title":"1001 Best Hot and Spicy Recipes - EPUB - WD","uid":9485398,"size":940708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ba5d3d5b8eeafca18293c9025d8b0f382f64bfd&amp;dn=1001+Best+Hot+and+Spicy+Recipes+-+EPUB+-+WD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AtomTPB","files":1,"time":1389880725,"description":"ISBN: 1572841133 \nYear: 2010 \nFormat: EPUB \nPages: 656 pages\n\nThe latest addition to Agate Surrey's beloved 1001 series of cookbooks is its hottest ever. The largest and most comprehensive cookbook ever published on this subject, 1001 Best Hot and Spicy Recipes is composed of the very best dishes from author Dave DeWitt's collection of chili pepperï¿½Claden recipes. Created from his globe-trotting travels, from colleagues, and from research in authentic, obscure, and out-of-print cookbooks from all over the world, the book is loaded with a huge variety of soups, stews, chilies, and gumbos. It also includes a broad selection of barbecue dishes for the grill, a lengthy list of meatless entrees and vegetable options, and even a surprising array of zesty beverages, desserts, and breakfasts. Recipes are organized according to the region from which the chili peppers come: South and Central America, Mexico, the Caribbean, the United States, Europe, the Mediterranean and Middle East, Africa, the Indian subcontinent, and Asia and the Pacific. A treasury of the very best the world has to offer of great spicy foods, no serious cook should be without this jam-packed trove.","torrent":{"xt":"urn:btih:2ba5d3d5b8eeafca18293c9025d8b0f382f64bfd","amp;dn":"1001+Best+Hot+and+Spicy+Recipes+-+EPUB+-+WD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ba5d3d5b8eeafca18293c9025d8b0f382f64bfd","infoHashBuffer":{"type":"Buffer","data":[43,165,211,213,184,238,175,202,24,41,60,144,37,216,176,243,130,246,75,253]},"announce":[],"urlList":[]}}