{"title":"Domination And The Arts Of Resistance: Hidden Transcripts By Jam","uid":8897572,"size":5681931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2be090fda7f2ea21b3a33fe4a7f22b09a1a201d0&amp;dn=Domination+And+The+Arts+Of+Resistance%3A+Hidden+Transcripts+By+Jam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"The_Abee","files":1,"time":1378738273,"description":"Domination And The Arts Of Resistance: Hidden Transcripts By James C. Scott ABEE\n__\n &lt;a href=&quot;\nhttp://yalepress.yale.edu/images/full13/9780300056693.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yalepress.yale.edu/images/full13/9780300056693.jpg&lt;/a&gt;\n\nAbout:\n_\n\nConfrontations between the powerless and the powerful are laden with deception - the powerless feign deference and the powerful subtly assert their mastery. Peasants, serfs, untouchables, slaves, labourers, and prisoners are not free to speak their minds in the presence of power. These subordinate groups instead create a secret discourse that represents a critique of power spoken behind the backs of the dominant. At the same time, the powerful also develop a private dialogue about practices and goals of their rule that cannot be openly avowed. In this book, the author, a social scientist, offers a discussion both of the public roles played by the powerful and powerless and the mocking, vengeful tone they display off stage - what he terms their public and hidden transcripts. Using examples from the literature, history, and politics of cultures around the world, the author examines the many guises this interaction has taken throughout history and the tensions and contradictions it reflects. The author describes the ideological resistance of subordinate groups - their gossip, folktales, songs, jokes, and theater - their use of anonymity and ambiguity. He also analyzes how ruling elites attempt to convey an impression of hegemony through such devices as parades, state ceremony, and rituals of subordination and apology. Finally he identifies - with quotations that range from the recollections of American slaves to those of Russian citizens during the beginnings of Gorbachev's glasnost campaign - the political electricity generated among oppressed groups when, for the first time, the hidden transcript is spoken directly and publicly in the face of power.\n\nPaperback: 251 pages\nPublisher: Yale University Press; 1st Edition(PB) edition (July 29, 1992)\nLanguage: English\nISBN-10: 0300056699\nISBN-13: 978-0300056693\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_____________________________________\n                                                            &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_____________________________________\n\t\t\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE, LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                     :)__Abee\t","torrent":{"xt":"urn:btih:2be090fda7f2ea21b3a33fe4a7f22b09a1a201d0","amp;dn":"Domination+And+The+Arts+Of+Resistance%3A+Hidden+Transcripts+By+Jam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2be090fda7f2ea21b3a33fe4a7f22b09a1a201d0","infoHashBuffer":{"type":"Buffer","data":[43,224,144,253,167,242,234,33,179,163,63,228,167,242,43,9,161,162,1,208]},"announce":[],"urlList":[]}}