{"title":"Lords of the North (The Saxon Stories # 3) - Bernard Cornwell.ep","uid":8951606,"size":383874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bea2cc5b25a73ef8c21a6870fcf14322606d255&amp;dn=Lords+of+the+North+%28The+Saxon+Stories+%23+3%29+-+Bernard+Cornwell.ep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1379899095,"description":"From Bernard Cornwell, the undisputed master of historical fiction, hailed as &quot;the direct heir to Patrick O'Brien,&quot;* comes the third volume in the exhilarating Saxon Chronicles: the story of the birth of England as the Saxons struggle to repel the Danish invaders.\n\nThe year is 878, and as Lords of the North begins, the Saxons of Wessex, under King Alfred, have defeated the Danes to keep their kingdom free. Uhtred, the dispossessed son of a Northumbrian lord, helped Alfred win that victory, but now he is disgusted by Alfred's lack of generosity. Uhtred flees Wessex, going north to search for his stepsister, who was taken prisoner by Kjartan the Cruel, a Danish lord who lurks in the formidable stronghold of Dunholm.\n\nUhtred arrives in the north to discover rebellion, chaos, and fear. His only ally is Hild, a West Saxon nun fleeing her calling, and his best hope is his sword, Serpent-Breath, with which he has made a notable reputation as a warrior. He needs other partners if he is to attack Dunholm, and chooses Guthred, a seemingly deluded slave who believes he is a king. Together they cross the Pennines, where fanatical Christians and beleaguered Danes have formed a desperate alliance to confront the terrible Viking lords who rule Northumbria.\n\nInstead of victory Uhtred finds betrayal. But he also discovers love and redemption as he is forced to turn once again to his reluctant ally, Alfred the Great. It is Alfred who sees opportunity in Northumbria's chaos, and Alfred who looses Uhtred and his stepbrother, Ragnar, onto Dunholm, the invincible fortress on its great spur of rock. A breathtaking adventure, Lords of the North is also the story of the creation of England, as the English and Danes fight against each other, but also find common cause and create a common language. In the end they will become one people, but as Uhtred will discover, their union is forged through the white heat of battle.","torrent":{"xt":"urn:btih:2bea2cc5b25a73ef8c21a6870fcf14322606d255","amp;dn":"Lords+of+the+North+%28The+Saxon+Stories+%23+3%29+-+Bernard+Cornwell.ep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bea2cc5b25a73ef8c21a6870fcf14322606d255","infoHashBuffer":{"type":"Buffer","data":[43,234,44,197,178,90,115,239,140,33,166,135,15,207,20,50,38,6,210,85]},"announce":[],"urlList":[]}}