{"title":"Tears of Gold - Laurie McBain","uid":9189912,"size":1192226,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c4dd3c5e37191b0e9f74aa6815eeba15d77f2ba&amp;dn=Tears+of+Gold+-+Laurie+McBain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1384369692,"description":"Haunted by the memory of her aristocratic father's desertion of his mistress and children, Mara O'Flynn grew up despising men. She sought her livelihood in the theater, where, as a beautiful actress, she found vengeance in enchanting and discarding suitors, teasing them with subtle promises of ecstasy only to reject them with an air of finely tuned cruelty. It was an amusing sport...until the young Lord Julian--half mad with desire--shot himself. Then Mara, with her brother Brendan and his small son Paddy, departed for America. Brendan hoped to strike it rich in the California hills...Mara wanted only to forget young Julian's desperate act. She had no idea that Julian's uncle, Nicholas Chantale, was in pursuit. Dashing, reckless and rich, Nicholas Chantale had vowed revenge on the temptress who brought his nephew to such an extreme. Nicholas desired one thing--to win the affection of this evil beauty and then spurn her! Unsuspecting, Mara found herself in love, her long-suppressed passions awakened for the first time....by a man whose seductive allure concealed the hate in his heart!","torrent":{"xt":"urn:btih:2c4dd3c5e37191b0e9f74aa6815eeba15d77f2ba","amp;dn":"Tears+of+Gold+-+Laurie+McBain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c4dd3c5e37191b0e9f74aa6815eeba15d77f2ba","infoHashBuffer":{"type":"Buffer","data":[44,77,211,197,227,113,145,176,233,247,74,166,129,94,235,161,93,119,242,186]},"announce":[],"urlList":[]}}