{"title":"T.S. Eliot The Making Of An American Poet - Miller. Jr [Non-Fict","uid":8868922,"size":2715683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c9861f1c6bc635b3fb0a7abd317a5714de0e1e3&amp;dn=T.S.+Eliot+The+Making+Of+An+American+Poet+-+Miller.+Jr+%5BNon-Fict&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"K-Slender","files":3,"time":1378002153,"description":"Late in his life T. S. Eliot, when asked if his poetry\nbelonged in the tradition of American literature, replied: &quot;I'd say that my\npoetry has obviously more in common with my distinguished contemporaries in\nAmerica than with anything written in my generation in England. That I'm\nsure of. . . . In its sources, in its emotional springs, it comes from\nAmerica.&quot; In T. S. Eliot: The Making of an American Poet, James\nMiller offers the first sustained account of Eliot's early years, showing\nthat the emotional springs of his poetry did indeed come from America.\n\n\n\nBorn in 1888 in St. Louis, Missouri, T. S. Eliot grew up along the\nMississippi River, only a few miles down river from Hannibal, the boyhood\nhome of another great American writer, Mark Twain. Miller recounts Eliot's\nearly years in St. Louis schools and follows him in the summers as he\nvacationed with his family in their Gloucester, Massachusetts, home perched\non the Atlantic Ocean's edge. In 1905 at the age of seventeen, Eliot left\nthe Midwest for what would prove to be a lasting separation--attending\nMilton Academy in Massachusetts for one year and then Harvard for nine\nyears, as an undergraduate and as a graduate student in philosophy. The\nfirst time he ventured abroad was 1910, when he spent a crucial year\nstudying in Paris and forming a deep friendship with the Frenchman Jean\nVerdenal. It was not until 1914, when Eliot was 26 years old, that he left\nAmerica for England--and found reasons to stay there permanently, becoming\na British citizen in 1927.\n\n\n\nMiller challenges long-held assumptions about Eliot's poetry and his life.\nEliot himself always maintained that his poems were not based on personal\nexperience, and thus should not be read as personal poems. But Miller\nconvincingly combines a reading of the early work--from his earliest poems\nthrough 1922, the year The Waste Land was published--with careful\nanalysis of surviving early correspondence, accounts from Eliot's friends\nand acquaintances, and new scholarship that delves into Eliot's Harvard\nyears. Ultimately, Miller demonstrates that Eliot's poetry is filled with\nreflections of his personal experiences: his relationships with family,\nfriends, and wives; his sexuality; his intellectual and social development;\nhis influences.\n\n\n\nPublication of T. S. Eliot: The Making of an American Poet marks a\nmilestone in Eliot scholarship. At last we have a balanced portrait of the\npoet and the man, one that takes seriously his American roots. In the\nprocess, we gain a fuller appreciation for some of the best-loved poetry of\nthe twentieth century. Eliot may have lived most of his life abroad, but he\nwas and continued to be an American poet. ","torrent":{"xt":"urn:btih:2c9861f1c6bc635b3fb0a7abd317a5714de0e1e3","amp;dn":"T.S.+Eliot+The+Making+Of+An+American+Poet+-+Miller.+Jr+%5BNon-Fict","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c9861f1c6bc635b3fb0a7abd317a5714de0e1e3","infoHashBuffer":{"type":"Buffer","data":[44,152,97,241,198,188,99,91,63,176,167,171,211,23,165,113,77,224,225,227]},"announce":[],"urlList":[]}}