{"title":"Herbie Mann - Memphis Underground (1969) (Requested) [Jazz][mp3","uid":4860720,"size":52173818,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ced60b5c009afb43913d9892072df00a7dd1536&amp;dn=Herbie+Mann+-+Memphis+Underground+%281969%29+%28Requested%29+%5BJazz%5D%5Bmp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":10,"time":1240259835,"description":"Herbie Mann - Memphis Underground \nOriginal Release Date: 1969 \nAudio CD: July 1, 1991 \nLabel: Atlantic / Wea \nBitrate: 192 kbps\n\n&quot;Much of the record is made up of funky, one-chord vamps, and this has its charms. First of all, the Memphis rhythm section is first rate. Drummer Gene Christman lays down some tight beats that really support the soloists, all of whom play soulful, ...    Full Descriptionbluesy improvisations throughout. Vibraphonist Roy Ayers plays the jazziest licks, mixing in some advanced harmonic vocabulary with his otherwise pentatonic (rock-influenced) licks. Well-known soul hits &quot;Hold On, I'm Comin'&quot; and &quot;Chain of Fools&quot; are covered on this jam album, as is the traditional &quot;Battle Hymn of the Republic.&quot; Overall, this disc has a strong late-'60's feel to it, which proves to be an endearing virtue.\n\nFlutist Herbie Mann's career has taken him in a variety of musical directions. This 1969 studio session is a perfect example of the range of Mann's stylistic interests. MEMPHIS UNDERGROUND is a clean break from bebop; in fact, this music could hardly be called jazz. It is really groove music, with a dash of Southern rock and country added to the mix.&quot;\n\nI first got this on vinyl in the mid 70's and was blown away by the jazz rock sound the band put down. The title tune,Memphis Underground, is still on of my favorite songs and I have been listening to it for 25 years. Possibly the best driving song ever. The rest of the album is very good too. Lots of R&amp;B feel and some wonderous jazz riffs. The guitar and vibe sound great with Manns flute, and the rhythm section is rock solid. I replaced the old vinyl album with a cd and if I lost it, I would buy another in a minute. A listening treat. ~ Robert E Boylan\n\nOkay, I admit it upfront: I am a Herbie Mann fan, and this CD captures the essence of what he was doing at the very end of the 60's. \nThe musical style is very R&amp;B focused, and the band provides a gritty, chunky foundation for the solos of Mann, Ayers (vibes), Coryell (guitar) and Sharrok (guitar). The recording leaves a little to be desired, but the playing is outstanding. Mann's playing is strong, and the rhythm section captures the overall feel of the time, with strong bass/rhythm lines that sit in groove all day long. The sound is somewhat dated, but to me it's *history* - an important part of the jazz tradition. Regardless, the album certainly has something to say to today's listener.\n\nOverall, think Steppenwolf with a rocking flute over the top. Buy it. ~ &quot;the jazz doctor&quot;\n\nPersonnel:\nReggie Young - guitar\nRoy Ayers - vibraphone, congas\nBobby Wood - acoustic &amp; electric piano\nBobby Emmons - organ\nTommy Cogbill\nMike Leech\nHerbie Mann - flute\nLarry Coryell\nMiroslav Vitous - Fender bass\nSonny Sharrock\nGene Christman - drums\n \nHerbie Mann - Memphis Underground Tracks:\n01  Memphis Underground (7:09)\n02  New Orleans ( 2:08 )\n03  Hold On, I'm Coming (8:57)\n04  Chain Of Fools (10:44)\n05  Battle Hymn Of The Republic (7:14)","torrent":{"xt":"urn:btih:2ced60b5c009afb43913d9892072df00a7dd1536","amp;dn":"Herbie+Mann+-+Memphis+Underground+%281969%29+%28Requested%29+%5BJazz%5D%5Bmp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ced60b5c009afb43913d9892072df00a7dd1536","infoHashBuffer":{"type":"Buffer","data":[44,237,96,181,192,9,175,180,57,19,217,137,32,114,223,0,167,221,21,54]},"announce":[],"urlList":[]}}