{"title":"Conjunto Primavera - Algo de Mi - Complete CD - MP3","uid":4429847,"size":50594539,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2d1b87d1ef716153a978c4bece5d0edaa98077df&amp;dn=Conjunto+Primavera+-+Algo+de+Mi+-+Complete+CD+-+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheLabMan","files":14,"time":1223228816,"description":"                          Algo de Mi\n\n\n\n\t1.\tDejame Decirte\n\t2.\tAlgo de Mi\n\t3.\tDiganle\n\t4.\tSi Vuelve Ya\n\t5.\tCon la Mitad\n\t6.\tNi, Asi Me Rajo\n\t7.\tSolo\n\t8.\tTe Necesito\n        9.\tNo Se Decirte Adios\n\t10.\tGracias Por Estar Conmigo\n\n\n    Guide Review - CD Review: Conjunto Primavera - Algo De Mi\n\n\nConjunto Primavera started their group 27 years ago in Chihuahua, Mexico. Since then, they&amp;#039;ve recorded 1+ albums a year and now bring us their 33rd album, Algo De Mi. It can&amp;#039;t be easy to keep those hits coming year after year, especially since their special brand of music combines norteno / conjunto traditional instrumentation (bajosexto, accordion, bass and drums) with romantic ballads, a combination that is less often found in the genre.\n\nOf course, its easier to do when you collaborate with some really fine composers writing numbers especially for you. On this album, their break out single, &quot;Aldo De Mi&quot; was composed by Monterrey, Mexico native Osvaldo Villareal and tells a story about what happens at the end of a relationship.\n\nThe recording is graced with the rich voice of Tony Melendez and expressful saxaphone by Juan Dominguez. Driving polkas and lilting waltzes are perfect for dancing. &quot;Te Necessito&quot; and &quot;No Se Decirte Adios&quot; add a distinctive pop flavor, with the latter adding some untypical orchestral string background.\n\nIf you are one of the many misguided music listeners that think accordion music is unsophisticated and &amp;#039;Lady of Spain&amp;#039;-ish, be sure to listen to &quot;Dejame Decirte&quot; where accordionist/keyboardist Felix Contreras works his fingers to the bone playing a brilliant counterpoint to the melody. ","torrent":{"xt":"urn:btih:2d1b87d1ef716153a978c4bece5d0edaa98077df","amp;dn":"Conjunto+Primavera+-+Algo+de+Mi+-+Complete+CD+-+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d1b87d1ef716153a978c4bece5d0edaa98077df","infoHashBuffer":{"type":"Buffer","data":[45,27,135,209,239,113,97,83,169,120,196,190,206,93,14,218,169,128,119,223]},"announce":[],"urlList":[]}}