{"title":"ULTRA - Underground Legion of Terroristic Research Activists","uid":9646125,"size":85430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d350743236ccd554371bbe2e297f3e84e1fd93c&amp;dn=ULTRA+-+Underground+Legion+of+Terroristic+Research+Activists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"iv0live","files":1,"time":1393001366,"description":"ULTRA - Underground Legion of Terroristic Research Activists\n\nReasons for forming our own text file group were many. There seems to be a\nfew groups already out there who are just rehashing old stuff, or just typing\nin chapters from some old dusty manual they found in a trashcan. Nothing that\nis shocking or original. We have formed ULTRA to break this chain and bring\nsomething new along. Our files will be different, outrageous, sick, evil, and\njust about everything else you could think of. Ultra will not have any set\nformat or speciality. We will voice our own opinions and how we feel, they will\nnot even reflect what the other group members personal opinions are. Hell we\nmight even offend you. Ultra will not hold to any release date nor will we have\nany special hangout to call our headquarters. If you want our stuff bad enough\nyou will find it.\n\n   Ultra plans on bringing you original text files on various subjects. We want\nto tell it like it really is. Ultra will have the law enforcement agencies\nfaxing urgent bulletins across the states. We will bring you the most\ndangerous, the most fantastic, the most controversial, and some of the evilist\nstories you have ever laid eyes upon.\n\n\n1991/txt","torrent":{"xt":"urn:btih:2d350743236ccd554371bbe2e297f3e84e1fd93c","amp;dn":"ULTRA+-+Underground+Legion+of+Terroristic+Research+Activists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d350743236ccd554371bbe2e297f3e84e1fd93c","infoHashBuffer":{"type":"Buffer","data":[45,53,7,67,35,108,205,85,67,113,187,226,226,151,243,232,78,31,217,60]},"announce":[],"urlList":[]}}