{"title":"The Climax Chicago Blues Band-Climax Chicago Blues Band(1969)(19","uid":4624185,"size":254648345,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2d75ca35597aab799cb6618010c84741c48be047&amp;dn=The+Climax+Chicago+Blues+Band-Climax+Chicago+Blues+Band%281969%29%2819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thewall68","files":24,"time":1231153947,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\n\n\nThe Climax Chicago Blues Band--not from Chicago at all, but from Stafford, England--were major participants in the 1960s British blues-rock scene. This classic 1969 debut record, recorded before the condensed their name to Climax Blues Band, ...    Full Descriptionhints at the power demonstrated on successive albums.\n\nThis is the 1969 debut by this prolific British band. Influenced by the Chicago style of blues, these blues-loving musicians bring us a sound that is both direct and immediate and features very talented and creative harmonica and guitar playing.\n\nIn the grand tradition of Peter Green's Fleetwood Mac, the Aynsley Dunbar Retaliation, John Mayall's Bluesbreakers, The Keef Hartley Band, T.S. McPhee's Groundhogs, early Rod Stewart, early Led Zeppelin and a dozen others, the British blues scene of 1967-1969 was hot.\n\nAnd the best of the best was the Climax Chicago Blues Band (they dropped 'Chicago' after this first album). Though rooted in the American blues tradition, they gave it their own distinctive British twist, producing some of the finest modern blues music around in their first 4 or 5 albums.\n\n\n\n\n\n\n1. Mean Old World - Climax Blues Band, Broonzy\n2. Insurance - Climax Blues Band, Hall\n3. Going Down This Road - Climax Blues Band, Climax Chicago Blue\n4. You've Been Drinking - Climax Blues Band, Climax Chicago Blue\n5. Don't Start Me Talking - Climax Blues Band, Williamson\n6. Wee Baby Blues - Climax Blues Band, Johnson\n7. Twenty Past One - Climax Blues Band, Climax Chicago Blue\n8. A Stranger in Your Town - Climax Blues Band, Cooper, Colin\n9. How Many More Years - Climax Blues Band, Burnett\n10. Looking for My Baby - Climax Blues Band, Climax Chicago Blue\n11. And Lonely - Climax Blues Band, Climax Chicago Blue\n12. The Entertainer - Climax Blues Band, Joplin, Scott \n","torrent":{"xt":"urn:btih:2d75ca35597aab799cb6618010c84741c48be047","amp;dn":"The+Climax+Chicago+Blues+Band-Climax+Chicago+Blues+Band%281969%29%2819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d75ca35597aab799cb6618010c84741c48be047","infoHashBuffer":{"type":"Buffer","data":[45,117,202,53,89,122,171,121,156,182,97,128,16,200,71,65,196,139,224,71]},"announce":[],"urlList":[]}}