{"title":"The House of Love - Babe Rainbow","uid":3814470,"size":62981595,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2d96ced7ab5b68429e026e1c6886aaac0186b90d&amp;dn=The+House+of+Love+-+Babe+Rainbow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"knowyourpast","files":11,"time":1190404242,"description":"The House Of Love - Babe Rainbow (Fontana)\nIt&amp;#039;s some strange secret - probably one that only Guy Chadwick fully understands - how a band that have known such trauma and turmoil as The House Of Love make such serence, melancholy music when they get together.\n\nOn this (let&amp;#039;s just say it) difficult third album you might have expected primal screams and bitter accusations in excelsis. Verily, the plague hath descended on their houses. Their slide out of the dubious glory of hipness (1988 model) has been so acute they&amp;#039;re now virtually the expensive cult group on the planet; their prolific, terrific Year of Living Lysergically turned into a hideous 1989 angel dust headfuck as albums were scrapped and lead guitarists sacked; they plummeted into staggering debt, sloth and self-doubt; they then scrapped yet another EP and saw the back of yet another lead guitarist; they then...\n\nJesus, why don&amp;#039;t they just split up? Why drag us into their private hell, already?\n\nBecause this is brilliant is why. Because they are currently coming in the kind of colours that rock &amp;#039;n&amp;#039; roll rainbows are made of. Becuase it is too late to stop now. Because &amp;#039;Babe Rainbow&amp;#039; is born of defiance, and becuase it&amp;#039;s gorgeous.\n\n&amp;#039;Babe Rainbow&amp;#039; is an album without a scene to clutch or a smash hit predecessor to duplicate (&amp;#039;Fontana&amp;#039; was made so long ago no one can remember what it sounded like anyway). The result? The House of Love ound more out of time than ever. Whenever that may be.\n\nOn the blower to our news desk last summer, Guy Chadwick was talking of &quot;a rock album&quot;. It&amp;#039;s not really that, although the single &amp;#039;You Don&amp;#039;t Understand) is undeniably a belter. Grooving heavily on hefty doses of &amp;#039;I&amp;#039;m A Man&amp;#039; by the Spencer Davis Group (excellant mid-60&amp;#039;s R&amp;B-ers led by a teenage Stevie Windood), it opens the album on a promise of wall-to-wall hugeness and energy.\n\nThat&amp;#039;s a promise immediatly scythed down by the next tune, &amp;#039;Crush Me&amp;#039;, which is an eggshell-preciously lovely as anything the band have done since &amp;#039;Flow&amp;#039; off the first single. If you adored that, you&amp;#039;ll need toread no further. Andrea Heukamp, who quit the band to return to Germany in 1988, returns here on the sort of backing vocals the hairs on the back of your neck were put there for.\n\nSiz minutes of Indian-influenced raga sensuosness called &amp;#039;Cruel&amp;#039; (now familiar to live audiences) follow, and then a brazen thing with seriously, anthemic aspirations entitled &amp;#039;High In Your face&amp;#039;. Then it&amp;#039;s a sweet little accoustic turn-on called &amp;#039;Fade Away&amp;#039; (cue the spiritual tones of Andrea again), and &quot;another chance to hear&quot; the last two singles:&amp;#039;Feel&amp;#039;, which never sounded particularly commercial anyway, and &amp;#039;The Girl With The Loneliest Eyes&amp;#039;, which did and whose chart failre was but the latest in an extended series of body blows for the band. Good to see it again; it was too good to waste.\n\nback to the six minuete intensity/psychodramatic stuff for &amp;#039;Burn Down The World&amp;#039;, which begins on a soft, tribal Pete Evans drum pattern and just keeps rising and swaying, up into probably the most ambitious House Of Love arrangment since &amp;#039;Se Dest&amp;#039;. And talking of which, &amp;#039;Phillyphile&amp;#039; is a slow, woozy blues that moods out all over the place before climaxing in squealing, freaked-out guitar solo.\n\nThe closer, &amp;#039;Your Eyes&amp;#039; has just about the most singable line on the LP (&quot;When you touch, a little bit dies in me&quot;) and great veils of moodiness behind neat chorus. It closes the album on a sticky, delicious chord that resonates with mystique and cool and all the other things you&amp;#039;re supposed to do with a guitar but which no one seems to get around to.\n\nIn fact, what can&amp;#039;t be got accross in such a frenetic rundown of &amp;#039;Babe Rainbow&amp;#039; is the sound of the guitars. It was widely believed that this was a magic potion Terry Bickers took away with him. Bollocks. Only Spiritualised are doing anything quite as beautiful with guitar textures, and if Chadwick did do it all himself, then belated apologies are due for undervaluing him in the past.\n\nYou get the drift. &amp;#039;Babe Rainbow&amp;#039; is a honey. Better than &amp;#039;Fontana&amp;#039;, almost as good as the first one. As instinctively rock &amp;#039;n&amp;#039; rollas the beatles, the Stones or the varnish on a red guitar, it awaits your pleasure. Well, did you ever. The suspiciously ancient looking kid in the striped T-shirt has done it again. 5/5.\n\nDAVID CAVANAGH for Select June 1992 (reproduced by Dave Roberts.)","torrent":{"xt":"urn:btih:2d96ced7ab5b68429e026e1c6886aaac0186b90d","amp;dn":"The+House+of+Love+-+Babe+Rainbow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d96ced7ab5b68429e026e1c6886aaac0186b90d","infoHashBuffer":{"type":"Buffer","data":[45,150,206,215,171,91,104,66,158,2,110,28,104,134,170,172,1,134,185,13]},"announce":[],"urlList":[]}}