{"title":"GAY - Emo Twinks (Saggerz Skaterz)","uid":4443421,"size":1782690052,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2d9d6ae47b369d3d2d974f1e06a582a9397f52c7&amp;dn=GAY+-+Emo+Twinks+%28Saggerz+Skaterz%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"SDnikko","files":1,"time":1223927916,"description":"Link to clip of this video:\n &lt;a href=&quot;\nhttp://blog.rockettube.com/movie-reviews/twinks/saggerzskaterz-studio-candy-spookie-studios-emo-twinks/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blog.rockettube.com/movie-reviews/twinks/saggerzskaterz-studio-candy-spookie-studios-emo-twinks/&lt;/a&gt;\n\nEmo Twinks\nSaggerz Skaterz\n\nAVI - 1.66 GB\n\n09/2008\n\nSaggerzSkaterz Studios present the first production from Kyros Christain and Dillon Samuels' The Candy Spookie Studios. 7 Hot Emo Twinks explore each other in duos, 3-ways and the DVD ends with a 5 Twink Orgy! \n\nScene 1 \n\nIn such wonderful scenery, it would be quite the pity to cage yourself inside for the remainder of your visits into the deserts. The days grow undeniably hot in the barren wastelands that surround the mountains of Phoenix, Arizona, where the only source of water can be drilled for in the deep bowels of a tight twinkys ass! This is exactly what the twinks do at that. Deprived for a drop of water, they find hope for its nurturing foundation deep within the tight orifices possessed by Brendan Killen. Dark, chestnut hues are hidden beneath a veil of ebony straight locks, which melt over his head like chocolate and shackle to his frame for the end result of an exquisite beauty. It is within a scene like this that you will find yourself stopping to take an immense gasp at the undefinable beauty these three youths share. How big and solid their aching cocks are, begging and pleading for something warm and moist to nest within. Seemingly acting as if there was only a single purpose, Ryan and Ash take Brendan into their custody, and show him exactly how to break in a twink! \n\nScene 2 - BAREBACK SCENE\n\nSupertwink porn stars Kyros Christian, &quot;the Candy Spookie&quot; and Dillon Samuels exert their love on screen for this, one of their hottest scenes to date!! This is a very rare performance of Kyros topping his husband, in which Dillon takes his fat 8 inch cut cock raw and rough!!! Kyros loves to pound that plump tight bubble butt into next week, and does so by fueling Dillon's engines up with a thick load of his warm cum. Kyros breeds this twinkys ass and shows him just whose boss! \n\nScene 3 \n\nBrendan Killen, the twink exclusive to Candy Spookie Studios, and Jase Bionx team up together for some hot steamy fun. A mutual exchange of blowjobs leads to some serious ass pounding. Watch Brendans tight white ass endure the punishment of Jase's cock!!! \n\nScene 4 \n\nSuperTwink Kyros Christian, &quot;the Candy Spookie&quot; and up and coming twink star Ryan Conners have always had a little thing for one another, so when Ryan knew hed be meeting Kyros for the first time, he couldnt wait to pull him aside in private, take his socks off and shove his toes in Kyros mouth. Ryan knows how much Kyros loves feet, so just moments before he shoved his fat 9 inch cock into Kyros pretty little ass, he shoves his feet in his mouth and made this long haired skater brunette taste the dirt he walks on!! \n\nScene 5 \n\nTwink beauty Asher Christiansen is something unlike youve ever seen before. His quiet confidence just breeds something to be admired. Jase Bionx cant stand to not feel what it must feel like deep inside Asher's tight tanned ass, so he gladly hands the boy over his rock hard cock. \n\nScene 6 \n\nKyros Christian, Dillon Samuels, Asher Christiansen, Brendan Killen, and Kayden Daniels - what could be more sublime then to see this group of hot young twinks sucking and fucking. Five twinks, five cocks, five cum shots, five asses.\n\n\n\n File     :  1.66 GB ,  duration: 2:05:53,  type: AVI\n Video :  1.54 GB,  1760 Kbps,  29.970 fps,  720*400 (16:9),  XVID \n Audio :  115 MB,  128 Kbps,  44100 Hz,  2 channels,  MPEG Layer-3\n","torrent":{"xt":"urn:btih:2d9d6ae47b369d3d2d974f1e06a582a9397f52c7","amp;dn":"GAY+-+Emo+Twinks+%28Saggerz+Skaterz%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d9d6ae47b369d3d2d974f1e06a582a9397f52c7","infoHashBuffer":{"type":"Buffer","data":[45,157,106,228,123,54,157,61,45,151,79,30,6,165,130,169,57,127,82,199]},"announce":[],"urlList":[]}}