{"title":"JAZZ - Wynton Marsalis - Live House of Tribes(2005/320kps)","uid":3396937,"size":161017570,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2db35251c4ad169623d2160a9cbf0ed636241ba0&amp;dn=JAZZ+-+Wynton+Marsalis+-+Live+House+of+Tribes%282005%2F320kps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lagathy2","files":8,"time":1129403688,"description":"Live at the House of Tribes documents trumpeter Wynton Marsalis performing with his sextet at the intimate community theater space in New York City on December 15, 2002. Apparently an annual ritual of sorts for Marsalis, the performance makes for one of his best live recordings since 1986's stellar Live at Blues Alley. Backed by a slightly altered lineup from his 2005 Blue Note studio debut, The Magic Hour, Marsalis gains first-class support from alto saxophonist Wessel Anderson, pianist Eric Lewis, drummer Joe Farnsworth, bassist Kengo Nakamura, and percussionist Orlando Q. Rodriguez. Special mention must be made of Robert Rucker for his highly energetic tambourine performance on the New Orleans &quot;2nd Line&quot; finale. New Orleans jazz aficionados may recognize this tune as &quot;Joe Avery's Blues&quot; and based on the cheering, clapping, and general rowdiness of the crowd, it probably found the band marching around the room. In fact, one of the great things about the album is that you can really hear the crowd. There are many moments of the band playing a particularly nice phrase or line and somebody grunting out a surprised and pleased &quot;hmmm.&quot; Marsalis seems to really feed off this interplay and his playing, never less than technically superb, sounds inspired. To these ends, Marsalis takes swinging blues and angular post-bop harmonicism to ever-increasing absurdist heights on &quot;Green Chimneys.&quot; Similarly, he brings a mix of Clifford Brown and Clark Terry to &quot;Donna Lee&quot; and waxes romantic with devastating melodicism on &quot;You Don't Know What Love Is.&quot; Loose, swinging, funky, and spirited, Live at the House of Tribes is an absolute joy. \n \n\n       1  Green Chimneys  Monk  15:49  \n       2  Just Friends  Klenner, Lewis  17:48  \n       3  You Don't Know What Love Is  DePaul, Raye  12:13  \n       4  Donna Lee  Parker  6:47  \n       5  What Is This Thing Called Love  Porter  10:27  \n       6  2nd Line  Barbarin  3:55  \n \n \n \n \n \n \n","torrent":{"xt":"urn:btih:2db35251c4ad169623d2160a9cbf0ed636241ba0","amp;dn":"JAZZ+-+Wynton+Marsalis+-+Live+House+of+Tribes%282005%2F320kps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2db35251c4ad169623d2160a9cbf0ed636241ba0","infoHashBuffer":{"type":"Buffer","data":[45,179,82,81,196,173,22,150,35,210,22,10,156,191,14,214,54,36,27,160]},"announce":[],"urlList":[]}}