{"title":"Supersquirt 2: The Drenching (DVD.xvid) - anal, squirting","uid":4828456,"size":1465490714,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2dd4ce53553276ce60463d1f5dbeb455b6f18d5d&amp;dn=Supersquirt+2%3A+The+Drenching+%28DVD.xvid%29+-+anal%2C+squirting&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"the_skid","files":6,"time":1239039527,"description":"Supersquirt 2: The Drenching (DVD.xvid)\n\n\n\n\n\n\nscreens CD1 + CD2 (+ DVD-covers)\n &lt;a href=&quot;\nhttp://x4xx.blogbugs.org/8298349/Supersquirt-2---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://x4xx.blogbugs.org/8298349/Supersquirt-2---screens.html&lt;/a&gt;\n\n\n\n\n\nPut on your rain-gear people it's gonna be a VERY WET ride! \nElegant Angel exclusive contract star Tiana Lynn blasts copious amounts of pussy puddles in this soaking edition of SUPERSQUIRT #2!\nTiana easily lays claim to the title as one of the most intense, and WETTEST performers in the history of porn! She adds so much to a scene that you're always left wanting to see more! \nAnd not to worry, she's Drippingly present in all 5 scenes and she wantonly sprays her nectar in the faces and down the throats of ALL her co-stars including Kinzie Kenner, Flower Tucci, Dani Woodward, Sammie Rhodes, Lexxy Love and Angela Stone!\n\n\n    * Angela Stone              [Anal Facial Squirt]\n    * Dani Woodward             [LezOnly]\n    * Flower Tucci              [Anal Squirt A2M]\n    * Hillary Scott             [Anal Facial]\n    * Kinzie Kenner             [Facial]\n    * Lexi Love\n    * Sammie Rhodes             [LezOnly]\n    * Tiana Lynn                [Facial Squirt]\n \n   \nScene Breakdowns\n\n    * Scene 1. Billy Glyde, Flower Tucci, Tiana Lynn\n    * Scene 2. Billy Glyde, Hillary Scott, Tiana Lynn\n    * Scene 3. Dani Woodward, Sammie Rhodes, Tiana Lynn\n    * Scene 4. Kinzie Kenner, Tiana Lynn, Tommy Gunn\n    * Scene 5. Angela Stone, Lexi Love, Randy Spears, Tiana Lynn\n\n\n\nGenre:        All Sex, Gonzo, Squirting\nStudio:       Elegant Angel\nDirector:     Patrick Collins\nReleased:     2005\nDuration:     00:52:57 + 00:58:25\n\nVideo: XVID 512x384 29.97fps 1641Kbps\nAudio: Dolby AC3 48000Hz stereo 192Kbps\n\n\n\nREVIEW:\n\nTiana Lynn returns with another installment of Supersquirt. She takes a major part in every one of the five scenes, and makes sure that each scene starts out with a nice tease. Sometimes there's a little story to lead into the action, but most times it's right to the good stuff.\n\n\nScene 1 - Flower Tucci, Tiana Lynn, and Billy Glyde\n\nSmoking hot brunette Tiana starts things out in some pink lingerie admiring Flower's ass as she bends over the counter wearing only stockings and a pink bra and garter belt. She tells Billy about how she enjoyed the first movie but wants to make a better wetter one at home while teasing him with Flower's ass as she runs her hands and tongue around it and talks dirty to him. She lets Billy slide his cock up and down between Flower's cheeks while she gives it a few licks before getting down to suck it while Billy warms Flower up with his tongue. Billy moves around so Flower can suck his cock while Tiana works on Flower from behind. Tiana gets in the middle so she can titty fuck Billy while Flower works on her holes, and they keep working the oral around until Tiana lies back on the counter and lets Billy fuck her pussy missionary style. Of course Tiana lets go with a massive squirt after he pumps her a bit, and both Billy and Flower get right in there to take in as much of her womanly juices as possible. Billy moves over to fuck Flower from behind, which of course results in more squirting, before they work on Tiana orally and let her have a cowgirl ride on the pool table. Flower kicks Tiana's ride up a notch with the help of a pink buttplug, and after a bit Tiana pulls it out to get a nice taste of her fantastic ass. They sucks Billy's cock clean before Flower gets up for a reverse cowgirl anal ride and makes Flower beg for her girly gash goo. They keep trading back and forth, with Tiana letting Billy spoon her pussy and fuck it missionary style and Flower letting him fuck her ass missionary and cowgirl style. Finally, Billy pops in Tiana's mouth and she spits it back out all over Flower's ass to play with it.\n\nThis is a great opening scene. Tiana starts it out with a great tease, and as always her trash talking helps things out extremely well. There's a great balance between the girls as they take on Billy, and no shortage of intensity. Tiana, Flower, and Billy deliver everything I hoped for and more to start out Supersquirt 2!\n\n\nScene 2 - Hillary Scott, Tiana Lynn, and Billy Glyde\n\nTiana starts out the next scene wearing a slutty greenish outfit sitting on the couch and playing with Hillary, who's in a little pink and white outfit, and teasing Billy with her. She plays with Hillary's ass with her tongue and fingers to tease Billy before they finally let Billy come over so Hillary can choke on his cock as she moves down to play with her pussy. Billy warms Hillary's ass up with a finger as she works on him orally before moving over to let Tiana have the first fuck missionary style as Hillary works on her tits. Billy needs to work on her a little longer here to get Tiana to squirt, and with a little help from Hillary playing with her tits Tiana lets go with several squirts. She keeps laying back and works on her ass with a pink plug while watching Hillary get her sphincter stretched reverse cowgirl style above her before coming up to suck and smell Billy's cock as well as eating Hillary's ass. They mix in a little more oral all around before Tiana gets up for a reverse cowgirl ride of her own while Hillary watches from below and lets Tiana squirt all over her. Tiana lets Billy take care of Hillary's ass in both cowgirls as she licks Hillary's ass and his cock or lies back to watch and play with herself. She lets Billy fuck her again missionary style, and they cum at the same time with Hillary catching both orgasms on her head. They swap the pop a little before Hillary swallows it down.\n\nThis is another great scene. As always, Hillary looks fantastic and puts out some great energy and vocals. She and Tiana have a great balance once again, as well as the same division of labor, with Billy continuing to show why people should hate him for the simple reason of being a lucky enough bastard to bone both these beauties. There's plenty of squirting to go with the anal, and the scene flows along very nicely. This is a darn hot scene.\n\n\nScene 3 - Dani Woodward, Sammie Rhodes, and Tiana Lynn\n\nTiana switches gears to play with redheaded Dani and dirty blonde Sammie next. Tiana and Sammie quickly put Dani in the middle, with Dani obviously enjoying being able to give and get at the same time. Tiana moves up to kiss her as Sammie fucks Dani with a dildo, and gives Dani's neck, ears, and tits plenty of love. Dani pulls Sammie up to kiss and hold her tight as Sammie makes her cum, with Sammie appearing to come very close herself as Tiana works on both of them. Dani insists that Sammie lays back so she can return the favor, and after starting her out with a little tongue and finger work gets up so they can grind gashes as Tiana watches, works herself over with a glass dildo, and surprises Sammie as she squirts right next to her head. Tiana hops on Sammie's chest and continues to play with herself before moving around to work on Dani from behind as Dani continues to work on Sammie. Dani moves up to sit on Sammie's chest as Tiana fucks Sammie with a pink dildo, and after Tiana works her up to a screaming, thrashing orgasm, Tiana and Dani trade places so Dani can see if she can repeat Sammie's pleasure as Tiana sits on her and slaps her up a bit. Tiana moves forward to get a little toy play herself, and comes back to give Sammie a nice facial before working on Sammie's ass with a toy as she straddles Dani. The focus quickly moves back to Dani, who gets a buttplug while holding a vibe on her pussy, with Sammie getting plenty of action from below her. Sammie appears to have a few more nice orgasms, and even gets up to take another facial from Tiana as she and Dani sixty-nine. Finally, the scene fades out as Sammie and Dani work on Tiana.\n\nI can't remember the last time I watched an all girl group scene this hot. There's plenty of passion all around, and I love how Tiana seems to try to keep the focus on Dani and Sammie's pleasure. The girls are all extremely vocal and intense, and I love how much kissing is worked throughout the scene. The only thing that holds back the scene is the ending, which peels away feeling like there was still plenty more to go. This is a smoking hot scene that could have kept my full attention for much longer.\n\n\nScene 4 - Kinzie Kenner, Tiana Lynn, and Tommy Gunn\n\nTiana starts out the penultimate scene lying back on the bed with Kinzie talking about fucking one of her teachers with the help of another girl. Kinzie can't believe it, but Tiana agrees to tell her all about it so long as Kinzie imagines that she's the other girl. They move on with a passionate kiss before magically changing from their sexy white lingerie to naughty school girl outfits being taught by Tommy. They quickly point out that the grammar lesson he's giving isn't for them as her subject is fashion and wonders if she made her skirt too long. They quickly move on to suck Tommy's cock with Tiana also giving Kinzie a little oral attention. Tiana once again starts the fucking out on her back and squirts away after being fucked a bit. Kinzie sucks Tommy's cock whenever she can as he works on Tiana, and is rewarded with a bit of doggie fucking as Tiana watches from below and sucks Tommy when he offers himself to her. Tiana gets back on top for a squirting cowgirl ride as well as squirting away with some more missionary fucking before letting Kinzie have a reverse cowgirl ride. She trades places with Kinzie for a reverse cowgirl ride of her own before letting Kinzie get fucked again cowgirl style. Tiana rides it cowgirl style also and cums on Kinzie's face before she and Tommy team up to give Kinzie a double cum facial. Afterwards the girls share the pop with a great final kiss before the scene returns to the opening bedroom as Tiana finishes eating Kinzie's pussy to give her story a really happy ending.\n\nThis scene is every bit as hot as I hoped. Tiana and Kinzie have fantastic chemistry, and do a great job of sharing Tommy. Heck, Tommy often becomes little more than a phantom cock, which always annoys me, but here I just couldn't care with how much both girls were getting into it. This is yet another smoking hot scene.\nScene 5 - Angela Stone, Lexi Love, Tiana Lynn, and Randy Spears\n\nTiana talks about men just being one of their props as Angela strips down beside her, Lexi lets her caress her ass, and Randy watches and strokes himself. Tiana licks and fingers Lexi's ass, and when Randy asks for a closer look lets him taste her finger. They let Lexi down to suck Randy's cock while Tiana and Angela work themselves over to squirt all over both of them. Randy comes up to fuck Angela missionary style as Lexi moves up to eat Tiana, and lets her moves off to spray Tiana and Lexi with her girly goodness. Angela continues to squirt them riding Randy reverse cowgirl style, and after they fuck a bit more move down so she can eat Tiana's ass while Randy fucks Lexi's face. He moves up so Tiana can taste him as well before they break off for some missionary fucking. She tries to squirt Angela and Lexi as Angela toes Lexi's pussy and sucks on Tiana's toes before letting Lexi ride Randy in both cowgirls as she and Angela make each other squirt. Randy moves back to Angela for a little pile driving anal action as well as some anal missionary, before she and Lexi team up on Randy orally. He goes back to fuck Tiana again, and finishes things up popping on her feet for the others to lick up before Tiana lets them have one last facial.\n\nThis is yet another winner of a scene. Adding Angela to the mix is definitely a very nice touch and helps to finish off the movie on a strong note. This scene stands out nicely against the rest by having Randy working his way through the women as the others play with each other, and has such a strong balance between the girls that Tiana never stands out as the driving force of the scene like she did in all the others. It gives the scene a different feel, and ends the movie on a slightly lower note.\n\n\nSupersquirt 2 is one heck of a hot fuck flick! \nOnce again Tiana Lynn's squirting makes for one heck of a great thing to build a movie around, and her enthusiasm, energy, and vocals only make the action hotter. There are many times when a movie is built around a single girl where the girl seems to get tiring as the movie goes on, but that doesn't happen here thanks to the passion Tiana brings to the screen. There's plenty of kissing and screaming throughout the movie, and the entire cast seemed like they were having a fantastic time. There are a lot of smiles, and even a few laughs mixed in as they get surprised by a squirt. It was a very nice change to see such realistic looking reactions popping up throughout the entire movie. I'd have a very hard time picking out a favorite or best scene here, but I can say that the final scene fell a little behind the others for me due to its slightly different style. Supersquirt 2 is a must see movie for anybody who's a fan of squirting, anal action, or Tiana Lynn.\n\n\nThe Down -n- Dirty Sex Stuff\n\nThemes: Straight, tease, lesbian, rimming (male &gt; female and female &gt; female), group, titty fucking, squirting, anal, toys, and DP (technical)\n\nRaincoat Factor: Extreme\n\nCondom Usage: None \n\n\n\n\n\n.\n","torrent":{"xt":"urn:btih:2dd4ce53553276ce60463d1f5dbeb455b6f18d5d","amp;dn":"Supersquirt+2%3A+The+Drenching+%28DVD.xvid%29+-+anal%2C+squirting","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dd4ce53553276ce60463d1f5dbeb455b6f18d5d","infoHashBuffer":{"type":"Buffer","data":[45,212,206,83,85,50,118,206,96,70,61,31,93,190,180,85,182,241,141,93]},"announce":[],"urlList":[]}}