{"title":"A Materialism for the Masses by Ward Blanton (2014) [5 Versions]","uid":10573652,"size":38560646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2df19fd7206571f30ace670415d3cef6df0aaec8&amp;dn=A+Materialism+for+the+Masses+by+Ward+Blanton+%282014%29+%5B5+Versions%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405620296,"description":"\nTitle: A Materialism for the Masses - Saint Paul and the Philosophy of Undying Life\nAuthor: Ward Blanton\nCategory: Academic/Religion/Philosophy\nSeries: Insurrections: Critical Studies in Religion, Politics, and Culture\nPublisher: Columbia University Press (February 25, 2014)\nLanguage: English\nISBN-10: 0231166915\nISBN-13: 978-0231166911\n\nPromotional info/Publisher's summary - &quot;Nietzsche and Freud saw Christianity as metaphysical escapism, with Nietzsche calling the religion a &quot;Platonism for the masses&quot; and faulting Paul the apostle for negating more immanent, material modes of thought and political solidarity. Integrating this debate with the philosophies of difference espoused by Gilles Deleuze, Michel Foucault, Jacques Derrida, Jacques Lacan, and Pier Paolo Pasolini, Ward Blanton argues that genealogical interventions into the political economies of Western cultural memory do not go far enough in relation to the imagined founder of Christianity.\n\nBlanton challenges the idea of Paulinism as a pop Platonic worldview or form of social control. He unearths in Pauline legacies otherwise repressed resources for new materialist spiritualities and new forms of radical political solidarity, liberating &quot;religion&quot; from inherited interpretive assumptions so philosophical thought can manifest in risky, radical freedom.&quot;\n\nReviews:\n&quot;Ward Blanton's handling -- and mastery -- of Western philosophical traditions provides a much more convincing account of Christian origins as well as a greater appreciation of the ways in which power works in the present.&quot; -James Crossley, University of Sheffield\n\n&quot;Ward Blanton attempts nothing less than the overthrow of an understanding of Paul that has dominated philosophical criticism since Nietzsche. Blanton is convinced that Paul is better understood within a repressed tradition of Western thought that Althusser called a 'materialism of the encounter' and that Blanton names 'materialist spirituality.' He pursues two intertwined goals: the destruction of the image of Paul as a metaphysical dualist and the resurrection of an originary Paulinism which is materialist in invigorating life in this world with messianic hope. Blanton writes with an intensity that is hypnotic. There is nothing like his book in existing scholarship.&quot; -Laurence L. Welborn, Fordham University\n\nThis torrent contains the original retail EPUB as well as conversions into MOBI, AZW3, LIT, and large print PDF formats done in Calibre. The front cover image and generated metadata.opf file are also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:2df19fd7206571f30ace670415d3cef6df0aaec8","amp;dn":"A+Materialism+for+the+Masses+by+Ward+Blanton+%282014%29+%5B5+Versions%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2df19fd7206571f30ace670415d3cef6df0aaec8","infoHashBuffer":{"type":"Buffer","data":[45,241,159,215,32,101,113,243,10,206,103,4,21,211,206,246,223,10,174,200]},"announce":[],"urlList":[]}}