{"title":"El imaginario del Doctor Parnassus[DVDrip][AC3 Spanish]","uid":5518652,"size":1982347264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e03e624e8b56f2fea96b7880b07ab5c39bc78ee&amp;dn=El+imaginario+del+Doctor+Parnassus%5BDVDrip%5D%5BAC3+Spanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sahae","files":1,"time":1272373410,"description":"Reparto\nHeath Ledge, Johnny Depp, Colin Farrell, Jude Law, Christopher Plummer, Vern Troyer, Tom Waits\nDirectorTerry Gilliam\nproductor\nTerry Gilliam, William Vince, Amy Gilliam, Samuel Hadida\nDuraciÃƒÂ³n\n02:02:00\nEstreno\nviernes 23 octubre 2009\nGÃƒÂ©nero\nAventuras\nPaÃƒÂ­s\nReino Unido,CanadÃƒÂ¡,Francia\nDistribuidora\nSony Pictures\n\nSinopsis\n\n\n\n&quot;El Imaginario del Doctor Parnassus&quot; es una moraleja del gÃƒÂ©nero fantÃƒÂ¡stico que transcurre en la ÃƒÂ©poca actual. Cuenta la historia del Dr. Parnassus y su extraordinario &quot;Imaginario&quot;, un show itinerante donde el pÃƒÂºblico tiene la irresistible oportunidad de elegir entre la luz y la alegrÃƒÂ­a, o entre la oscuridad y la tristeza.\n\nEl Doctor Parnassus posee el extraordinario don de guiar la imaginaciÃƒÂ³n de los demÃƒÂ¡s, pero sobre ÃƒÂ©l recae una oscura maldiciÃƒÂ³n secreta. Jugador empedernido, miles de aÃƒÂ±os atrÃƒÂ¡s hizo una apuesta con el demonio, Mr. Nick, con la que se ganÃƒÂ³ la inmortalidad. Siglos mÃƒÂ¡s tarde, al conocer a su amor verdadero, Dr. Parnassus hizo otro trato con el diablo, comerciando su inmortalidad por su juventud, con la condiciÃƒÂ³n de que cuando su hija alcanzara la edad de 16 aÃƒÂ±os, pasara a ser propiedad de Mr. Nick.\n\nValentina estÃƒÂ¡ cada vez mÃƒÂ¡s cerca de esta importante fecha y el Dr. Parnassus estÃƒÂ¡ desesperado por protegerla de su inminente destino. Mr. Nick se presenta para llevÃƒÂ¡rsela pero como siempre estÃƒÂ¡ dispuesto a hacer una nueva apuesta, renegocia el envite. Se quedarÃƒÂ¡ con Valentina el que primero seduzca a cinco almas. En su viaje recluta a una serie de personajes salvajes, cÃƒÂ³micos y convincentes, y el Dr. Parnassus entregarÃƒÂ¡ ÃƒÂºnicamente la mano de su hija a aquel que le ayude a ganar.\n\nEn esta contrarreloj fascinante, explosiva y tremendamente imaginativa, el Dr. Parnassus deberÃƒÂ¡ luchar para salvar a su hija en un entorno donde los obstÃƒÂ¡culos se suceden de manera interminable y asÃƒÂ­ deshacer los errores de su pasado de una vez por todas.\n\n","torrent":{"xt":"urn:btih:2e03e624e8b56f2fea96b7880b07ab5c39bc78ee","amp;dn":"El+imaginario+del+Doctor+Parnassus%5BDVDrip%5D%5BAC3+Spanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e03e624e8b56f2fea96b7880b07ab5c39bc78ee","infoHashBuffer":{"type":"Buffer","data":[46,3,230,36,232,181,111,47,234,150,183,136,11,7,171,92,57,188,120,238]},"announce":[],"urlList":[]}}