{"title":"Albert King - 1972 - I'll Play The Blues For You (2012) FLAC","uid":8779031,"size":394868517,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2e053c08e1386ddd9c2b3abaeb1b5e3641f505f3&amp;dn=Albert+King+-+1972+-+I%27ll+Play+The+Blues+For+You+%282012%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1375634936,"description":"Albert King - 1972 - I'll Play The Blues For You (2012)\n\nIt's not as if Albert King hadn't tasted success in his first decade and a half as a performer, but his late-'60s/early-'70s recordings for Stax did win him a substantially larger audience. During those years, the label began earning significant clout amongst rock fans through events like Otis Redding's appearance at the Monterey International Pop Festival and a seemingly endless string of classic singles. When King signed to the label in 1966, he was immediately paired with the Stax session team Booker T. &amp; the MG's. The results were impressive: &quot;Crosscut Saw,&quot; &quot;Laundromat Blues,&quot; and the singles collection Born Under a Bad Sign were all hits. Though 1972's I'll Play the Blues for You followed a slightly different formula, the combination of King, members of the legendary Bar-Kays, the Isaac Hayes Movement, and the sparkling Memphis Horns was hardly a risky endeavor. The result was a trim, funk-infused blues sound that provided ample space for King's oft-imitated guitar playing. King has always been more impressive as a soloist than a singer, and some of his vocal performances on I'll Play the Blues for You lack the intensity one might hope for. As usual, he more than compensates with a series of exquisite six-string workouts. The title track and &quot;Breaking Up Somebody's Home&quot; both stretch past seven minutes, while &quot;I'll Be Doggone&quot; and &quot;Don't Burn Down the Bridge&quot; (where King coaxes a crowd to &quot;take it to the bridge,&quot; James Brown-style) break the five-minute barrier. Riding strutting lines by bassist James Alexander, King runs the gamut from tough, muscular playing to impassioned cries on his instrument, making I'll Play the Blues for You one of a handful of his great Stax sets. (AllMusic)\n\nTrack list:\n01 - I'll Play The Blues For You\n02 - Little Brother (Make A Way)\n03 - Breaking Up Somebody's Home\n04 - High Cost Of Living\n05 - I'll Be Doggone\n06 - Answer To The Laundromat Blues\n07 - Don't Burn Down The Bridge ('Cause You Might Want To Come Back Across)\n08 - Angel Of Mercy\n09 - I'll Play The Blues For You (alt)\n10 - Don't Burn Down The Bridge ('Cause You Might Want To Come Back Across) (alt)\n11 - I Need A Love\n12 - Albert's Stomp\n\nEnjoy and share!","torrent":{"xt":"urn:btih:2e053c08e1386ddd9c2b3abaeb1b5e3641f505f3","amp;dn":"Albert+King+-+1972+-+I%27ll+Play+The+Blues+For+You+%282012%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e053c08e1386ddd9c2b3abaeb1b5e3641f505f3","infoHashBuffer":{"type":"Buffer","data":[46,5,60,8,225,56,109,221,156,43,58,186,235,27,94,54,65,245,5,243]},"announce":[],"urlList":[]}}