{"title":"Clive Barker's Jericho [Region: FREE]","uid":10955070,"size":7835494091,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:2e69def6eeed2696799eb4bbbf1f43174318b8ed&amp;dn=Clive+Barker%27s+Jericho+%5BRegion%3A+FREE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":7,"uploader":"zerodayz","files":-1,"time":1409672735,"description":"Title:     Clive Barker's Jericho\nReleased:  10/23/07\nPlatform:  Xbox360\nGenre:     Action/Shooter\nRegion:    Region Free\nFiles:     71x100mb\nhttp:     &lt;a href=&quot; http://www.ebgames.com/product.asp?product_id=200043&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.ebgames.com/product.asp?product_id=200043&lt;/a&gt;\n\nDescription: Clive Barker's Jericho is a squad-based Action/Horror game based on an original concept and story by acclaimed horror writer and film maker Clive Barker.  The most ancient of evils has broken through into our world and is\nthreatening to spread its taint across the whole of the earth unless it's stopped. At ground zero lies the Middle Eastern city of Al-Khali, a modern city built atop the ancient ruins of a dozen previous conquerors. All attempts of contacting the citizens of the city have failed. With tensions already running high in the region, this is just the sort of thing that could trigger the apocalypse In Clive Barker's Jericho, players assume the role of the leader of the Jericho Squad  a seven man Special Forces strike team that protects U.S. interests against paranormal threats. Each member of the squad is an expert in modern warfare as well as their own different para-psychological disciplines, including clairvoyance, alchemy, blood magic, exorcism, etc. Players must lead the Jericho Squad into the flaming ruins of the city, moving block by block towards the dimensional rift tearing away at its heart. Along the way, they encounter the horrific armies of hellish denizens that now rule the city and corrupt everything they touch. As players incrementally approach the source of evil, they will have to rely less and less on traditional weapons and instead focus on the combined psychic talents of the Jericho Squad.\n\n\n","torrent":{"xt":"urn:btih:2e69def6eeed2696799eb4bbbf1f43174318b8ed","amp;dn":"Clive+Barker%27s+Jericho+%5BRegion%3A+FREE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e69def6eeed2696799eb4bbbf1f43174318b8ed","infoHashBuffer":{"type":"Buffer","data":[46,105,222,246,238,237,38,150,121,158,180,187,191,31,67,23,67,24,184,237]},"announce":[],"urlList":[]}}