{"title":"Raphael Brown - The Little Flowers of St. Francis (pdf)","uid":8305203,"size":7606932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f48e86e51d02692a070301fdfe7e534b2cb2615&amp;dn=Raphael+Brown+-+The+Little+Flowers+of+St.+Francis+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1364352733,"description":"Raphael Brown, translator - The Little Flowers of St. Francis (Image, 1958). 359 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nClassic collection of stories about St. Francis of Assisi and his early companions. Many are historically dubious but have nevertheless deeply influenced devotion to St. Francis and the popular image of him.\n\ndescription:\n\nHere is a book that generation after generation has taken to its heart, for it lives and breathes the spirit of St. Francis as no other book has ever done. It is irresistible. The warmth of Franciscan love and joy radiates from every page. The best-loved stories of the Poverello and his followers are all here: Francis's sermon to the birds... the Stigmata... the wolf of Gubbio... the preaching of St. Anthony... the soaring &quot;Canticle of Brother Sun&quot;... the lives and sayings of Brother Juniper and Brother Giles.\n\nThis edition -- the only complete version -- has been translated into modern English by Raphael Brown, the well-known Franciscan scholar whose own deep feeling for St. Francis has helped him capture the spirit and flavor that gives these writings their indescribable charm. Truly universal is the appeal of this book, extending to people of all faiths and of every intellectual level. It is wise, very funny, rich in human wisdom, inspiring. Above all, it is a love story... the story of how the Little Poor Man taught the world about the love of Christ, and how this love can be lived and enjoyed by everyone.\n\nYou can find St. Francis' and St. Clare's own writings here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8196661&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8196661&lt;/a&gt;\n\nOther books about St. Francis are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8267686&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8267686&lt;/a&gt;\n\nand here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8305196&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8305196&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2f48e86e51d02692a070301fdfe7e534b2cb2615","amp;dn":"Raphael+Brown+-+The+Little+Flowers+of+St.+Francis+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f48e86e51d02692a070301fdfe7e534b2cb2615","infoHashBuffer":{"type":"Buffer","data":[47,72,232,110,81,208,38,146,160,112,48,31,223,231,229,52,178,203,38,21]},"announce":[],"urlList":[]}}