{"title":"The Enemy By Lee Child","uid":8098352,"size":1656504,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f683fcc3e24df70d69e44249c651f9cee6b4477&amp;dn=The+Enemy+By+Lee+Child&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"maxdesolate","files":5,"time":1359908728,"description":"\nJack Reacher. Hero. Loner. Soldier. Soldier's son. An elite military cop, he was one of the army's brightest stars. But in every cop's life there is a turning point. One case. One messy, tangled case that can shatter a career. Turn a lawman into a renegade. And make him question words like honor, valor, and duty. For Jack Reacher, this is that case.\n\nNew Year's Day, 1990. The Berlin Wall is coming down. The world is changing. And in a North Carolina &quot;hot-sheets&quot; motel, a two-star general is found dead. His briefcase is missing. Nobody knows what was in it. Within minutes Jack Reacher has his orders: Control the situation. But this situation can't be controlled. Within hours the general's wife is murdered hundreds of miles away. Then the dominoes really start to fall.\n\nTwo Special Forces soldiers--the toughest of the tough--are taken down, one at a time. Top military commanders are moved from place to place in a bizarre game of chess. And somewhere inside the vast worldwide fortress that is the U.S. Army, Jack Reacher--an ordinarily untouchable investigator for the 110th Special Unit--is being set up as a fall guy with the worst enemies a man can have.\n\nBut Reacher won't quit. He's fighting a new kind of war. And he's taking a young female lieutenant with him on a deadly hunt that leads them from the ragged edges of a rural army post to the winding streets of Paris to a confrontation with an enemy he didn't know he had. With his French-born mother dying--and divulging to her son one last, stunning secret--Reacher is forced to question everything he once believed...about his family, his career, his loyalties--and himself. Because this soldier's son is on his way into the darkness, where he finds a tangled drama of desperate desires and violent death--and a conspiracy more chilling, ingenious, and treacherous than anyone could have guessed. &quot;\n\nEPUB,MOBI AND TXT.","torrent":{"xt":"urn:btih:2f683fcc3e24df70d69e44249c651f9cee6b4477","amp;dn":"The+Enemy+By+Lee+Child","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f683fcc3e24df70d69e44249c651f9cee6b4477","infoHashBuffer":{"type":"Buffer","data":[47,104,63,204,62,36,223,112,214,158,68,36,156,101,31,156,238,107,68,119]},"announce":[],"urlList":[]}}