{"title":"A History of God - Karen Armstrong","uid":6764365,"size":5588327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fbbc58b8132569093b24633eb59fc3f0fa2ade3&amp;dn=A+History+of+God+-+Karen+Armstrong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rosie1966","files":2,"time":1319316449,"description":"A History of God: The 4,000-Year Quest of Judaism, Christianity and Islam\n\n\n\nArmstrong, a British journalist and former nun, guides us along one of the most elusive and fascinating quests of all time--the search for God. Like all beloved historians, Armstrong entertains us with deft storytelling, astounding research, and makes us feel a greater appreciation for the present because we better understand our past. Be warned: A History of God is not a tidy linear history. Rather, we learn that the definition of God is constantly being repeated, altered, discarded, and resurrected through the ages, responding to its followers' practical concerns rather than to mystical mandates. Armstrong also shows us how Judaism, Christianity, and Islam have overlapped and influenced one another, gently challenging the secularist history of each of these religions.\n\n\nThis searching, profound comparative history of the three major monotheistic faiths fearlessly illuminates the sociopolitical ground in which religious ideas take root, blossom and mutate. Armstrong, a British broadcaster, commentator on religious affairs and former Roman Catholic nun, argues that Judaism, Christianity and Islam each developed the idea of a personal God, which has helped believers to mature as full human beings. Yet Armstrong also acknowledges that the idea of a personal God can be dangerous, encouraging us to judge, condemn and marginalize others. Recognizing this, each of the three monotheisms, in their different ways, developed a mystical tradition grounded in a realization that our human idea of God is merely a symbol of an ineffable reality. To Armstrong, modern, aggressively righteous fundamentalists of all three faiths represent &quot;a retreat from God.&quot; She views as inevitable a move away from the idea of a personal God who behaves like a larger version of ourselves, and welcomes the grouping of believers toward a notion of God that &quot;works for us in the empirical age.&quot; 25,000 first printing; BOMC alternate.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:2fbbc58b8132569093b24633eb59fc3f0fa2ade3","amp;dn":"A+History+of+God+-+Karen+Armstrong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fbbc58b8132569093b24633eb59fc3f0fa2ade3","infoHashBuffer":{"type":"Buffer","data":[47,187,197,139,129,50,86,144,147,178,70,51,235,89,252,63,15,162,173,227]},"announce":[],"urlList":[]}}