{"title":"A Convenient Spy: Wen Ho Lee and the Politics of Nuclear Espiona","uid":8642858,"size":4176749,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fcf439e22ca6bef678bed33d1867a8562c51be2&amp;dn=A+Convenient+Spy%3A+Wen+Ho+Lee+and+the+Politics+of+Nuclear+Espiona&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"blackatk","files":-1,"time":1372912957,"description":"No espionage case in recent decades has been anything like the Wen Ho Lee affair. As Dan Stober and Ian Hoffman describe in A Convenient Spy, an astonishingly inept investigation of a crime that may never have occurred ended in a national disgrace. A weapons-code scientist at Los Alamos National Laboratory, Lee was hunted as a spy for China, indicted on fifty-nine counts, and held in detention for nine months as a threat to the entire nation. But after pleading guilty to just one count, he went home -- with an unusual and emotional apology from a federal judge. Prosecutors' claims that Lee had stolen America's &quot;crown jewels&quot; of nuclear security simply evaporated. Yet Lee's motives have never been satisfactorily explained, and his often-repeated excuse that he was just backing up his work files does not stand up to scrutiny.\n\nAs Stober and Hoffman report, Lee's lies and his unexplained connections to foreign scientists spanned eighteen years. He was a security nightmare. Tapping at his keyboard, he assembled a private collection of the computer programs used to design America's nuclear weapons, then left them vulnerable to hackers and foreign intelligence services for years. The FBI's belated discovery that he had also put the codes on portable cassette tapes launched a frenzied worldwide search that eventually carried agents to the Los Alamos landfill. And yet today, the tapes have never been found.\n\nIn 1995, Lee was just another American, a Taiwanese immigrant striving to support a family he cherished and to make a name for himself in scientific circles. Unknown to him, however, scientists working in the secret world of nuclear-weapons intelligence examined purloined Chinese documents, studied spy reports, and wondered: Had China stolen the secrets of the W88, America's most advanced nuclear weapon? Scientific hunches rapidly evolved into a criminal investigation aimed at Lee. He had been overheard by the FBI while telephoning a spy suspect, and he was warmly embraced by a high-ranking Chinese nuclear-weapons official whom he wasn't supposed to know. The FBI noted that he was &quot;ethnic Chinese.&quot; And in this uncertain period after the Cold War, many politicians played up China as a threatening new enemy. Energy Secretary and vice presidential hopeful Bill Richardson was eager to fire Lee and appear decisive in protecting national security.\n\nIn this stormy confluence of intelligence and politics, Lee became a convenient spy. But was he guilty?\n\nDan Stober and Ian Hoffman tell the story of the Wen Ho Lee fiasco dramatically and authoritatively, providing an objective account that no partisan version of the story can match.\n\n\n\n384 Pages\nPublisher \tSimon &amp; Schuster (August 3, 2007)\nLanguage \tEnglish\nISBN-10 \t1416572090\nISBN-13 \t978-1416572091\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Convenient-Spy-Politics-Nuclear-Espionage/dp/1416572090/ref=sr_1_3?s=books&amp;ie=UTF8&amp;qid=1372905337&amp;sr=1-3&amp;keywords=wen+ho+lee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Convenient-Spy-Politics-Nuclear-Espionage/dp/1416572090/ref=sr_1_3?s=books&amp;ie=UTF8&amp;qid=1372905337&amp;sr=1-3&amp;keywords=wen+ho+lee&lt;/a&gt;","torrent":{"xt":"urn:btih:2fcf439e22ca6bef678bed33d1867a8562c51be2","amp;dn":"A+Convenient+Spy%3A+Wen+Ho+Lee+and+the+Politics+of+Nuclear+Espiona","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fcf439e22ca6bef678bed33d1867a8562c51be2","infoHashBuffer":{"type":"Buffer","data":[47,207,67,158,34,202,107,239,103,139,237,51,209,134,122,133,98,197,27,226]},"announce":[],"urlList":[]}}