{"title":"Muhammad Ali Parkinson interview (October 10th, 1971)","uid":8939544,"size":687269977,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:307aba838e40c39ea2cce86404ef91a31b016924&amp;dn=Muhammad+Ali+Parkinson+interview+%28October+10th%2C+1971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cockymountainoyster","files":-1,"time":1379634802,"description":"Muhammad Ali Parkinson interview (October 10th, 1971)\n\nVideo: 720x540 NTSC (DX50)\nAudio: MP3 (48 khz, 128 kb/s)\n\n Runtime: 56 minutes, MKV format.\n\nWhat about the poetry, was that you're idea?\n\n &quot; Well yes.. when I fought Archie Moore I wrote a poem, I said &quot; When you come to the fight, don't block the aisles, and don't block the door, for you all may go home after round four. From then on, I've been writing poems, and I just completed a few more poems I probably could tell you later, on other subjects. &quot;\n\nWhen is your first recollection as a child, of being a second-class citizen?\n\n &quot; A second class? No.. fifth, sixteenth-class! They used to always say we're second-class citizens.. I used to always say to my mother, I said: Mama, how come we're second class citizens? The African can go where I can't go, the Chinese can go where I can't go in America, the Englishmen, you can call them the white Americans, can set up businesses and do the things that I can't do.. and the Puerto-Rican, the Hawaiian, and just about everybody came before the black people, and were more respected. So I said if we were just second-class citizens we'd be doing alright, but we were way down farm South! Aw man, we were second-class citizens we'd be driving all Cadillacs, livin' good, first class, we'd be drivin' Rolls-Royce.. &quot;\n\n &quot;..And the angel food-cake was the white cake, and the devil food-cake was the chocolate cake! And the president lived in the white house, and Mary had a little lamb his feet is white as snow, and Snow White, and everything was white, Santa Claus was white, and everything bad was black! The little ugly duckling was a black duck, and the black cat was the bad luck, and if I threatened you I'm gonna blackmail you.. I said: Mama, why don't you call it white male, they lie too! &quot;\n\nYou disagree with the war in Vietnam, is it because you.. (?)\n\n &quot; I believe in the Holy Qur'an, it says we who declare ourselves to be righteous Muslims will not take part in any wars, and in no way fashion or form take the lives of other humans unless it's a holy-war declared by God himself. I think anybody that's in his right mind, if he knew it was God calling him, he would go fight for God. &quot;\n\nWould you like to be president?\n\n &quot; No! No, Sir! Too dangerous! Like, in other words: Here's a ship, people are dancing on the ship, a lot of money's on the ship, a lot of food's on the ship, and I cannot integrate on the ship, I cannot have equality on the ship, I'm just in the galley working, and I never could get up and see the captain of the ship. Now, all of the sudden the man tells me: Say, come on down Ali, out of the galley! I want you to come up here, here, have something to drink, what do you want? And giving me number-one spot, from the galley to the number-one spot, I said: The Ship Must Be Sinking! Why is he so nice to me now? What moves him to call me up here? Black men have been mayors, and now one might be the president! America's in too much trouble, I don't want that job now! (laughter) Something to think about, ain't it? &quot;\n\n &quot; Who ever thought when they come to the fight,\n that they would witness the launching of a coloured satellite! &quot;\n\nThis is an epic interview, you should save and seed it, thank you.\n\nv=Ba23hxCDrM4\nv=4LvNDn1eBNw\n\n (seeds please)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/cockymountainoyster&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/cockymountainoyster&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:307aba838e40c39ea2cce86404ef91a31b016924","amp;dn":"Muhammad+Ali+Parkinson+interview+%28October+10th%2C+1971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"307aba838e40c39ea2cce86404ef91a31b016924","infoHashBuffer":{"type":"Buffer","data":[48,122,186,131,142,64,195,158,162,204,232,100,4,239,145,163,27,1,105,36]},"announce":[],"urlList":[]}}