{"title":"LEMMINGS REVOLUTION.zip","uid":4992347,"size":538665826,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:30a8b69b9df83ce108a4c1375423f2777bd0c536&amp;dn=LEMMINGS+REVOLUTION.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cgcarter1","files":1,"time":1247107748,"description":"The Lemmings series is revered by both puzzle- and strategy-game fans, especially those who enjoy solving puzzle after mind-wracking puzzle into the wee hours. In Lemmings Revolution, developers Psygnosis and Take 2 have combined the addictive gameplay of the original Lemmings with smooth, accelerated 3D graphics. The gameplay and graphics are complemented with an interface that makes the game both easy to learn and fun to play. Were it not for a few bugs the game shipped with and a marked lack of settings options, Lemmings Revolution might have been the ultimate game for Lemmings fanatics. \n\nThe Lemmings gameplay is inextricably linked with the nature of the actual Norwegian rodent, which is famous for its bizarre migrating pattern in which huge masses of lemmings often end up careening into the sea to their deaths. Basically, a Lemming will stop at nothing to complete its migration. As in previous Lemmings games, each level in Lemmings Revolution requires that you get a certain number of lemmings safely from point A to point B. Point A is a box out of which your lemmings drop one by one. Point B is an escape balloon waiting in another area of the level. In between the points lies a host of traps and obstacles that this procession of little critters must negotiate. Lemmings won't try to save themselves - instead they walk aimlessly off every steep cliff and into every skull-crushing spike and pool of lava in their path. As the lemmings march on relentlessly, you must assign them skills to help them surmount these obstacles. The various skills have remained largely the same since the original 1991 game, and they include abilities such as building walkways, climbing, digging through platforms, and gliding down from high above. You're allocated a finite number of each skill to assign per level. As the levels increase in difficulty, you're given a wider variety of skills and a fewer number of each skill to spare. This is where the gameplay begins to get intensely challenging and fun. \n\nAs the levels become more complex, you must take a number of other elements into account. One new feature, the antigravity pad, makes for some interesting situations. When a lemming steps onto one of these, it flips upside down, landing either on the ceiling or on the ground, depending on where it started. With a few antigravity pads on a level, you're faced with the task of making sure the marching horde doesn't fall downward - or upward - to its death. Also, there are switches you'll have to toggle. Often you'll have to guide a single lemming to an area where it can trip a switch, which in turn triggers an event such as rising water or a retracting barrier. Water and acid pits also come into play relatively soon in the game. To traverse these safely you must employ water and acid-oriented lemmings, respectively. The wide variety of game elements opens up many gameplay possibilities. \n\nIn spite of the new additions, the classic Lemmings gameplay remains intact in Lemmings Revolution. However, the revolving 3D levels put a new spin on the action, literally. Part of playing the game involves constantly rotating the cylindrical map in order to keep an eye on your lemmings' activities. Rotating is easy, as it simply requires that you right-click and drag. The game also has a good pause feature. As levels get increasingly harder, you can pause mid-game and rotate to check the position of each lemming. This gives you time to plan out a strategy. While paused, you can select any lemming onscreen to ready it for its next job. Once you assign the lemming a task, it immediately goes to work, and the game un-pauses. To really hone in on what you're doing, you can hit the space bar to zoom in and out of the map. \n\nLike previous Lemmings games, Lemmings Revolution has great level design. The early levels are simple, and they serve to acquaint you with the various types of lemmings skills. Later levels become increasingly difficult, as they force you to plan and manage your resources with the utmost care. Whenever you complete a level, two slightly tougher levels become available. This means that if a level becomes frustrating, you can simply quit to the level-select screen and take a stab at another. Still, it would have been nice if the developers could have included the auto-replay feature found in 3D Lemmings, where the computer replayed a level up to the point where you chose to take over for yourself. \n\nLemmings Revolution is probably the finest-looking game of the series, yet fans of spectacular 3D effects may be disappointed, as the levels are a bit stark. Of course, this graphical compromise means that the game will run smoothly on 266MHz systems on up. You may have scores of lemmings wandering onscreen during a game, but the graphic simplicity of the levels ensures that slowdown isn't likely to occur. \n\nAs it is, Lemmings Revolution lacks any kind of video options, and it won't let you assign your own controls. What's more, it shipped with a few sound, video, and input-device bugs that may cause problems for some players who are loading up the game for the first time. The game practically begs for a patch that addresses these issues. \n\n","torrent":{"xt":"urn:btih:30a8b69b9df83ce108a4c1375423f2777bd0c536","amp;dn":"LEMMINGS+REVOLUTION.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30a8b69b9df83ce108a4c1375423f2777bd0c536","infoHashBuffer":{"type":"Buffer","data":[48,168,182,155,157,248,60,225,8,164,193,55,84,35,242,119,123,208,197,54]},"announce":[],"urlList":[]}}