{"title":"Die Hard Trilogy 1 and 2 (Full PSX Collection) (PS1) (ePSXe)","uid":6202451,"size":799754538,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:315112e4ac561c8d79ef63dbecd557705f3d73f4&amp;dn=Die+Hard+Trilogy+1+and+2+%28Full+PSX+Collection%29+%28PS1%29+%28ePSXe%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FuCtUpPuNk","files":8,"time":1298669354,"description":"INSTALLATION:\nUse an Emulator to run the games.\nRecommended: ePSXe 1.6 or 1.7\n\nI have also uploaded the emulator to run this game on all of the following link:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&lt;/a&gt;\n----------------------------\n----------------------------\n----------------------------\n\nDIE HARD TRILOGY 1:\nDie Hard Trilogy is a video game based on the first three installments of the Die Hard series of action movies. Die Hard Trilogy features three games in one, each based on a movie installment and featuring a different genre and game play style respectively. The game was well received and would eventually become a Sony Greatest Hits game.\n\nCHAPTERS:\n\nDie Hard:\nis a third-person shooter. The player battles terrorists and rescues hostages in the Nakatomi Plaza,which is the setting of the film.\n\nDie Hard 2: Die Harder:\nis presented as a rail shooter, where the player must stop terrorists who have taken over Dulles Airport.\nPlayers control the crosshair with a gamepad, light gun, or, on PC, a mouse. Die Hard Trilogy was one of the few light gun games available for the PlayStation that was not compatible with Namco's GunCon/G-Con 45 controller or GunCon 2. However, it was compatible with Sega's stunner light gun for the Saturn version.\n\nDie Hard with a Vengeance:\nthe player goes on a joy ride driving a taxicab, sports car, and dump truck throughout of New York City and is tasked with finding and defusing several explosives before they can go off.\n--------------------\n--------------------\n--------------------\n\nDIE HARD TRILOGY 2:\n\nLike its predecessor, the game features three distinct genres; a third-person shooter, a light gun game, and an action driving game. However, unlike Die Hard Trilogy, which featured three separate storylines based on the first three Die Hard films, Die Hard Trilogy 2 features a single original storyline that alternates between the three genres throughout the levels.\n\nPLOT:\nJohn McClane is living in an apartment in New York until he receives a phone call from Kenny Sinclair, his best friend in the New York Police Department to come to Las Vegas. Sinclair was appointed as the new warden of the Mesa Grande Prison and is throwing a party in his honor. McClane accepts the invitation. At the party, McClane gets into a brief conversation about a prisoner named Klaus Van Haug, and meets Reese Hoffman, the owner of the Roaring 20's Casino, and his secretary Elena Goshkin. But however, during the party Von Haug got out of his cell and freed every inmate there which meant it was up to McClane to annihilate bloodthirsty terrorist thugs again.\nMcClane successfully takes out the terrorists in true Die Hard form, fights his way back to the party, and before any innocents are harmed, finish out the last of them. He finds out from one of the party members that some more terrorists have taken hostages in a bus elsewhere. McClane follows them in a vehicle to the desert, fights off other bad drivers and catches up to the bus which has flipped over. He fights off terrorists some more and rescues the hostages. Von Haug's fate is not revealed.\nAs the game progressed, it is later revealed that Kenny, Reese, and Elena are all in on the terrorist plot in their attempt to control Las Vegas. McClane dispatches them all, with Kenny being saved for last.\nThe game's entire storyline has been considered non-canon since the release of Die Hard 4 which contradicts many plot elements.\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:315112e4ac561c8d79ef63dbecd557705f3d73f4","amp;dn":"Die+Hard+Trilogy+1+and+2+%28Full+PSX+Collection%29+%28PS1%29+%28ePSXe%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"315112e4ac561c8d79ef63dbecd557705f3d73f4","infoHashBuffer":{"type":"Buffer","data":[49,81,18,228,172,86,28,141,121,239,99,219,236,213,87,112,95,61,115,244]},"announce":[],"urlList":[]}}