{"title":"Naruto Shippuuden - 427 [720p].mkv","uid":12341539,"size":330732070,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:3185d1b52cd945edb82ae788ada1ec61daf78e8d&amp;dn=Naruto+Shippuuden+-+427+%5B720p%5D.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Freeswe","files":1,"time":1441306400,"description":"Air date: 03 September 2015\nSummary [AniDB]: The second incarnation of the very popular NARUTO anime. It covers Part II of the manga storyline which takes place two years after Part I (which ends with the Sasuke Retrieval arc, episodes 107-135 of the first TV series). The anime chronology differs from the manga as the Shippuuden series happens two and a half years after the end of the first Naruto series. The story revolves mainly around Uzumaki Naruto`s and Haruno Sakura`s new adventures and their search for Uchiha Sasuke after he left Konoha-gakure (Leaf Village) to gain Orochimaru`s power. The plot also shows a more active Akatsuki in their quest for obtaining all the tailed beasts. After his failed attempt to retrieve Sasuke, Naruto learns that circumstances have granted him slightly less than three years to prepare for a confrontation with Orochimaru, who has to wait that much time before he can transfer into Sasuke`s body. Naruto also must prepare for his eventual confrontation with Akatsuki, who are after the demon sealed within him. To prepare, Naruto leaves the village and undergoes intensive training under Jiraiya. At the same time, Sakura becomes Tsunade`s apprentice, and Sasuke trains under Orochimaru. Thus, all three members of the original Team 7 are now training under one of the Legendary Sannin.\n &lt;a href=&quot;\nhttp://mega-pixs.eu/image/DT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mega-pixs.eu/image/DT&lt;/a&gt;","torrent":{"xt":"urn:btih:3185d1b52cd945edb82ae788ada1ec61daf78e8d","amp;dn":"Naruto+Shippuuden+-+427+%5B720p%5D.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3185d1b52cd945edb82ae788ada1ec61daf78e8d","infoHashBuffer":{"type":"Buffer","data":[49,133,209,181,44,217,69,237,184,42,231,136,173,161,236,97,218,247,142,141]},"announce":[],"urlList":[]}}