{"title":"Topgrl--Analyzing Ashley  Ashley Lane  Elise Graves Low","uid":10980142,"size":1309542529,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:32a1680b7bb853af1480c187f035e3516ac70efa&amp;dn=Topgrl--Analyzing+Ashley++Ashley+Lane++Elise+Graves+Low&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"merzedes","files":-1,"time":1409860936,"description":"Analyzing Ashley | Ashley Lane | Elise Graves \n\nSeptember 3, 2014\n\n\nLow bitrate MP4 only.\n\n\nYou've probably seen Ashley on our sites before. You've seen her take orgasms. You've seen her take pain. \nBut does that necessarily mean you have any idea who Ashley Lane really is? \n\nShe's quiet, that's for sure. I'm quite sure that she is quite unsure of herself. In a young and clueless sort of way.\n\nBut let's hear it from her own mouth. Who does she think she is? How would she describe herself? Is she too unfamiliar with herself to satisfactorily answer those questions?\n\nOnly through the rigors of bondage are we given the opportunity to see glimpses of the real Ashley. Ashley without anxiety. Ashley without tension. Ashley without fear of embarrassment. \n\nAshley begins her journey in an asymmetrical rope tie and leather hood, being lead to the bed. One darkened footstep by another. She stands there silently as a near stranger gropes her body - not really having an opinion on the matter either way. \nOnce shoved onto the bed, Ashley is further secured in an erotically exposed spread. Removal of her clothing reveals a tight rope harness that snugly crafts a very pretty pink rose bud pussy. It's difficult not to play with that pussy. \n\nLet's stand this tall drink of water up on her feet and see what she can do. Her vision is blacked out, her legs spread, and her pussy clamped with electrics. After forcing Ashley into a standing arched back position, she graciously waits for the whip. My whip really likes her pale skin.\n\nTime to bend her over. I need more from her. I need to see that she can share a deeper side of herself with me. She's not making this easy, so it's time to grab a cane. Time to cane some real emotion right out of Ashley Lane. \n\nShe's one tough nut to crack. \n \nScreens &lt;a href=&quot;\nhttp://topgrl.com/female/bondage/2014/09_03alane/TopGrl-Ashley-Lane-Elise-Graves-Analyzing-Ashley.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://topgrl.com/female/bondage/2014/09_03alane/TopGrl-Ashley-Lane-Elise-Graves-Analyzing-Ashley.php&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n","torrent":{"xt":"urn:btih:32a1680b7bb853af1480c187f035e3516ac70efa","amp;dn":"Topgrl--Analyzing+Ashley++Ashley+Lane++Elise+Graves+Low","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32a1680b7bb853af1480c187f035e3516ac70efa","infoHashBuffer":{"type":"Buffer","data":[50,161,104,11,123,184,83,175,20,128,193,135,240,53,227,81,106,199,14,250]},"announce":[],"urlList":[]}}