{"title":"Batman - The Television Series - Season 2, Part 3 [Uncut] [WEB-D","uid":11588655,"size":8397149047,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:3318e7859a7bd8e0263fe2ea7a45f770f8fce59a&amp;dn=Batman+-+The+Television+Series+-+Season+2%2C+Part+3+%5BUncut%5D+%5BWEB-D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"distinctive61783","files":20,"time":1417203849,"description":"Batman - The Television Series - Season 2, Part 3 [Uncut] [WEB-DL 1080P] [Subtitles Included]\n\nThe original Batman television series, from the 1960's has finally been released completely uncut and digitally remastered. \n\nIn this torrent, you will find the third 10 episodes from the show's second season. All episodes are in mkv format. Unlike my previous uploads of this series, these epsisodes are in 1080P, directly downloaded from the web and of extremely high quality. Pretty much, this is what the Blu-ray version of the episodes look like.\n\nIn addition, subtitles are now available on these episodes. You can turn them on/off depending on the media player you opt to use (VLC, KM, etc...). You can also use the .srt file that I have included for each episode. I know that was a big deal to many of you, so I am glad I can provide the subtitles this time around.\n\nYou may ask why the file sizes are so large. That is because I have NOT compressed the episodes with any software, as I did not want to reduce the quality the episodes at all. These episodes are the genuine real deal and I hope people appreciate me uploading them.\n\nIf this torrent is able to garner enough interest (comments/seeders), I will go forward with uploading more episodes in the same quality. I will seed for as long as I can but I need help. If people want these episodes in such good quality with subtitles, they need to (if they can of course) seed as well. Please be fair with that is all I ask.\n\nEnjoy as always. :)","torrent":{"xt":"urn:btih:3318e7859a7bd8e0263fe2ea7a45f770f8fce59a","amp;dn":"Batman+-+The+Television+Series+-+Season+2%2C+Part+3+%5BUncut%5D+%5BWEB-D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3318e7859a7bd8e0263fe2ea7a45f770f8fce59a","infoHashBuffer":{"type":"Buffer","data":[51,24,231,133,154,123,216,224,38,63,226,234,122,69,247,112,248,252,229,154]},"announce":[],"urlList":[]}}