{"title":"The Induction Series-MK-Ultra","uid":4099143,"size":4618780538,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3322b0de9e1f01c5253687880d71e91738e8ff30&amp;dn=The+Induction+Series-MK-Ultra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"BUBBBAS","files":46,"time":1206482490,"description":"Induction Into Authority - MK-Ultra Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ (Published September 9th 2007)\n-------------------------------------------------\n\nTo some, the very possibility of controlling someone else\\\\\\&amp;#039;s mind seems \nimpossible to consider, but when the moral and ethical restrictions of medicine\nand common law are removed, and the impending state of wartime measures \ndescends, every possibility is explored and exploited by the state in the\npursuit and preservation of National Security. As Hitler believed, the wars \nof the twentieth century are not fought on the battlefield, but in the minds\nof the people. This is more true today than it ever has been in the past.\n\nThis compilation deals specifically with the historical evidence and programs\nused in the government mind control program known as MK-Ultra. It\\\\\\&amp;#039;s technology \nis often psychological and electronic means of producing of the kind of trauma \nused to brainwash and covertly manipulate unsuspecting human beings. This practice\nfirst began in Nazi Germany, as Hitler sought the ultimate weapon of domination\nfor the Third Reich. His pursuits included the use of highly devleoped propaganda,\nthe creation of the youth movement, multi-generational incestuous families, and the\ntorture of jewish children and social outcasts who were used as test subjects\nin medical experiments conducted at Dashau by Dr Josef Mengele.\n\nBut the atrocities did not end with the Nuremberg trials and the so-called defeat\nof the nazi regime. Under project paperclip, hundreds of Hitlers \\\\\\&quot;Mind Scientists\\\\\\&quot;\nwere covertly relocated into the USA national security establishment and top Ivy \nLeague universities. In addition, Hitlers own spymaster and head of intelligence, \nReinhard Gehlen, was made the head of the US intelligence gathering organization\nset up after world war II, and was instrumental in the creation of the National \nSecurity Act of 1947, giving birth to the CIA and the \\\\\\&quot;Invisible Government\\\\\\&quot;.\n\nSince its inception, the national security state has sought, as Hitler did, to \nachieve the ultimate weapon in world domination and military supremacy. During \nthe cold war era, military intelligence, covert warfare and black operations \nbecame the new rules of engagement, and just as common law and ethics were \nsubverted under Nazism, so were laws and morality of US government under the\nnational security act and intelligence establishment. The US government began to \nconduct and resurrect everything Hitler had discovered in his goal of creating\nthe ultimate technology of military and mental control.\n\nThe details and research involved in this subject can be quite traumatizing to\nthose seeking an understanding of what Mind Control involves. The MK-Ultra program\nwas first exposed through the freedom of information act. Since then, a \noverwhelming amount of documentation, witness testimony, and political scandals \nhave surfaced and brought much of this dark subject to light. This DVD attempts to \ntrace the development of the MK-Ultra program, its use over the last 50 years,\nand the future of government mind control.\n\n\n\nDocument Archives:\n------------------------\n\nCKLN-FM Mind Control Series\nDr. Ewen Cameron\nFritz Springmeier\nJon Rappoport\nJohnny Gosch\nMindnet Journals\nProject Paperclip\nSatanic Ritual Abuse\nThe Bohemian Grove\nThe Montauk Project\nWalter Bowart\n\n1977 Senate Hearing on MKULTRA.pdf\nBiography - Doctor Josef Mengele.mht\nBrave New World Revisited - Aldous Huxley.htm\nBrice Taylor - Thanks For The Memories\nCIA Mind Control - Project Monarch History.txt\nCharles Stone - Beyond Mind Control\nDID - What is Disassociative Identity Disorder.htm\nDonald Kalsched - The Inner World of Trauma.html\nExcerpts From Operation Mind Control - WH Bowart.htm\nFundamentals of Trauma Based Mind Control.mht\nGovernment Mind Control Techniques - Forum Archive.htm\nHistory Of Mind Control - Walter Bowart Interview.htm\nIG Farben, Floridation - Mind Control for the Masses.pdf\nIn Your Head - Experiments into Remote Mind Control Technology.pdf\nInterview with Alex Christopher By Dave Allan - Pandoras Box 1 and 2.htm\nJacobson - Mind Control in the United States (subliminal programming).pdf\nJim Keith - Mind Control, World Control - The Encyclopedia of Mind Control.pdf\nJohnny Gosch\\\\\\&amp;#039;s Kidnapping Back in the News - conspiracywannabes.org.mht\nJonestown Massacre - CIA Mind Control Run Amok.pdf\nJourney Into Madness - Mind Control and Medical Abuse.htm\nLinks about Mind Control and Electromagnetic Weapons.mht\nMightnight Tours of the White House - Washington Times 1989.pdf\nMind Control - Covert Operations of the NSA.pdf\nMind Control Articles - Totse.com.mht\nMind Control Forums - Complete Book List.mht\nMind Control Forums - Web Archives 1993-2004.pdf\nMind Control Operations at Stanford Research Institute.htm\nMind Control REFERENCE Archives - Radio Free Michigan.doc\nMind Control Slavery and the New World Order - Uri Dowbenko.mht\nMind Control Using Holography and Disassociation - 2005.pdf\nMK-ULTRA Materials and Methods - CIA Documents 1955.pdf\nMK-ULTRA Program and Government Electronic Mind Control.mht\nNEXUS Mind Control - Brave New World - Part One - Nick Begich.htm\nPersuasion and Brainwashing Techniques - The Battle For Your Mind.doc\nProject Artichoke - The CIA\\\\\\&amp;#039;s Quest for Mind Control Drugs and Biowarfare.pdf\nProject Mk-Ultra - The CIA\\\\\\&amp;#039;s Program of Research In Behavioral Modification.pdf\nProject Superman - The Andy Pero Story - Nazi Mind Control At Montauk.pdf\nThe Controllers - Martin Cannon - Mind Control And The UFO Phenomenon.doc\nPsychoPolitics - Synthesis Of The Russian Art Of Brainwashing - Part 1.htm\nPsychoPolitics - Synthesis Of The Russian Art Of Brainwashing - Part 2.htm\nSecret Government Mind Control Project - Super Warrior Gone Rogue.htm\nSex to Blackmail to Elite Mind Control - Can We Solve This Mystery.mht\nSex, Lies, and Mind Control - Cathy O\\\\\\&amp;#039;Brien - On Anti Shyster.htm\nSuch Things Are Known - CIA Mind Control - Dorothy Burdick.htm\nTerror and Chaos - Citizen\\\\\\&amp;#039;s Commission on Human Rights and Freedom.pdf\nTerrorism - Defusing the Ticking Time Bomb - Arguments Against Torture.pdf\nThe Aviary - Psychic Warefare and Non-Lethal Attacks Background.htm\nThe Controllers - Martin Cannon - Mind Control And The UFO Phenomenon.doc\nThe Franklin Cover-Up - Child Abuse, Satanism and Murder in Nebraska (1996).pdf\nThe Government Psychiatric Torture Site - MK-Ultra, The CIA and Radiation.mht\nThe Illuminati Formula Used to Create an Undetectable Total Mind Control.pdf\nThe Invisible Third World War - WH Bowart and Richard Sutton.htm\nThe Mind Has No Firewall - Foreign Military Studies Office 1998.mht\nThe Psychology of Torture - Sam Vaknin Article 1995.mht\nThe Search For The Manchurian Candidate 1978 - John Marks.rtf\nThe Secret Language of Cults and Politicians - Daniel Jones.pdf\nThomas Porter - Mind Control and the Secret State 1996.htm\nTrance-Formation of America - Mark Philips and Cathy O\\\\\\&amp;#039;Brien.pdf\nUnderground Nazi Invasion of the United States - Brantonia.htm\nWalter Bowart - Operation Mind Control - Chapter Four.mht\nWar Against The Mind - by Colin Ross - PsychicAssault.htm\n\nMK-Ultra Freedom of Information Act File Archive (500MB)\n\n\nDVD Main Contents:\n------------------------\n\n_Captive Minds - Hypnosis and Beyond NFB.avi\n_Operation Mind Control - Walter Bowart Interview.mp3\n2003 GNN - The Most Dangerous Game - Part 1, Origins.avi\nABC News Special - 1979 - Mission Mind Control - Part 1.avi\nABC News Special - 1979 - Mission Mind Control - Part 2.avi\nABC News Special - 1979 - Mission Mind Control - Part 3.avi\nBiological Warfare and The CIA - Code Name Artichoke.avi\nCIA and MKULTRA in Canada - The Fifth Estate 1998.avi\nCIA and MKULTRA in Canada - The Sleep Room 1998.avi\nCIA and Project Monarch - Full History - Ron Patton.txt\nCIA MK-ULTRA Hearings - Survivor Testimony B 1996.avi\nCIA MK-ULTRA Hearings - Survivor Testimony C 1996.avi\nDave Emory - Operation Mind Control - Walter Bowart.mp3\nDisassociative Identity Disorder - What is DID and MPD.htm\nDiscovering Psychology Series - Mind, Hidden and Divided.avi\nEvidence of Revision - RFK Assassination, MK-Ultra, Jonestown.avi\nGuantanamo Bay Guidebook - BBC Live Torture - Reality TV Show.avi\nGuantanemo Bay Guidebook - Torture TV - Jeff Rense, Alex Jones.mp3\nKay Griggs - Homosexual Blackmail - Why Would Everybody be Silent.avi\nKay Griggs - Jeff Rense - I Married A Manchurian Candidate 1 - 2005.mp3\nKay Griggs - Jeff Rense - I Married A Manchurian Candidate 2 - 2005.mp3\nKay Griggs - Jeff Rense - I Married A Manchurian Candidate 3 - 2005.mp3\nMarshall Thomas - Project Monarch, Chapter 01 - The Phoenix Program.avi\nMarshall Thomas - Project Monarch, Chapter 05A - Cults, Michael Aquino.avi\nOperation Monarch - Where Have All The Children Gone - Mark Philips.htm\nRichard William Hamlin - Incest Atrocities with Connections to Mk-Ultra.mht\nSenator Michael DeCamp - The Franklin Cover-Up - Conspiracy of Silence.avi\nSenator Michael DeCamp - The Franklin Cover-Up - Interview Alex Jones.mp3\nSenator Michael DeCamp - The Franklin Cover-Up - Unabridged ebook 1993.pdf\nSex Slaves - Kidnapping and Prostitution Rings - PBS Frontline Documentary.avi\nSRA and Government Mind Control 1 - The Ted Gunderson Chronicles - Part One.avi\nSRA and Government Mind Control 2 - Naming Names - Brice Taylor Interview.avi\nSuper-Soldier Duncan O\\\\\\&amp;#039;Finioan - Project Camelot - Video Interview (11-2006).avi\nSuper-Soldier Duncan O\\\\\\&amp;#039;Finioan - Red Ice Radio - Interview with David Corso.mp3\nTechnology of Mind Control - BBC Horizon Human v2 - Neuroscience Experiments.avi\nTed Kaczynski, The Unabomber - He Wasnt Paranoid He Was Conspired Against.avi\nThe Andy Pero Story - Project Superman - Mind Control Experiments Montauk.pdf\nThe Future of Mind Control And Weapons - Electromagnetic Radiation Waves.avi\nThe History of Mind Control - Earth Rising Series 1 - Nick Bregich 2005.avi\nThe Manchurian Candidate - Denzel Washington and Jonathan Demme.mp3\nThe Real Room 101 - Documentary on George Orwell Mind Control.avi\nThe Ultimate Revolution - Aldous Huxley - Berkley Speech 1962 P1.mp3\nThe Ultimate Revolution - Aldous Huxley - Berkley Speech 1962 P2.mp3\nTrance-Formation of America - GNN Panel Discussion and Reactions.avi\n\n\n4.33 GB DVD-ROM\n\n\nThis DVD-ROM is part of the Induction series, a self-induced initiation\ninto self-knowledge and power. Because true mind control is self control.\n\nEnjoy, and please freely distribute and copy these files and discs.\n\n\n\nOn Playback Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢\n---------------------\n\nFor maximum compatibility all files have been converted to low bit mp3 or\nDivX. There are also some WMV, RA and Mov files which either couldn\\\\\\&amp;#039;t be re-\nencoded or were kept intact due to their small size. All photos are in jpg\nor bmp format, and most webpages are included in single archive MHT files.\nConverting these files ensures compatibility for playback on recommended\nelectronic media players and set-top DVD/DivX players.\n\nAll files included should be considered sub-retail and for education only.\n\n\n\nOn Publishing Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢\n----------------------\n\nDue to the need for this information, some of these files are distributed\nwithout the direct expressed consent of the original copyright holders.\nMost are freely recorded or downloaded from public sources before being\nfurther compiled. In this form they are highly compressed, degraded and\nshould be considered to be sub-retail, non-commercial files. They were\ncreated for personal reference and educational use only.\n\nI would encourage everyone to make their own compilations and to copy,\npublish and distribute them freely. Make induction your own.\n\nThe Induction Series is published through the Conspiracy Central Tracker\nand as such it follows ConCen\\\\\\&amp;#039;s policy of removing content at the original\ncopyright holders request.\n\n\n\nOn The Induction Series Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ \n-----------------------------------\n\nThe Induction series can be thought of as a tree. Its roots can be found \nin the She Who Remembers Archives and through Conspiracy Central, Torrent\nsites and online research. The Induction Tree:\n\nInduction Into Authority\n\nDespotism\n---------------\n20th Century\n911 Truth\nDemocracy\n\nFascism\n---------------\nBlack Ops\nMK-Ultra\nSecret Societies\n\nUtopia\n---------------\nPopulation Control\nPublic Relations\nSocial Engineering\n\n\nTo find out more about The Induction Series, please visit:\n &lt;a href=&quot;\nhttp://www.conspiracywannabes.org/blogs/tales_of_power/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.conspiracywannabes.org/blogs/tales_of_power/index.php&lt;/a&gt;\n\n\n\nSpecial Thanks Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ \n----------------------\n\nThis particular tree of knowledge finds its roots in many sources, but most \ncan be found through basic searches or on Conspiracy Central. Most files were \nwere intentionally found through public trackers or direct downloads on public \nsites. DVDrips were avoided where ever possible. All sources of information\nand file names are kept relatively accurate to facilitate further research \nand encourage inductees to continue on with their research. \n\nSpecial thanks to all of the authors, speakers and researchers who contributed \nto these archives. And thanks to all of the inspiring individuals who contribute\nto the sites listed below... \n\nConspiracy Central Tracker - http://conspiracycentral.net:6969/index.html\n\nConspiracy Central Forums - http://conspiracycentral.info/index.htm\n\nShe Who Remembers Archives - http://www.thehemperor.net/archives.html\n\n\n\nExtra Special Thanks Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ \n----------------------------\n\nThis disc is dedicated to all subjects of government mind control... and since\nwe have all been subject of Mind Control in some ways, it has become our personal\nresponsibility to understand what has happened to us and join together as survivors,\nnot victims, of this terrible conspiracy.\n\n\n--------------------- Ãƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ ---------------------- \n\n\n\\\\\\&quot;During times of universal deceit, telling the truth becomes a revolutionary act.\\\\\\&quot; ","torrent":{"xt":"urn:btih:3322b0de9e1f01c5253687880d71e91738e8ff30","amp;dn":"The+Induction+Series-MK-Ultra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3322b0de9e1f01c5253687880d71e91738e8ff30","infoHashBuffer":{"type":"Buffer","data":[51,34,176,222,158,31,1,197,37,54,135,136,13,113,233,23,56,232,255,48]},"announce":[],"urlList":[]}}