{"title":"[root] Triangle Away v3.25","uid":10054464,"size":319694,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3398a187560488eb6941df29ec1aa51a623e303b&amp;dn=%5Broot%5D+Triangle+Away+v3.25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"319BASED","files":1,"time":1398643951,"description":"Many Samsung devices store a flash counter that keeps track of how many times you have flashed *custom* firmwares to your device. On some devices, a yellow triangle or other sort of visual warning is also displayed during boot if you are running a *custom* firmware. TriangleAway was built to disable the triangle (if a visual warning is present) and reset the custom ROM flash counter to 0. This app requires root !\nYou can find out the current status of your flash counter and firmware state (custom or official) by booting into &quot;download mode&quot; on most devices. The usual way of getting into &quot;download mode&quot; is by first turning off your device, then turning it on by pressing and holding VolDown+(Home)+Power. Alternatively, the &quot;adb reboot download&quot; command also often works.\nWhen you run TriangleAway, if your device and firmware are supported, it will show you the detected state of the binary (custom or official) and flash counter value, and the option to &quot;Reset flash counter&quot;. Please confirm that the information shown is correct before resetting the values.\nOn a number of devices, TriangleAway can work, but your firmware may not be supported directly. In that case, the app will tell you it needs to reboot into a special boot mode, which will be happen if you select &quot;Reset flash counter&quot;. The device will reboot into a special mode which will allow you to review the current status and reset the binary and flash counter values (or abort and do nothing). On some devices this will actually trigger the counter to 1 if its 0 - so if you're &quot;just checking&quot;, do that in download mode!\n!!! THIS IS A DANGEROUS OPERATION AND COULD POTENTIALLY BRICK YOUR DEVICE. PROCEED AT YOUR OWN RISK. A USB JIG IS PREFERRED IF YOU HAVE A WORKING ONE !!!\n( and by brick I mean brick - only a board replacement or a JTAG unit will be able to save you, don't mess with boot(loader) stuff unless you *really* mean it! )\nNote#1: using Triangle Away may unmount your SD card. Reboot or manually remount it from Android settings.\nNote#2: on new devices status can only be reset on stock firmwares!\nSupported devices:\nSG S2:\n- GT-I9100 **\n- Sprint Epic 4G Touch\n- Korea SHW-M250K/L/S\nSG S3:\n- GT-I9300/I9300T **\n- GT-I9305/I9305T/I9305N LTE **\n- USA: AT&amp;T, Sprint, T-Mo, VZW (unlock bootloader !), USCC, MetroPCS, Cricket, CSpire\n- Canada\n- Korea: SHV-E210K/L/S, SHW-M440S\nSG S4:\n- GT-I9505\n- USA: AT&amp;T, VZW, Sprint, T-Mo, USCC\n- Canada\nSG Note:\n- GT-N7000\n- GT-I9220\nSG Note 2:\n- GT-N7100/N7100T/N7102/N7105/N7105T **\n- USA: AT&amp;T, Sprint, T-Mo, VZW (unlock bootloader !), USCC\n- Canada: I317M, T889V\n- Korea: SHV-E250K/L/S **\nSG Note 3 (4.4+):\n- GT-N9005 \n- USA: T-Mobile, Sprint\n- Canada: SM-N900W8\n- Asia: SM-N900S/2/6/8/9\nSG Note 8.0&quot;:\n- GT-N5100 3G **\n- GT-N511x Wi-Fi **\n- GT-N5120 LTE **\nSG Note 10.1&quot;:\n- GT-N8000 3G **\n- GT-N801x Wi-Fi **\n- GT-N8020 LTE **\n- SHW-M480S/K/W **\nSG Camera EK-GC100 **\nSG Tab 2:\n- GT-P310x 7&quot; 3G\n- GT-P311x 7&quot; Wi-Fi\n- GT-P510x 10.1&quot; 3G\n- GT-P511x 10.1&quot; Wi-Fi\nVarious:\n- I8160, I8190\n- I9070/P\n- I9082\n- I9260\n- S7500, S7560, S7562\n** Various models are supported depending on firmware, but only the exact models listed are supported regardless of firmware version.\nWhether or not Triangle Away works may depend on your kernel, try flashing a different one if it doesn't work.\nPlease also note that some devices set the counter to 1 at every boot if you are running a custom kernel or recovery. On these devices, Triangle Away may always display 1 - make sure to check the counter in actual download mode.\nFor discussion and technical details, see the XDA-Developers.com thread here: &lt;a href=&quot;\nhttp://forum.xda-developers.com/showthread.php?t=1494114&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.xda-developers.com/showthread.php?t=1494114&lt;/a&gt;\nNote that this download is also available from that thread completely for free. You can go there and download it for free, or buy me a beer and download it from Play. It is the same program.\nI'm not sure about future updates - http://www.chainfire.eu/articles/118/Triangle_Away_vs_Samsung/","torrent":{"xt":"urn:btih:3398a187560488eb6941df29ec1aa51a623e303b","amp;dn":"%5Broot%5D+Triangle+Away+v3.25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3398a187560488eb6941df29ec1aa51a623e303b","infoHashBuffer":{"type":"Buffer","data":[51,152,161,135,86,4,136,235,105,65,223,41,236,26,165,26,98,62,48,59]},"announce":[],"urlList":[]}}