{"title":"GAY PORN-Take it Like a Bitch Boy - Cobra Video.avi","uid":4315185,"size":1723049984,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:33afc104c0c5380a7dfcbed82ddf4be2c8503277&amp;dn=GAY+PORN-Take+it+Like+a+Bitch+Boy+-+Cobra+Video.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"NOFXMAC","files":1,"time":1217037077,"description":"File size: 1.60 GB\nRunning time: 2:20:44\nContainer: AVI\nVideo: XviD MPEG-4 Codec; 720x540 @ 29.97 fps; 1495 kbps\nAudio: MPEG Layer-3 128 Kbps (stereo); 48000 Hz\n\nDirector: Bryan Phillips\nStaring: Brent Corrigan, Cameron Lane, Carson Rhodes, Christopher Anderson, Cody Lockheart, Lance Evans, Leo Kross, Nate Grant  \nStudio: Cobra Video\nReleased: 2006\nCondoms: No\n\nEvery now and then a movie is made which really excels on multiple fronts, and this Cobra release (Also later renamed as &quot;Take It Like a Bad Boy&quot;) is definitely one of those movies. From start to finish, the action is enjoyable and hot. The models look completely comfortable on camera and seem to greatly enjoy their scene partners. In total there are five duos, each interesting and erotic.\n\nThings start off differently than you might expect. Cody Lockheart is able to bum a ride from Leo Kross and they stop off at Leo's before Cody gets dropped off. There is some great interplay as Cody uses a combination of horniness and caution to eventually end up jerking off with totally straight Leo. It never gets past j/o (Cody does convince Leo to cum on him), but it's all believable and a really nice scene.\n\nThe rest of the movie follows a more traditional approach, but is still excellent. Cameron Lane is stressed out, but friend Nate Grant is able to help reduce his stress with sex! Both men are handsome and nicely hung and take turns topping each other, with multiple cumshots scattered throughout.\n\nA mark of how good this movie is definitely comes in the third scene, which doesn't necessarily feature the best looking of men. It's a winner though, as the setup and interplay between the two are top notch. An older married man (Christopher Anderson) is working at the office and takes a break to check out the Cobra website. Lance Evans, the cleaning boy, starts doing his thing, when coincidentally Christopher realizes both that he knows Lance's dad and that Lance has posed for Cobra! Things take off from there in a hurry and some hot action proceeds, Lance even briefly tops Christopher. Lance's mixed look of pain and pleasure when Christopher first enters him is a classic, and their &quot;dad/son&quot; roleplay is pretty hot.\n\nThe fourth scene returns to Cameron's place as friend Cody (from the 1st scene) wants him to go out clubbing. The two instead dance at home with their big hardons! Both models are really into each other and again there's flip-flopping and multiple cumshots, most notably Cameron's final cumshot is right into Cody's butt, and then it all leaks out! Naughty but definitely hot to see!\n\nThe final scene finds coverboy Brent Corrigan at a hotel, doing schoolwork in the room while his dad is at a convention. After an hour delay, room service arrives via super sexy Carson Rhodes! This is the only scene which really ties in to the movie's title (Carson does a little dirty talk) but mostly they're too busy devouring each other to talk much! There's lots of cumeating and they have a great fuck... it really should be a crime to be as good looking as they are!\n\nEnjoy !\n","torrent":{"xt":"urn:btih:33afc104c0c5380a7dfcbed82ddf4be2c8503277","amp;dn":"GAY+PORN-Take+it+Like+a+Bitch+Boy+-+Cobra+Video.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33afc104c0c5380a7dfcbed82ddf4be2c8503277","infoHashBuffer":{"type":"Buffer","data":[51,175,193,4,192,197,56,10,125,252,190,216,45,223,75,226,200,80,50,119]},"announce":[],"urlList":[]}}