{"title":"Winemaking Problems Solved","uid":7796756,"size":3303181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33d7393e2ec207286bce4d23457422440857c015&amp;dn=Winemaking+Problems+Solved&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352165466,"description":"Hardcover: 184 pages\nPublisher: CRC Press (August 26, 2010)\nLanguage: English\nISBN-10: 1439834164\nISBN-13: 978-1439834169\n\nWith contributions from a diverse team of international enologists, Winemaking problems solved is an essential, hands-on reference for professionals in the winemaking industry and students of enology.Expert answers to questions that often arise during winemaking can be found in this convenient reference. Arranged in practical question and answer format, it provides quickly accessible solutions to more than one hundred issues of frequent concern to winemaking professionals. Here's a sample of the questions answered in this book:\n\n    What is the best way to cold settle my white juices?\n    How do I sample for Brettanomyces?\n    What's the best procedure to clean or store a used barrel?\n    How do I care for the winery pump?\n    My wine is too astringent - what do I do?\n    When can I skip filtering my wine?\n    When will it re-ferment and push the corks?\n    How do I best store and ship my bottled wine? \n\nChapters review issues associated with grape analysis, juice and must preparation, yeast and malolactic fermentation, wine clarification and stabilisation, filtration, packaging and storage. Sections on winery equipment maintenance and troubleshooting, wine microbiology and sanitation are also included. The final part of the book focuses on particular wine quality issues, such as hazes and off-odours","torrent":{"xt":"urn:btih:33d7393e2ec207286bce4d23457422440857c015","amp;dn":"Winemaking+Problems+Solved","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33d7393e2ec207286bce4d23457422440857c015","infoHashBuffer":{"type":"Buffer","data":[51,215,57,62,46,194,7,40,107,206,77,35,69,116,34,68,8,87,192,21]},"announce":[],"urlList":[]}}