{"title":"John Berryman - The Dream Songs (pdf)","uid":10534475,"size":4057885,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33ef016dbeb2781e09e53ccaa513a12afd9363a4&amp;dn=John+Berryman+-+The+Dream+Songs+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1405144698,"description":"John Berryman - The Dream Songs (FSG, 1969). 427 pp.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\ndescription:\n\nThis edition combines 77 Dream Songs, awarded the Pulitzer Prize for Poetry in 1965, and His Toy, His Dream, His Rest, which won the National Book Award for Poetry in 1969. It contains 385 songs, an index of first lines, an index of titles, and a note by the author.\n\nIn his essay on the work, Denis Donoghue says: &quot;John Berryman has now completed the long poem, The Dream Songs, begun in 1955 . . . The poet resolved it [the problem of a long poem] in his own way; not Eliot's way in Four Quartets, Williams's way in Paterson, Pound's way in the Cantos, or Hart Crane's way in The Bridge . . . Mr. Berryman's answer was to conceive a diary, a dream diary.&quot;\n\n&quot;A major achievement,&quot; writes A. Alvarez in The Observer. &quot;He has written an elegy on his brilliant generation and, in the process, he has also written an elegy on himself.&quot;\n\nOf the hero of The Dream Songs, James Schevill has written: &quot;The character of Henry is a permanent addition to American literature.&quot;\n\n**\n\nReview\n\n&quot;A major achievement . . . [Berryman] has written an elegy on his brilliant generation and, in the process, he has also written an elegy on himself.&quot;-A. Alvarez, The Observer\n\nAbout the Author\n\nJohn Berryman was born in Oklahoma in 1914. The author of several volumes of poetry, of which The Dream Songs is considered his masterwork, he died, a suicide, in 1972.","torrent":{"xt":"urn:btih:33ef016dbeb2781e09e53ccaa513a12afd9363a4","amp;dn":"John+Berryman+-+The+Dream+Songs+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33ef016dbeb2781e09e53ccaa513a12afd9363a4","infoHashBuffer":{"type":"Buffer","data":[51,239,1,109,190,178,120,30,9,229,60,202,165,19,161,42,253,147,99,164]},"announce":[],"urlList":[]}}