{"title":"Escape From Death Row (Lee Van Cleef) [1973] @","uid":5531466,"size":936378534,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:33f97cfdeb4f4a6798ee41a16f61ace78e59e4b3&amp;dn=Escape+From+Death+Row+%28Lee+Van+Cleef%29+%5B1973%5D+%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"alien99","files":3,"time":1272938510,"description":"source file from DVD but one of those $1.99 ones so file is somewhat\nlarge but goes downhill fast if i reduced it. but doubt this will ever\nbe released on a regular DVD.\nI'll rate i guess as a vcr rip\n\nhave seen alot worse out there\n\nyes its Italian movie dubbed in English\n\nAlso Known As:\n&quot;Frank and Tony&quot; - USA (video title)\n&quot;Power Kill&quot; - USA\nDio, sei proprio un padreterno! \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0069979/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0069979/&lt;/a&gt;\n\nFrankie Dio (Lee VanCleef) is a high-ranking mobster who turns himself in to the police or illegal gambling (for reasons that seem unclear to me). Tony (Tony Lo Bianco) is a low-level thug who frequents a pool hall and spends his free time envying Frankie. By being in the right place at the right time, Tony gets arrested with Frankie and is sent to jail... where they form a bond that may not quite be friendship, but it will do for now.\n\nThis film came to me under the title of &quot;Frank and Tony&quot;, which is disappointing because I see an alternate name is &quot;Mean Frank and Crazy Tony&quot;, which would have helped sell the film more effectively. I presume that's an homage to &quot;Dirty Mary, Crazy Larry&quot; but what do I know? I watched it shortly after another Italian crime film, &quot;Violent Professionals&quot;, and I must say the two complement each other very well.\n\nItalians have always lagged behind Americans in their budgets and production values, which is a real shame with this film. It is considered a &quot;grindhouse&quot; film, which unfairly demotes it to a b-movie (or worse). With a cleaner sound and picture, this could have been a Hollywood hit, I suspect. I found the story very interesting, the characters (and actors) better than average and unlike &quot;Violent Professionals&quot; the plot is fairly clear -- not too many secondary characters.\n\nIf you like Mafia movies or crime films you should give this one a try. A film about the mob that's actually from Italy (how much more authentic do you want?) is as much as you can ask. Sure, it's not &quot;The Godfather&quot;, but it's not supposed to be. This isn't a drama, it's a light comedy, heavy action buddy film... like &quot;Die Hard With a Vengeance&quot; from the point of view of the bad guys. Well, okay, not really.\n","torrent":{"xt":"urn:btih:33f97cfdeb4f4a6798ee41a16f61ace78e59e4b3","amp;dn":"Escape+From+Death+Row+%28Lee+Van+Cleef%29+%5B1973%5D+%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33f97cfdeb4f4a6798ee41a16f61ace78e59e4b3","infoHashBuffer":{"type":"Buffer","data":[51,249,124,253,235,79,74,103,152,238,65,161,111,97,172,231,142,89,228,179]},"announce":[],"urlList":[]}}