{"title":"An Economic History Of Europe - Karl Persson.pdf","uid":8214582,"size":2428563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34028a815950b50403f315dd74c9a6cf619dab4a&amp;dn=An+Economic+History+Of+Europe+-+Karl+Persson.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1362316956,"description":"This concise and accessible introduction to European economic history focusses on the interplay between the development of institutions and the generation and diffusion of knowledge-based technologies. The author challenges the view that European economic history before the Industrial Revolution was constrained by population growth outstripping available resources. He argues instead that the limiting factor was the knowledge needed for technological progress but also that Europe was unique in developing a scientific culture and institutions which were the basis for the unprecedented technological progress and economic growth of the nineteenth and twentieth centuries. Simple explanatory concepts are used to explain growth and stagnation as well as the convergence of income over time whilst text boxes, figures, an extensive glossary and online exercises enable students to develop a comprehensive understanding of the subject. This is the only textbook students will need to understand Europe's unique economic development and its global context.","torrent":{"xt":"urn:btih:34028a815950b50403f315dd74c9a6cf619dab4a","amp;dn":"An+Economic+History+Of+Europe+-+Karl+Persson.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34028a815950b50403f315dd74c9a6cf619dab4a","infoHashBuffer":{"type":"Buffer","data":[52,2,138,129,89,80,181,4,3,243,21,221,116,201,166,207,97,157,171,74]},"announce":[],"urlList":[]}}