{"title":"The Settlers II - Vikings","uid":8512277,"size":565797744,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:34153dabe55d8090b430f304f966d8965d6a0600&amp;dn=The+Settlers+II+-+Vikings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Sirrobinn","files":-1,"time":1369611488,"description":"This is the standalone ENGLISH version (fans translated the new content). This installer contains The Settlers II 10th anniversary and The vikings.\n\nMultiplayer is included and works.\n\n\n&quot;We have now entered the year of the wolf. Many years have passed since the discovery of the world portal and the vikings are a accepted race with a high level of wealth due to the trading with other nations which the portal made possible. One day they invited all their friends for a big feast. The celebration goes well until the world portal suddenly explodes and half of the nearby village people are missing. Those people were caught in the blastwave and thrown through the world portal onto an unknown land. Under the rule of Eirigg they now find out, that the guests they harbored were the &quot;Pirates of the Wolf&quot; and now seek vengeance and a way home.\n\nThis add-on to The Settlers II: 10th Anniversary adds the Vikings as a new playable race to the original game. And they also bring a new campaign with twelve new missions with them. Those missions also feature the new quest-system. Instead of just reaching the portal out of the world, you now get different objectives throughout the mission, some of which are optional like destroying a nearby camp of pirates.\n\nBut there are also some smaller additions and changes. There is now a random-map-generator for example with which you can generate multiplayer maps after setting a few parameters like &quot;terrain&quot;, &quot;number of players&quot; and so on. Among other changes are things like new messages you can receive (&quot;Flagpole is overloaded&quot; or &quot;No more Soldiers left&quot;) or a new button which let's you decide in which warehouse new soldiers should be recruited.\n\nThe Vikings are also playable in multiplayer. The add-on features several new maps including three fan-made single player maps. These were exclusively made for the expansion and chosen by a jury in the course of a competition held by UbiSoft on the official website.&quot;","torrent":{"xt":"urn:btih:34153dabe55d8090b430f304f966d8965d6a0600","amp;dn":"The+Settlers+II+-+Vikings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34153dabe55d8090b430f304f966d8965d6a0600","infoHashBuffer":{"type":"Buffer","data":[52,21,61,171,229,93,128,144,180,48,243,4,249,102,216,150,93,106,6,0]},"announce":[],"urlList":[]}}