{"title":"Pieter Vos Series - David Hewson","uid":12009552,"size":943799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:345777d19d7342aaced11a8a75cb9395ca8e91f9&amp;dn=Pieter+Vos+Series+-+David+Hewson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1434065997,"description":"01. The House of Dolls - David Hewson\n\n\n\nAnneliese Vos, sixteen-year-old daughter of Amsterdam detective, Pieter Vos, disappeared three years ago in mysterious circumstances. Her distraught father's desperate search reveals nothing and results in his departure from the police force. Pieter now lives in a broken down houseboat in the colourful Amsterdam neighbourhood of the Jordaan. One day, while Vos is wasting time at the Rijksmuseum staring at a doll's house that seems to be connected in some way to the case, Laura Bakker, a misfit trainee detective from the provinces, visits him. She's come to tell him that Katja Prins, daughter of an important local politician, has gone missing in circumstances similar to Anneliese. In the company of the intriguing and awkward Bakker Vos finds himself drawn back into the life of a detective. A life which he thought he had left behind. Hoping against hope that somewhere will lay a clue to the fate of Anneliese, the daughter he blames himself for losing ...\n\n\n\n02. The Wrong Girl - David Hewson\n\n\n\nSinterklaas, a beaming, friendly saint with a white beard, was set to mark his arrival in Amsterdam with a parade so celebrated it would be watched live on television throughout the Netherlands. Today the crowds would run into three hundred thousand or more, and the police presence would top four figures.\n\nThe city centre was closed to all traffic as a golden barge bore Sinterklaas down the Amstel river, surrounded by a throng of private boats full of families trying to get close.' Amsterdam is bursting at the seams with children trying to get a glimpse of their hero and families enjoying the occasion.\n\nThe police are out in force, struggling to manage the crowds on one of the busiest days of the year. Brigadier Pieter Vos is on duty with his young assistant, Laura Bakker, when the first grenade hits. As Sinterklaas prepares to address the crowds, a terrorist incident grips the heart of the city.\n\nIn the chaos a young girl wearing a pink jacket is kidnapped. But the abducted child isn't the daughter of an Amsterdam aristocrat as the terrorists first thought. She's the daughter of an impoverished Georgian prostitute, friendless and trapped in the web of vice that is Amsterdam's Red Light District.\n\nAs the security forces and the police clash over the ensuing investigation, the perpetrator's horrifying demands become clear. Vos, trapped in a turf war with state intelligence, tries to unravel a conspiracy that reaches from the brothels of the city to the hierarchy of the security services.\n\nAnd at its heart lies an eight-year-old girl, snatched from a loving mother and then ferried from one criminal lair to the next. Her life in the balance as Vos and Laura Bakker struggle to uncover the shocking truth behind her abduction. What is the life of one immigrant child worth in the greater political game emerging around them?","torrent":{"xt":"urn:btih:345777d19d7342aaced11a8a75cb9395ca8e91f9","amp;dn":"Pieter+Vos+Series+-+David+Hewson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"345777d19d7342aaced11a8a75cb9395ca8e91f9","infoHashBuffer":{"type":"Buffer","data":[52,87,119,209,157,115,66,170,206,209,26,138,117,203,147,149,202,142,145,249]},"announce":[],"urlList":[]}}