{"title":"Freyda and Acoustic AttaTude-Midnight at Cabell Hall FLAC EAC","uid":12313943,"size":268545525,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:34bebfb4f25ed7812c8cde8ca160cde3b8577327&amp;dn=Freyda+and+Acoustic+AttaTude-Midnight+at+Cabell+Hall+FLAC+EAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rontoolsie","files":10,"time":1440957666,"description":"I originally stumbled across this marvelous album through the recommendation of Stereophile back in the early 1990s. If you read the liner notes you will see that the recording engineer was very much an audiophile and used minimalistic techiques to get a very 'live' sound. If you are a fan of the sound of 'The Trinity Sessions' by the Cowboy Junkies you need to listen to this. \n\nThe music is classical inspired folk. Freyda et al used to be in a hammered dulcimer band in the early years (Trapezoid) with their unusual blend of Celtic Mountain music. She was a classically trained violinist of no little talent. \n\nI was moved enough by her music to contact her through her record label back in the late 1990s. She responded and I ended up sending all of the CD's I had with her on it for her autographs. As you will see from the accompanying scans, she gracefully obliged and returned them to me within a matter of days. So the scans of the artwork and disk here bear her writing.\n\nShe unfortunately perished when a fleeing murderer driving on the wrong side of the road collided head on with her on the way back from a music camp she was giving. But her music lives on. \n\nPlease give this a listen and SEED. This is great music and very unrecognized. My favorite track is 'Potters Wheel' which still gives me goosebumps","torrent":{"xt":"urn:btih:34bebfb4f25ed7812c8cde8ca160cde3b8577327","amp;dn":"Freyda+and+Acoustic+AttaTude-Midnight+at+Cabell+Hall+FLAC+EAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34bebfb4f25ed7812c8cde8ca160cde3b8577327","infoHashBuffer":{"type":"Buffer","data":[52,190,191,180,242,94,215,129,44,140,222,140,161,96,205,227,184,87,115,39]},"announce":[],"urlList":[]}}