{"title":"Drugs, Oil, and War The United States in Afghanistan, Colombia,","uid":8050730,"size":16433715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34e5f2aacd559012695ddccf6198c4d45a940156&amp;dn=Drugs%2C+Oil%2C+and+War+The+United+States+in+Afghanistan%2C+Colombia%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"imarion","files":-1,"time":1358852325,"description":"Drugs, Oil, and War: The United States in Afghanistan, Colombia, and Indochina By Peter Dale Scott\n2003 | 248 Pages | ISBN: 0742525228 , 074252521X | PDF | 16 MB\n\n\n\n\nPeter Dale Scott's brilliantly researched tour de force illuminates the underlying forces that drive U.S. global policy from Vietnam to Colombia and now to Afghanistan and Iraq. He brings to light the intertwined patterns of drugs, oil politics, and intelligence networks that have been so central to the larger workings of U.S. intervention and escalation in Third World countries through al liances with drug-trafficking proxies. The result has been a staggering increase in global drug traffic. Thus, the author argues, the exercise of power by cover t means, or parapolitics, often metastasizes into deep politics - the interplay of unacknowledged forces that spin out of the control of the original policy ini tiators. Scott contends that we must recognize that U.S. influence is grounded n ot just in military and economic superiority but also in so-called soft power. W e need a soft politics of persuasion and nonviolence, especially as America is e mbroiled in yet another disastrous intervention, this time in Iraq. ","torrent":{"xt":"urn:btih:34e5f2aacd559012695ddccf6198c4d45a940156","amp;dn":"Drugs%2C+Oil%2C+and+War+The+United+States+in+Afghanistan%2C+Colombia%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e5f2aacd559012695ddccf6198c4d45a940156","infoHashBuffer":{"type":"Buffer","data":[52,229,242,170,205,85,144,18,105,93,220,207,97,152,196,212,90,148,1,86]},"announce":[],"urlList":[]}}