{"title":"Colmax - Fuga dall'Albania XXX DVDRip","uid":11856970,"size":729930994,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3524890cd57ad761e9f8e15552ab060d5eb6d134&amp;dn=Colmax+-+Fuga+dall%27Albania+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"feeldabyte","files":1,"time":1430181119,"description":"\nScreens &amp; Info :\n\n----------------------------------\n &lt;a href=&quot;\nhttp://lovechix.com/?p=836913&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lovechix.com/?p=836913&lt;/a&gt;\n &lt;a href=&quot;\nhttp://lovechix.com/?p=929731&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lovechix.com/?p=929731&lt;/a&gt;\n\n----------------------------------\n\nStarring: Chipie Marlowe, Coralie Tanita, Eva Falk, Eva Hot, Fovea, Karen Lancaume, Monica Roccaforte\n\nSummary: This time Mario Salieri turned to the topic of illegal Albanian emigration to Italy.\nYoung Albanian women (Karen Bach aka Karen Lancaume) bothered to cohabit with his own father-former kommunistom.Ona kills him and flees to Italy to his girlfriend (Monica Roccaforte), who works as a maid in a wealthy family izvraschentsev.Oni using drugs, money, involve heroin in their sexual orgies.\nAt this time in Albania, a corrupt cop, takes charge in kind, with the girls who are going, just to escape to Italy ...\nOur heroine call from Albania, and she finds out that her boyfriend is accused of murder. It is, as I understand, by blackmail pulls Italian family sizeable number of Nala and returned to Albania, but the end is tragic, how tragic fate and starred-Karen Bach (19 January 1973-28 January 2005).\nShe was born in France, in Lyon. In porn hit trying to give other debts (they soon parted).\nPornokarera Karen Lancome progressed well, but to a certain point it was not unusual. Karen and her friend, French pornozvezdochka Raffaele Anderson appeared in a local documentary, which was shown at Cannes in 1999. There they saw a writer and rezhzhiser Virginia Despentes. Despentes aktirs looking for starring in his new controversial film, and decided that Karen Lancome and Raffaele will suit her just what we needed. The girls jumped at the chance to do work on mainstream French cinema. Despentis film was even more controversial than expected. Entitled &quot;Rape me&quot; (trachea me or Baise-moi) shone Karen Lancome and Raffaele, who played angry prostitutes who brawled awful. An unexpected combination of extreme violence and extreme sexuality shocked viewers around the world. And it turned Karen Lanka in French celebrity. Porn star almost overnight became known throughout the country. She's going to tie with porn ...\nBut the demons of the past have not forgiven Karen ...\nShe was found dead in an apartment of her friends, she adopted a lethal dose of pills ....\nIn conclusion, we give a small review of the film with a well-known site, the author of Major.\n&quot;Mario Salieri has a very individual style statement of erotic scenes, which, perhaps, no one else has. His scenes are usually rather short; he rarely draws usual hardcore tedious plans moving display of genitalia; it more interested in the overall plastic, beautiful body, facial expressions. The action is usually not noisy, and lit with a soft, intimate light. Thus Salieri reaches a very strong erotic tension due to the internal energy of the actors. It should be noted that the actors had even sex scenes have every right to be called so. They do play, even for a second from the comfort of the image, and even sex scenes can trace its development.\nThe first serious sex action in the film takes place 20 minutes after the start that for conventional Porn is simply impossible. But this - the whole Salieri. He needs a plot to bring down the then already on the head viewer a cascade of beautiful naked bodies in the most perverse positions.\nFrancesco Malcom, young and handsome son of the hostess, makes sex with a languid, sexy maid Monica Roccaforte, gorgeous body on which you can watch endlessly. Monica sucks, artistic and fascinating, and Francesco leafing through a pornographic magazine. Then Francesco Monica has a gorgeous ass. Then he pours sperm picture in a magazine. All of this brief, bright, brightly. I would like to something else like that, and the director provides it in abundance.\nA family friend, a pervert by Filippo Valentino makes hostess Coralie Tanith and young Helen - Karen Lancome - caress each other and masturbate at night in a closed car outside with flashlights which looks a crowd of men. Tense scene ends with abundant watering car windows sperm under hazy eyes still almost immaculate Karen Lancome.\nBeauty and the good actress, Karen Lancome as the main character in general godsend for the film. She manages to show character development and strengthens its depravity throughout the story. First, Francesco Malcom teaches her to sniff cocaine, and have sex with her. Although there are anal, but Karen has clearly not confident.\nFrancesco then arranges orgy, inviting Monica Roccaforte, Karen and beautiful lesbian Foveyu. That's where the feast for the eyes, purely Italian feast female body!\nKaren then passes into the hands of another lover of big companies, played by Philip Dean.\nThe scene where Dean and Karen Lancome arrange rapid &quot;chetvernik&quot;, and especially double blowjob in this scene above the highest temperature.\nIn fact, so many scenes that we should not dwell on the description of each. They should be easy to see.\n\nPick another one from my entire collection:\n &lt;a href=&quot;\nhttps://thepiratebay.se/user/feeldabyte/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/feeldabyte/&lt;/a&gt;","torrent":{"xt":"urn:btih:3524890cd57ad761e9f8e15552ab060d5eb6d134","amp;dn":"Colmax+-+Fuga+dall%27Albania+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3524890cd57ad761e9f8e15552ab060d5eb6d134","infoHashBuffer":{"type":"Buffer","data":[53,36,137,12,213,122,215,97,233,248,225,85,82,171,6,13,94,182,209,52]},"announce":[],"urlList":[]}}