{"title":"Gramophone magazine - November 2014 [classical music]","uid":11436087,"size":37547434,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35f3777f43bcc499f6225622f487c53d2752b046&amp;dn=Gramophone+magazine+-+November+2014+%5Bclassical+music%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"workerbee","files":-1,"time":1415754778,"description":"\nGramophone magazine (November 2014)\n\nISSN: 0017-310X | 140 pages | PDF\n\n\nGRAMOPHONE is a magazine published monthly in London and devoted to classical music, particularly recordings. Packed with features across all classical music genres, its globally acclaimed writers inform and entertain you with independent and intelligent editorial and more than 150 reviews in every issue. Gramophone's reputation is founded on its acclaimed critical analyses of the latest CD releases, in-depth features and interviews with classical stars, and its comprehensive coverage of recorded and live music.\n\n\nIN THE NOVEMBER ISSUE:\n\n* In her new album, &quot;St Petersburg&quot;, the bestselling mezzo Cecilia Bartoli opens a window on a hidden period of musical life in the Russian city, during which three visionary tsaritsas allowed music to thrive.  Gramophone's Editor-in-Chief James Jolly went to meet the opera star to discover how she managed to gain access to the Mariinsky archives to unearth the music for her new album;\n\n* The death of Christopher Hogwood in September was a great loss to the classical music world, but he left a rich legacy of recordings behind him.  David Vickers surveys Hogwood's life and career;\n\n* Michael McManus remembers the music of Andrzej Panufnik in the composer's centenary year and offers a guide to the best recordings;\n\n* Mezzo Sarah Connolly takes James Jolly on a tour of the score to Elgar's much-loved song-cycle, &quot;Sea Pictures&quot;;\n\n* Rob Cowan profiles the conductor Antal Dorati, who made his name with his stunning recordings on Mercury Living Presence;\n\n* Pollini's recording of Beethoven's &quot;Hammerklavier Sonata&quot; immediately achieved &quot;classic&quot; status when it was released in the 1970s.  Jed Distler and Harriet Smith see how the disc stands up to alternative versions today;\n\n* and Philip Clark gives a guide to the works of James Dillon.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                             &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:35f3777f43bcc499f6225622f487c53d2752b046","amp;dn":"Gramophone+magazine+-+November+2014+%5Bclassical+music%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35f3777f43bcc499f6225622f487c53d2752b046","infoHashBuffer":{"type":"Buffer","data":[53,243,119,127,67,188,196,153,246,34,86,34,244,135,197,61,39,82,176,70]},"announce":[],"urlList":[]}}