{"title":"Jesus Culture - We Cry Out [2008]","uid":5691477,"size":79514166,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3618bcd22cee6724843d5798d35efe8190002461&amp;dn=Jesus+Culture+-+We+Cry+Out+%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"piratetorrent1989","files":10,"time":1279107532,"description":"Jesus Culture is a Christian youth outreach ministry that hosts three conferences in Redding, California every year, as well as in Atlanta, Las Vegas, Dallas, Cleveland and Australia and England. The conferences bring thousands of young people from around the world to the host cities.\n\n\nHistory\n\nCalled &quot;one of the most significant Christian movements in post-war America&quot; Jesus Culture began in the summer of 1999 when the youth group at Bethel Church, Redding, California, led by Banning Liebscher, launched the first Jesus Culture conference. More followed. The mission of these gatherings was to serve other churches and lead young people to experience the love of God. At each conference there was a strong presence of the Lord, and the youth and young adults were going back to their homes, schools, work places and churches completely impassioned and transformed.\n\nA few years into hosting conferences at Redding, the Lord began to speak to the Jesus Culture Ministry leadership about a new breed of revivalists. Their mandate was defined: to raise up, mobilize, equip, encourage, resource, and send these young people burning with the passion of the Lord to fulfill the call of God on their lives, and see entire cities saved, campuses revolutionized, and nations discipled.\n\nJesus Culture Music\n\nEarly on it became clear that worship was to be a significant part of the Jesus Culture movement. Kim Walker, Chris Quilala, and Melissa How were worship leaders at Bethel Church's youth group, and the Lord began to use them to bring an entire generation into whole-hearted worship (they are the core of the Jesus Culture Band).\n\nAustralian songwriter and worship leader Darlene Zschech is a notable supporter, recently Twittering: ÃƒÂ¢","torrent":{"xt":"urn:btih:3618bcd22cee6724843d5798d35efe8190002461","amp;dn":"Jesus+Culture+-+We+Cry+Out+%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3618bcd22cee6724843d5798d35efe8190002461","infoHashBuffer":{"type":"Buffer","data":[54,24,188,210,44,238,103,36,132,61,87,152,211,94,254,129,144,0,36,97]},"announce":[],"urlList":[]}}