{"title":"How The Universe Works - 720p (Discovery 2010) Improved Version","uid":6140696,"size":9205443732,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:36708ccbdeeaa4590a6d23e4e38df17cc00f4f77&amp;dn=How+The+Universe+Works+-+720p+%28Discovery+2010%29+Improved+Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fillinthisspace","files":11,"time":1296492106,"description":"As the original version of this torrent still seems to be quite popular I've deleted it in order to replace it with this one. Not that there was anything wrong with the previous torrent, it's just that this one is a little better.\n\nThis torrent contains the same episodes from the same broadcasts as the previous torrent (episodes 1,3,4,5,6 are 25fps while 2,7,8 are 23.970) as these are still the best combination of quality v low station logo annoyance episodes I could find. However after uploading the previous torrent I stumbled across copies of a couple of episodes which I didn't think existed, so while I was encoding newer versions of those, I improved all of them.\n\n-All episodes now have 5.1ch audio (previously episodes 1 &amp; 5 only contained 2ch audio).\n-I ran a mild sharpening filter on the 25fps episodes while encoding them to help make up for the interlacing blur.\n-All of the promo intros and outros (where the promo breaks would have been) have now been removed, so all episodes should just play straight through.\n-I fixed the luminance level of episode 5 (Stars). I don't know how I missed it originally, but space is now black instead of dark grey. Oddly enough I downloaded a few different copies of episode 5 from a few different sources once I realised the luminance level was wrong and they were all exactly the same. I'm not sure what the deal is there, but I'm pretty sure it was broadcast that way and I'm also sure it was wrong.\n-Each episode is no longer 1.09GB in size. I compromised a little to ensure four episodes could still be burned to a DVD, but basically they're encoded for quality this time, not file size. For example don't be alarmed at episode one being only 883MB. It looks better than the original mts file from which it was encoded.\n-All episodes have now been encoded using a Bluray player compatibility setting. I can't test it myself, but hopefully these will all play on any MKV capable player.\n\nIf you want to save yourself some bandwidth, I'll be uploading the &quot;improved&quot; standard definition version of this torrent once I've seeded this one. I wasted way too much time encoding them, but in the end when running the AVI versions full screen, side by side with these 720p encodes on my monitors, the quality difference isn't all that great, while the torrent itself is half the size.\n\nMy upload speed is still rather slow, so as it'll take me several days to completely seed this torrent, please be patient. It'll probably be very slow for the first few hours as my shared internet connection is currently somewhat busy.\n\nEnjoy.","torrent":{"xt":"urn:btih:36708ccbdeeaa4590a6d23e4e38df17cc00f4f77","amp;dn":"How+The+Universe+Works+-+720p+%28Discovery+2010%29+Improved+Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36708ccbdeeaa4590a6d23e4e38df17cc00f4f77","infoHashBuffer":{"type":"Buffer","data":[54,112,140,203,222,234,164,89,10,109,35,228,227,141,241,124,192,15,79,119]},"announce":[],"urlList":[]}}