{"title":"NubileFilms - Vinna Reed (At Last) NEW 12 November 2015","uid":12747047,"size":246426873,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:36d67cf6d21498d7398e7a1b210f001165f77e88&amp;dn=NubileFilms+-+Vinna+Reed+%28At+Last%29+NEW+12+November+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1447325100,"description":"Vinna Reed has been waiting patiently all day for Lutro to get in the mood, and when she finally has him where she wants him she's not about to back down! Lutro turns out to be Vinna's willing partner in crime as he peels off her shirt to worship her little titties with his mouth and then works her miniskirt and thong down her long legs to leave her wearing just a thong that only highlights her tight ass.Before Lutro can get her fully out of her clothes, Vinna does a little undressing of her own. She is eager to pull off her lover's jeans and reveal his long hard cock that begs to be licked and sucked. She takes Lutro into her mouth eagerly, working him with long slow strokes and then hotter deeper thrusts to deep throat him.Finally satisfied, Vinna realizes that she needs no further foreplay to be wet and ready to fuck. She slips her thong down her legs and then climbs onto Lutro's waiting dick as he lies on the floor and watches his tanned lover dominate him. Her thrusts are fast and bouncy so that her small breasts jiggle with the force of her motion, and she keeps up a breakneck pace that only heightens her insatiable lust.Several climaxes later, Vinna is happy to lie back and let Lutro go to work. Flipping her onto her back, he picks up right where Vinna left off with long deep strokes between her legs that leave her panting for even more. When she gets down on her hands and knees on the floor and lifts her ass to him, he is happy to accommodate her need for a doggy style pussy pounding until he has sent her flying over the edge of orgasmic bliss once again.Vinna may be fully satisfied, but she wants Lutro to feel just as good! Putting her sweet mouth and hands to work, she turns around on her knees and sucks Lutro off like a Hoover until he creams all over her face and mouth. Covered in her lover's hot cum, Vinna makes sure to lick Lutro's head and shaft clean as she enjoys the sticky wetness.\r\nTags: Blonde, Blowjob, Deep Throat, European, Girl-Boy, Hardcore, Long hair, Petite, Puffy Nipples, Shaved Pussy, Short Girls, Small Boobs, Tan, Thongs\r\n \nhttp://imgdone.com/viewer.php?file=19646770583484643478.jpg\r\n \nhttp://imgdone.com/viewer.php?file=09574376236302873029.jpg","torrent":{"xt":"urn:btih:36d67cf6d21498d7398e7a1b210f001165f77e88","amp;dn":"NubileFilms+-+Vinna+Reed+%28At+Last%29+NEW+12+November+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d67cf6d21498d7398e7a1b210f001165f77e88","infoHashBuffer":{"type":"Buffer","data":[54,214,124,246,210,20,152,215,57,142,122,27,33,15,0,17,101,247,126,136]},"announce":[],"urlList":[]}}