{"title":"Standup Comedy - Nick Griffin - Shot In The Face","uid":7536190,"size":51416345,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3729081f04b4ea6904ec6d2339da216553117a85&amp;dn=Standup+Comedy+-+Nick+Griffin+-+Shot+In+The+Face&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rambam1776","files":-1,"time":1345094390,"description":"With his latest release, Shot in the Face, comedian Nick Griffin picks up right where he left off a little more than a year ago. This is a solid follow-up to Bring Out the Monkey and serves to solidify his reputation as an original and consistent performer. If I were to make a chart outlining the good and bad things about this album, there would only be one item in the &quot;Cons&quot; column. And, if memory serves, it's the same thing I struggled with when I reviewed his last CD: There's so much good stuff here, I can't possibly begin to scratch the surface. Will I successfully be able to relate to you just how good this is? I don't know, but I'm sure going to try.\n\nI love Griffin's knack for being able to call B.S. and his total willingness to do so. He puts me in mind of Johnny Appleseed, only instead of strolling through the countryside haphazardly tossing seeds into the wind, I see Griffin strolling through town nonchalantly pointing out one thing after another and muttering, &quot;That's crap. That's not true. That's crap. Not even close.&quot; And I love it.\n\nThis is a guy who's fed up and isn't going to take it any longer. Nothing's going to stop him, nor should it. Not the &quot;bad boys&quot; of Hollywood, not guys who drive Hummers (or, as Griffin refers to them, &quot;I wish I were taller-mobiles&quot;), and certainly not thrift store hipsters at coffee shops who wear 2-dollar pants and drink 4-dollar lattes.\n\n01 - Intro - I Hate People\n02 - Coffee - Booze\n03 - Cockblock - Clothes\n04 - Fake Breasts\n05 - Hummers\n06 - Tough Guys\n07 - Bad Boys\n08 - Shot In the Face\n09 - Divorced\n10 - Love\n11 - No Kids\n12 - Too Many Hot Women\n13 - Sex","torrent":{"xt":"urn:btih:3729081f04b4ea6904ec6d2339da216553117a85","amp;dn":"Standup+Comedy+-+Nick+Griffin+-+Shot+In+The+Face","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3729081f04b4ea6904ec6d2339da216553117a85","infoHashBuffer":{"type":"Buffer","data":[55,41,8,31,4,180,234,105,4,236,109,35,57,218,33,101,83,17,122,133]},"announce":[],"urlList":[]}}