{"title":"Lady Windermere's Fan (1985) BBC TV","uid":4670506,"size":811495426,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:37b95dfbbd3fc97f8dc950bdf6a91032cde73242&amp;dn=Lady+Windermere%5C%27s+Fan+%281985%29+BBC+TV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jgordon20904","files":1,"time":1232716910,"description":"This is a great movie, the best of the 1985 BBC TV mini-series about Oscar Wilde's plays. The original DVDs contain closed captioning. I am including a\ntext file containing everything in the .cc file of the first DVD. It is possible for me, or anyone, to use this file with the video on Subtitle Workshop and create an .srt subtitle file to fit both movies. It will take about\na week or two depending on how hard you work. I don't feel up to it. \n\nSince my foreign-born wife with hearing difficulties can enjoy it pretty well\nfrom the original, I do not have to work hard. I've already done 25-30 movies.\nI am 85 and she is 81.\n\n(the following from IMBd.)\nLike &quot;An Ideal Husband&quot;, &quot;Lady Windermere's Fan&quot; explores the nature of marital trust and the pitfalls of perceiving others in an ideal and simplistic manner. It does so with more depth and gravity than &quot;An Ideal Husband&quot; and this fine production particularly emphasizes the serious nature of the play. Wilde's sharp witticisms abound, but he clearly is aiming for a lot more than amusing his audience.\n\nIt's played to perfection by Helena Little, Tim Woodward and Stephanie Turner. The BBC could have cast big theatrical names, but instead made the admirable choice of casting lesser known names based upon their formidable talents.\n\nThe result is a moving and powerful drama well worth your time. Without any memorable cinematic version of &quot;Lady Windermere's Fan&quot;, this production is an important record of Wilde at his best. \n\n\n","torrent":{"xt":"urn:btih:37b95dfbbd3fc97f8dc950bdf6a91032cde73242","amp;dn":"Lady+Windermere%5C%27s+Fan+%281985%29+BBC+TV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37b95dfbbd3fc97f8dc950bdf6a91032cde73242","infoHashBuffer":{"type":"Buffer","data":[55,185,93,251,189,63,201,127,141,201,80,189,246,169,16,50,205,231,50,66]},"announce":[],"urlList":[]}}