{"title":"Torchwood complete series 1,2,3,4 + NL subs","uid":8581936,"size":18711034652,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3813613a175c06e52f0767ccb22084e3e746a75c&amp;dn=Torchwood+complete+series+1%2C2%2C3%2C4+%2B+NL+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"buur1969","files":82,"time":1371427478,"description":"Torchwood\nThe Complete Seasons 1, 2, 3 and 4\n+ NL subs (srt)\n\n\nFor the dutch Doctor Who fans!\n\n\nTorchwood is a British science fiction television programme created by Russell T Davies. The series is a spin-off from Davies' 2005 revival of the long-running science fiction programme Doctor Who, which has a family audience. Torchwood, however, is aimed at a mature audience.\nIt follows the exploits of a small team of alien-hunters, who make up the Cardiff branch of the fictional Torchwood Institute, which deals mainly with incidents involving extraterrestrials. Its central character is Captain Jack Harkness (John Barrowman), an immortal and ex-conman from the distant future who has lived on Earth since the 19th century.\nThe branch is initially a team of five operatives, led by Jack Harkness (John Barrowman), with Gwen Cooper (Eve Myles) as the &quot;new girl&quot; who joins in the first episode and acts as an audience surrogate. Owen Harper (Burn Gorman) is the unit's medical officer and Toshiko Sato (Naoko Mori) is the resident computer specialist, while &quot;administrative&quot; duties are performed by Ianto Jones (Gareth David-Lloyd).\nIt's a fantastic show worth watching - especially if you like Doctor Who, because there are several cross-overs, which just complete the universal experience of the whole &quot;Doctor Who&quot;-universe!","torrent":{"xt":"urn:btih:3813613a175c06e52f0767ccb22084e3e746a75c","amp;dn":"Torchwood+complete+series+1%2C2%2C3%2C4+%2B+NL+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3813613a175c06e52f0767ccb22084e3e746a75c","infoHashBuffer":{"type":"Buffer","data":[56,19,97,58,23,92,6,229,47,7,103,204,178,32,132,227,231,70,167,92]},"announce":[],"urlList":[]}}