{"title":"The Truth About Muhammad (Robert Spencer)","uid":5136474,"size":3358385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38642bf2a83aa2daabb335a37ee82365c1dd7909&amp;dn=The+Truth+About+Muhammad+%28Robert+Spencer%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"boutros_0","files":1,"time":1256517588,"description":"\nThe Truth About Muhammad: Founder of the World's Most Intolerant Religion\n\n\n\n\nFrom the Inside Flap\nMuhammad: a frank look at his influential (and violent) life and teachings\n\nIn The Truth about Muhammad, New York Times bestselling author and Islam expert Robert Spencer offers an honest and telling portrait of the founder of Islam-perhaps the first such portrait in half a century-unbounded by fear and political correctness, unflinching, and willing to face the hard facts about Muhammad's life that continue to affect our world today.\n\nFrom Muhammad's first &quot;revelation&quot; from Allah (which filled him with terror that he was demonpossessed) to his deathbed (from which he called down curses upon Jews and Christians), it's all here-told with extensive documentation from the sources that Muslims themselves consider most reliable about Muhammad.\n\nSpencer details Muhammad's development from a preacher of hellfire and damnation into a political and military leader who expanded his rule by force of arms, promising his warriors luridly physical delights in Paradise if they were killed in his cause. He explains how the Qur'an's teaching on warfare against unbelievers developed-with constant war to establish the hegemony of Islamic law as the last stage.\n\nSpencer also gives the truth about Muhammad's convenient &quot;revelations&quot; justifying his own licentiousness; his joy in the brutal murders of his enemies; and above all, his clear marching orders to his followers to convert non-Muslims to Islam-or force them to live as inferiors under Islamic rule.\n\nIn The Truth about Muhammad, you'll learn\n\n- The truth about Muhammad's multiple marriages (including one to a nine-year-old) - How Muhammad set legal standards that make it virtually impossible to prove rape in Islamic countries - How Muhammad's example justifies jihad and terrorism - The real &quot;Satanic verses&quot; incident (not the Salman Rushdie version) that remains a scandal to Muslims - How Muhammad's faulty knowledge of Judaism and Christianity has influenced Islamic theology--and colored Muslim relations with Jews and Christians to this day.\n\nRecognizing the true nature of Islam, Spencer argues, is essential for judging the prospects for largescale Islamic reform, the effective prosecution of the War on Terror, the democracy project in Afghanistan and Iraq, and immigration and border control to protect the United States from terrorism.\n\nAll of which makes it crucial for every citizen (and policymaker) who loves freedom to read and ponder The Truth about Muhammad.","torrent":{"xt":"urn:btih:38642bf2a83aa2daabb335a37ee82365c1dd7909","amp;dn":"The+Truth+About+Muhammad+%28Robert+Spencer%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38642bf2a83aa2daabb335a37ee82365c1dd7909","infoHashBuffer":{"type":"Buffer","data":[56,100,43,242,168,58,162,218,171,179,53,163,126,232,35,101,193,221,121,9]},"announce":[],"urlList":[]}}