{"title":"History Channel - The Dark Ages (2007 - DVD Rip)","uid":6324768,"size":1578282647,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:386b7d59bddcffdce37ab73122f0404dfdffc274&amp;dn=History+Channel+-+The+Dark+Ages+%282007+-+DVD+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"rambam1776","files":-1,"time":1303070783,"description":"History Channel - The Dark Ages (2007 - DVD Rip)\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 845kbps \nDuration.............: 1:30:45\nResolution...........: 600*398 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 224 kbps CBR \nAudio Channels.......: 2  \nFilesize.............: 736,176,614 \nNO SUBTITLES\n\n\nHistory Channel - The Plague \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 849kbps \nDuration.............: 1:30:25\nResolution...........: 600*414 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 224 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 736,158,264 \nNO SUBTITLES\n\n\n***UPLOADERS NOTE*** - There is another torrent of this about, but it is a TV rip with commercials, and lacks the extras. This DVD came with the Dark Ages show as the primary offering, with the Plague Documentary as a secondary extra. They certainly belong together, so I left them as one torrent package instead of simply splitting them up. However, I will be offering the Plague by itself since some searchers might be looking for that instead of the Dark Ages in general. Further, this DVD came in an odd letterbox configuration that made the rip come out a little weird. Since that might bother some purists, I am also going to be offering this as a full DVD .ISO file in just a bit. Finally, is IS worth noting that this show is not terribly accurate. True historians will find a lot to quibble about here, and should check out the top link below:\n\n &lt;a href=&quot;\nhttp://historymedren.about.com/b/2007/03/02/the-dark-ages-on-the-history-channel.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://historymedren.about.com/b/2007/03/02/the-dark-ages-on-the-history-channel.htm&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0972369/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0972369/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/JahbfAAdK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/JahbfAAdK&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Dark-Ages-History-Channel/dp/B000NO2416&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Dark-Ages-History-Channel/dp/B000NO2416&lt;/a&gt;\n\nProduct Description\n\nAt its height in the second century A.D., the Roman Empire was the beacon of learning, trade, power and prosperity in the western world. But the once-powerful Rome--rotten to the core by the fifth century--lay open to barbarian warriors who came in wave after wave of invasion, slaughtering, stealing, and ultimately, settling. As chaos replaced culture, Europe was beset by famine, plague, persecutions, and a state of war that was so persistent it was only rarely interrupted by peace. THE DARK AGES profiles those who battled to shape the future, from the warlords whose armies threatened to case the demise of European society, like Alaric, Charles the Hammer, and Clovis; to the men and women who valiantly tended the flames of justice, knowledge, and innovation including Charlemagne, St. Benedict, Empress Theodora, and other brave souls who fought for peace and enlightenment. It was in the shadows of this turbulent millennium that the seeds of modern civilization were sown.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dark_Ages_(historiography)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dark_Ages_(historiography)&lt;/a&gt;\n\n&quot;Dark Ages&quot; is a term referring to the period of cultural and economic deterioration and disruption that occurred in Europe following the decline of the Roman Empire. The first record of the term comes from 1602 in the form of the Latin saeculum obscurum (dark age). The label employs traditional light-versus-darkness imagery to contrast the &quot;darkness&quot; of the period with earlier and later periods of &quot;light&quot;. Originally, the term characterized the bulk of the Middle Ages (ca. 5th - 15th C.) as a period of intellectual darkness between the extinguishing of the light of Rome and the Renaissance or rebirth from the 14th century onwards. This definition is still found in popular usage, but increased recognition of the accomplishments of the Middle Ages since the 19th century has led to the label being restricted in application. Since the 20th century, it is frequently applied only to the earlier part of the era, the Early Middle Ages (ca. 5th - 9th C.). However, many modern scholars who study the era tend to avoid the term altogether for its negative connotations, finding it misleading and inaccurate for any part of the Middle Ages.\n\nThe concept of a Dark Age originated with the Italian scholar Petrarch (Francesco Petrarca) in the 1330s, and was originally intended as a sweeping criticism of the character of Late Latin literature. Petrarch regarded the post-Roman centuries as &quot;dark&quot; compared to the light of classical antiquity. Later historians expanded the term to refer to the transitional period between Roman times and the High Middle Ages (ca. 11th - 13th C.), including not only the lack of Latin literature, but also a lack of contemporary written history, general demographic decline, limited building activity and material cultural achievements in general. Popular culture has further expanded on the term as a vehicle to depict the Middle Ages as a time of backwardness, extending its pejorative use and expanding its scope.","torrent":{"xt":"urn:btih:386b7d59bddcffdce37ab73122f0404dfdffc274","amp;dn":"History+Channel+-+The+Dark+Ages+%282007+-+DVD+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"386b7d59bddcffdce37ab73122f0404dfdffc274","infoHashBuffer":{"type":"Buffer","data":[56,107,125,89,189,220,255,220,227,122,183,49,34,240,64,77,253,255,194,116]},"announce":[],"urlList":[]}}