{"title":"Beethoven - The Complete Concertos  (5 CDs  -  2011)","uid":6844965,"size":1657191826,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3896657d69cc3df7f86aab50f5d231b10b11dcda&amp;dn=Beethoven+-+The+Complete+Concertos++%285+CDs++-++2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"rosie1966","files":36,"time":1322316358,"description":"Music : Classical : Lossless\nBeethoven - Complete Concertos (DG 2011) - 5CD box set\n\nNotes: New September 2011 release. DG's 'Collectors Edition' all-star compilation of its big-name artists. Flac lossless. Source off rutracker - all credit to original uploader. Files renamed so all works appear in the one folder. Includes hi-res booklet and cover scan.\n\nInfo: \nPiano Concerto 1 in C Major, Op. 15 Maurizio Pollini (piano), Wiener Philharmoniker, Eugen Jochum\nPiano Concerto 2 in B flat major, Op. 19 Maurizio Pollini (piano) Wiener Philharmoniker, Eugen Jochum\nPiano Concerto 3 in C minor, Op. 37 Maurizio Pollini (piano) Wiener Philharmoniker, Karl BÃƒÂ¶hm\nPiano Concerto 4 in G major, Op. 58 Maurizio Pollini (piano) Wiener Philharmoniker, Karl BÃƒÂ¶hm\nPiano Concerto 5 in E flat major, Op. 73 'Emperor' Maurizio Pollini (piano) Wiener Philharmoniker, Karl BÃƒÂ¶hm\nPiano Concerto in D major Daniel Barenboim (piano and conductor) English Chamber Orchestra\nPiano Concerto in E flat major, WoO 4 Lidia Grychtolowna (piano) Folkwang-Kammerorchester, Heinz Dressel\n\nViolin Concerto in D major, Op. 61 Anne-Sophie Mutter (violin) Berliner Philharmoniker, Herbert von Karajan\nViolin Concerto Movement in C major, WoO 5 Gidon Kremer (violin) London Symphony Orchestra, Emil Tchakarov\nTriple Concerto for Piano, Violin, and Cello in C major, Op. 56 Mark Zeltser (piano), Anne-Sophie Mutter (violin) &amp; Yo-Yo Ma (cello) Berliner Philharmoniker, Herbert von Karajan\nRomances 1 &amp; 2 for violin and orchestra Gil Shaham (violin) Orpheus Chamber Orchestra\nRomance cantabile Hess 13 Patrick Gallois (flute), Pascal Gallois (bassoon) &amp; Myung-Whun Chung (piano and conductor) Philharmonia Orchestra\nRondo in B flat major, Anh. 6 Sviatoslav Richter (piano) Wiener Symphoniker, Kurt Sanderling\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3896657d69cc3df7f86aab50f5d231b10b11dcda","amp;dn":"Beethoven+-+The+Complete+Concertos++%285+CDs++-++2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3896657d69cc3df7f86aab50f5d231b10b11dcda","infoHashBuffer":{"type":"Buffer","data":[56,150,101,125,105,204,61,247,248,106,171,80,245,210,49,177,11,17,220,218]},"announce":[],"urlList":[]}}