{"title":"Shooters 2002","uid":6392859,"size":918528762,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:38b74482c9ae18735262e27732bc8662cd9cb5cf&amp;dn=Shooters+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"centaura","files":2,"time":1305410083,"description":"Actors: Adrian Dunbar, Andrew Howard, Louis Dempsey, Gerard Butler, Jason Hughes \nDirectors: Colin Teague, Glenn Durfort \nWriters: Andrew Howard, Louis Dempsey, Gary Young \nProducers: Colin Teague, Glenn Durfort, George Skene \nFormat: PAL \nLanguage English \n\n\nGritty, profane and un-nervingly dark this film inhabits the hidden underworld that we suspected may be there in London. The plot twists and turns with intrigue as we watch loyalties shift amongst the characters and we follow the cast into ever deeper depravity. In a dog-eat-dog world only bones are left.\nI felt that the film could still have worked with a slightly less heavy use of bad language, but the method-acting style employed by the cast may have contributed to this. The actors do however turn in excellent performances, with a wonderfully menacing Dunbar showing us why English actors always make the best villans, and some brilliant young actors too.\n\nAn appropriate soundtrack, good edditing and special effects that added rather than took over from the film all added to my enjoyment. The fact that this is a low-budget film does not detract from it\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s effectiveness, so I\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'ll be watching out for more offerings from this director in the future.\n\nBe prepared to be somewhat disturbed by the content, but do enjoy this film. The dark-side of the good ol\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\' Brit-gangster fun genre. \n","torrent":{"xt":"urn:btih:38b74482c9ae18735262e27732bc8662cd9cb5cf","amp;dn":"Shooters+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b74482c9ae18735262e27732bc8662cd9cb5cf","infoHashBuffer":{"type":"Buffer","data":[56,183,68,130,201,174,24,115,82,98,226,119,50,188,134,98,205,156,181,207]},"announce":[],"urlList":[]}}