{"title":"They Live","uid":3593772,"size":4652335151,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:38d341fbb4623454fcb55099a695a7f70423bac4&amp;dn=They+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"silvia-","files":18,"time":1168462755,"description":"THEY LIVE\n\n[img]http://www.gotterdammerung.org/film/collection/t/00000745.jpg[/img]\n\nDirector John Carpenter\nYear: 1988 \nCast Roddy Piper, Keith David, Meg Foster, George Â´BuckÂ´ Flower, Peter Jason, Raymond St. Jacques, Jason Robards, John Lawrence, Susan Barnes, Sy Richardson, Wendy Brainard, Lucille Meredith \nLength 89 min \nVideo Pal\nAspect Ratio: 16:9 \nLanguages Dolby Digital Stereo: English, German, Spanish \nSubtitles English, German, Spanish, Portuguese, Dutch, Finnish, Swedish, Norwegian, Danish \nDV9 to DVD5: Decrypter + Rebuilder (9 pass)\n\nSinopsis:\nAn economic crisis brings unemployed Nada (Roddy Piper) to L.A. in search of work. What he finds instead is that the ruling elite of the world are aliens in disguise, their aim being to keep humans in a state of mindless consumerism. His discovery comes when he dons a pair of special sunglasses made by a resistance group and sees for the first time reality unadorned. Billboards, store signs, magazine covers--all bear subliminal messages to OBEY, to CONSUME, to have NO INDEPENDENT THOUGHT. Money itself says THIS IS YOUR GOD. But worst of all, with these glasses you see which of us are really hideous, bug-eyed aliens. The conceptual breakthrough is hilarious while keeping its roots in darker matters. Although some fault the film for settling into its action plot, the ending has a great payoff. And the direction by John Carpenter is handled with superb workmanlike aplomb. One unforgettable set piece has Piper in a back-alley fistfight with a friend who won&amp;#039;t put on the glasses that goes on and on, and just when you think it&amp;#039;s over it goes another round. One of the most subversive films ever made in Hollywood, They Live was released on the eve of the 1988 elections. The first TV ads had two hideous alien politicians debating, then one accusing the other of being &quot;No John Kennedy!&quot; --Jim Gay \n\nMore details: www.solodvd.org","torrent":{"xt":"urn:btih:38d341fbb4623454fcb55099a695a7f70423bac4","amp;dn":"They+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d341fbb4623454fcb55099a695a7f70423bac4","infoHashBuffer":{"type":"Buffer","data":[56,211,65,251,180,98,52,84,252,181,80,153,166,149,167,247,4,35,186,196]},"announce":[],"urlList":[]}}