{"title":"Robert Asprin - Myth Directions 1982 (Unab) Myth # 3","uid":6172240,"size":173730633,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:39660fe93505230eca2d77c2d4a7e61893e86a52&amp;dn=Robert+Asprin+-+Myth+Directions+1982+%28Unab%29+Myth+%23+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"rambam1776","files":-1,"time":1297627167,"description":"Robert Asprin - Myth Directions 1982 (Unab) Myth # 3\n\nUnabridged, 64 kbps mp3, 6:01:25\n &lt;a href=&quot;\nhttp://www.amazon.com/Myth-Directions-Robert-Asprin/dp/0441555292&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Myth-Directions-Robert-Asprin/dp/0441555292&lt;/a&gt;\n\n\nProduct Details\nPaperback: 202 pages\nPublisher: Ace; later printing edition (November 15, 1986)\nLanguage: English\nISBN-10: 0441555292\nISBN-13: 978-0441555291\n &lt;a href=&quot;\nhttp://bayimg.com/cADigaAdN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cADigaAdN&lt;/a&gt;\n\n\n\nMyth Directions is a 1982 humor fantasy novel by Robert Asprin, part of the MythAdventures series.\n\nPlot synopsis\n\nTanda wanted to get Aahz a birthday present, so she decides to rope Skeeve in to help find her a unique present for Skeeve's mentor. After travelling through several dimensions Skeeve hasn't managed to eat anything on the journey so Tanda takes him to Jahk, a dimension where the people are either too skinny or are overweight. When they arrive in Jahk they find themselves in the middle of a celebration, which they later find out that Ta-hoe (the city where they are) has recently won &quot;The Big Game&quot;. When Tanda sees the trophy she has a eureka moment and decides to steal it. But everything is not all that it seems. When they implement their plan they find the trophy gone and the alarms sounded! Skeeve manages to escape back to Klah (his home dimension) but, Tanda gets captured. After a brief explanation to Aahz the two of them head to Jahk to rescue Tanda.\n\nThey arrive back in Jahk and with the help of a native guide called Griffin they found out what happened to the trophy. The preparations for the upcoming war between Tahoe and Veygus (the city who Ta-hoe compete against in &quot;The Big Game&quot;) seemed stupid to Skeeve, but Aahz was showing more respect than seemed imaginable towards the Jahk's. They also found out that the magician who was holding Tanda captive. was actually Quigly (from Another Fine Myth). Unfortunately Skeeve makes a rash promise which makes escape for Tanda a lot harder.\n\nAfter that, Aahz and Skeeve went to Veygus to steal the trophy back. They went to the Veygus magician Massha to see what the security was like for the trophy. When they found out that they could only steal the trophy when it was on parade they created a diversion to make sure no-one was around when the stole the trophy.\n\nAfter stealing the trophy Skeeve finally told Aahz why they tried to steal the trophy in the first place. When Aahz finds out he becomes very reluctant to part with it, but it gave him a plan. They beat the Jahk's at their own game... literally.\n\nAfter pulling a team together they play &quot;The Big Game&quot; against Ta-hoe and Veygus. In the game after Aahz &quot;gets knocked out cold&quot; Skeeve manages to get Tanda to play so they win 1 and a half to 1 and a half to 1.\n\n\nCharacters\n\nSkeeve - Main character in this series of books. Court Magician to Possiltum and a reputation far above his level of skill at magik.\n\nAahz - Skeeve's mentor. With golden eyes and green scales he is easily the most recognizable character in the books.\n\nTanda - A curvaceous trollop with long green hair and olive skin. She is a free lance assassin and wouldn't care about stooping to petty crime.\n\nGriffin - Skeeve and Aahz's guide and a son of an officer of the Ta-hoe army.\n\nQuigley - Used to be a Demon hunter ( see: Another Fine Myth). In this book, however he is a magician for Ta-hoe and the person who is holding Tanda Captive.\n\nMassha - She is the Veygus magician. In the trade she is called a mechanic as she uses her jewellery instead of her own powers. Massha is easily recognizable as her literal prescense is staggering.\n\nChumley - A troll that Skeeve meets in the &quot;Yellow Crescent Inn&quot;. It soon turns out that he is a lot smarter than many people thinks, as in public he puts on his &quot;Big Crunch&quot; act to &quot;keep the riff-raff away&quot;. In this book he is part of the team that plays &quot;The Big Game&quot; with Aahz and Skeeve.\n\nGus - A Gargoyle who works in the &quot;Yellow Crescent Inn&quot;. He has worked with Skeeve and Aahz before when they fought Big Julie's army in Myth Conceptions. He also becomes part of Skeeve and Aahz's team.\n\nThe Geek - A very loathsome Deveel. He is a bookie who gives Aahz the basic information and rules of &quot;The Big Game&quot; but somehow manages to elude some key points of the game.\n\nBig Julie - Originally he was the leader of the army Skeeve and Aahz faced in Myth Conceptions. Being the master tactician that he is he coached the team over the month they were given.\n\nGeneral Badaxe - He leads the Possiltum army and joined the Aahz and Skeeve's team. He also caught Massha's eye.\n\nGleep - Skeeve's dragon and the final member of the team. At first he only seems to mess around but when the tough got going, so did he.\n\nDimensions\n\nKlah - Home dimension to Skeeve. Not very technologically or magically advanced.\n\nDeva - Home to the biggest year round market known as &quot;The Bazaar&quot;. The locals are known as Deveels or 'devils'.\n\nJahk - This dimension is the key focus of this book. There are several references in later books in the series.\n\nGastropo - A dimension full of man sized snails. Skeeve gets an admirer there.\n\nAvis - Full of bird like creatures. This dimension put a strain on Skeeve's magical ability as he had to maintain a disguise and fly at the same time.","torrent":{"xt":"urn:btih:39660fe93505230eca2d77c2d4a7e61893e86a52","amp;dn":"Robert+Asprin+-+Myth+Directions+1982+%28Unab%29+Myth+%23+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39660fe93505230eca2d77c2d4a7e61893e86a52","infoHashBuffer":{"type":"Buffer","data":[57,102,15,233,53,5,35,14,202,45,119,194,212,167,230,24,147,232,106,82]},"announce":[],"urlList":[]}}