{"title":"KMPlayer (HD, Video) v1.6.9 (Mod Ad Free) (CTRC)","uid":13314840,"size":17785789,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:39a46874773da9c27a3262cdda48429af35238de&amp;dn=KMPlayer+%28HD%2C+Video%29+v1.6.9+%28Mod+Ad+Free%29+%28CTRC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lion.King","files":2,"time":1453817201,"description":"[center][img]https://media.licdn.com/mpr/mpr/p/4/005/0a3/213/017d6f5.jpg[/img]\r\n\r\n[b]Requirements:[/b] 3.0+\r\n\r\n[b]Overview:[/b] Take The World’s Best Desktop Video Player on the Go with KMPlayer Mobile!\r\n\r\nKMPlayer is the world's best PC video player, chosen by over 300 million people from all around the world. We now bring our PC application to your Mobile!\r\nJust like KMPlayer PC, KMPlayer Mobile, is a free encoding media player which supports and plays all video files.\r\nHave a problem viewing your friend’s video recorded on his Apple on your Android? Use KMPlayer!\r\nWe bring the same features that made KMPlayer PC popular to your Mobile: A user friendly interface, high quality video, high quality sound, and of course the ability to play all videos!\r\n\r\n[b]*The world’s favorite player, KMPlayer!*[/b]\r\n\r\n[b]What you can do with KMPlayer:[/b]\r\n-One Finger Gesture Function for: video speed, sound adjustment, video skip/rewind, and brightness.\r\n-Organizational function to allow you to structure your files how you want.\r\n-A video media library function for all of your favorite lists.\r\n\r\n[b]KMPlayer’s Special Features:\r\n[/b]\r\n◆With KMP Connect you can connect your PC to your KMPlayer Mobile App.\r\nWatch movies on the go! KMP Connect has a strong connection and is easy to use! Connect NOW!\r\n★★★Chromecast compatible! Watch videos stored on your PC, on your Big Screen TV!\r\nDo you want to know how to used KMP Connect with Chromecast?\r\nGo to it is easy!\r\n\r\n◆ Video formats that are supported by KMP\r\n3gp, 3gp2, 3gpp, amv, asf, avi, axv, divx, dv, flv, f4v, gvi, gxf, m1v, m2p, m2t, m2ts, m2v, m4v, mks, mkv, moov, mov, mp2v, mp4, mpeg, mpeg1, mpeg2, mpeg4, mpg, mpv, mt2s, mts, mxf, nsv, nuv, oga, ogg, ogm, ogv, ogx, spx, ps, qt, rec, rm, rmvb, tod, ts, tts, vob, vro, webm, wm, wmv, wtv, xesc.\r\n\r\n◆ Codecs that are supported by KMP\r\nH.265, VP9\r\n\r\n[b]*KMPlayer has a dedicated team of developers working every day to Enhance and Simplify your viewing experience. We appreciate your support and promise more Amazing Features![/b]\r\n- KMPlayer cares about each and every one of your opinions, please leave us your comments and suggestions, so we can become a better KMPlayer.\r\nThank you!\r\n- If you are experiencing any technical problems or have questions, please contact us at    .\r\nThank you!\r\n- KMP Team –\r\n\r\n[b]WHAT'S NEW[/b]\r\n\r\n- Changed Interstitial Ads’ exposure location\r\n- Added an advertisement on video view with related SDK updates\r\n- Updated inquiry email to append device information\r\n- Added Database field for each media[/center]\r\n\r\n[center][img]http://extraimago.com/images/2015/11/08/oPEExeG.png[/img]","torrent":{"xt":"urn:btih:39a46874773da9c27a3262cdda48429af35238de","amp;dn":"KMPlayer+%28HD%2C+Video%29+v1.6.9+%28Mod+Ad+Free%29+%28CTRC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39a46874773da9c27a3262cdda48429af35238de","infoHashBuffer":{"type":"Buffer","data":[57,164,104,116,119,61,169,194,122,50,98,205,218,72,66,154,243,82,56,222]},"announce":[],"urlList":[]}}