{"title":"Patterns 1956 DvdRip Mkv Lee1001","uid":9967165,"size":1202251570,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a42aef579b6ea0a84c5b7f448a572f04666f6f2&amp;dn=Patterns+1956+DvdRip+Mkv+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xultfoad","files":1,"time":1397588858,"description":"Patterns 1956 DvdRip Mkv Lee1001\nFrench Subs\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0049601/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0049601/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Patterns_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Patterns_(film)&lt;/a&gt;\nRod Serling's incisive &quot;gray flannel suit&quot; TV drama created such a sensation when Kraft Television Theatre first aired it live on January 11, 1955 that, in an unprecedented move, it was repeated four weeks later, on February 9, again live. Richard Kiley starred as Fred Staples, a bright young man from Cincinnati brought into the executive pool at a top New York firm by ruthless CEO Ramsey (Everett Sloane). Staples doesn't know it at first, but he was recruited as the potential replacement for Andy Sloane (Ed Begley), an ailing exec whom Ramsey is easing out in a most unsubtle fashion. Staples takes a liking to Sloane and despises Ramsey's tactics; the question is: does he despise them enough to throw away the biggest opportunity in his life? Director Fielder Cook, who helmed both TV versions of Patterns, also did the same for the 1956 film version. While Everett Sloane and Ed Begley were carried over from TV, the more &quot;bankable&quot; Van Heflin replaced Kiley as Staples.\n \nMarch 28, 1956\nScreen: 'Patterns' Bows at Mayfair; Powerful Video Drama Scores in New Form\nBy A.H. WEILER\n\nTHERE has been much speaking of minds, pro and con, anent differences between the movies and TV. &quot;Patterns,&quot; Rod Serling's powerful video drama about life in the upper echelons of big business was first televised in January, 1955, and, without demeaning the phrase, brought back by popular demand a month later. It arrived on the Mayfair Theatre's screen yesterday to prove strikingly that fine drama is universal. The sterling values of &quot;Patterns&quot; remain unchanged. Mr. Serling has given us a creative, frightening and often moving portrait of familiar and rare executives caught in mahogany -paneled &quot;jungles&quot; with their teeth, hearts and minds bared.\n\nThere is little point in discussing whether &quot;Patterns&quot; is suited to a 21-inch or a 30-foot viewing area. Suffice it to say that the same director and virtually the same cast (Van Heflin is the only newcomer among the principals), have made the sometimes difficult switch from TV to films without loss of integrity, trenchant characterization or impact. The movie has given &quot;Patterns&quot; wider physical scope, but it has not glossed over its terrible truths.\n\nAlthough it was filmed in a Brooklyn studio and on location hereabouts in simple, non-spectacular, black-and-white style, &quot;Patterns&quot; is neither simple nor black and white in treatment. Michael Myerberg and Jed Harris, who produced, and Fielder Cook, who directed both the TV and present versions, have not deviated from the original blueprint. This is still the story of the fierce and corrosive competition that exists in the executive branch of Ramsey &amp; Co., a New York industrial colossus headed by Walter Ramsey, its cold, designing and ruthless chief. It is the saga, too, of Bill Briggs, his longtime second in command, who is swayed by human as well as technological values. And, it is the case of Fred Staples, a comparatively youthful industrial engineer brought in by Ramsey to succeed Briggs.\n\nAs was the issue in the video edition, there is no clash between Briggs and his obvious heir. The younger man's views and sensitivities are essentially the same as Briggs'. People are not merely units, they feel. But it is Ramsey's calculated pattern not to fire his aging aide but to create such untenable positions that he will be forced to resign. And, it is the unenviable lot of the emotionally distraught but ambitious Staples to go along with this diabolical maneuver until Briggs dies of a heart attack.\n\nCredit the producers for not changing the climax as the thoroughly devastated Staples, intent on quitting, nevertheless takes on his late predecessor's weighty responsibilities. In a compelling last sequence, Ramsey, unregenerate as ever, dares our hero to compete for his job, while observing his own rules of conduct, just so long as he will devote his all to expansion of Ramsey &amp; Co. Perhaps Staples' defiant acceptance of this challenge is unusual, if not altogether comprehensible, under these harrowing circumstances. But it is true to the film's premise and it makes for forceful drama.\n\nAll the principals are familiar with their assignments and one would expect good results from them. They are better than that. They are uniformly excellent. The portrayals drawn by the director, Fielder Cook, from Everett Sloane, Van Heflin and Ed Begley, as Ramsey, Staples and Briggs, respectively, are charged with genuine emotion. One is hard put to choose among them. Mr. Sloane's characterization, is, as has been noted, a frighteningly menacing picture of a man dedicated to the idea of profits. Mr. Begley's Bill Briggs is not simply a weak man but one who is defeated by an order he cannot accept. Van Heflin's delineation of Fred Staples is one replete with shadings. He is not seduced by prospects of power but he emerges as one who will try to use it with compassion.\n\nThey are supported in restrained but effective fashion by Beatrice Straight, as Mr. Heflin's realistic but under-standing wife; Elizabeth Wilson, as the faithful secretary deeply hurt by her boss' misfortune; Ronnie Welsh Jr. as Mr. Begley's teen-aged son, and Joanna Roos as Mr. Sloane's coolly efficient secretary.\n\nThe settings in both offices and homes reflect taste, wealth and, of course, the tension of this frenetic world of business. But it is Mr. Serling's words and ideas that give it power and distinction and make &quot;Patterns&quot; a thoughtful and fascinating addition to this year's film files.\n\nPatterns is based on the teleplay of Rod Serling which was aired live on TV in January of 1955 on Kraft Television Theater, and was so-well received that it was repeated four weeks later. That was something not done during that period. This brilliant script by the creator of the Twilight Zone, Rod Serling, is considered by many as the finest piece of writing he has ever done and brought him instant acclaim. It is ably directed by Fielder Cook, and tells a tale about a power struggle in a giant New York corporation as an older executive is being phased out by a younger replacement. The ensemble cast is superb, with special kudos to Van Heflin, Ed Begley, Beatrice Straight and Everett Sloane. This is Van Heflin's finest role since Shane (53). Beatrice Straight was to go on to win an Academy Award in Network (76) as a supporting actress. Many considered this Sloane's finest role in his illustrious career. While Begley caught the proper anxiety mood of the aging executive fighting for survival, and gave that discriminated group the human face it needed. \n\nVIDEO\nSize.... 1.11gb\nDuration.... 01:28:18\nCodec.... H264 [&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0941606e6149453d2738&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;]\nFrame Width..... 716\nFrame Height.... 576\nYotal BitRate.... 1996kbps\nFrame Rate.... 24F/S\nAUDIO\nBit Rate.... 192kbps \nAc3 2.0 [eng]\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample\nSUBTITLES \nSRT [fre]","torrent":{"xt":"urn:btih:3a42aef579b6ea0a84c5b7f448a572f04666f6f2","amp;dn":"Patterns+1956+DvdRip+Mkv+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a42aef579b6ea0a84c5b7f448a572f04666f6f2","infoHashBuffer":{"type":"Buffer","data":[58,66,174,245,121,182,234,10,132,197,183,244,72,165,114,240,70,102,246,242]},"announce":[],"urlList":[]}}