{"title":"Understanding Bestiality and Zoophilia (2002) Miletski","uid":4575779,"size":1901699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3aa6970b9146eca9041a5a40e87062b63e588931&amp;dn=Understanding+Bestiality+and+Zoophilia+%282002%29+Miletski&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mwanon","files":-1,"time":1229222849,"description":"Understanding Bestiality &amp; Zoophilia. Hani Miletski. Bethesda, MD: East-West Publishing LLC, 2002, 273 pp.\nhttp://en.wikipedia.org/wiki/Hani_Miletski\n\n\n \n\nReviewed by Vern L. Bullough, Ph.D.\nhttp://www.vernbullough.com/\n\nThis is the best overall survey of bestiality that I have read. It is based on a doctoral dissertation at the Institute for Advanced Study of Human Sexuality in San Francisco, and is one of the few dissertations from that institution to be published. The title itself is important since Miletski, following the work of Mark Matthews (1994), believes there are two general classes of people who have sex with animals: (1) the &quot;bestialists&quot; who have had one or a few sexual contacts with an animal or use animals when a more &quot;normal&quot; outlet is not available; and (2) the &quot;Zoophiles,&quot; individuals who prefer an animal as a sex partner, often forming deep emotional relationships with them. Whereas these definitions are useful for studies of people currently involved in animal relationships and those who can be interviewed, they are not so useful for historical study of such activity, which tends to be confused by use of such terminology as &quot;sodomy,&quot; &quot;unnatural acts,&quot; and &quot;zooerasty.&quot;\n\nUsing a wide range of secondary sources dealing with the history of sexuality, Miletski examines animal and human sexual contacts area by area, from prehistoric times to the most recent, all in less than 30 pages. In spite of its brevity, it is the most comprehensive summary listing that I have seen in print. References to actual contacts are not always easy to locate and it is worth noting that some observers, for example, report animal-human contacts as widespread in China, whereas others claimed they were comparatively rare. Such contradictions only amplify the confused state of, and lack of research on, this topic.\n\nFrom surveying the widespread existence of animal-human contact, Miletski then turns to surveying the explanations for such conduct offered by earlier investigators ranging from Krafft-Ebing (1935), Freud (1963), and Menninger (1951), to Kinsey (Kinsey, Pomeroy, &amp; Martin, 1948; Kinsey, Pomeroy, Martin, &amp; Gebhard, 1953)and his associates (Gebhard, Gagnon, Pomeroy, &amp; Christensen, 1965), to John Money (1986). The differences in findings is evident in the changing explanations provided in the Diagnostic and Statistical Manual from the first edition (published in 1952) to the fourth edition (published in 1994).\n\nIt seems clear from Miletski's summary of the existing literature that very little is actually known about bestiality and there is not anything approaching a consensus as to why animal-human sexual contacts occur. Research on the topic, while out of the mainstream of sexuality research, has been further complicated by the growing groups of advocates of animal rights who wonder whether animals can consent, or whether animal-human sexual contact is harmful to animals, which drive potential respondents further underground. Miletski simply reports the conflicting views of the various positions on this issue and does not take sides.\n\nThe investigation of the topic is still further complicated by the fact that much of the existing reports and studies should be classified more as pseudo-science than serious research. As far as data on actual numbers involved, Kinsey's research is probably the most objective attempt to define the extent of the practice, although Miletski believes Morton Hunt's (1974) study was helpful. Unfortunately little survey data on the topic exists since those earlier works.\n\nAll of this discussion is by way of introduction to Miletski's own study which is based on detailed responses to a mailed questionnaire by 82 men and 11 women. The average age of the men was 38 (range = 19 to 78, median = 37) and of the women 36 (range = 21 to 48, median = 35). The major hurdle in conducting the study was obtaining respondents. Miletski received referrals from professionals through advertisements in sexuality newsletters, from references from survey respondents who knew others, and from contacts made via the Internet. It was really the Internet and its vast resources, including chat rooms, that made such research possible. To verify her Internet data, however, Miletski also had face-to-face contacts with a number of individuals in her sample.\n\nMuch of the book is devoted to reporting the responses to the lengthy questionnaire. The statistics analyses are simple, generally percentages who responded in particular ways, with no attempt to go beyond a descriptive account. There is also copious quotation from respondents since, once they found an interested researcher, many had a lot to say. The author calls her study a descriptive one, and recognizes that it has inherent flaws. This makes Miletski hesitant to claim any generalized significance, in part also because she found that there was little other than their sexual relations with animals that would distinguish her respondents from other Americans. Instead Miletski indicates the hope that she has opened the door to others and she describes what kind of future studies are needed. Miletski has given such future researchers a foundation upon which to build.\n\nAt the end Miletski provides a summary comparison of her findings with those of earlier studies, and her lengthy quotations from her subjects should prove invaluable to those seeking elaboration of how those engaged in animal contacts view themselves. Miletski concludes with excerpts of what transpired in a chat room in 1995 when she logged onto the Internet for the first time. Her questionnaire is also included.\n\nIn sum, this study is a path-breaking one, and gives us a better understanding of the topic. Much work still needs to be done, but Miletski should be complemented for her pioneering efforts. That it was not easy to do is evident from some of the comments she makes in passing, especially about the hostility of other sex professionals, as well as the public at large, who were repelled by her topic. Hopefully, current ongoing studies undertaken by Martin Weinberg and Colin Williams in the United States and Andrea Beetz in Germany will be able to build on what Miletski has started.\n\nREFERENCES\n\nFreud, S. (1963). Three contributions to the theory of sex, in A. Kirch (Ed.), The sexual revolution, vol. 1, Pioneer writings on sex. New York: Dell.\n\nGebhard, P. H., Gagnon, J. H., Pomeroy, W. B., &amp; Christensen, C. V. (1965). Sex offenders: An analysis of types. New York: Harper &amp; Row.\n\nHunt, M. (1974). Sexual behavior in the 1970's. Chicago: Playboy Press.\n\nKinsey, A. C., Pomeroy, W. B. &amp; Martin, C. E. (1948). Sexual Behavior in the Human Male. Philadelphia: W. B. Saunders.\n\nKinsey, A. C., Pomeroy W. B., Martin, C. E., &amp; Gebhard, P. H. (1953).\nSexual behavior in the human female. New York: W. B. Saunders.\n\nKrafft-Ebing, R. V. (1935). Psychopathia sexualis (Rev. ed.)\nNew York: Physicians and Surgeons Book Company.\n\nMatthews, M. (1994). The horseman: Obsessions of a zoophile. Amherst, NY: Prometheus Books.\n\nMenninger, K. A. (1951). Totemic aspects of contemporary attitudes toward animals. In G. B. Wilbur &amp; W. Muensterberger (Eds.), Psychoanalysis and culture: Essays in honor of Geza Roheim. New York: International Universities Press.\n\nMoney, J. (1986). Lovemaps. New York: Irvington.","torrent":{"xt":"urn:btih:3aa6970b9146eca9041a5a40e87062b63e588931","amp;dn":"Understanding+Bestiality+and+Zoophilia+%282002%29+Miletski","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aa6970b9146eca9041a5a40e87062b63e588931","infoHashBuffer":{"type":"Buffer","data":[58,166,151,11,145,70,236,169,4,26,90,64,232,112,98,182,62,88,137,49]},"announce":[],"urlList":[]}}