{"title":"Destiny's Child - Say My Name","uid":4498231,"size":141383684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3ad1e6a99a85b416ff0512df7fbca8a844061901&amp;dn=Destiny%5C%27s+Child+-+Say+My+Name&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"2nafish","files":-1,"time":1226286422,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Say My Name&quot; is a song by American R&amp;B group Destiny&amp;#039;s Child. The song was the third single from the group&amp;#039;s 1999 album The Writing&amp;#039;s on the Wall, released through Columbia label in 1999. The single is the most successful of the four releases off of the album. It is considered to be one of their signature songs. It won a Grammy Award and an MTV Video Music Award.\n\nIn December 1999, Mathew Knowles hired Farrah Franklin and Michelle Williams to replace members Letoya Luckett and LaTavia Roberson in group without signed members consent or knowledge. The video was then filmed in January 2000 with little time for the new members to learn the choreography. When the &quot;Say My Name&quot; music video debuted on February 15, 2000, audiences were shocked to see the absence of LeToya Luckett and LaTavia Roberson, who had been replaced by Farrah Franklin and Michelle Williams. The video featured Franklin and Williams alongside BeyoncÃƒÂ© Knowles and Kelly Rowland, and debuted on MTV and BET at the same time a press release announcing the lineup change was released.\n\nThe video featured the veterans and the rookie members along with two female dancers and one male dancer each in different colored rooms that were designed to look like living rooms in an apartment. BeyoncÃƒÂ© was featured in orange clothes to match her equally orange room. Kelly was in a blue room, newcomer Farrah was featured in a red room and Michelle was in a white room. The original video idea had more choreography in it but due to the abrupt group change the new girls were unable to dance in stiletto heels like their veteran counterparts. Instead the directors had the girls sit and stand in various positions around their rooms and pose with the beat of the song. After the first verse and the chorus the girls switched rooms but kept their respective color couches and clothes. Soon after the second verse during the &quot;break down&quot;, Beyonce, Kelly, Michelle and Farrah all gathered in a garage-like room that was complete with cars and Destiny&amp;#039;s Child in black leather pants and orange tops and all of the dancers, dressed in black, from the video. The dancers did a rotating dance which later became part of the live routine until their comeback in 2005. After this scene it was back to the colorful rooms in which the girls had now switched couches and continued the song until the end of the video where the final pose was back in the garage.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3ad1e6a99a85b416ff0512df7fbca8a844061901","amp;dn":"Destiny%5C%27s+Child+-+Say+My+Name","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ad1e6a99a85b416ff0512df7fbca8a844061901","infoHashBuffer":{"type":"Buffer","data":[58,209,230,169,154,133,180,22,255,5,18,223,127,188,168,168,68,6,25,1]},"announce":[],"urlList":[]}}