{"title":"The Bird Sisters - Rebecca Rasmussen","uid":11856728,"size":2505955,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bb8712e97eb59a228193dd903ab853dd42db028&amp;dn=The+Bird+Sisters+-+Rebecca+Rasmussen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1430175302,"description":"When a bird flies into a window in Spring Green, Wisconsin, sisters Milly and Twiss get a visit. Twiss listens to the birds' heartbeats, assessing what she can fix and what she can't, while Milly listens to the heartaches of the people who've brought them. These spinster sisters have spent their lives nursing people and birds back to health.\n\nBut back in the summer of 1947, Milly and Twiss knew nothing about trying to mend what had been accidentally broken. Milly was known as a great beauty with emerald eyes and Twiss was a brazen wild child who never wore a dress or did what she was told. That was the summer their golf pro father got into an accident that cost him both his swing and his charm, and their mother, the daughter of a wealthy jeweler, finally admitted their hardscrabble lives wouldn't change. It was the summer their priest, Father Rice, announced that God didn't exist and ran off to Mexico, and a boy named Asa finally caught Milly's eye. And, most unforgettably, it was the summer their cousin Bett came down from a town called Deadwater and changed the course of their lives forever.\n\nRebecca Rasmussen's masterfully written debut novel is full of hope and beauty, heartbreak and sacrifice, love and the power of sisterhood, and offers wonderful surprises at every turn.\n\nFrom Publishers Weekly\n\nRasmussen's debut novel begins like a typical coming-of-age story, but reveals itself to be a singular portrayal of familial sacrifice and loss. As elderly women, sisters Twiss and Milly live alone in the house where they grew up in Spring Green, Wis. They spend their days tending to injured birds and roaming their land, lost in memories. For Milly, there is the constant reminder of what could have been. Twiss spent her childhood happily trailing behind their golf-pro father, but Milly dreamed about a family and children that never happened. There was hope for a young Milly, until an accident strips their father of his golfing abilities and sets in motion a series of events that rips apart the already unstable family. Dad retreats to the barn, and mom bemoans her choice to marry for love, leaving behind her wealthy family; a cousin who was thought to be a friend becomes an unexpected rival; and the sisters are left with only each other. As young women, and as old ones, they learn that their relationship is rewarding, but not without consequence. Achingly authentic and almost completely character driven, the story of the sisters depicts the endlessly binding ties of family","torrent":{"xt":"urn:btih:3bb8712e97eb59a228193dd903ab853dd42db028","amp;dn":"The+Bird+Sisters+-+Rebecca+Rasmussen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bb8712e97eb59a228193dd903ab853dd42db028","infoHashBuffer":{"type":"Buffer","data":[59,184,113,46,151,235,89,162,40,25,61,217,3,171,133,61,212,45,176,40]},"announce":[],"urlList":[]}}