{"title":"The China Choice: Why We Should Share Power (2013) pdf","uid":8926260,"size":4929518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c03f1b6f4eb09274313d1374fd344ee721e61e9&amp;dn=The+China+Choice%3A+Why+We+Should+Share+Power+%282013%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1379372540,"description":"China is rising. But how should the West -- and the United States in particular -- respond?\n \nThis could be the key geopolitical question of the twenty-first century, according to strategic expert Hugh White, with huge implications for the future security and prosperity of the West as a whole. The China Choice confronts this fundamental question, considering the options for the Asian century ahead.\n \nAs China's economy grows to become the world's largest, the US has three choices: it can compete, share power, or concede leadership in Asia. The choice is momentous -- as significant for the future as any the US has ever faced. China is already more formidable than any country the US has faced before -- and if America does not want to find itself facing China as an enemy, it must accept it as an equal partner.\n \nWeighing the huge difficulties of accepting China as an equal with the immense cost and risks of making it an enemy, in the end the choice is simple, even if it is not easy. The US simply must share power with China in Asia. The alternative is too terrible to contemplate.\n\n2013 Oxford UP\nPDF","torrent":{"xt":"urn:btih:3c03f1b6f4eb09274313d1374fd344ee721e61e9","amp;dn":"The+China+Choice%3A+Why+We+Should+Share+Power+%282013%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c03f1b6f4eb09274313d1374fd344ee721e61e9","infoHashBuffer":{"type":"Buffer","data":[60,3,241,182,244,235,9,39,67,19,209,55,79,211,68,238,114,30,97,233]},"announce":[],"urlList":[]}}