{"title":"Life, on the Line- A Chef's Story of Chasing Greatness,Facing De","uid":7228950,"size":2485562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c2ec5646ea412dcba313650b082fee3238231ce&amp;dn=Life%2C+on+the+Line-+A+Chef%27s+Story+of+Chasing+Greatness%2CFacing+De&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"594mgnav","files":9,"time":1335773657,"description":"Life, on the Line- A Chef's Story of Chasing Greatness,Facing Death,and Redefining the Way We Eat[Team Nanban][TPB]\n\nGrant Achatz and Nick Kokonas | English | ISBN: 1592406017 | 2011 | 400 pages | EPUB | 2,4 MB\n\nDESCRIPTION:\n\n&quot;One of America's great chefs&quot; (Vogue) shares how his drive to cook immaculate food won him international renown-and fueled his miraculous triumph over \ntongue cancer.\n\nIn 2007, chef Grant Achatz seemingly had it made. He had been named one of the best new chefs in America by Food &amp; Wine in 2002, received the \nJames Beard Foundation Rising Star Chef of the Year Award in 2003, and in 2005 he and Nick Kokonas opened the conceptually radical restaurant Alinea, \nwhich was named Best Restaurant in America by Gourmet magazine. Then, positioned firmly in the world's culinary spotlight, Achatz was diagnosed with \nstage IV squamous cell carcinoma-tongue cancer.\n\nThe prognosis was grim, and doctors agreed the only course of action was to remove the cancerous tissue, which included his entire tongue. \nDesperate to preserve his quality of life, Grant undertook an alternative treatment of aggressive chemotherapy and radiation. But the choice came at a cost. \nSkin peeled from the inside of Grant's mouth and throat, he rapidly lost weight, and most alarmingly, he lost his sense of taste. Tapping into the discipline, \npassion, and focus of being a chef, Grant rarely missed a day of work. He trained his chefs to mimic his palate and learned how to cook with his \nother senses. As Kokonas was able to attest: The food was never better. Five months later, Grant was declared cancer-free, and just a few months \nfollowing, he received the James Beard Foundation Outstanding Chef in America Award.\n\nLife, on the Line tells the story of a culinary trailblazer's love affair with cooking, but it is also a book about survival, about nurturing creativity, and \nabout profound friendship. Already much- anticipated by followers of progressive cuisine, Grant and Nick's gripping narrative is filled with stories from \nthe world's most renowned kitchens-The French Laundry, Charlie Trotter's, el Bulli- and sure to expand the audience that made Alinea the \nnumber-one selling restaurant cookbook in America last year.\n\nPLZ SEED AFTER DOWNLOADING...\n\n&quot;SHARING IS CARING&quot;","torrent":{"xt":"urn:btih:3c2ec5646ea412dcba313650b082fee3238231ce","amp;dn":"Life%2C+on+the+Line-+A+Chef%27s+Story+of+Chasing+Greatness%2CFacing+De","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c2ec5646ea412dcba313650b082fee3238231ce","infoHashBuffer":{"type":"Buffer","data":[60,46,197,100,110,164,18,220,186,49,54,80,176,130,254,227,35,130,49,206]},"announce":[],"urlList":[]}}