{"title":"Tyr: Myth, Culture, Tradition, Volume 1 (2002)","uid":12258335,"size":86915181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c6097d7f77674f28469586491bb473a1fc85d27&amp;dn=Tyr%3A+Myth%2C+Culture%2C+Tradition%2C+Volume+1+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1440132519,"description":"TYR IS NAMED FOR THE GERMANIC SKY GOD, THE GUARDIAN OF TRANSCENDENT AND ETERNAL ORDER.\n\nPublished annually, TYR celebrates the traditional myths, culture, and social institutions of pre-Christian, pre-modern Europe. It includes in-depth, original articles, interviews, translations of essential works by radical traditionalist and anti-modern thinkers, as well as extensive reviews of books, films, music, and the arts.\n\nWHAT DOES IT MEAN TO BE A RADICAL TRADITIONALIST?\n\nIt means to reject the modern, materialist reign of &quot;quantity over quality,&quot; the absence of any meaningful spiritual values, environmental devastation, the mechanization and over-specialization of urban life, and the imperialism of corporate mono-culture, with its vulgar &quot;values&quot; of progress and efficiency. It means to yearn for the small, homogeneous tribal societies that flourished before Christianity -- societies in which every aspect of life was integrated into a holistic system.\n\nWHAT WE REPRESENT:\n\nResacralization of the world versus materialism; folk/traditional culture versus mass culture; natural social order versus an artificial hierarchy based on wealth; the tribal community versus the nation-state; stewardship of the earth versus the &quot;maximization of resources&quot;; a harmonious relationship between men and women versus the &quot;war between the sexes&quot;; handicrafts and artisanship versus Industrial mass-production.\n\nIN THIS ISSUE:\n\nSTEPHEN EDRED FLOWERS on &quot;Integral Culture&quot;; JOSCELYN GODWIN on the Italian esotericist JULIUS EVOLA; French philosopher ALAIN DE BENOIST's interview with &quot;new comparative mythologist&quot; GEORGES DUMEZIL; NIGEL PENNICK on the &quot;Spiritual Arts and Crafts&quot;; STEVE POLLINGTON on the Germanic war god Woden; MICHAEL MOYNIHAN on divine traces in the Nibelungenlied; COLLIN CLEARY on the anti-modern television series The Prisoner; JOSHUA BUCKLEY'S interview with IAN READ of the English heathen music group FIRE + ICE, and much more.\n\nPRODUCT NOTES:\n\n286 pages\nPublisher: Ultra (July 1, 2002)\nLanguage: English\nISBN-10: 0972029206\nISBN-13: 978-0972029209\n\nUPLOADER NOTES:\n\nPages that consist of advertisements have been deleted","torrent":{"xt":"urn:btih:3c6097d7f77674f28469586491bb473a1fc85d27","amp;dn":"Tyr%3A+Myth%2C+Culture%2C+Tradition%2C+Volume+1+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c6097d7f77674f28469586491bb473a1fc85d27","infoHashBuffer":{"type":"Buffer","data":[60,96,151,215,247,118,116,242,132,105,88,100,145,187,71,58,31,200,93,39]},"announce":[],"urlList":[]}}