{"title":"Philip K. Dick - Minority Report And Other Stories (unabridged)","uid":4938841,"size":154842540,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3c617bbab8b7944d07407067d442868e613fc30c&amp;dn=Philip+K.+Dick+-+Minority+Report+And+Other+Stories+%28unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"degsey","files":-1,"time":1244374532,"description":"Philip K. Dick - Minority Report and other Stories\n\nISBN-10: 0806523794 | 2002 | English | MP3 (64kb/s) | 147 MB\n\n\nProduct Description\n\nViewed by many as the greatest science fiction writer on any planet, Philip K. Dick has written some of the most intriguing, original, and thought-provoking fiction of our time. This collection includes stories that will make you laugh, cringe...and stop. \n\nIncludes:- The Minority Report, We Can Remember It For You Wholesale, Paycheck, Second Variety and The Eyes Have It. Read by Keir Dullea.\n\nAbout the Author\n\nPhilip K. Dick (1928-1982) wrote more than 100 short stories and dozens of novels, including Do Androids Dream of Electric Sheep?, which was the basis of the classic film Blade Runner. Dick won the Hugo Award in 1963 for his novel The Man in The High Castle. The Philip K. Dick Award is given annually to a distinguished work of science fiction.\n\nFrom AudioFile\n\nPhilip K. Dick holds a special place in the annals of science fiction. He is beloved by many for his strange reality-bending stories. The five stories included here are an excellent sample of his fiction. Most notable in the collection are &quot;Minority Report,&quot; which supposes that psychics could be employed by the police to predict and prevent murder, and &quot;We Can Remember It For You Wholesale,&quot; in which a person goes to a shop to have memories of a vacation implanted in his mind, only to find that he's got some memories of his own. The no-frills presentation by Keir Dullea is perfect for the material.\n\nPlease seed to at least 1:1\n\nEnjoy.\n","torrent":{"xt":"urn:btih:3c617bbab8b7944d07407067d442868e613fc30c","amp;dn":"Philip+K.+Dick+-+Minority+Report+And+Other+Stories+%28unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c617bbab8b7944d07407067d442868e613fc30c","infoHashBuffer":{"type":"Buffer","data":[60,97,123,186,184,183,148,77,7,64,112,103,212,66,134,142,97,63,195,12]},"announce":[],"urlList":[]}}