{"title":"American Gangster (2007) DVD9 PAL ENG GER","uid":9897011,"size":7871752192,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3cdbf07e55901b639a9c6af5eaf62e9121346cf9&amp;dn=American+Gangster+%282007%29+DVD9+PAL+ENG+GER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1396725551,"description":"audio: english,german\n\n\nsubs: english,german,turkish\n\n\n\n\n\n\nAmerican Gangster is a 2007 American biographical drama film directed and produced by Ridley Scott and written by Steve Zaillian. The film is based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina who smuggled heroin into the United States on American service planes returning from the Vietnam War before being detained by a task force led by detective Richie Roberts. The film stars Russell Crowe and Denzel Washington in their first lead acting roles together since 1995's Virtuosity, and co-stars Ted Levine, John Ortiz, Josh Brolin, Chiwetel Ejiofor, Norman Reedus, Ruby Dee, Lymari Nadal and Cuba Gooding, Jr. This was Cuba Gooding, Jr's last theatrically released film in many countries until 2012's Red Tails.\n\nDevelopment for the film initially began in 2000, when Universal Pictures and Imagine Entertainment purchased the rights to a New York magazine story about the rise and fall of Lucas. Two years later, screenwriter Steven Zaillian introduced a 170-page scriptment to Scott. Original production plans were to commence in Toronto for budget purposes; however, production eventually relocated permanently to New York City. Because of the film's rising budget Universal canceled production in 2004. After negotiations with Terry George, it was later revived with Scott at the helm in March 2005. Principal photography commenced over a period of five months from July to December 2006; filming took place throughout New York City and concluded in Thailand","torrent":{"xt":"urn:btih:3cdbf07e55901b639a9c6af5eaf62e9121346cf9","amp;dn":"American+Gangster+%282007%29+DVD9+PAL+ENG+GER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cdbf07e55901b639a9c6af5eaf62e9121346cf9","infoHashBuffer":{"type":"Buffer","data":[60,219,240,126,85,144,27,99,154,156,106,245,234,246,46,145,33,52,108,249]},"announce":[],"urlList":[]}}