{"title":"Stargate.SG-1.S01E01.Children.Of.The.Gods.The.Final.Cut.DVDRip.X","uid":5020973,"size":745665708,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ce5e9ee9e7b59a9651538f0f30649a11582fd6b&amp;dn=Stargate.SG-1.S01E01.Children.Of.The.Gods.The.Final.Cut.DVDRip.X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Jmk1792","files":55,"time":1248459413,"description":"&lt; Release Notes &gt;\n\nTitle: Stargate SG-1 S01E01 Children Of The Gods: The Final Cut\nRelease Date: 07/24/2009\nFormat: XVID\nVideo Bitrate: 910 kb/s\nResolution: 640x352\nFPS: 23.976 fps\nSource: DVD\nAudio Formate: 136 kb/s VBR &lt;a href=&quot;\nhttp://www.tv.com/stargate-sg-1/show/185/summary.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tv.com/stargate-sg-1/show/185/summary.html&lt;/a&gt;\n\nThis is basicly an alternate/reworked verion of the first episode that\nwas recently done by the show's producer and writer Brad Wright\nIt is shorter than the original with some special effects upgrades and\nlots of reediting\n\nQuotes from the DVD review on DVD Verdict:\n\n&quot;Seven minutes. That's how much time has been cut from the original\npilot movie. Odd, huh? Usually, the &quot;Director's Cut&quot; of anything is\nlonger and more complex than the original. That's not the case here.&quot;\n\n&quot;The largest change comes in the form of the re-edit. Wright cut scenes\nre-ordered others, and added new angles all with an eye toward delivering\na tighter film. Some of these edits were ones he wished he could have\ndone at the time but couldn't because of production problems such as a\nscratch in the film marring all of Shanks' close-ups in a pivotal scene\nBut other edits were made with an eye toward a more sophisticated audience\nOne of the small changes is the removal of a MacGyver joke. A larger change\nis in the introduction to Carter's character. In the original, she comes\non with a female chip on her shoulder, saying that she shouldn't be denied\njust because her sex organs are on the inside and not the outside. This\nline has been removed and the scene re-edited so it's clear that O'Neill's\nonly problem with her is that she's a scientist and not a soldier.&quot;\n\n&quot;The edit that's causing the biggest uproar is removal of the frontal\nnudity that was shown when Sha're is presented to Apophis. Remember, the\nseries was originally made for Showtime, so nudity was a given. But now\nthat the series is considered safe, family fare, the scene has been removed\nMany fans have voiced their displeasure, saying that the nudity was\nnecessary to accentuate Apophis' callous indifference, to make it feel\nmore like a rape. Others are thrilled to see the scene gone, saying that\nit was a blot on an otherwise excellent movie. Though I wouldn't go so\nfar as to call the original cut pornographic as some have, removing the\nnudity does invite a wider audience.&quot;\n\n&lt; Plot Summary &gt;\n\n&lt; Group News &gt;\n\nWanted: NOTHING\n\n&lt; GREETS &gt;\nO O On Behalf of the SAiNTS TV Division, Greets Go Out to: O O\nO O O\nTVEP , BiA , FoV , SFM\n\nAnd Shepherds We Shall Be\n\nOO\nO OO\nOO\n\nOO\nOO OO\nOO\nOO\nOO\nOO\nOO\n\nOO\nOO\n\ntlr.","torrent":{"xt":"urn:btih:3ce5e9ee9e7b59a9651538f0f30649a11582fd6b","amp;dn":"Stargate.SG-1.S01E01.Children.Of.The.Gods.The.Final.Cut.DVDRip.X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ce5e9ee9e7b59a9651538f0f30649a11582fd6b","infoHashBuffer":{"type":"Buffer","data":[60,229,233,238,158,123,89,169,101,21,56,240,243,6,73,161,21,130,253,107]},"announce":[],"urlList":[]}}