{"title":"Steely Dan - Aja (1977) 2010 SHM-SACD-DFF","uid":10988365,"size":1679209953,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3cfb6231e2be0c18b8f2d34fcf505f3227f96a02&amp;dn=Steely+Dan+-+Aja+%281977%29+2010+SHM-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"hal4000","files":-1,"time":1409955106,"description":"Steely Dan is an American jazz rock/rock band founded by core members Walter Becker and Donald Fagen. The band's popularity peaked in the late 1970s, and their seven albums over that period of time blended elements of jazz, rock, funk, R&amp;B, and pop. Rolling Stone has called them &quot;the perfect musical antiheroes for the Seventies.&quot;\n\nSteely Dan hadn't been a real working band since Pretzel Logic, but with Aja, Walter Becker and Donald Fagen's obsession with sonic detail and fascination with composition reached new heights. A coolly textured and immaculately produced collection of sophisticated jazz-rock, Aja has none of the overt cynicism or self-consciously challenging music that distinguished previous Steely Dan records. Instead, it's a measured and textured album, filled with subtle melodies and accomplished, jazzy solos that blend easily into the lush instrumental backdrops. But Aja isn't just about texture, since Becker and Fagen's songs are their most complex and musically rich set of songs -- even the simplest song, the sunny pop of &quot;Peg,&quot; has layers of jazzy vocal harmonies. In fact, Steely Dan ignores rock on Aja, preferring to fuse cool jazz, blues, and pop together in a seamless, seductive fashion. It's complex music delivered with ease, and although the duo's preoccupation with clean sound and self-consciously sophisticated arrangements would eventually lead to a dead end, Aja is a shining example of jazz-rock at its finest.\n\nDFF tracks extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the Japanese 2010 SHM-SACD.","torrent":{"xt":"urn:btih:3cfb6231e2be0c18b8f2d34fcf505f3227f96a02","amp;dn":"Steely+Dan+-+Aja+%281977%29+2010+SHM-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cfb6231e2be0c18b8f2d34fcf505f3227f96a02","infoHashBuffer":{"type":"Buffer","data":[60,251,98,49,226,190,12,24,184,242,211,79,207,80,95,50,39,249,106,2]},"announce":[],"urlList":[]}}