{"title":"Close Combat Cross of Iron + Grossdeutschland Mod","uid":6400309,"size":1112635682,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3d1e83b68dc186ffd4705d86d4823f186d5d3a8e&amp;dn=Close+Combat+Cross+of+Iron+%2B+Grossdeutschland+Mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"koolio521","files":4,"time":1305642345,"description":"This is the classic Close Combat 3: Cross of Iron + one of the best mods of all time Grossdeutschland v2.0, in my opinion the best mod and version of Close Combat.\n\nHelp keep it alive!\n\n------------------------------------------------\n\nInstallation is simple:\n\n1) Install Close Combat COI by clicking on the Setup files.\n\n2) Use the serials found in the text file\n\n3) Make sure you install the Command Centre, this comes automatically after the main installation.\n\n\n4) Unzip the GD2 map files into the Close Combat III/maps folder in your Close Combat folder\n\n5) Unzip the GD2 mod file into your plugins folder in your Close Combat folder.\n\n6) Start the Close Combat opening screen, then run Modswap (on the left hand menu). Install by clicking File then Install.\n\nNote: If you already have Cross of Iron you can simply just download the Grossdeutschland folder and go from there.\n\n------------------------------------------------\n\nThis mod modifies &quot;Cross of Iron&quot; to allow you to fight the campaign on the Eastern Front as a single unit, the infamous Grossdeutschland. Lead your Battle Group starting as a Regiment in the Barbarossa invasion of 1941, to the bitter end (as a Panzer Korps) in East Prussia. Designed specically for play against the computer, several changes were made to make the AI a more challenging opponent. It should be noted, these changes do not involve modifying the effectiveness of weapons or thickness of armor - All values are set to the greatest accuracy possible for both sides. The Soviets, however, have overwhelming numerical superiority and can easily replace losses while you need to be much more careful about ensuring most (if not all) of your troops survive each battle","torrent":{"xt":"urn:btih:3d1e83b68dc186ffd4705d86d4823f186d5d3a8e","amp;dn":"Close+Combat+Cross+of+Iron+%2B+Grossdeutschland+Mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d1e83b68dc186ffd4705d86d4823f186d5d3a8e","infoHashBuffer":{"type":"Buffer","data":[61,30,131,182,141,193,134,255,212,112,93,134,212,130,63,24,109,93,58,142]},"announce":[],"urlList":[]}}