{"title":"The Goon v3 1-43 (2003-2012) (Digital) (G85-Empire) (Ongoing)","uid":8759839,"size":582562059,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3e09640b7d817d61177c9b39a1c2c06a394ff89e&amp;dn=The+Goon+v3+1-43+%282003-2012%29+%28Digital%29+%28G85-Empire%29+%28Ongoing%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"blackcanary","files":-1,"time":1375223676,"description":"English | CBR | 43 Issues\n\nThe Goon v3 #1-43\nPublisher:  Dark Horse\nPublication Date:  June 18, 2003 - November 21, 2012\n\nWriter:  Eric Powell\nColorists:  Dave Stewart, Eric Powell, Robin Powell, and others\n\nThe Goon is an ongoing comic book series written and drawn by Eric Powell (with colors often by Dave Stewart or Eric/Robin Powell). The series mixes both a comical and violent atmosphere with a paranormal slant, with the average story concerning various undead creatures/zombies, ghosts, ghouls, mutants, skunk-apes with an unnatural hunger for pies, giant squids, mob/gang leaders, extra-dimensional aliens, mad scientists, robots, and more.\n\nThe Goon debuted in Dreamwalker #0 (March 1998, Avatar Press) in a 4-page Preview (later reprinted as the third story in the Goon #1, which is the true first appearance of the character). Powell was unhappy with the quality of the Avatar Press comics after just 3 issues, so he stopped handing in new material and waited for his contract to expire. Once that happened, he was unable to find another publisher, so he moved into self-publishing in 2002 with Albatross Exploding Funny Books. These self-published issues caught the eye of Dark Horse Comics, which approached Powell by telling him that they didn't know why they passed on the book, and in 2003 publication of The Goon moved to Dark Horse.\n\nThe book also received a release that would never be reprinted in trade format, Satan's Sodomy Baby.\n\nAfter Dark Horse Comics published issue #18, The Goon went on hiatus to allow Eric Powell to work on Chinatown, a graphic novel which tells more of the Goon's back story. The series returned with issue #19 on July 11, 2007.\n\nOn July 22, 2009 a one-shot comic was released titled Dethklok vs. The Goon. Both Eric Powell and Brendon Small co-wrote the comic.\n\nOn July 20, 2011 another one-shot comic was released titled &quot;When Freaks Collide&quot;. It was a collaboration between the Criminal Macabre comic series and The Goon by Steve Niles, Christopher Mitten, and Eric Powell.\n\nThe series has won several Eisner Awards - Best Single Issue/Single Story, Best Continuing Series, Best Humor Publication, Best Writer/Artist - Humor, and Best Painter or Multimedia Artist (interior art).\n\nThanks goes to G85, PhD, and InnerDemons for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8689374&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8689374&lt;/a&gt;","torrent":{"xt":"urn:btih:3e09640b7d817d61177c9b39a1c2c06a394ff89e","amp;dn":"The+Goon+v3+1-43+%282003-2012%29+%28Digital%29+%28G85-Empire%29+%28Ongoing%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e09640b7d817d61177c9b39a1c2c06a394ff89e","infoHashBuffer":{"type":"Buffer","data":[62,9,100,11,125,129,125,97,23,124,155,57,161,194,192,106,57,79,248,158]},"announce":[],"urlList":[]}}