{"title":"G.K. Chesterton - The Innocence of Father Brown (Unabridged)","uid":10548797,"size":305559408,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3e4c0f7467a99a8be4cd1af657dcbb821105459e&amp;dn=G.K.+Chesterton+-+The+Innocence+of+Father+Brown+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"ancapcatholic","files":-1,"time":1405315580,"description":"G.K. Chesterton - The Innocence of Father Brown (Unabridged Audio Book)\n\nOne of the most memorable sleuths in the canon of detective fiction has to be Father Brown, the small priest with a face as round and dull as a Norfolk dumpling, but who nevertheless outwits the greatest criminal minds with his wisdom regarding human nature. Brought to life here by actor Kevin O'Brien in a series of dramatic readings, this unabridged audio book of The Innocence of Father Brown also features an introduction and conclusion to each chapter by Dale Ahlquist, president of the American Chesterton Society and host of EWTN's immensely popular television series, G.K. Chesterton: The Apostle of Common Sense.\n\nFirst published in 1910, The Innocence of Father Brown includes many of the greatest Father Brown stories, including The Blue Cross, The Flying Stars, and The Hammer of God. So, sit back and enjoy the brilliance and wit of G.K. Chesterton's inimitable Father Brown.\n\nKevin O'Brien is a stage and screen actor and theatrical director. He leads the popular Theater of the Word Incorporated, and has appeared in countless productions. He is currently appearing on EWTN in the new series, Theater of the Word.\n\nDale Ahlquist is the president of the American Chesterton Society and EWTN host. He is the bestselling author of G.K. Chesterton: The Apostle of Common Sense and Common Sense 101.\n\nIgnatius Press, United States, 2008.\n\nUnabridged 12 disc set\n\nDisc 1 - The Blue Cross\nDisc 2 - The Secret Garden\nDisc 3 - The Queer Feet\nDisc 4 - The Flying Stars\nDisc 5 - The Invisible Man\nDisc 6 - The Honor of Israel Gow\nDisc 7 - The Wrong Shape\nDisc 8 - The Sins of Prince Saradine\nDisc 9 - The Hammer of God\nDisc 10 - The Eye of Apollo\nDisc 11 - The Sign of the Broken Sword\nDisc 12 - The Three Tools of Death &amp; Conclusion\n\n---\n\nShortly after the publication of ORTHODOXY, G. K. Chesterton moved from London to Beaconsfield, where he met Father O'Connor. It was the combination of Father O'Connor's shrewd insights to the darker side of man's nature together with his mild appearance that suggested to Chesterton a character that became the unassuming, pudding-faced Father Brown.\n\nNumerous short stories followed. All of them featuring this priest who appeared to know nothing yet in fact knew more about criminals than they knew about themselves. THE INNOCENCE OF FATHER BROWN is the first collection of these stories.\n\n&quot;Father Brown is a direct challenge to the conventional detective and in many ways he is more amusing and ingenious.&quot; (Saturday Review)\n\n---\n\nGilbert Keith Chesterton was an English writer, philosopher, satirist, and social critic. During his lifetime, the prolific Chesterton wrote eighty books, several hundred poems, some two hundred short stories, four thousand essays, and several plays. He was also known as a strong debater and Christian apologist. He often took on what he considered to be the flawed philosophy of modernism found in the writings of his good friends Oscar Wilde and George Bernard Shaw. It was Shaw who once referred to Chesterton in Time magazine as &quot;a man of colossal genius.&quot; Chesterton's writings consistently displayed wit and a sense of humor. His ingenious use of paradox in his commentaries on the leading political, economic, philosophical, and theological beliefs of his day makes his writings as relevant today as they were a century ago.\n\n---\n &lt;a href=&quot;\nhttps://thepiratebay.se/user/ancapcatholic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/ancapcatholic/&lt;/a&gt;\n\n\nBTC: 1N3Y2HNWe3xWY4qdYricHRKz58zqqi5MZp","torrent":{"xt":"urn:btih:3e4c0f7467a99a8be4cd1af657dcbb821105459e","amp;dn":"G.K.+Chesterton+-+The+Innocence+of+Father+Brown+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e4c0f7467a99a8be4cd1af657dcbb821105459e","infoHashBuffer":{"type":"Buffer","data":[62,76,15,116,103,169,154,139,228,205,26,246,87,220,187,130,17,5,69,158]},"announce":[],"urlList":[]}}