{"title":"Herman's Hermits - Herman's Hermits (1965) + Both Sides Of Herma","uid":8624692,"size":204244332,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3e820fd1edcc1991d7454dd8d92a88e8e801431c&amp;dn=Herman%27s+Hermits+-+Herman%27s+Hermits+%281965%29+%2B+Both+Sides+Of+Herma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kabellos","files":35,"time":1372467686,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nHerman's Hermits - Herman's Hermits (1965) + Both Sides Of Herman's Hermits (1966) [2002]\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51nUF3j9JaL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51nUF3j9JaL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nIncludes cover art\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Bruce Eder):\n\nHerman's Hermits were one of those odd 1960's groups that accumulated millions of fans, but precious little respect. Indeed, their status is remarkably similar to that of the Monkees and it's not a coincidence that both groups' music was intended to appeal to younger teenagers. The difference is that as early as 1976, the Monkees began to be considered cool by people who really knew music; it has taken 35 years for Herman's Hermits to begin receiving higher regard for their work. Of course, that lack of respect had no relevance to their success: 20 singles lofted into the Top 40 in England and America between 1964 and 1970, 16 of them in the Top 20, and most of those Top Ten as well. Artistically, they were rated far lower than the Hollies, the Searchers, or Gerry &amp; the Pacemakers, but commercially, the Hermits were only a couple of rungs below the Beatles and the Rolling Stones.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/hermans-hermits-p4476/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/hermans-hermits-p4476/biography&lt;/a&gt;\n\nAll Music Album Reviews:\n\n2 for 1\nAMG Review by Bruce Eder &amp; Tim Sendra\n\nHerman's Hermits' debut British album, 1965's Herman's Hermits, was actually issued six months later than its American counterpart, and two months after the band's second American album, the LP being treated as far more important in the United States than in England. The contents are actually fairly close to the U.S.-issued Their Second Album! Herman's Hermits on Tour, with a couple of important differences. Among the tracks unique to this album, the Richard/Marvin ballad &quot;I Wonder&quot; is pretty dispensable, but interspersed with achingly beautiful ballads are the group's attempts at somewhat harder sounds on numbers like Carole King and Gerry Goffin's &quot;Walkin' With My Angel&quot; and more basic, slightly edgier rock ballads such as &quot;Dream On&quot; and their cover of Graham Gouldman's &quot;For Your Love.&quot; The latter is decent, and lively enough, but the Yardbirds' version, lightweight as it may have seemed next to their blues sides, is so deeply soulful that it completely eclipses this rendition. Spiced with Keith Hopwood's catchy &quot;Don't Try to Hurt Me&quot; and &quot;Tell Me Baby&quot; (which appear on both albums, a testimony to Hopwood's songwriting ability) and ubiquitous fare such as &quot;Mrs. Brown You've Got a Lovely Daughter,&quot; the result is a pleasantly upbeat and substantial album by a highly underrated group. The 2002 reissue on EMI combines the record with the group's second U.K. release, 1966's Both Sides of Herman's Hermits, an album that will amaze a lot of listeners who never had much use for Herman's Hermits. Opening with an angry, bluesy &quot;Little Boy Blue,&quot; ripping through a Chuck Berry-influenced original (&quot;My Reservation's Been Confirmed&quot;), a surprisingly subdued and poignant version of &quot;Bus Stop,&quot; another original (&quot;For Love&quot;) that recalls Wayne Fontana &amp; the Mindbenders at their best, and the folk-rock-influenced, Steve Barri/P.F. Sloan-authored &quot;Where Were You When I Needed You,&quot; it's chock-full of revelations about the group's sound and range of music. Side two does contain the music hall standard &quot;Leaning on a Lamp Post,&quot; but the rest of this record really rocks, about as well as any Hollies album of the same era, and it's all good listening 30-plus years later -- nicely sung (especially Graham Gouldman's &quot;Listen People&quot;) and played regardless of who's actually playing the instruments. The two records taken together paint a surprisingly good portrait of a band who never got much respect but released a lot of good music.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/hermans-hermitsboth-sides-of-hermans-hermits-r589533/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/hermans-hermitsboth-sides-of-hermans-hermits-r589533/review&lt;/a&gt;\n\n============\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000063988&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000063988&lt;/a&gt;\n\nTrack List:\n\n01. Heartbeat\n02. Travelin' Light\n03. I'll Never Dance Again\n04. Walkin' With My Angel\n05. Dream On\n06. I Wonder\n07. For Your Love\n08. Don't Try To Hurt Me\n09. Tell Me Baby\n10. I'm Henery The Eight I Am\n11. The End Of The World\n12. Mrs. Brown You've Got A Lovely Daughter\n\n13. Little Boy Sad\n14. The Story Of My Life\n15. My Reservation's Been Confirmed\n16. Bus Stop\n17. For Love\n18. Where Were You When I Needed You\n19. All The Things I Do For You Baby\n20. Leaning On A Lamp Post\n21. Dial My Number\n22. Oo-Ee Baby\n23. Je Suis Anglais\n24. Listen People\n\n","torrent":{"xt":"urn:btih:3e820fd1edcc1991d7454dd8d92a88e8e801431c","amp;dn":"Herman%27s+Hermits+-+Herman%27s+Hermits+%281965%29+%2B+Both+Sides+Of+Herma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e820fd1edcc1991d7454dd8d92a88e8e801431c","infoHashBuffer":{"type":"Buffer","data":[62,130,15,209,237,204,25,145,215,69,77,216,217,42,136,232,232,1,67,28]},"announce":[],"urlList":[]}}