{"title":"Manon Martin Premiere Orgie Pour Ma Femme (Marc Dorcel) WEB-DL (","uid":12210001,"size":1197017706,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:3ecd2c03d3c4c655ea39e52cd71ec5e6f8850655&amp;dn=Manon+Martin+Premiere+Orgie+Pour+Ma+Femme+%28Marc+Dorcel%29+WEB-DL+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"visita","files":4,"time":1439065810,"description":"Manon Martin Premiere Orgie Pour Ma Femme (NEW 2015 Marc Dorcel) [Split Scenes] WEB-DL\n\nNames: Manon Martin, 1ere Orgie pour ma femme / Manon Martin, 1st Orgy for my Wife\nReleased: 2015\nCountry: USA\nDirected by: Franck Vicomte\nStudio: Marc Dorcel\nGenre: Feature, Orgy\nCast: Manon Martin, Christen Courtney, Kiara Lord, Brandy Smile, Nataly Gold, Anita Bellini, Angel Blade, Renato, Thomas Stone, Mugur, Guillaume Valmer, Kristof Cale\nDuration: 105 min.\n\nDescription in French: Manon est une jeune femme de 22 ans, timide et prude concernant les choses du sexe. Sa rencontre avec Alex, un jeune homme beau, riche et libertin va totalement changer sa vie. Apres une somptueuse ceremonie de mariage et une nuit de noces inoubliable, Alex va commencer a initier Manon a tous les plaisirs de la sexualite. Et pourquoi, d'ailleurs, ne pas commencer avec cette magnifique cliente de cafe? Ne serait-elle pas parfaite pour une toute premiere fois avec une fille? Basculant un peu plus chaque jour dans une recherche effrenee du plaisir et de la jouissance, Manon ira jusqu'a participer a une magnifique orgie mondaine ...\n\nDescription in English: Manon is a young 22 year old woman, shy and prudish when it comes to sex. Her encounter with Alex, a young, good looking, rich and libertine man, will completely change her life. After an extravagant wedding ceremony and an unforgettable wedding night, Alex begins to introduce Manon to the joys of sex. And why not start with this extremely beautiful woman at a cafe? Would not she be perfect for Manon's very first time with a girl? Venturing a little further each day in her unquenchable search for pleasure and sex, Manon will go as far as to take part in an unforgettable high society orgy","torrent":{"xt":"urn:btih:3ecd2c03d3c4c655ea39e52cd71ec5e6f8850655","amp;dn":"Manon+Martin+Premiere+Orgie+Pour+Ma+Femme+%28Marc+Dorcel%29+WEB-DL+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ecd2c03d3c4c655ea39e52cd71ec5e6f8850655","infoHashBuffer":{"type":"Buffer","data":[62,205,44,3,211,196,198,85,234,57,229,44,215,30,197,230,248,133,6,85]},"announce":[],"urlList":[]}}