{"title":"Borrowed Billionaire Series (.5-5) by Mimi Strong [MU]","uid":8627790,"size":7294556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fec0ef61182c700c0d489d8f963275717036101&amp;dn=Borrowed+Billionaire+Series+%28.5-5%29+by+Mimi+Strong+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1372555042,"description":"Borrowed Billionaire Series (.5-5) by Mimi Strong in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nCalibre - {spam link removed}download \nOnline - http://ebook.online-convert.com \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter\n\nLexie's First Time (Borrowed Billionaire 0.5) by Mimi Strong (January 31st 2013)\n\nBefore Lexie met her billionaire, Luthor Thorne, she was once a high school virgin, desperate to be touched.\n\nEager and curious about being with a real-life boy, as opposed to her go-to imaginary hunk Freddie Prinze Jr., she meets up with an unlikely candidate, and has a first time, of sorts.\n\nShe gains confidence, but not quite all the experience she was seeking.\n\nThat summer, between high school and college, she takes a job with a family friend, cleaning cabins.\n\nShe meets a man who's trying to write his first detective novel, but seems more interested in getting to know his housekeeper. He's still going by the first name of David, but Lexie convinces him to use his much sexier middle name, and become Smith Wittingham.\n\nSmith Wittingham's first act as a new author is to help alleviate young Lexie of her ... curiosity.\n\nThe Walk-In (Borrowed Billionaire #1) by Mimi Strong (August 27th 2012)\n\nLexie Ross is a professional organizer to the mega-rich, but she's never had a boss like this.\n\nMr. Thorne smells good, or at least his clothes do.\n\nLexie doesn't know what he looks like, because Mr. Thorne's staff is doing everything they can to keep her from meeting him.\n\nOver three days of organizing at the Thorne mansion, she gets herself closer and closer to him, until at last it seems they might meet, face-to-face. But is the sexy stranger with the fiery eyes who he seems to be?\n\nLexie Goes Shopping (Borrowed Billionaire #2) by Mimi Strong (August 31st 2012)\n\nLexie leaves Luthor Thorne's mansion, more confused and agitated than ever.\n\nHer next professional organizing assignment is helping a rich lady with her &quot;shopping.&quot; The lady has brought her husband along, and Lexie tries to get her mind off Mr. Thorne by having some fun with a sexy silver fox of a man, inside the changing room at a luxury boutique.\n\nA phone call from Mr. Thorne changes everything.\n\nReturn to Mr. Thorne (Borrowed Billionaire #3) by Mimi Strong (September 5th 2012)\n\nProfessional organizer Lexie Ross refuses to take Mr. Thorne's call, so he invites her to dinner.\n\nThey meet in a private room, in complete darkness, because the restaurant's theme is dining in the dark. It's supposed to be a sensual experience, all about the food. All about the senses.\n\nThe appetizers haven't even arrived, and already Mr. Thorne is making some rather forceful demands.\n\nUnder the Sea (Borrowed Billionaire #4) by Mimi Strong (October 8th 2012)\n\nMr. Thorne's been talking to Lexie's best friend, and now there are plane tickets booked for Friday.\n\nLexie buys some special underwear for the trip, but that's not all she's bringing. She's got her best friends in tow with her, and they're all going diving, under the sea.\n\nThe resort is halfway around the world, and despite having the time of her life, Lexie finds herself thinking about someone back home.\n\nSet it on Fire (Borrowed Billionaire #5) by Mimi Strong (October 22nd 2012)\n\nAfter her harrowing adventure under the sea, Lexie's feeling cautious.\n\nShe finishes the vacation on a high note and returns home, to the arms of an old flame. They get each other's temperature rising, but he has a surprise, and it's not something Lexie wants. At least not yet.\n\nLexie is drawn back to Mr. Luthor Thorne, and they meet &quot;as friends&quot; for lunch. Where is this going? Upstairs? To the penthouse suite? The one with a piano?\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:3fec0ef61182c700c0d489d8f963275717036101","amp;dn":"Borrowed+Billionaire+Series+%28.5-5%29+by+Mimi+Strong+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fec0ef61182c700c0d489d8f963275717036101","infoHashBuffer":{"type":"Buffer","data":[63,236,14,246,17,130,199,0,192,212,137,216,249,99,39,87,23,3,97,1]},"announce":[],"urlList":[]}}