{"title":"The National Locksmith - Guide to Manipulation","uid":6512430,"size":16789657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4003fe7610adc99688dd2d6eb19db019cca5bae2&amp;dn=The+National+Locksmith+-+Guide+to+Manipulation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_F1_","files":-1,"time":1309687609,"description":"Gene Roberts, &quot;National Locksmith - Guide to Manipulation&quot; \n The Nation Publishing Company | 2009, 1988 | ASIN: B004IZLOQM | 155 pages | PDF | 16 MB \n\n Learn the Art Of lock Manitpulations. This book is a classic, and Most have for those into the field of Locksmithing. \n\n Preface:\n Bob Sieveking has completed an amazing task in writing this book on Manipulation. He has taken a complicated subject and he has broken it down and organized it into many steps which you may learn one step at a time. This may sound like an easy thing to accomplish. However, when considering a subject as complex as this one, the job of teaching becomes all the more difficult.\n Yet the result of the author's labor is a book which is virtually a complete course on Manipulation. One would never expect to learn a subject just by paging through a book on the topic. For example, even an excellent book on French will not help you to speak French unless you practice and work hard. But if you exert yourself, follow the author's instructions, and practice, practice, practice...you will learn to manipulate combination\n locks. Taking an actual course will upgrade your skills even further.\n As Editor and Publisher of The National Locksmith magazine, my work is centered on bringing information to the locksmith that will help you learn new skills. Locksmithing is becoming more and more a service-related industry. Therefore, it behooves the locksmith to have as many security-related skills as humanly possible. This makes your business more complete and will help you make more money in your career. Learning skills like Manipulation will help insure that you do not have to refer these calls away to other craftsmen. Thus your customer comes to understand that he can call you for service\n whenever he has a security problem.\n The National Locksmith magazine publishes a line of books and manuals written by locksmiths for other locksmiths. This is such a book. Contained in this manual are techniques that have been passed from generation to generation oflocksmiths. Be sure to use caution when storing this book. Guard it carefully to be sure that is does not fall into the wrong hands. I urge you to continue your quest for knowledge and understanding of the locksmith trade. Of course, you should subscribe to The National Locksmith. It is a very easy way to learn many new techniques and important information.\n I would like to thank Bob Sieveking for his good work in writing this book. We believe that combination locks will play an important role in security for many, many years to come. Therefore, locksmiths will be referring to this book on Manipulation for generations to come. I am proud to have played a part in its publication. The author is to be highly commended. And you, the reader, are to be commended also ...for seeking to upgrade your skills. Congratulations.\n Marc Goldberg","torrent":{"xt":"urn:btih:4003fe7610adc99688dd2d6eb19db019cca5bae2","amp;dn":"The+National+Locksmith+-+Guide+to+Manipulation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4003fe7610adc99688dd2d6eb19db019cca5bae2","infoHashBuffer":{"type":"Buffer","data":[64,3,254,118,16,173,201,150,136,221,45,110,177,157,176,25,204,165,186,226]},"announce":[],"urlList":[]}}