{"title":"IEInspector HTTP Analyzer Full Edition v7.5.2.454 Incl Keymaker-","uid":10241605,"size":9934847,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:404281e99d64af3fde0de0c833bffee8e258e188&amp;dn=IEInspector+HTTP+Analyzer+Full+Edition+v7.5.2.454+Incl+Keymaker-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TorDigger","files":12,"time":1401249250,"description":"HTTP Analyzer\n\nHTTP Sniffer, HTTP Monitor, HTTP Tracer, HTTP Debugger, HTTP/HTTPS Analyzer\n\nIEInspector HTTP Analyzer is such a handy tool that allows you to monitor, trace, debug and analyze HTTP/HTTPS traffic in real-time. It is used by industry-leading companies including Microsoft, Cisco, AOL and Google.\n\nHTTP Analyzer includes two Editions---Stand-alone Edition and Add-on Edition.\n\nStand-alone Edition : Window stand-alone EXE application. It allows you to capture and view HTTP/HTTPS traffic from a specific process or user/session/system wide. Support IE, Safari, Firefox and other win32 web application.\n\nAdd-on Edition: An add-on that integrates into the lower part of your IE or Firefox window and can be opened/closed from the IE or Firefox toolbar. It can only capture and view HTTP/HTTPS traffic of current IE or Firefox process.\n\nMain Features\n\n- Integrate with Internet Explorer and Firefox, No more switching between windows. HTTP Analyzer Shows HTTP/HTTPS traffic and web page in the same window. \n- Support HTTPS, show you unencrypted data sent over HTTPS / SSL connections as the same level of detail as HTTP.\n- See wide range data, including Header, Request ,Network Timing, Content, Cookies, Caching, Query Strings, Post data, Request and Response Stream, redirection URLs, DOMReadyTime, PageLoadTime. \n- Real-time Page and Request Level Time Chart, The colored time chart is used to express the relative time between a single network level timing (i.e. , DNS lookup, TCP connects) and other timing segments in the same request. \n- IE/Firefox Tamper, User can tamper with HTTP requests, view and modify GET query parameters, HTTP/HTTPS headers and POST parameters from Internet Explorer 5+ and Firefox 3+ by using IE/Firefox tamper tool. \n- Highlights Detected Potential Problems, Http Analyzer examines each request and issues hinting messages when detecting potential functionality ,performance or security problem. \n- Native support for Flash Remoting , HTTP Analyzer is especially useful for Adobe Flash developers as you can view the request and response of LoadVariables, LoadMovie and XML loads. It can also deserialize and display all Flash Remoting or AMF (AMF0 and AMF3) traffic in a easy-to-use AMF object tree. \n- JSON , SOAP and .NET ViewState Viewer , HTTP Analyzer can deserialize SOAP and JSON traffic into the easy-to-use object tree. It can also read and decode the hidden ViewState on an ASP.NET Page. \n- Request builder, Users can handcraft an HTTP request by using the HTTP Request Builder, or use a drag-and-drop operation to move an existing request from the session grid to the Request Builder to execute it again. \n- Automation interface, The HTTP Analyzer automation library is packaged as COM components. both Stand-alone and Add-on can be fully controlled by using OLE Automation. It can be used by most programming languages (e.g. C#, VC, Delphi &amp; JavaScript).\n\nSupported OS:\n\nWindows 7/vista/xp\n\nAlso Support IE11 , Win8.1 32/64 bit Applications\n\nHomepage: http://www.ieinspector.com/httpanalyzer/index.html\n\nInstallation Instructions: \n\n- Install program.\n- Use Keygen to get Valid key for registering application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:404281e99d64af3fde0de0c833bffee8e258e188","amp;dn":"IEInspector+HTTP+Analyzer+Full+Edition+v7.5.2.454+Incl+Keymaker-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"404281e99d64af3fde0de0c833bffee8e258e188","infoHashBuffer":{"type":"Buffer","data":[64,66,129,233,157,100,175,63,222,13,224,200,51,191,254,232,226,88,225,136]},"announce":[],"urlList":[]}}