{"title":"Total Marvel Week of 7-23-2014 (darkhomr) [ALL]","uid":10655803,"size":549336669,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:417d9732e2c39831b3dc240a1bfa290db61db070&amp;dn=Total+Marvel+Week+of+7-23-2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1406664721,"description":"Each week I will be posting the current week's Marvel titles These are the titles for July 23, 2014. \n\nIncluded in this pack will be all Marvel comics and Marvel NOW comics. What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\n My release packs are as follows: \n\n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n100th Anniversary Special #1 Avengers (CBR 7/23/2014)\n\nClassified\n\nAll New Doop #4 (of 5) (CBR 7/23/2014)\n\nThe true horror of Doop rears its ugly head! Kitty Pryde and Doop find themselves in the middle the scariest moment of their lives with no one to turn to! Will Kitty finally accept Doop's proposal of marriage? \n\nAll New Invaders #8 (CBR 7/23/2014)\n\nClassified\n\nAll New Ultimates #5 (CBR 7/23/2014)\n\nFROM THE CREATOR OF THE HIT COMIC 'COPRA' It's a battle royale when the new superteens on the block go up against the most dangerous supergangs on the street! Will the bloodthirsty vigilante, SCOURGE, take everyone in a costume down, be it street punk or good guy? Will SPIDER-MAN, BLACK WIDOW, KITTY PRYDE, BOMBSHELL, CLOAK &amp; DAGGER survive a second wave of violence when the deadly CROSSBONES joins the fray? \n\nAmazing Spider-Man #4 (CBR 7/23/2014)\n\nORIGINAL SIN tie-in! The radioactive spider that gave Peter Parker his powers bit someone else, too! Who is Silk and where has she been? Don't miss this incredible new character who will be a major Spider-player for the whole year! \n\nDaredevil #6 (CBR 7/23/2014)\n\nClassified\n\nDeadpool #32 (CBR 7/23/2014)\n\nORIGINAL SIN tie-in! Preston uncovers a secret from Deadpool's past that needs immediate attention! But Deadpool and Dazzler are still fighting off Dracula's forces! \n\nDeadpool vs. X-Force #2 (of 4) (CBR 7/23/2014)\n\nClassified\n\nMighty Avengers #12 (CBR 7/23/2014)\n\nORIGINAL SIN tie-in! Election Night, 1972. Under a moonless sky, unspeakable evil slouched towards Manhattan to be born... ...and the only people who could hold it back were the original Mighty Avengers. Meanwhile, in the present day - history repeats itself! But this time, have the Mighty Avengers already failed? \n\nOriginal Sin #5.2 (CBR 7/23/2014)\n\nClassified\n\nOriginal Sins #4 (of 5) (CBR 7/23/2014)\n\nClassified\n\nStorm #1 (CBR 7/23/2014)\n\nThief. Goddess. Headmistress. Queen. The X-Man called STORM has always defied a single title. And her desire to better the world has never been limited to only her own kind. On a mission to foster goodwill and safeguard the mutant race's continued existence in her own way, Storm will travel the globe, confronting man and mutant, god and monster and everything inbetween. She will overthrow tyrants, quell tsunamis and strive to see her dream for the world realized. She is STORM, a hero like no other....and the skies will tremble at the sight of their namesake.\n\nWolverine and the X-Men #6 (CBR 7/23/2014)\n\nTOMORROW NEVER LEARNS FINALE! The Phoenix Corporation vs. the X-Men and their very future hangs in the balance! Jason Latour and Mahmud Asrar conclude chapter one of the smash hit of All New Marvel Now! \n\n\n","torrent":{"xt":"urn:btih:417d9732e2c39831b3dc240a1bfa290db61db070","amp;dn":"Total+Marvel+Week+of+7-23-2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"417d9732e2c39831b3dc240a1bfa290db61db070","infoHashBuffer":{"type":"Buffer","data":[65,125,151,50,226,195,152,49,179,220,36,10,27,250,41,13,182,29,176,112]},"announce":[],"urlList":[]}}