{"title":"Fargo - Season 1","uid":13715014,"size":5862330035,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:42748999ccc1f210e1f9c35e1245284a2d97a2d4&amp;dn=Fargo+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"POtHS11","files":12,"time":1456899724,"description":"Description:   Fargo - Season 1\r\n\r\n\r\nFargo\r\nAmerican comedy series\r\nYoung state trooper Lou Solverson, who recently returned from Vietnam, is investigating a case that involves a criminal gang, a major mob syndicate, and a small-town beautician. Among the people Solverson comes across during his investigation are Korean War vet Karl Weathers, a lawyer with the eloquence of a con artist, and Joe Bulo, who is the front man for a northern expansion of a Kansas City crime syndicate. Bulo's crew has its sights set on Fargo's Gerhardt crime family. With her husband facing death, matriarch Floyd now leads the Gerhardt clan, which frustrates eldest son Dodd, who can't wait for both of his parents to die so he can take over and expand the family's crime empire.\r\n\r\n1. The Crocodile's Dilemma\r\n\r\nA rootless, manipulative man meets a small town insurance salesman and sets him on a path of destruction.\r\n\r\n2. The Rooster Prince\r\n\r\nMolly begins to suspect that Lester is involved with the murders, but her new boss points her in a different direction. Meanwhile, Malvo investigates the blackmail plot against a man known as the Supermarket King.\r\n\r\n\r\n3. A Muddy Road\r\n\r\nMalvo flips the script on the blackmail operation, Molly sets a trap, and Gus debates whether he should come clean. Lester's return to work has complicated repercussions.\r\n\r\n\r\n4. Eating the Blame\r\n\r\nWhen Gus tries to right a wrong, Malvo embraces his alter ego. Lester finds himself in a surprising situation, and Molly uncovers a promising lead.\r\n\r\n5. The Six Ungraspables\r\n\r\nWhen Lester has a close call, Molly makes an unorthodox decision. Gus weighs some neighborly advice, and Malvo gets what he wants.\r\n\r\n6. Buridan's Ass\r\n\r\nMalvo executes his master plan, while Lester attempts to craft one of his own. Gus and Molly team up in Duluth.\r\n\r\n\r\n7. Who Shaves the Barber?\r\n\r\nMalvo seeks answers, while Lester finagles a few of his own. Molly and Gus try to get past a setback in the investigation.\r\n\r\n8. The Heap\r\n\r\nMolly faces pressure to close the case, while Lester starts to feel like a new man.\r\n\r\n9. A Fox, a Rabbit, and a Cabbage\r\n\r\nLester has an unexpected encounter, Malvo changes course, and a new investigation leads Molly down a familiar path.\r\n\r\n10. Morton's Fork\r\n\r\nMolly takes the lead, while Gus pursues a hunch. Lester manipulates a situation, and Malvo finds a new target","torrent":{"xt":"urn:btih:42748999ccc1f210e1f9c35e1245284a2d97a2d4","amp;dn":"Fargo+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42748999ccc1f210e1f9c35e1245284a2d97a2d4","infoHashBuffer":{"type":"Buffer","data":[66,116,137,153,204,193,242,16,225,249,195,94,18,69,40,74,45,151,162,212]},"announce":[],"urlList":[]}}