{"title":"John Pilger - Palestine Is Still The Issue - 2002","uid":4707889,"size":545237275,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:42df14b6ae5246affc70da589498e3b1d1bae3b8&amp;dn=John+Pilger+-+Palestine+Is+Still+The+Issue+-+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"amgine2007","files":1,"time":1233878903,"description":"Twenty-five years ago, I made a film called Palestine Is Still The Issue. It was about a nation of people - the Palestinians - forced off their land and later subjected to a military occupation by Israel. An occupation condemned by the United Nations and almost every country in the world, including Britain.\n\nBut Israel is backed by a very powerful friend, the United States. So in 25 years, if we're to speak of the great injustice here, nothing has changed. What has changed is that the Palestinians have fought back.\n\nStateless and humiliated for so long, they've risen up against Israel's huge military machine, although they themselves have no arm, no tanks, no American planes and gun ships or missiles.\n\nSome have committed desperate acts of terror, like suicide bombing. But for Palestinians, the overriding, routine terror, day after day, has been the ruthless control of almost every aspect of their lives, as if they live in an open prison. This film is about the Palestinians and a group of courageous Israelis united in the oldest human struggle - to be free.\n\nBritish writer DH Lawrence once classified the passion for justice as the finest and noblest of all emotions. John Pilger's accurate and fair account of the conflict between Palestine and Israel is one of the finest examples of this passion. Pilger is now teaching at Cornell University and is the recipient of countless journalistic awards. A renowned veteran war reporter, he has covered some of the most war-torn regions of the world: Vietnam, Cambodia, East Timor, Afghanistan and many others. Only the most sullen opponents to his commitment to freedom and justice would deny him the status he enjoys as a first-class journalist.\n\n&quot;Palestine Is Still the Issue&quot; is a must-see for Americans, who are kept in the dark by the media and political elites by the real nature of the Israeli-Palestinian conflict. It is a conflict about land, which the documentary makes clear. The brutality of the Israeli Defence Forces (IDF) in dealing with the people it occupies--the Palestinians--is, indeed, uncomfortable to watch for people who wish to shrink from the truth, but the film is replete\n\nwith interviews with conscientious Israelis who oppose the Israeli occupation of Palestinian lands--including a traumatic interview with an Israeli father of a victim of a suicide bomber.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0383551/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0383551/&lt;/a&gt;","torrent":{"xt":"urn:btih:42df14b6ae5246affc70da589498e3b1d1bae3b8","amp;dn":"John+Pilger+-+Palestine+Is+Still+The+Issue+-+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42df14b6ae5246affc70da589498e3b1d1bae3b8","infoHashBuffer":{"type":"Buffer","data":[66,223,20,182,174,82,70,175,252,112,218,88,148,152,227,177,209,186,227,184]},"announce":[],"urlList":[]}}