{"title":"Simplified Diet Manual (11th Ed)(gnv64)","uid":7071813,"size":26827789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:430c7a1bccde73883f9b5ad452ecbc2c2d7e5534&amp;dn=Simplified+Diet+Manual+%2811th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1330702639,"description":"Simplified Diet Manual (11th Ed)\nEdited by Andrea K. Maher\nWiley-Blackwell | January 2012 | ISBN: 0813811961 | 296 pages | PDF | 25.5 mb &lt;a href=&quot;\nhttp://www.amazon.com/Simplified-Diet-Manual-Andrea-Maher/dp/0813811961&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Simplified-Diet-Manual-Andrea-Maher/dp/0813811961&lt;/a&gt;\n\nHospitals and long-term care facilities in every state and many foreign countries use the Simplified Diet Manual to assist them in planning nutritious, appealing, and cost-effective meals that are modified to meet the dietary requirements of individuals with special health needs. While reflecting the dynamic nature of the field of nutrition, the Eleventh Edition of the Simplified Diet Manual retains its basic purpose: providing consistency among diet terminology, in a simplified manner, for the prescription and interpretation of diets or nutrition plans. The concise, user-friendly format of this resource helps dietitians and foodservice managers succeed in their vital role in maintaining nutritional health and well-being of clients in long-term care facilities, hospitals, and outpatient service centers.\n\nRevisions and additions to the Eleventh Edition of the Simplified Diet Manual include:\n* Update of the Guidelines for Diet Planning based on Dietary Guidelines for Americans 2010\n* Inclusion of updated Study Guide Questions at the end of each chapter for training foodservice employees in health care facilities that are served by a registered dietitian or dietary consultant.\n* Inclusion of online patient education handouts that coordinate with selected therapeutic diets in the manual\n* Revision of FOOD FOR THE DAY tables using wider variety of culturally diverse foods\n* Addition of the Mechanical Soft and Pureed Diets\n* Addition of the Small Portion Diet\n* Revision of the Fat Restricted Diets\n* Addition of the DASH Diet\n* Revision of the Diets for Kidney and Liver Disease to include potassium and phosphorus food lists and a section on Guidelines for Liver Disease\n* Addition of the Kosher Diet\n* Inclusion of Choose Your Foods, Exchange Lists for Diabetes (2008, American Dietetic Association, American Diabetes Association)","torrent":{"xt":"urn:btih:430c7a1bccde73883f9b5ad452ecbc2c2d7e5534","amp;dn":"Simplified+Diet+Manual+%2811th+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"430c7a1bccde73883f9b5ad452ecbc2c2d7e5534","infoHashBuffer":{"type":"Buffer","data":[67,12,122,27,204,222,115,136,63,155,90,212,82,236,188,44,45,126,85,52]},"announce":[],"urlList":[]}}