{"title":"Weaponology Seasons 1-2 (Every Episode)","uid":4366360,"size":8134617093,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:431f05cef012cd38fed6a3f7c226e960c671f617&amp;dn=Weaponology+Seasons+1-2+%28Every+Episode%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"x_DontTreadOnMe_x","files":29,"time":1219910087,"description":"Full credit goes to 4n00bis for ripping the video, and the previous torrents......I simply put them together for people who want to download everything at once.\n\n~~~~~~~~~~~~~~~~\n***SEASON ONE***\n\nEpisode 1: Sniper Rifles\nFrom 18th-century German Jaeger rifles to the modern Barrett AS50, see how centuries of technological innovation have resulted in firearms that can kill at 2,000 yards. The history of bullets, guns, sights, actions, camouflage and tactics are all unravelled as Weaponology gets locked and loaded.\n\nEpisode 2: Body Armor\nFollow the history of the combatants last line of defense, from the armor od medieval knights to the latest revolutionary invention: Dragon Skin. Find out how a priest invented the first bullet-proof vest, and how a pizza boy came up with the concealable body armor.\n\nEpisode 3: Rapid Fire\nOne man, one weapon, lots of bullets. From the cumbersome but deadly Gatling Gun to the lightweight hand-held firepower of the modern battlefield. we trace the men and breakthroughs that gave birth to the most deadly family of infantry weapons.\n\nEpisode 4: Submarines\nCarrying nuclear missiles of unimaginable destructive power, torpedoes capable of wiping out entire fleets, and special forces for clandestine missions, today's subs are the ultimate marine warfare package. We trace the submarine's ancestry from the first submersibles to today's Virginia-Class attack submarines.\n\nEpisode 5: Vertical Take-Off\nWith cutting-edge science and awesome firepower, Vertical Take-Off aircraft are the most versatile and innovative weapons in modern warfare. Exploring the development of engine design, advanced avionics, target and survival systems, we show how helicopters and VTO are an essential component of air power on 21st -century battlefields.\n\nEpisode 6: Bomber\nFrom the first moment that man took to the skies, he realized the potential of using aircraft to assault the enemy from the air. In World War 1, pilots dropped bombs out of the cockpit by hand. Eight decades later, the bomber went intercontinental, supersonic, eluded radar and dropped bombs with precision accuracy. Built to carry the fight to the enemy, there's no hiding place from 21st Century bombers and their bombs.\n\nEpisode 7: Fighter\nStrap yourself in for the extraordinary history of fighter planes - the most versatile and terrifying weapons in modern warfare. Exploring the development of engine power, wings, maneuverability and ejection systems, see how fighter jets now rule the land and sky.\n\nEpisode 8: Artillery\nLong ago christened the &quot;King of Battle&quot;, heavy guns are always evolving to keep pace with warfare. From catapults to cannon, ballista to battleships, gunpowder to giant superguns, we chart the evolution and the sheer power of this mind-shattering dynasty of destruction.\n\nEpisode 9: Booby Traps\nDangerous and infinitely adaptable, traps are the hidden killers of the battlefield. For millennia they've maimed, killed and psychologically defeated the enemy, making the safe unsafe. We trace their ancestry through centuries of global conflicts and technological innovation to show you what's gone into today's latest and greatest traps.\n\nEpisode 10: Frags\nWhen a soldier is pinned down, sometimes he can only rely on the weapons he carries with him. He might be facing a tank, he might be pinned down by a machine gun nest, and he might take heat from planes and choppers. When that moment comes, hand grenades and RPG's become a soldier's best friend.\n\nEpisode 11: Fire Weapons\nFire is the oldest, most feared weapon known to man. Take a journey through time to see how ancient Greek Fire set seas alight, destroying naval fleets; how World War II incendiary bombs unleashed firestorms in enemy cities; why napalm became one of the lasting images of the Vietnam War; and how all of these weapons have been surpassed by the awesome destructive power of today's thermobaric bombs.\n\nEpisode 12: Armored Personnel Carriers\nThe modern battlefield is swept by lethal cyclones of fire and steel making them vast killing fields for unprotected infantry. We take you on a journey charting the development of some of the infantryman's best friends: dashing recon vehicles, armored personnel carriers, and bristling gun trucks to protect vital convoys. See how these vehicles slug it out with the enemy to keep the guys on the ground alive, informed and ready for action.\n\nEpisode 13: Tanks\nThe tank is the incarnation of the modern offensive spirit - a lethal combination of speed, protection, and terrifying destructive power. Come along as we reveal how the blazing forge of battle transformed the tank from the lumbering steel box of 1916 into today's swift and savage hunter. Follow the tank's family tree to discover why, after nearly 100 years, tanks are still the unstoppable cutting edge of a modern army.\n\n~~~~~~~~~~~~~~~~\n***SEASON TWO***\n\nEpisode 1: Navy SEALs\nMasters of stealth, lords of destruction: the U.S. Navy SEALs are the most versatile special operations force in the world. SEAL teams smash their enemies from land, sea and air using cutting-edge combat tactics and state-of-the-art equipment. Now Weaponology traces the SEALs' development from search-and-destroy missions in the jungles of Vietnam to hunting the Taliban in the highlands of Afghanistan.\n\nEpisode 2: U.S.M.C.\nThe United States Marine Corps is the ultimate combined arms force. This well-oiled military machine unites beach-assault vehicles, devastating air support and battle-hardened riflemen. Now Weaponology traces the U.S.M.C.'s development from its beginning as a group of shipboard warriors in the 18th century to the ultimate all arms force operating in Iraq today.\n\nEpisode 3: Waffen S.S.\nThe Waffen S.S. were Nazi Germany's ultimate warriors -- earning their brutal reputation in blood during World War II. Adolf Hitler's elite units destroyed their enemies with futuristic weapons systems backed up by an unrivaled fanaticism.  Weaponology takes you back through time to take a closer look at the men, machines and moments that shaped Hitler's henchmen.\n\nEpisode 4: U.S. Airborne\nThe United States Airborne are America's sky soldiers, hitting the combat zone from just 600 feet, striking their enemy hard and fast. Now, Weaponology invites you to take a closer look at the men, machines and moments that shaped this elite fighting unit.\n\nEpisode 5: Rangers\nThe Army Rangers are the hammer and anvil of U.S. military might. Men of steel, forged in the fire of every major conflict from the beaches of D-Day to the streets of Baghdad, the Rangers are the elite assault-and-ambush team of the U.S. Army. Weaponology shows viewers how the U.S. Army Rangers always ride the cutting edge of military technology to get the job done.\n\nEpisode 6: Green Berets\nShadow warriors, the Green Berets are lords of unconventional warfare. Their mission is to train and raise armies behind enemy lines. On this episode, Weaponology explores how the Green Berets rose out the ashes of World War II to fight the clandestine conflicts of the Cold War and the post-Sept. 11 world.\n\nEpisode 7: SAS\nWith a motto that reads &quot;Who Dares Wins,&quot; the SAS are at the cutting edge of global special forces operations. The SAS go in where it hurts to take out the trash using deep insertion behind enemy lines and have revolutionized the global war on terrorism.\n\nEpisode 8: Royal Marines\nWith a bulldog spirit, the royal marine commandos are a pup that loves to bite. They are all-terrain tsunami, military chameleons who attack the enemy amphibiously, in the mountains, skies and on land.\n\nEpisode 9: Extreme Warriors\nExtreme Warriors are trained to live and fight in the harshest environments known to man - exposed mountaintops, extreme altitude, sub-zero temperatures, snowstorms - these guys bring the pain in any terrain.\n\nEpisode 10: Combat Engineers\nCombat Engineers build with one hand, and destroy with the other. First onto the battlefield they have got the nuts, and bolts, to build bridges, blow up obstacles, diffuse landmines, take out bunkers and detect I.E.D's.\n\nEpisode 11: French Foreign Legion\nWeaponology looks at the genealogy of France's famous Foreign Legion. Which draws its ranks from other countries around the world.\n\nEpisode 12: Spetsnaz\nMembers of Russia's elite fighting force work in counter terrorist strike squads and special operations. Go behind the scenes of Russia's super soldiers and see why the world fears the word Spetsnaz!\n\nEpisode 13: Israeli Commandos\nWeaponology looks at the genealogy of Israel's Elite Commando Unit from the Israel Defense Forces which specialize in hostage rescue missions and pre-emptive strikes against terrorists.\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!\n\nQUICK UPDATE- Apologies to the peers getting disconnected; my lovely ISP (I'll give you a hint..its crap-tastic!) continues to add rst to the torrents, thus booting people off.  But don't worry, once enough peers climb on, my upload will scream along at 3-400KB/s, if not more.","torrent":{"xt":"urn:btih:431f05cef012cd38fed6a3f7c226e960c671f617","amp;dn":"Weaponology+Seasons+1-2+%28Every+Episode%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"431f05cef012cd38fed6a3f7c226e960c671f617","infoHashBuffer":{"type":"Buffer","data":[67,31,5,206,240,18,205,56,254,214,163,247,194,38,233,96,198,113,246,23]},"announce":[],"urlList":[]}}