{"title":"Wheeler Dealers Season 07 - All Episodes (Wikipedia Order)","uid":10051891,"size":3899045888,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:43aa8c425078c12fe9172f965c4e211bb843122b&amp;dn=Wheeler+Dealers+Season+07+-+All+Episodes+%28Wikipedia+Order%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"nicocane","files":10,"time":1398614893,"description":"Wheeler Dealers Season 07 - All Episodes (Wikipedia Order)\n\nI simply joined some torrents already available to create this one and put everything into order.\n\n\n1 \tJensen Interceptor III \t4 May 2010\n\nCut out rust and welded new steel in passenger foot well, replaced brake master cylinder and steering rack, leather interior cleaned and restored, wheels polished. \tCar was missing the air conditioning system, which was not reinstated due to cost. Restored car brought to Millbrook Proving Ground for its test drive. \t\n\n\n2 \tFord Sierra Sapphire RS Cosworth \t11 May 2010\n\nGearbox rebuilt, clutch replaced, valve stem oil seals &amp; guides replaced, seats, door cards and steering wheel replaced, Escort Cosworth alloy rims replaced with original units, front bumper repainted. \tAcquired through eBay. Restored car taken to a 1-mile drag strip to do a 0-60 acceleration contest. Mike scored 5.9 seconds while Edd did 6.4 seconds. \t\n\n\n3 \tVolkswagen Type 2 T2 \t18 May 2010\n\nFull body respray from white to metallic orange, 1641cc engine rebuild &amp; exhaust. New tailgate, driver door, Recaro leather seats (recycled from the Sierra Cosworth project), wheels, door cards and carpet. \tOriginally planned on Series 3 (which became the T3 Transporter project). Sold off-screen to an army major who was serving overseas. \t\n\n\n4 \tBMW 840Ci \t25 May 2010\n\nRepaired and resprayed front bumper and driver's side door, replaced cooling fan and recharged air conditioning, replaced automatic transmission cooler, installed new windscreen (supplied by seller), refurbished alloy wheels, bodywork polished. \tSold to a buyer from Ireland. \t\n\n\n5 \tTriumph Stag \t1 June 2010\n\nReplaced cam cover gasket, radiator with improved unit, differential gasket, hood and frame, front bumper and polished brightwork. \tAcquired through eBay. \t\n\n\n6 \tBond Bug 700ES \t12 October 2010\n\nGearbox and canopy, brake shoes and differential half shaft oil seals replaced. \tThe first three-wheeled car featured in the series. Restored for the Bond Bug 40th anniversary gathering at Woburn Abbey, featuring designer Tom Karen. Buyer offered Â£550 over the asking price. \t\n\n\n7 \tVolvo P1800 \t19 October 2010\n\nReplaced fuel gauge, fuel tank and sender, front shocks and springs, and engine rocker cover. Front crossmember repainted. Cylinder head valves updated with hardened units and twin carburettors rebuilt to run on unleaded petrol. \tMike owned one, and this was the type of car driven by Simon Templar in the 1960s television series The Saint. \t\n\n\n8 \tLand Rover 90 \t26 October 2010\n\nFitted aftermarket hi-lift camshaft, alloy wheels, steering wheel and seat bottoms, grill, bumper and decal, doors, rear windows and a full respray from blue to Gunmetal Gray. \tFarm vehicle turned into a Chelsea tractor. Previous owner swapped the original 2.5 litre turbo diesel motor with a Rover V8 engine. \t\n\n\n9 \tSubaru Impreza WRX \t2 November 2010\n\nPerformance air filter and exhaust added, ECU remapped to 243 bhp, clutch, brakes, calipers and alloy wheels uprated, bonnet stripes added \tFirst Japanese car featured since Series 4. Restored car tested on Rockingham Motor Speedway. \t\n\n\n10 \tLotus Elan S3 \t9 November 2010\n\nExhaust renewed in stainless steel, ball joints renewed, custom CV joint assemblies fitted, wheels refurbished and red/white respray done. \tRestored car tested at Gurston Down Motorsport Hillclimb. Mike beat Edd 46 seconds to 49 seconds. When Mike purchased it, the owner had the engine bored up to 1.7 litres, putting 150 hp. \t","torrent":{"xt":"urn:btih:43aa8c425078c12fe9172f965c4e211bb843122b","amp;dn":"Wheeler+Dealers+Season+07+-+All+Episodes+%28Wikipedia+Order%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43aa8c425078c12fe9172f965c4e211bb843122b","infoHashBuffer":{"type":"Buffer","data":[67,170,140,66,80,120,193,47,233,23,47,150,92,78,33,27,184,67,18,43]},"announce":[],"urlList":[]}}