{"title":"Vivir su Vida [Dvdrip][Spanish]","uid":6839367,"size":457168896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:44124e4c3b9fe3fb3eb1565751f36947ca7de9b2&amp;dn=Vivir+su+Vida+%5BDvdrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"virana","files":-1,"time":1322121887,"description":"VIVIR SU VIDA, Jean-Luc Godard \n\nLa historia consiste bÃƒÂ¡sicamente en una mujer llamada Nana (Anna Karina) que necesita dinero y para conseguirlo empieza a ejercer de prostituta.\nSiendo un film de Godard, estamos ante una pelÃƒÂ­cula en la que importa mÃƒÂ¡s el cÃƒÂ³mo se cuenta que lo que se cuenta.\n\n Si Al final de la escapada era rompedora en su forma, en Vivir su vida Godard vuelve a destrozar y a hacer pedazos las convenciones del cine, y mediante una serie de encuadres horribles y planos feÃƒÂ­simos nos cuenta una historia dedicada a las pelÃƒÂ­culas de serie B. Ã‚Â¿PodrÃƒÂ­amos imaginarnos una conversaciÃƒÂ³n articulada con los personajes de espaldas? Pues Godard en esta pelÃƒÂ­cula lo hace. Ã‚Â¿Y unos planos que capturan el cogote de los personajes desde un ÃƒÂ¡ngulo antiestÃƒÂ©tico? Pues Godard en esta pelÃƒÂ­cula lo hace. Ã‚Â¿Y unos movimientos de cÃƒÂ¡mara injustificados? Pues Godard en Vivir su vida mueve la cÃƒÂ¡mara cuando le da la gana y porque le da la gana. No obstante, hay que decir en beneficio del rey de la nueva ola, que salta a la vista que son errores de alguien que conoce las reglas del cine a la perfecciÃƒÂ³n. \n\nDecÃƒÂ­a Picasso que primero habÃƒÂ­a que conocer las normas para despuÃƒÂ©s saltÃƒÂ¡rselas. Pues bien, creo que en este sentido Godard es el Picasso del cine, puesto que ÃƒÂ©l sabe cÃƒÂ³mo se debe hacer una pelÃƒÂ­cula, quÃƒÂ© normas hay que seguir y quÃƒÂ© principios hay que aplicar, pero sencillamente no le da la gana aplicar ningÃƒÂºn principio y seguir ninguna norma, haciendo en cine el equivalente de un Picasso en pintura. Ã‚Â¿Para quÃƒÂ© vamos a respetar el raccord?\nUno de los mejores elementos del filme es, aparte de la triste mÃƒÂºsica que entra de vez en cuando, la preciosidad de Anna Karina, que fue, por cierto, mujer del propio Godard. Si para la obra representativa de la nouvelle-vague veÃƒÂ­amos a una bellÃƒÂ­sima Jean Seberg, en Vivir su vida Anna Karina es quien nos deja boquiabiertos al mirar a cÃƒÂ¡mara con esos ojazos. No asÃƒÂ­ con su gracia para bailar, por cierto.\n\nComo no podÃƒÂ­a ser de otra forma en un cinÃƒÂ©filo empedernido como es Godard, los guiÃƒÂ±os al sÃƒÂ©ptimo arte vuelven a estar presentes, y si en Al final de la escapada veÃƒÂ­amos una cartelera que anunciaba la Hiroshima mon amour de Alain Resnais, en Vivir su vida vemos, aparte de una proyecciÃƒÂ³n de La PasiÃƒÂ³n de Juana de Arco de Dreyer (con la que el personaje de Nana guarda cierto paralelismo), la Jules et Jim de su compaÃƒÂ±ero Truffaut. Pura nouvelle-vague.\n","torrent":{"xt":"urn:btih:44124e4c3b9fe3fb3eb1565751f36947ca7de9b2","amp;dn":"Vivir+su+Vida+%5BDvdrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44124e4c3b9fe3fb3eb1565751f36947ca7de9b2","infoHashBuffer":{"type":"Buffer","data":[68,18,78,76,59,159,227,251,62,177,86,87,81,243,105,71,202,125,233,178]},"announce":[],"urlList":[]}}