{"title":"Power Rangers Dino Thunder (Legacy Collection and Beyond)","uid":11748688,"size":14775215045,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:445e66b04d57d7c7c43cc8d81a9ec404773ed49e&amp;dn=Power+Rangers+Dino+Thunder+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"CeraKesh","files":40,"time":1426115846,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette2.wikia.nocookie.net/powerrangers/images/c/c0/PRDTpromo.jpg/revision/latest?cb=20130622170348[/img]\nPower Rangers Dino Thunder (often abbreviated as &quot;PRDT&quot;) is the tenth incarnation and twelfth season of Power Rangers, based on the 27th season of Super Sentai - BakuryÅ« Sentai Abaranger.\n\nA soccer player, computer expert, a musician, and a science teacher join forces to become Power Rangers and help save the Earth from mutant dinosauric beings that wish to eradicate all human life and return Earth to the age of the dinosaurs.\n\nIn this season, Tommy Oliver, of Mighty Morphin Power Rangers to Power Rangers Turbo fame, returns as a paleontology professor in Reefside, California. When he is assigned three detention students, Conner, Ethan, and Kira, they end up finding the Dino Gems, paving the way for them to become the Dino Thunder Power Rangers. Conner gains the power of the Tyrannozord, as well as superspeed; Ethan gains the power of the Tricerazord, as well as the ability to make his skin super-strong; Kira gains the power of the Pterazord, as well as a sonic scream. Tommy (known often as Dr. O) himself joins the team as the Black Dino Thunder Ranger, and they are also later joined by Trent Mercer as the White Dino Thunder Ranger. During the course of the series, the team adds to its arsenal Zords based on the Pachycephalosaurus, Parasaurolophus, Ankylosaurus, Dimetrodon, and Stegosaurus, the last of which combines with Trent's Zord, a Tupuxuara, to form the Dino Stegozord. Tommy pilots the Brachio Zord, the carrier for all the other Zords","torrent":{"xt":"urn:btih:445e66b04d57d7c7c43cc8d81a9ec404773ed49e","amp;dn":"Power+Rangers+Dino+Thunder+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"445e66b04d57d7c7c43cc8d81a9ec404773ed49e","infoHashBuffer":{"type":"Buffer","data":[68,94,102,176,77,87,215,199,196,60,200,216,26,158,196,4,119,62,212,158]},"announce":[],"urlList":[]}}