{"title":"Fairport Convention - Heyday - The BBC Sessions 1968-1969 [2002]","uid":11725350,"size":423064454,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:44e25413a00e939fafaacb99304965e3558d3f6b&amp;dn=Fairport+Convention+-+Heyday+-+The+BBC+Sessions+1968-1969+%5B2002%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":23,"time":1425021575,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#:Island #IMCD-290\nCountry: UK\nYear:2002\nGenre:folk/rock\nFormat:CD\n\n1\tClose the Door Lightly When You Go\t\n2\tDon't Know Where I Stand\t\n3\tSome Sweet Day\t\n4\tReno Nevada\t\n5\tSuzanne\t\n6\tIf It Feels Good You Know It Can't Be Wrong\t\n7\tI Still Miss Someone\t\n8\tBird on a Wire\t\n9\tGone, Gone, Gone\t\n10\tTried So Hard\t\n11\tShattering Live Experience\t\n12\tPercy's Song\t\n\nBonus Tracks:\n\n13\tYou Never Wanted Me\t\n14\tNottamun Town\t\n15\tFotheringay\t\n16\tSi Tu Dois Partir\t\n17\tCajun Woman\t\n18\tAutopsy\t\n19\tReynardine\t\n20\tTam Lin\n\nFairport Convention has long been British folk-rock with the emphasis on British and folk, but listeners most familiar with their revved-up interpretation of traditional English ballads (and like-minded originals) often forget that the band started out as the U.K.'s response to Jefferson Airplane. Heyday collects 12 performances (ten of them covers) recorded for the BBC during the early period when Sandy Denny and Ian Matthews were both singing for the group (and a bus accident had not yet taken the life of original drummer Martin Lamble). While most of the songs were written by noted American folk-rockers of the day, the Fairports put a very individual stamp on every selection here; if you don't think you ever need to hear another version of Leonard Cohen's &quot;Suzanne&quot; or Bob Dylan's &quot;Percy's Song,&quot; you might well change your mind after hearing Fairport work their magic with them, and their takes on Joni Mitchell's &quot;I Don't Know Where I Stand&quot; and Gene Clark's &quot;Tried So Hard&quot; actually improve on the very worthy originals. Fairport Convention approaches these songs with taste, skill, and subtle but potent fire, and Richard Thompson was already growing into one of the most remarkable guitarists in British rock (and if you're of the opinion that he doesn't know how to be funny, check out his goofy double entendre duet with Sandy, &quot;If It Feels Good, You Know It Can't Be Wrong&quot;). While Fairport Convention would create their most lasting work with Liege and Leif and Full House, Heyday offers delightful proof that this band's talents (and influences) took many different directions, and it captures one of the band's better lineups in superb form","torrent":{"xt":"urn:btih:44e25413a00e939fafaacb99304965e3558d3f6b","amp;dn":"Fairport+Convention+-+Heyday+-+The+BBC+Sessions+1968-1969+%5B2002%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44e25413a00e939fafaacb99304965e3558d3f6b","infoHashBuffer":{"type":"Buffer","data":[68,226,84,19,160,14,147,159,175,170,203,153,48,73,101,227,85,141,63,107]},"announce":[],"urlList":[]}}