{"title":"Jeffery Deaver ~ [Lincoln Rhyme 04] - The Stone Monkey *** Linco","uid":15291712,"size":440340629,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:450afd022b91c40ed7f707d8f96802b0ef49b721&amp;dn=Jeffery+Deaver+%7E+%5BLincoln+Rhyme+04%5D+-+The+Stone+Monkey+%2A%2A%2A+Linco&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":18,"time":1468426572,"description":"General Information\r\nBook............................The Stone Monkey\r\nSeries Name................Lincoln Rhyme\r\nSeries No.....................04\r\nAuthor.........................Jeffery Deaver\r\nNarrator.......................Adam Sims\r\nUnabridged..................Yes\r\nGenre..........................Psychological Crime Mystery Thriller\r\n\r\nFile Information\r\nSource.........................13 CDs\r\n# of MP3 files...............13\r\nTotal Runtime..............15 Hours 15 Minutes\r\nEncoder.......................Lame 3.97\r\nConverted to................64 Kb | CBR | 44,100 Hz | Mono\r\nTotal Size.....................419 MB\r\nConverted By...............OldScotsman\r\nDate Converted............20-February-2016\r\nID3 Tags......................Includes Image and all info shown on this page (Smart Phone Ready)\r\n\r\nIf you would like to try another Jeffery Deaver Audio Book I have uploaded, just click the title below.\r\nLincoln Rhyme 02 - The Coffin Dancer\r\nLincoln Rhyme 03 - The Empty Chair\r\nLincoln Rhyme 04 - The Stone Monkey\r\n\r\nABOUT THE BOOK\r\nLincoln and Amelia are recruited to track down a cargo ship carrying two-dozen illegal Chinese immigrants, as well as the notorious human smuggler and killer known as the Ghost. But when the capture goes disastrously wrong, Lincoln and Amelia find themselves in a race to stop the Ghost before he can track down and murder the two surviving families who havevanished deep into the labyrinthine world of New York City's Chinese community...\r\n\r\nimage\r\nABOUT THE AUTHOR\r\nJeffery Deaver was born outside of Chicago in 1950. His father was an advertising copywriter and his mother was a homemaker. Deaver worked as a magazine writer, then, to gain the background needed to become a legal correspondent for The New York Times or Wall Street Journal, he enrolled at Fordham Law School. In 1990 he started to write full time. Deaver has been nominated for six Edgar Awards from the Mystery Writers of America, an Anthony award, a Gumshoe Award, and is a three-time recipient of the Ellery Queen Reader's Award for Best Short Story of the Year. In 2001, he won the W.H. Smith Thumping Good Read Award for his Lincoln Rhyme novel The Empty Chair. In 2004, he was awarded the Crime Writers Association of Great Britain's Ian Fleming Steel Dagger Award for Garden Of Beasts and the Short Story Dagger for &quot;The Weekender.&quot;\r\n\r\nimage\r\nABOUT THE READER\r\nAdam Sims is an actor who trained at the London Academy of Music and Dramatic Art. His narration of Farley Mowat’s Never Cry Wolf won an AudioFile Earphones Award. His recordings for radio include Wenny Has Wings, The World According to Humphrey, and The Salamander Letter, all for the BBC. Film and theater credits include Band of Brothers on HBO; Lost in Space and The Madness of George III at the West Yorkshire Playhouse; Alice in Wonderland with the Royal Shakespeare Company; A Midsummer Night’s Dream at Regent’s Park; and Snake in Fridge at the Royal Exchange Theatre, for which he won the award for Best Actor at the Manchester Evening News Theatre Awards.\r\n\r\n\r\nAll the above information including the picture are inserted into the ID3 tags on the MP3 files.\r\n\r\nRemember, we have uploaded these books just for you because we wish to SHARE them. It is only right therefore, you SHARE them with others, and the only way you can do this, is to keep SEEDING. In other words, don't stop after you have finished the download. Check and make sure your torrent program is set to continue uploading even after the downloading has been completed. A ratio of 2.0 means you are giving back twice what you have received, the book won't die and all our efforts have not been wasted but 5.0 would be outstanding and shows you have really entered into the spirit of what we are about. WE DO OUR BIT AND YOU DO YOUR BIT, sounds fair, doesn't it. If you are new to this and don't understand, type a message at the bottom and if I can't help, I know someone who can. biggrin\r\n\r\nimage This Audiobook was converted and uploaded by OldScotsmanimage","torrent":{"xt":"urn:btih:450afd022b91c40ed7f707d8f96802b0ef49b721","amp;dn":"Jeffery+Deaver+%7E+%5BLincoln+Rhyme+04%5D+-+The+Stone+Monkey+%2A%2A%2A+Linco","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"450afd022b91c40ed7f707d8f96802b0ef49b721","infoHashBuffer":{"type":"Buffer","data":[69,10,253,2,43,145,196,14,215,247,7,216,249,104,2,176,239,73,183,33]},"announce":[],"urlList":[]}}