{"title":"American_Top_40_1986_August_16th","uid":10831695,"size":299041088,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:453f7d9a8ad0cd0f12b71ca0911977a73a635587&amp;dn=American_Top_40_1986_August_16th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1408629811,"description":"&quot;We're on our way to the number one song in the USA.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nWell, I must not have had money to buy &quot;D&quot; batteries for my boom  box in August of '86 because I do not remember half of these songs. But since Billy Joel is in the number 36 spot with &quot;Modern Woman&quot; it reminded me that I am supporting two movie files by other people from that summer: &quot;Ruthless People&quot; and &quot;Short Circuit.&quot; I previously promised to share back until a ratio of 30. Currently, &quot;Ruthless People&quot; is at 7.9 and &quot;Short Circuit&quot; is 5.9 (&quot;Buck Privates&quot; with Abbott and Costello, currently at 27.4 is about to be discharged but they've been in longer. TGIF and FM are at the bottom of these five). So if you want any of these, get your red-hot links in the notepad text and someday you can be the only OTHER person who has a copy.\n\nThis question, &quot;What singer holds the record for the most number one albums without ever having a number one single?&quot; comes in from two different people who have had neither of either. Casey says the record of seven #1 albums and no singles goes to this boy from Jersey.\n\nThe band Glass Tiger claims the number 31 spot with their single, &quot;Don't Forget Me (When I'm Gone)&quot; and Bryan Adams helps them be unforgettable by singing backup.\n\nNot to be outdone, Run-DMC debuts at number 30 with &quot;Walk This Way&quot; which includes Aerosmith leads: singer Steven Tyler &amp; guitarist Joe Perry.\n\nAlso, the group Journey (at number 17 with a song about &quot;Suzanne&quot;) have added a new bass player named Randy Jackson.\n\nA listener asks, &quot;What group has had the longest gap between top 40 hits?&quot; Casey lists the top three which includes a group in this week's countdown. They just made the record 18 years with the song at number 25.\n\n&quot;Yankee Rose&quot; by David Lee Roth is at number 23. The AT40 staff discovered there really is a rose named &quot;Yankee&quot; (well, Yankee Doodle). When they called Mr. Roth for comment, he apparently knew nothing about it.\n\nThe song at number 18 is &quot;Baby Love&quot; by a solo artist who goes by only one name: Regina. Casey lists some of the 43 other previous one named performers who sacrificed so Regina could have that right, including 29 men, 12 women, and 2 Muppets?\n\nThe song at number 15 is &quot;Friends And Lovers&quot; by Carl Anderson &amp; Gloria Loring. Casey says Loring is one of only four soap-opera stars ever to make the chart, including the one that hit number one in 1955 with, &quot;The Ballad Of Davy Crocket.&quot;\n\nThe solo woman with the most number one songs to her credit is not Madonna, but she is only one single behind the leader as of this week when her hit, &quot;Papa Don't Preach&quot; became the most popular song in the land.\n\nMeanwhile, back at number 36, Casey mentioned Billy Joel's 1972 live performance of &quot;Captain Jack.&quot; If you've never heard this track from the Piano Man album, likely the best recording of it appears on Joel's &quot;Songs In The Attic&quot; album, and I've included it as a RocketMan extra, as well as the album's liner notes (go look up &quot;liner notes&quot; in your World Book Encyclopedia). The tracks on this album were chosen because they sounded much better performed live by Joel's regular touring band than their counterparts recorded in the studio with session musicians. In the liner notes, Joel explains, &quot;Some songs have been excluded here because they pretty much sound the same. 'Piano Man' for instance, sounds pretty much the same live. However, 'Captain Jack' plays with much more power and conviction when a roaring Philadelphia audience sets off a kind of internal explosion and the adrenalin screams through our veins - when Doug, David and Russell push their amplifiers into ear-bleeding overdrive and Richie floors the organ pedal like the accelerator on a '64 Corvette - when I feel piano strings snapping and breaking under the fingers in my left hand and Liberty literally tries to smash his drums into shiny metal bits of shrapnel. When we play 'Captain Jack,' we are actually committing an act of pure brutality.&quot;\n\nEnjoy.\n\n40:    Two Of Hearts - Stacey Q\n39:    Dreamtime - Daryl Hall\n38:    Take It Easy - Andy Taylor        \n37:    Modern Woman (from &quot;Ruthless People&quot;) - Billy Joel     \n36:    Digging Your Scene - The Blow Monkeys     \n35:    Hanging On A Heart Attack - Device    \n34:    The Captain Of Her Heart - Double\n33:    Love Zone - Billy Ocean\n32:    Taken In - Mike &amp; The Mechanics\nLDD:   Just As I Am - Air Supply\n31:    Don't Forget Me (When I'm Gone) - Glass Tiger\n30:    Walk This Way - Run-D.M.C.\n29:    Opportunities (Let's Make Lots of Money) - Pet Shop Boys    \n28:    Rumbleseat - John Cougar Mellencamp\n27:    Man Sized Love (From &quot;Running Scared&quot;) - Klymaxx\n26:    Nasty - Janet Jackson\n25:    That Was Then, This Is Now - The Monkees\n24:    Stuck With You - Huey Lewis &amp; The News\n23:    Yankee Rose - David Lee Roth\n22:    One Step Closer To You - Gavin Christopher\nLDD:   Truly - Lionel Richie\n21:    Invisible Touch - Genesis\n20:    Words Get In The Way - Miami Sound Machine\n19:    All The Love In The World - The Outfield\n18:    Baby Love - Regina\n17:    Suzanne - Journey\n16:    Danger Zone - Kenny Loggins\n15:    Friends And Lovers - Carl Anderson &amp; Gloria Loring\n14:    You Should Be Mine (The Woo Woo Song) - Jeffrey Orborne    \n13:    Sledgehammer - Peter Gabriel\n12:    Sweet Freedom (Theme From &quot;Running Scared&quot;) - Michael McDonald\n11:    Love Touch (Theme From &quot;Legal Eagles&quot;) - Rod Stewart\n10:    The Edge Of Heaven - Wham!\n9:    Take My Breath Away (Love Theme from &quot;Top Gun&quot;) - Berlin\nLDD:  You Are So Beautiful - Joe Cocker\n8:    Rumors - Timex Social Club\n7:    Dancing On The Ceiling - Lionel Richie\n6:    Venus - Bananarama\n5:    We Don't Have To Take Our Clothes Off - Jermaine Stewart\n4:    Higher Love - Steve Winwood\n3:    Mad About You - Belinda Carlisle\n2:    Glory Of Love (Theme From &quot;Karate Kid Part II&quot;) - Peter Cetera\n1:    Papa Don't Preach - Madonna","torrent":{"xt":"urn:btih:453f7d9a8ad0cd0f12b71ca0911977a73a635587","amp;dn":"American_Top_40_1986_August_16th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"453f7d9a8ad0cd0f12b71ca0911977a73a635587","infoHashBuffer":{"type":"Buffer","data":[69,63,125,154,138,208,205,15,18,183,28,160,145,25,119,167,58,99,85,135]},"announce":[],"urlList":[]}}