{"title":"The Creative University - PDF","uid":9680689,"size":1267628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4540ab98ae5bb708f9028e2e0b5d471abe872f4f&amp;dn=The+Creative+University+-+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393665179,"description":"Pages: 200 pages\nPublished: May 17, 2013\nLanguage: English\nISBN-10: 9462092435\nISBN-13: 978-9462092433\nFormat: PDF\n\n\nThe concept of the &quot;Creative University&quot; signals that higher education stands at the center of the creative economy indicating the growing significance of intellectual capital and innovation for economic growth and cultural development. Increasingly economic activity is socialised through new media and depends on immaterial and digital goods. This immaterial economy includes new international labour markets that demand analytic skills, global competencies and an understanding of markets in tradeable knowledges. Delivery modes in education are being reshaped. Global cultures are spreading in the form of knowledge and research networks. Openness, networking, cross-border people movement, flows of ideas, capital and scholars are changing the conditions of imagining and producing creative work. The economic aspect of creativity refers to the production of new ideas, aesthetic forms, scholarship, original works of art and cultural products, as well as scientific inventions and technological innovations. It embraces both open source communication as well as commercial intellectual property. This collection explores these ideas as the basis for a new development agenda for universities.","torrent":{"xt":"urn:btih:4540ab98ae5bb708f9028e2e0b5d471abe872f4f","amp;dn":"The+Creative+University+-+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4540ab98ae5bb708f9028e2e0b5d471abe872f4f","infoHashBuffer":{"type":"Buffer","data":[69,64,171,152,174,91,183,8,249,2,142,46,11,93,71,26,190,135,47,79]},"announce":[],"urlList":[]}}