{"title":"The Exodus Decoded-(WTC-SWE)","uid":4598336,"size":734709976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47258beb553cdbb67365ad4cd58cc64cc522fa0b&amp;dn=The+Exodus+Decoded-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1230096180,"description":"\n                             THE EXODUS DECODED\n                            --------------------\n\n\nComplex yet utterly compelling, The Exodus Decoded is presented by movie director James Cameron (Titanic) but is the passion of Jewish-Canadian filmmaker Simcha Jacobovici. Jacobovici has extensively researched evidence that the Biblical account of the Exodus was real, and concludes that it actually took place in 1500 BCE (during the reign of pharaoh Ahmos I), historically known as the Hyksos Expulsion. The Hyksos people were a Semitic race about whom little is known. But their departure from Egypt, following a long enslavement, along with early writings and other physical evidence, make a strong case that they are the Hebrews of lore. \n\n\nJacobovici suggests the Exodus is also connected to the catastrophic eruption of the Santorini volcano, which ended the Minoan civilization and triggered a limnic eruption (a surge of carbon dioxide) in the Nile river delta. The latter would have killed the river's fish but likely chased out all the frogs, a phenomenon that could have been considered one of the famous plagues in the Exodus story. (Jacobovici makes a case for the other so-called plagues also being a consequence of the eruption.) Whatever one's opinion of The Exodus Decoded as a historical documentary, it is engrossing viewing, shot in some truly exotic locations, often under the highly suspicious eye of Egyptian authorities. Several moments--such as the revelation of a Hyksos slave's rock carving, pleading with God to be rescued--are astonishing.\n\nAt the very heart of Judaism, Christianity and Islam lies the story of the Exodus, an epic tale of plagues, miracles and revelations. But the truth behind these events has been obscured by faith and time--until now. After six years of unprecedented research, host Simcha Jacobovici and a team of renowned archeologists, Egyptologists, geologists, and theologians shed revelatory new light on the Exodus and the era's ruling Egyptian Dynasty. \n\nTheir new theory pushes events hundreds of years earlier than previously thought, allowing age-old stories to sparkle with new perspectives and startling historical import. Using elaborate, state-of-the-art CGI, THE EXODUS DECODED offers a stunning virtual account of stories like the birth of Moses, the ten plagues, and the parting of the Red Sea, revealing once and for all the difference between acts of Nature and the hand of God.\n\n\n\nDirector:James Cameron:\n-----------------------\n\n\n\n\nTitle: The Exodus Decoded\nYear:  2006\nFile Size: 700 MB \nFormat:AVI\nVideo Length: 01:33:10\nVideo Codec: XviD\nVideo Resolution: 592x320\nVIdeo Bitrate: 1026 kbit/s\nFPS:  29.970029\nAudio Bitrate: 116 kbit/s\nAudio Codec: MPEG Layer-3\nChannels:  2\nSubtitles: (N/A)\n\n  \n \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0847162/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0847162/&lt;/a&gt;\n\n\n\nENJOY:\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n(Please seed so others can enjoy)\n\n\n\n\nFor father information and pictures of all my torrents visit&quot; Suprbay Forum&quot; at   \n\nthis link: --------&gt; &lt;a href=&quot; http://suprbay.org/showthread.php?t=38774&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/showthread.php?t=38774&lt;/a&gt; \n\nUpdated directly before the torrent is uploaded.              \n\n\n\n*** This information is also avaible on the &quot;nfo&quot; file that comes with all my uploads.)***   \n\n\nTips:For better background view chance the &quot;Style Chooser&quot; at the bottom left \ncorner to &quot;graphite_x&quot;.\n\t\t\n\n\n\n\n\n***********************************\n*                                 *\n*   MERRY CHRISTMAS TO YOU ALL!!  *\n*                                 *\n***********************************\n\n","torrent":{"xt":"urn:btih:47258beb553cdbb67365ad4cd58cc64cc522fa0b","amp;dn":"The+Exodus+Decoded-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47258beb553cdbb67365ad4cd58cc64cc522fa0b","infoHashBuffer":{"type":"Buffer","data":[71,37,139,235,85,60,219,182,115,101,173,76,213,140,198,76,197,34,250,11]},"announce":[],"urlList":[]}}