{"title":"Maud Casey-The Man Who Walked Away","uid":15575633,"size":180066610,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:474aa8a444a3c3f7d0b991094d9b3bdf146df8b4&amp;dn=Maud+Casey-The+Man+Who+Walked+Away&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"twocows","files":28,"time":1471326259,"description":"The Man Who Walked Away\r\nby Maud Casey\r\n\r\n\r\n\r\nIn a trance-like state, Albert walks--from Bordeaux to Poitiers, from Chaumont to Macon, and farther afield to Turkey, Austria, Russia--all over Europe. When he walks, he is called a vagrant, a mad man. He is chased out of towns and villages, ridiculed and imprisoned. When the reverie of his walking ends, he's left wondering where he is, with no memory of how he got there. His past exists only in fleeting images.Loosely based on the case history of Albert Dadas, a psychiatric patient in the hospital of St. Andre in Bordeaux in the nineteenth century, &quot;The Man Who Walked&quot;&quot;Away&quot; imagines Albert's wanderings and the anguish that caused him to seek treatment with a doctor who would create a diagnosis for him, a narrative for his pain. In a time when mental health diagnosis is still as much art as science, Maud Casey takes us back to its tentative beginnings and offers us an intimate relationship between one doctor and his patient as, together, they attempt to reassemble a lost life. Through Albert she gives us a portrait of a man untethered from place and time who, in spite of himself, kept setting out, again and again, in search of wonder and astonishment","torrent":{"xt":"urn:btih:474aa8a444a3c3f7d0b991094d9b3bdf146df8b4","amp;dn":"Maud+Casey-The+Man+Who+Walked+Away","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"474aa8a444a3c3f7d0b991094d9b3bdf146df8b4","infoHashBuffer":{"type":"Buffer","data":[71,74,168,164,68,163,195,247,208,185,145,9,77,155,59,223,20,109,248,180]},"announce":[],"urlList":[]}}