{"title":"Mercedes-Benz Comand APS NAVI MAP 8.0 EUROPE","uid":4243245,"size":3106472092,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:4755bd6fb4f1c4ec17e41cde59fd5d6065dd0edc&amp;dn=Mercedes-Benz+Comand+APS+NAVI+MAP+8.0+EUROPE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"nicce12","files":1,"time":1213655141,"description":"Comand APS Map DVD Europe 2008 for E, SL, SLK, Maybach, S, CL, CLS\n\nThis is the latest V8.0 Map European DVD for E, CLS, MY2005 SL , new SLK, Maybach, S (09/03-&gt;09/05), CL (/09/03-&gt;09/06).\n\nNOTE 1: Works only for COMAND APS and not for the APS 50 system.\n\nNOTE 2: You might need to update the firmware of your Comand system to the latest version for the navigation software to work, I had to do that.\n\nInstructions:\n\n1. Burn the image with Nero, use a good quality DVD-R disk like Verbatim - crap disks might be a bit to thick and get stuck in the DVD drive and that is a bad thing (then you might have to pay an M-B garage to get your pirated map disk from the drive).\n\n2. Take the disk and go to your car.\n\n3. Insert your key and and start the COMAND system in NAV mode.\n\n4. Open the trunk, locate the DVD drive in the back, probably under some protective cover (use the manual in case you have trouble finding the unit).\n\n5. Eject the old map disk.\n\n6. Insert the burned disk and keep an eye on the Comand screen, it will say someting about loading Navigation Software and 2 progress block will start to fill, then nothing will seem to happen for a while...\n\n7a. If you have a recent version of the firmware, the Comand system will suddenly reset or shutoff.\n\n7b. If you have an old version of the firmware, an error message will say that the system could not load the software (if that is the case, eject the burned disk and insert your old map disk, get thee to an M-B garage and most likely you will have to pay to get the Nav firmware/Comand system upgrade).\n\n8. You should remove the key and wait 3 minutes...\n\n9. That was just 2 minutes...\n\n10. Insert key and try out the Nav system, make a few routes to check that it can read the disk correctly.\n\n11. Whish me a long and happy life by including me in your nightly praying/ritual to your favourite deity of choise.\n\nCheers, Nicce\n\nPs. I was to layz to convert the .nrg file to a .iso file, use Nero to burn or get some software to convert it to your most beloved image file format Ds.","torrent":{"xt":"urn:btih:4755bd6fb4f1c4ec17e41cde59fd5d6065dd0edc","amp;dn":"Mercedes-Benz+Comand+APS+NAVI+MAP+8.0+EUROPE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4755bd6fb4f1c4ec17e41cde59fd5d6065dd0edc","infoHashBuffer":{"type":"Buffer","data":[71,85,189,111,180,241,196,236,23,228,28,222,89,253,93,96,101,221,14,220]},"announce":[],"urlList":[]}}