{"title":"Michael Chabon Books (3) Epub,Mobi, KK","uid":7035210,"size":4006145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:480825a9ddcff5bef04bb57134ade3f5edb24527&amp;dn=Michael+Chabon+Books+%283%29+Epub%2CMobi%2C+KK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1329350191,"description":"Michael Chabon Books (3) Epub,Mobi\n\n\nThe Yiddish Policemen's Union (2006)\n by Michael Chabon\n This is the brilliantly original new novel from Michael Chabon, author of the Pulitzer prize-winning 'The Adventures of Kavalier and Klay'. What if, as Franklin Roosevelt once proposed, Alaska - and not Israel - had become the homeland for the Jews after World War II? In Michael Chabon's Yiddish-speaking 'Alyeska', Orthodox gangs in side-curls and knee breeches roam the streets of Sitka, where Detective Meyer Landsman discovers the corpse of a heroin-addled chess prodigy in the flophouse Meyer calls home. Marionette strings stretch back to the hands of charismatic Rebbe Gold, leader of a sect that seems to have drawn its mission statement from the Cosa Nostra - but behind Rebbe looms an even larger shadow! Despite sensible protests from Berko, his half-Tlingit, half-Jewish partner, Meyer is determined to unsnarl the meaning behind the murder. Even if that means surrendering his badge and his dignity to the chief of Sitka's homicide unit - also known as his fearsome ex-wife, Bina. &quot;The Yiddish Policemen's Union&quot; interweaves an homage to the stylish menace of 1940s noir with a bittersweet fable of identity, home and faith. It is a novel of colossal ambition and heart from one of the most important and beloved writers working today. \n\n\nThe Final Solution (2004)\n by Michael Chabon\n In the Pulitzer Prize-winning novel The Amazing Adventures of Kavalier and Clay, prose magician Michael Chabon conjured up the golden age of comic books -- intertwining history, legend, and storytelling verve. In The Final Solution, he has condensed his boundless vision to craft a short, suspenseful tale of compassion and wit that reimagines the classic nineteenth-century detective story.\n \nIn deep retirement in the English country-side, an eighty-nine-year-old man, vaguely recollected by locals as a once-famous detective, is more concerned with his beekeeping than with his fellow man. Into his life wanders Linus Steinman, nine years old and mute, who has escaped from Nazi Germany with his sole companion: an African gray parrot. What is the meaning of the mysterious strings of German numbers the bird spews out -- a top-secret SS code? The keys to a series of Swiss bank accounts perhaps? Or something more sinister? Is the solution to this last case -- the real explanation of the mysterious boy and his parrot -- beyond even the reach of the once-famed sleuth?\n \nSubtle revelations lead the reader to a wrenching resolution. This brilliant homage, which won the 2004 Aga Khan Prize for fiction, is the work of a master storyteller at the height of his powers.\n\n\nThe Mysteries of Pittsburgh (1988)\n by Michael Chabon\n A story of adolescence and of the dawning realization that childhood is a country you can never return to.","torrent":{"xt":"urn:btih:480825a9ddcff5bef04bb57134ade3f5edb24527","amp;dn":"Michael+Chabon+Books+%283%29+Epub%2CMobi%2C+KK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"480825a9ddcff5bef04bb57134ade3f5edb24527","infoHashBuffer":{"type":"Buffer","data":[72,8,37,169,221,207,245,190,240,75,181,113,52,173,227,245,237,178,69,39]},"announce":[],"urlList":[]}}