{"title":"Neil Young - A Letter Home [2014][EAC/FLAC]","uid":10427201,"size":151912956,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4815c29cb5a10ddb92c83189249df44d1c5a58d4&amp;dn=Neil+Young+-+A+Letter+Home+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":-1,"time":1403719884,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#:   Reprise / 9362-49399-9 \nCountry: USA\nYear:     May 12, 2014\nGenre: rock\nFormat: CD,Album\n\n\n\n\n\n01. A Letter Home Intro [0:02:17.16]\n02. Changes [0:03:56.23]\n03. Girl From The North Country [0:03:31.37]\n04. Needle Of Death [0:04:57.20]\n05. Early Morning Rain [0:04:26.20]\n06. Crazy [0:02:19.57]\n07. Reason To Believe [0:02:49.04]\n08. On The Road Again [0:02:22.44]\n09. If You Could Read My Mind [0:04:04.03]\n10. Since I Met You Baby [0:02:13.34]\n11. My Hometown [0:04:08.06]\n12. I Wonder If I Care As Much [0:02:31.45]\n\n\n\n\nDuring the 2014 promo campaign for Pono, his high-end digital audio device, Neil Young called his forthcoming album A Letter Home &quot;an art project,&quot; which is an appropriate term for this curious collection of covers from his contemporaries. It's not so much that the choice of songs is unusual -- nearly all of them are from the '60s and '70s, years when Young was also active, but a handful (&quot;Crazy,&quot; &quot;Since I Met You Baby,&quot; &quot;I Wonder If I Care as Much&quot;) date from the late '50s or early '60s -- but the recording method. Young headed down to Jack White's Third Man Records in Nashville where Jack installed a refurbished Voice-O-Graph booth, a device designed to allow a user to &quot;Make Your Own Record&quot; by cutting a song or message directly to vinyl. These contraptions were designed in 1947 and were once a common sight in arcades and fairs but they died away in the '70s, turning into an artifact of a weird old Americana beloved by both Young and White. Neil decided to use the Voice-O-Graph to record a full album, an experiment that's strictly about the method of recording, not the music itself. By design, the Voice-O-Graph allows for no overdubs -- it captures everything that happens in the booth and nothing more -- so the performances are intimate and sometimes rushed, qualities that are alternately enhanced and undercut by the thin, crackly recording. This aural affectation can be affecting -- in particular, his readings of Gordon Lightfoot's &quot;Early Morning Rain&quot; and &quot;If You Can Read My Mind&quot; are quite sweet, as is Bob Dylan's &quot;Girl from the North Country,&quot; while there's a genuine pang of pathos lying in Bert Jansch's &quot;Needle of Death&quot; -- but the trebly, wavy audio can also seem cacophonous, whether it's capturing Neil alone (Bruce Springsteen's &quot;My Hometown&quot;) or in tandem with White (a version of Willie Nelson's &quot;On the Road Again&quot; that always seems just on the verge of falling apart, which could be perceived as a compliment depending on your view). Usually, the flaws of A Letter Home can be pegged on the archaic recording technology -- only a couple of performances feel shambolic -- but Young is also having fun with what the Voice-O-Graph meant, opening the album with a wry, winding spoken letter to his departed mother and then addressing another missive to her later on the record. These words are simultaneously sentimental and impish, a wink to the audience that Young is in on the joke but also doesn't quite consider A Letter Home a joke. Sure, there's artifice and humor here, but there's also heart, and this blend of emotions is what makes A Letter Home one of Neil Young's quintessential, endearingly odd records.","torrent":{"xt":"urn:btih:4815c29cb5a10ddb92c83189249df44d1c5a58d4","amp;dn":"Neil+Young+-+A+Letter+Home+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4815c29cb5a10ddb92c83189249df44d1c5a58d4","infoHashBuffer":{"type":"Buffer","data":[72,21,194,156,181,161,13,219,146,200,49,137,36,157,244,77,28,90,88,212]},"announce":[],"urlList":[]}}