{"title":"VA - Blue Brazil Vol 2: Blue Note in a Latin Groove (1997) [Boss","uid":5966888,"size":139203682,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:48189872f36e9558942a663b22cf0445363fbaec&amp;dn=VA+-+Blue+Brazil+Vol+2%3A+Blue+Note+in+a+Latin+Groove+%281997%29+%5BBoss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":25,"time":1290133762,"description":"VA - Blue Brazil Vol 2: Blue Note in a Latin Groove\nRelease - 1997\nLabel: Blue Note Records \nAudio CD: November 22, 1997\nQuality: CBR 320 kbps\n\n... I grew to appreciate this one more. At first listen, you're thrown off because it's so much different from the first one, released a few years earlier in the mid 90s (this one's from 1997). Featuring Brazilian tracks with a pretty &quot;blue note&quot; type of vibe, but really loaded with funk &amp; some soul, this is a sampler of some pretty sweet clasics from the 60's and 70's (give or take a few). The funny thing is that today, I listened to a few albums I hadn't heard in a long time, so I felt like comparing Blue Brazil 2 with Beleza Tropical and Brazilian Beats. \n\nStarting out with Antonio &amp; Adolofo's &quot;Transamazonica&quot;, you know you're in for a pretty sweet, jazzed up trip. While you've got some original glory featured here, do note that in early 07', it was featured on Far Out's &quot;Brazilika&quot;, given a Daz-I-Que edit under the title &quot;Luizao&quot;. Wilson Simonal had a nice rendition of a Moacir Santos classic here with &quot;Nana&quot;. And how about Elza Soares' &quot;Deixa A Negar Gingar&quot;. Once married to the &quot;Joy of the People&quot; (Garrincha), Elza had so much power and spirit in her voice, and was so popular the same could also be said of her. Milton Banana which his distinct sound, light bossa and gentle sway chipped in with a few great songs too. Also check out the Quarteto Em Cy version of &quot;Tudo Que Voce Podia Ser&quot; - nice. It's been done quite a few times, maybe more notably recent versions by fusion legends Azymuth. But I think the real cool track here is the pretty emotional &quot;Libera Nos&quot; by Edu Lobo. The intro's so cool - in about 1996 or so, a French jazz group featuring Salome De Bahia named &quot;Reminiscence Quartet&quot; released a song titled &quot;Inspiration&quot; which featured the beginning of this song. Fitting, really considering Edu Lobo's sometimes overlooked musical genius. \n\nAll in all, this was a very good compilation of songs. Not all of the songs I liked now or back when I first got this several years ago (&quot;Also Sprach Zarathustra&quot; being one, even though it was a very influential song. But listening to it now, I can appreciate more of the songs. There's some real quality here and some really cool, funky and groovy old sounds and auras from Brasil from 30-40 years ago. The politics, the poverty, the crime and desparation but still the breath-taking beauty and art in such an amazing place. Check it out! And it placed a bit above Brazilian Beats (vol 1) and Beleza Tropical to me. Different concepts, but altogether different quality too. The good thing with this compilation is that they proudly trumpet that Brazilian music is much more than &quot;The Girl from Ipanema&quot; and they do a great job showing it. ~ bordersj2\n\nFantastic! And every bit as wonderful as volume one. Put together by the guys at Mr. Bongo, this volume 2 features more rare Brazilian gems from the Brazilian EMI/Odeon catalog. The selection is stunning, and filled with material that will make your jaw drop! Way beyond the usual bossa stuff, this one includes amazing fusion, cool grooy sounding stuff, and haunting cuts that are beyond description. Great stuff, and a fantastic introduction to the kind of grooves that have been driving the international Brazilian scene. ~ Dusty Groove\n\nVA - Blue Brazil Vol 2: Blue Note in a Latin Groove Tracks:\n01  Antonio Adolfo &amp; A Brazuca - Transamazonica 3:17\n02  Silvio Cezar &amp; Meirelles - Sambo Do Carioca 1:59\n03  Wilson Simonal - Nana 2:53\n04  Os Tres Morais - Freio Aerodinamico 2:41\n05  Quinteto Villa Lobos &amp; Luiz EÃƒÂ§a - Reflexos 2:21\n06  Elza Soares - Deixa A Nega Gingar 2:21\n07  Quarteto Em Cy - Tudo Que VocÃƒÂª Podia Ser 2:43\n08  Di Melo - A Vida Em Seus Metodos Diz Calma 3:46\n09  Luiz Gonzaga Jnr - Moleque 4:28\n10  Milton Banana - Ladeira Da Preguice 2:30\n11  Milton Banana - Procissao 2:13\n12  Elza Soares - Mas Que Nada 2:27\n13  Som TrÃƒÂªs - Jungle 3:27\n14  Edu Lobo - Vento Bravo 3:30\n15  Meirelles - Also Sprach Zarathustra 3:59\n16  Leny Andrade - Estamos Al 3:08\n17  Quarteto Novo - Ponteio 2:41\n18  Edu Lobo - Libera Nos 3:41\n","torrent":{"xt":"urn:btih:48189872f36e9558942a663b22cf0445363fbaec","amp;dn":"VA+-+Blue+Brazil+Vol+2%3A+Blue+Note+in+a+Latin+Groove+%281997%29+%5BBoss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48189872f36e9558942a663b22cf0445363fbaec","infoHashBuffer":{"type":"Buffer","data":[72,24,152,114,243,110,149,88,148,42,102,59,34,207,4,69,54,63,186,236]},"announce":[],"urlList":[]}}