{"title":"KRKsoft Directory Lister PRO v1.71","uid":12727118,"size":8694734,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:48699ce818fbd33b78620d6b087201ed074cc9ed&amp;dn=KRKsoft+Directory+Lister+PRO+v1.71&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZarkBit","files":2,"time":1447064263,"description":"KRKsoft Directory Lister PRO v1.71\r\n\r\nCreate file list with Directory Lister Pro\r\nCompatible with Windows 10 Compatible with Windows 8 Compatible with Windows 7\r\n\r\nDirectory Lister Pro allows you to list files or print folders, that is to create and then save, print or send via e-mail list of files from selected folders on hard disks, cd-roms, dvd-roms, floppys, USB storages and network shares. Listing can be in HTML, text, CSV format (for easy import to Excel) or stored directly to a database.\r\n\r\nDirectory Lister Pro is one of the best and at affordable price application from a wide category of directory printers.\r\nAdditional columns you can include when you print folder list\r\n\r\nWhen you print a file list, you can include standard file information like file name, extension, type, owner and attributes as well as executable file information (EXE, DLL, OCX) like file version, description, company.\r\nAlso multimedia properties (MP3, AVI, WAV, JPG, GIF, BMP) like track, title, artist, album, genre, video format, bits per pixel, frames per second, audio format, bits per channel can be listed.\r\nAnother set of columns you can print is for Microsoft Office files (DOC, XLS, PPT) so you can see document title, author, keywords etc. without opening these files one after another.\r\nFor each file and folder it is also possible to obtain its CRC32, MD5, SHA-1 and Whirlpool hash number so you can verify the file has not been modified.\r\nPrint files in folder - further customization\r\n\r\nExtensive number of options allows you to completely customize the visual look of the output. You can set sorting for files and folders so they are always displayed as you want. You can define column order so the most important columns are immediately visible. International display format options allows you to adjust the output for your local needs. Listing can contain links to actual files and directories so you are able to put the listing on a web page with clickable contents.\r\nHTML display style is fully customized - you can change background color, separate style for header, directory rows, odd and even file rows and for surrounding frame.\r\nYou can limit the files list by applying a filter for filename, date, size or attributes.\r\nDirectory Lister Pro can also be integrated into the context menu of Windows Explorer so you don't even need to open the application to generate listings.\r\nCommand line interface is supported for automated listings that can be run from Windows Task Scheduler.\r\nCheck folder size or find large folders\r\n\r\nWith Directory Lister Pro, you can also find out what is the given directory size, sort by folder size and check which folders occupy the most space on your disks. You can also find the largest files on your PC by using size filter options.\r\nSystem requirements\r\n\r\nDirectory Lister Pro works on Windows XP, Windows 2003, Windows 2008, Windows Vista, Windows 7, Windows 8 and Windows 10 operating systems. It works well on 32-bit and 64-bit Windows versions","torrent":{"xt":"urn:btih:48699ce818fbd33b78620d6b087201ed074cc9ed","amp;dn":"KRKsoft+Directory+Lister+PRO+v1.71","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48699ce818fbd33b78620d6b087201ed074cc9ed","infoHashBuffer":{"type":"Buffer","data":[72,105,156,232,24,251,211,59,120,98,13,107,8,114,1,237,7,76,201,237]},"announce":[],"urlList":[]}}