{"title":"The Easy Day Was Yesterday The Extreme Life of an SAS Soldier by","uid":9207886,"size":3217091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4898dcad698b7c8c064bdf37baabe560f0cb9cbf&amp;dn=The+Easy+Day+Was+Yesterday+The+Extreme+Life+of+an+SAS+Soldier+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"420weedman","files":1,"time":1384728829,"description":"From his cage in a putrid, overcrowded Indian gaol, Paul Jordan reflects on a life lived on the edge and curses the miscalculation that robbed him of his freedom. His childhood, marred by the loss of his father and brother, produces a young man hell bent on being the best of the best - an ambition he achieves by being selected to join the elite SAS. He survives the gut-wrenching training regime, deployment to the jungles of Asia and the horrors of genocide in Rwanda before leaving the army to embark on a career as a security adviser. His new life sees him pursuing criminals and gun-toting bandits in Papua New Guinea and the Solomons, protecting CNN newsmen as the US 7th Cavalry storms into Baghdad with the outbreak of the Iraq War, and facing death on a massive scale as he accompanies reporters into the devastated Indonesian town of Banda Ache, flattened by the Boxing Day tsunami. During his 24 days in an Indian gaol, Paul Jordan discovers that friendship and human dignity somehow survive the filth and deprivation. The Easy Day was Yesterday is fast paced, brutally honest, raw and laced with dark humour. The core of Paul Jordan's eventful life it is the ability of the human spirit to survive even in the direst adversity.\nGenre: Non Fiction , General","torrent":{"xt":"urn:btih:4898dcad698b7c8c064bdf37baabe560f0cb9cbf","amp;dn":"The+Easy+Day+Was+Yesterday+The+Extreme+Life+of+an+SAS+Soldier+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4898dcad698b7c8c064bdf37baabe560f0cb9cbf","infoHashBuffer":{"type":"Buffer","data":[72,152,220,173,105,139,124,140,6,75,223,55,186,171,229,96,240,203,156,191]},"announce":[],"urlList":[]}}