{"title":"Flying Free - Nigel Farage","uid":11706139,"size":707348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:489ef986b4b1805dd14211308adc07cd4f242e8c&amp;dn=Flying+Free+-+Nigel+Farage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424129638,"description":"In an age of colourless bureaucrats, Nigel Farage is a politician who is impossible to ignore, provoking controversy and admiration in equal measure. A fun-loving iconoclast whose motto is work hard and play harder&quot;, Farage's charismatic leadership and determination to battle the forces of anti-libertarianism have made him a Robin Hood figure to many, and propelled his party, UKIP, into a position of real power in the country. Never one for a quiet life, this paperback edition includes the story of Nigel's extraordinary escape from death in a plane crash on the eve of the 2010 general election (the light aircraft he was flying in got caught up in a UKIP banner it was towing and crashed shortly after take-off, badly injuring Farage and his pilot), his recovery and return to the leadership of UKIP in November 2010. Featuring sometimes hilarious and often terrifying encounters with a stellar supporting cast, including Tony Blair, Gordon Brown, Nicolas Sarkozy, Jose Manuel Barroso, and UKIP's short-lived, silver-gilt masco, Robert Kilroy-Silk - and told with Farage's customary wit and humour, Fighting Bull is a candid, colourful life story by a fascinating and controversial character. It also shows that one fearless, determined individual can still make a difference.\n\n\nAbout the Author:\n Nigel Farage is a founder member of the UK Independence Party, which was established in September 1993. He is Member of the European Parliament for the South East region and is the leader of the party","torrent":{"xt":"urn:btih:489ef986b4b1805dd14211308adc07cd4f242e8c","amp;dn":"Flying+Free+-+Nigel+Farage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"489ef986b4b1805dd14211308adc07cd4f242e8c","infoHashBuffer":{"type":"Buffer","data":[72,158,249,134,180,177,128,93,209,66,17,48,138,220,7,205,79,36,46,140]},"announce":[],"urlList":[]}}