{"title":"James Patterson - The Midnight Club (Retail)","uid":10322258,"size":504385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:493d043afd0bdadcf8046f9e2337d7c3c7ce9473&amp;dn=James+Patterson+-+The+Midnight+Club+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheRose88","files":1,"time":1402320418,"description":"James Patterson - The Midnight Club - Retail (epub)\n\n\nA stunningly brilliant psychopathic killer who has skillfully eluded the police from London to Paris to New York. A beautiful woman journalist suddenly in grave danger. An unorthodox New York detective whose motive for stopping the killer couldn't be more personal or emotional. Bestselling author James Patterson weaves a suspenseful tale of a powerful mobster who runs up against a very determined cop and his faithful crime fighters.\n\nThe charming, urbane, but megalomaniacal Alexandre St. Germain wanted nothing less than control of international organized crime. A sadistic psychotic as well, he shot and crippled New York policeman John Stefanovitch and then killed Stef's beloved wife. A few years later, during a purge of other New York crime lords, St. Germain is brutally murdered--or is he? Stef, confined to a wheelchair, joins with a rogue cop, whose brother was tortured and killed by St. Germain, and a beautiful journalist, with whom Stef falls in love, to unravel a complicated conspiracy. \n\nWritten before Patterson's popular Alex Cross novels, The Midnight Club lacks the suspense of those tales, building up slowly to a rather tame resolution. Like the Cross books, however, it includes many unpleasant elements, including a kidnapped child.","torrent":{"xt":"urn:btih:493d043afd0bdadcf8046f9e2337d7c3c7ce9473","amp;dn":"James+Patterson+-+The+Midnight+Club+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"493d043afd0bdadcf8046f9e2337d7c3c7ce9473","infoHashBuffer":{"type":"Buffer","data":[73,61,4,58,253,11,218,220,248,4,111,158,35,55,215,195,199,206,148,115]},"announce":[],"urlList":[]}}