{"title":"Marvel NOW! Week 13 (darkhomr) [TPB]","uid":8141374,"size":278021982,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:499d0ded7b1fdc3cbec47c36a7ded7c60592c312&amp;dn=Marvel+NOW%21+Week+13+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dadrkhomr","files":8,"time":1360819401,"description":"Starting the week of February 13, 2013 I will be posting the ongoing adventures in the Marvel NOW! storyline. Each week I will be posting the current week's Marvel NOW titles. \n\nIncluded in this pack will be all Marvel comics and  Marvel NOW comics.  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/aa12_zpsb500f1b7.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/fanf4_zpsee2ca2f7.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/uxm1_zps962b3309.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/waxm25_zps9d7ff219.jpg[/IMG]\n\nAvengers Arena #4 (CBR 2/13/2013)\n\nThe Runaways vs. Avengers Academy! \n\nAvengers Assemble #12 (CBR 2/13/2013)\n\nThe sins of Black Widow's past have resurfaced and threaten the safety of not only the Avengers, but also the entire world!!  Widow, Spider-Woman and Hawkeye must travel to Siberia to search for a missing girl with ties to an old Soviet assassination.  But the truth behind this girl's disappearance may be more than the Avengers are prepared to handle!Acclaimed writer Kelly Sue DeConnick teams with Pete Woods for an all new Avengers Assemble epic! \n\nCable And X-Force #4 (CBR 2/13/2013)\n\nWitness the massacre that makes Cable and X-Force criminals. They can't go back from here.\n\nFantastic Four #4 (CBR 2/13/2013)\n\nAn alien world, a thousand-year-old prophesy-is the Invisible Woman a long-awaited intergalactic messiah? \n\nScarlet Spider #14 (CBR 2/13/2013)\n\n'IN THE MIDST OF WOLVES' PART TWO OF THREE  The cast deals with the fallout from last issue's shocking fatality.  The Lobos are on the prowl as Aracely fights for her life. WHO IS THE OTHER? \n\nUncanny X-Men #1 (CBR 2/13/2013)\n\nThe true flagship book of the X-Men returns. In the wake of the Phoenix, the world has changed and is torn on exactly what Cyclops and his team of X-Men are--visionary revolutionaries or dangerous terrorists?  Whatever the truth, Cyclops, Emma Frost, Magneto, and Magik are out in the world gathering up new mutants and redefining the name UNCANNY X-MEN.\n\nWolverine and the X-Men #25 (CBR 2/13/2013)\n\nThe hottest new X-Book turns 25!  Jason Aaron (THOR:GOD OF THUNDER) and Eisner-Award winner Ramon Perez (Tale of Sand, JOHN CARTER) kick off the mega story that will define WXM in 2013!  Wolverine and the students go to the Savage Land!  Plus, Wolverine's brother Dog, from the super hit ORIGIN, returns and becomes the biggest new X-Villain in years. \n\n\n\n\n\n","torrent":{"xt":"urn:btih:499d0ded7b1fdc3cbec47c36a7ded7c60592c312","amp;dn":"Marvel+NOW%21+Week+13+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"499d0ded7b1fdc3cbec47c36a7ded7c60592c312","infoHashBuffer":{"type":"Buffer","data":[73,157,13,237,123,31,220,60,190,196,124,54,167,222,215,198,5,146,195,18]},"announce":[],"urlList":[]}}