{"title":"Invasion of Privacy - Perri O'Shaughnessy [iDeusEx]","uid":8573008,"size":978576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49c2d13a320dc8493ccc1239c263ebacf18bee25&amp;dn=Invasion+of+Privacy+-+Perri+O%27Shaughnessy+%5BiDeusEx%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"iDeusEx","files":-1,"time":1371208311,"description":"Invasion of Privacy  \nPerri O'Shaughnessy (Author)\n\n\n\nTwelve years ago, a young girl disappeared.  Now a filmmaker has made a movie about it.  The girl's parents call it invasion of privacy.  A woman lawyer calls it murder.\n\nThe bloodstains on the courtroom floor belong to attorney Nina Reilly.  Months earlier she'd been shot during a heated murder trial.  She should have died that day.  Instead, Nina has returned to the same Lake Tahoe court.  Her only concession to her lingering fear is to give up criminal law.  She figures an invasion of privacy lawsuit is a nice, safe civil action that will help her support her young son and pay the bills for her one-woman law office.  She figures wrong.\n\nNina's client is Terry London, a filmmaker whose documentary about a missing girl is raising disturbing questions.  The girl's distraught parents believe the film invades their privacy.  But Terry's brutal murder changes everything. Breaking her promise to herself, Nina decides to defend Terry's accused murderer, a man she'd known years before and hoped never to see again. Suddenly the secrets of Nina's past are beginning to surface in a murder case that gets more dangerous every day.  The evidence against her client is shocking and ironclad--a video of Terry's dying words.  The only chance Nina has to save the man may be illegal.  And if it fails, Nina may lose the case, her practice...and even her life.","torrent":{"xt":"urn:btih:49c2d13a320dc8493ccc1239c263ebacf18bee25","amp;dn":"Invasion+of+Privacy+-+Perri+O%27Shaughnessy+%5BiDeusEx%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49c2d13a320dc8493ccc1239c263ebacf18bee25","infoHashBuffer":{"type":"Buffer","data":[73,194,209,58,50,13,200,73,60,204,18,57,194,99,235,172,241,139,238,37]},"announce":[],"urlList":[]}}