{"title":"The British Empire and the Ravaging of India During World War II","uid":9773134,"size":184155264,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b0ba79788577d31c0c17906663e6dfdefa5369d&amp;dn=The+British+Empire+and+the+Ravaging+of+India+During+World+War+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sidmal","files":-1,"time":1394985934,"description":"\nChurchill's Secret War: The British Empire and the Ravaging of India During World War II (Audiobook) By Madhusree Mukarjee, read by James Adams\n Unabridged edition 2010 | 12 hours and 47 minutes | ISBN: n/a , ASIN: B0044Z4CW4 | MP3 32 kbps | 184 MB\n\n\n\n\n In the tradition of The Rape of Nanking and A Problem from Hell, this account will change the way we think of Churchill and World War II. \n\n In 1943 Winston Churchill and the British Empire needed millions of Indian troops, all of India's industrial output, and tons of Indian grain to support the Allied war effort. Such massive contributions were certain to trigger famine in India. Because Churchill believed that the fate of the British Empire hung in the balance, he proceeded, sacrificing millions of Indian lives in order to preserve what he held most dear. The result: the Bengal Famine of 1943-44, in which millions of villagers starved to death. \n\n Relying on extensive archival research and first-hand interviews, Mukerjee weaves a riveting narrative of Churchill's decisions to ratchet up the demands on India as the war unfolded and to ignore the corpses piling up in the Bengali countryside. The hypocrisy, racism, and extreme economic conditions of two centuries of British colonial policy finally built to a head, leading Indians to fight for their independence in 1947. \n\n Few Americans know that World War II was won on the backs of these starving peasants; Mukerjee shows us a side of World War II that we have been blind to. We know what Hitler did to the Jews, what the Japanese did to the Chinese, what Stalin did to his own people. This story has largely been neglected, until now. \n\n","torrent":{"xt":"urn:btih:4b0ba79788577d31c0c17906663e6dfdefa5369d","amp;dn":"The+British+Empire+and+the+Ravaging+of+India+During+World+War+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0ba79788577d31c0c17906663e6dfdefa5369d","infoHashBuffer":{"type":"Buffer","data":[75,11,167,151,136,87,125,49,192,193,121,6,102,62,109,253,239,165,54,157]},"announce":[],"urlList":[]}}