{"title":"BISEX movie of BI BACK Mountain","uid":4205907,"size":702154983,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4b8690254d8bdf89b35745da404d815168a85932&amp;dn=BISEX+movie+of+BI+BACK+Mountain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"spybot222","files":1,"time":1211801698,"description":"\\&quot;Bi-Back Moutain\\&quot; does things a little differently. Here, the sexual tension between two straight guys (Dean Campbell and Tommy Blade) takes place in the military. Then they go to Bi-Back Mountain, only they\\&amp;#039;ve brought the wives along.\n\nThe first full sex scene involves two straight couples in the same room, trying to outdo each other. Dean Campbell nails his wife Shy Love (including some major deep throat), while Tommy Blade boinks T.J. Hart. Dean looks quite at home, but Tommy clearly wishes he could trade places with Shy - the best part of this scene is his longing eyes wandering over to Dean.\n\nThe next scene is just Shy and T.J. out on the porch, enjoying a full lesbian scene, complete with dildo play. The third scene is where the full 9-person cast appears, separating themselves into three MMF threesomes. It\\&amp;#039;s never a full-blown orgy, but the guys all get together to come on Tommy.\n\nThe movie ends with Dean and Tommy coming to terms with their relationship, which means Dean tops Tommy. Pretty good bi movie, one of several knock-offs of \\&quot;Brokeback\\&quot; to come out in the last year. Some will consider it too heavy on the straight side.","torrent":{"xt":"urn:btih:4b8690254d8bdf89b35745da404d815168a85932","amp;dn":"BISEX+movie+of+BI+BACK+Mountain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b8690254d8bdf89b35745da404d815168a85932","infoHashBuffer":{"type":"Buffer","data":[75,134,144,37,77,139,223,137,179,87,69,218,64,77,129,81,104,168,89,50]},"announce":[],"urlList":[]}}