{"title":"free energy plans to make a time machine and propel a UFO (the r","uid":4206151,"size":914256,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:4ba13cc0344f298e6d370830162520a78ea26e0d&amp;dn=free+energy+plans+to+make+a+time+machine+and+propel+a+UFO+%28the+r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"creatorbot","files":1,"time":1211815646,"description":"Free energy with no moving parts. The device needs to be tuned to the note of &quot;a&quot;. To do this use the 5/3 ratio for it&amp;#039;s size such as 15&quot;x9&quot;x9&quot; or 5&amp;#039;x3&amp;#039;x3&amp;#039; or any other 5/3 ratio size. The device needs to be zapped with a neon sign transformer to magnetize it. Do not put it on the ground and keep it shorted out when not in use. The device works on the principle of piezoelectricity and compression. When silicon dioxide is compressed the oxygen atoms will become deficient in electrons and thus all free electrons will fall into it. You may have to soak the stones in water before assembly so they absorb oxygen. Beware of lightning bolts. Do not touch the device, it is a capacitor and can discharge and kill you. USE EXTREME CAUTION YOU ARE MESSING WITH HIGH VOLTAGE&gt; you are building it at your own risk and I will assume no responsibility for your injury or death. BE CAREFUL!\nYou are building a musical instrument and it has to be in tune so it vibrates to the musical note of &quot;a&quot;. There are no moving parts so it will never break down.\nYou can build it with most metals, however gold is preferred if you want it to last because gold will never corrode from oxygen. The stones you use must have a high quartz content or it will not work. If you make it powerful enough you will stop time around you, however.. your mind will not remember or comprehend any time travel experience that you encounter because no time will have passed so there is nothing to remember. \n","torrent":{"xt":"urn:btih:4ba13cc0344f298e6d370830162520a78ea26e0d","amp;dn":"free+energy+plans+to+make+a+time+machine+and+propel+a+UFO+%28the+r","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ba13cc0344f298e6d370830162520a78ea26e0d","infoHashBuffer":{"type":"Buffer","data":[75,161,60,192,52,79,41,142,109,55,8,48,22,37,32,167,142,162,110,13]},"announce":[],"urlList":[]}}