{"title":"Seeds - Ecology, Biogeography, and, Evolution of Dormancy and Ge","uid":9888334,"size":64685584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bf42f472a8e79b24b9bdce964c595ffc2cbd798&amp;dn=Seeds+-+Ecology%2C+Biogeography%2C+and%2C+Evolution+of+Dormancy+and+Ge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1396609772,"description":"Seeds - Ecology, Biogeography, and, Evolution of Dormancy and Germination (2nd Ed)\nby Carol C. Baskin and Jerry M. Baskin\nAcademic Press | March 2014 | ISBN-10: 0124166776 | PDF | 1600 pages | 61.6 mb\n\nThe new edition of Seeds contains new information on many topics discussed in the first edition, such as fruit/seed heteromorphism, breaking of physical dormancy and effects of inbreeding depression on germination. New topics have been added to each chapter, including dichotomous keys to types of seeds and kinds of dormancy; a hierarchical dormancy classification system; role of seed banks in restoration of plant communities; and seed germination in relation to parental effects, pollen competition, local adaption, climate change and karrikinolide in smoke from burning plants.\n\nThe database for the world biogeography of seed dormancy has been expanded from 3,580 to about 13,600 species. New insights are presented on seed dormancy and germination ecology of species with specialized life cycles or habitat requirements such as orchids, parasitic, aquatics and halophytes. Information from various fields of science has been combined with seed dormancy data to increase our understanding of the evolutionary/phylogenetic origins and relationships of the various kinds of seed dormancy (and nondormancy) and the conditions under which each may have evolved. This comprehensive synthesis of information on the ecology, biogeography and evolution of seeds provides a thorough overview of whole-seed biology that will facilitate and help focus research efforts.\n\n-    Most wide-ranging and thorough account of whole-seed dormancy available\n-    Contains information on dormancy and germination of more than 14,000 species from all the continents- even the two angiosperm species native to the Antarctica continent\n-    Includes a taxonomic index so researchers can quickly find information on their study organism(s) and\n-    Provides a dichotomous key for the kinds of seed dormancy\n-    Topics range from fossil evidence of seed dormancy to molecular biology of seed dormancy\n-    Much attention is given to the evolution of kinds of seed dormancy\n-    Includes chapters on the basics of how to do seed dormancy studies; on special groups of plants, for example orchids, parasites, aquatics, halophytes; and one chapter devoted to soil seed banks\n-    Contains a revised, up-dated classification scheme of seed dormancy, including a formula for each kind of dormancy\n-    Detailed attention is given to physiological dormancy, the most common kind of dormancy on earth","torrent":{"xt":"urn:btih:4bf42f472a8e79b24b9bdce964c595ffc2cbd798","amp;dn":"Seeds+-+Ecology%2C+Biogeography%2C+and%2C+Evolution+of+Dormancy+and+Ge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bf42f472a8e79b24b9bdce964c595ffc2cbd798","infoHashBuffer":{"type":"Buffer","data":[75,244,47,71,42,142,121,178,75,155,220,233,100,197,149,255,194,203,215,152]},"announce":[],"urlList":[]}}