{"title":"Amores Perros AKA Loves a Bitch 2000 DD2.0 Spanish NL subs Retai","uid":6308927,"size":4681990708,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4c07ee770da54a3d49262221e76f50970767e4ca&amp;dn=Amores+Perros+AKA+Loves+a+Bitch+2000+DD2.0+Spanish+NL+subs+Retai&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Saggin","files":-1,"time":1302460098,"description":"Amores Perros AKA Loves a Bitch 2000 DD2.0  NL subs Retail\n\n\n\nNederlands:       \nMexico\nMisdaad / Drama\n153 minuten\n\nmet Emilio EchevarrÃƒÂ­a, Goya Toledo en Gael GarciÃƒÂ¡ Bernal\n\nGemiddelde:\nMoviemeter: 3,99\nIMDB: 8.2/10\n\nDeze film staat op nummer 49 in de films top 250.\n\n\nDeze neo-noir film van debuterend regisseur Alejandro GonzÃƒÂ¡lez IÃƒÂ±ÃƒÂ¡rritu, won de BAFTA Award voor Beste film niet in de Engels Taal en werd genomineerd voor de Oscar voor Beste Buitenlandse Film.\n\nSamenvatting\nAmores Perros vertelt het verhaal van 3 mensen in Mexico City. In het eerste verhaal wordt Octavio verliefd op zijn schoonzus Suzanna en wil een nieuw leven met haar beginnen. Om aan geld te komen geeft hij zijn hond Cofi aan een man die hondengevechten organiseert. Daniel heeft zijn gezin verlaten om in te trekken bij de beeldschone Valeria. Kort daarna raakt ze verminkt door een auto-ongeluk. Dan is er nog El Chivo, een huurmoordenaar, die zijn dochter zoekt die hij jaren niet meer gezien heeft. El Chivo volgt een prooi en is dan getuige van een auto ongeluk waarbij Octavio en Valeria betrokken zijn.\n\nRecensie\nHet mooie van Amores Perros is dat we als kijker een ongeval van 3 totaal verschillende kanten te zien krijgen. Voor de 3 verschillenden mensen uit totaal verschillende sociale klassen heeft het ongeluk een eigen betekenis en andere gevolgen. Het ongeval is enkel het punt dat de paden van hun levens laat kruisen. Naast het ongeluk staat ook het overlevingsinstinct van zowel honden als mensen centraal in deze produktie. Een apart gegeven, maar mede daardoor wel een goede film van de hier debuterende regisseur Alejandro. Andere zaken die de film tot een meesterwerk maken zijn de goede acteerprestaties, de realistische sfeer en het hoge tempo. Dit tempo neemt op een gegeven moment wel wat in snelheid af, maar het geheel blijft snel, krachtig en bovendien boeiend!\n\nVerhaal\nAmores perros is een drieluik dat samengehouden wordt door een auto-ongeluk. De veroorzaker van de aanrijding is Octavio. Hij woont in bij zijn broer en probeert door middel van hondengevechten aan geld te komen om zijn schoonzus van haar agressieve echtgenoot af te helpen. Slachtoffer Valeria, hoofdpersoon in het tweede deel van de film, is een succesvol fotomodel maar verliest een been door het ongeluk, waardoor zij in een depressie raakt. Zwerver El chivo is getuige van de crash. Hij heeft zich na 20 jaar gevangenschap door vrouw en kind verlaten teruggetrokken uit de samenleving en bekommert zich alleen nog om zijn honden. Om aan geld te komen zet hij zich in als huurmoordenaar. De trouwe viervoeter verbindt deze zeer verschillende mensen in hun zoektocht naar geluk. \n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1959&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1959&lt;/a&gt;\n\nEnglish\nThree interconnected stories about the different strata of life in Mexico City all resolve with a fatal car accident. Octavio is trying to raise enough money to run away with his sister-in-law, and decides to enter his dog Cofi into the world of dogfighting. After a dogfight goes bad, Octavio flees in his car, running a red light and causing the accident. Daniel and Valeria's new-found bliss is prematurely ended when she loses her leg in the accident. El Chivo is a homeless man who cares for stray dogs and is there to witness the collision.   \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0245712&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0245712&lt;/a&gt;\n\n\nSpotinformatie\n\nCategorie      : Beeld \nFormaat        : DVD5 ISO 9660 \nAudio          : Spanish DD2.0\nBron           : Retail\nOndertitels    : NL\nExtra's        : No\nMenu           : No\nGenre          : Misdaad/Drama\nCover          : Ja \n \nTBS","torrent":{"xt":"urn:btih:4c07ee770da54a3d49262221e76f50970767e4ca","amp;dn":"Amores+Perros+AKA+Loves+a+Bitch+2000+DD2.0+Spanish+NL+subs+Retai","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c07ee770da54a3d49262221e76f50970767e4ca","infoHashBuffer":{"type":"Buffer","data":[76,7,238,119,13,165,74,61,73,38,34,33,231,111,80,151,7,103,228,202]},"announce":[],"urlList":[]}}