{"title":"K.T.Lewandowski -Diablu Ogarek-2-Kolumna Zygmunta [  ]","uid":14122286,"size":418903386,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4c17ecd35b7ebe57bb527b569b9a9b8debff06e1&amp;dn=K.T.Lewandowski+-Diablu+Ogarek-2-Kolumna+Zygmunta+%5BMP3%4096%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"everdarksoul","files":28,"time":1459474591,"description":"Audiobook PL - 24 części /   \r\nrozmiar: 399 MB / czas: 09:39:58\r\nczyta: Roch Siemianowski\r\n\r\nDalsze przygody Stanisława Jakuba Lawendowskiego herbu Paprzyca - nieustępliwego szlachcica-zabijaki, którego poznaliśmy w pierwszej części cyklu - &quot;Czarna Wierzba&quot;. Wstawka dodatkowo zawiera plik torrent do pobrania poprzedniej części w audio- oraz trzech części w e-book (EPUB+MOBI).\r\nStanisław Jakub Lawendowski herbu Paprzyca wyrusza do Warszawy, gdzie zaciąga się do Straży Marszałkowskiej. Tropiąc osoby odpowiedzialne za niedawne tragiczne wypadki w Liwie, wplątuje się w magnackie porachunki i odkrywa kulisy czarnoksięskich knowań. Kiedy okazuje się, że w spór między władzą świecką a duchowną wmieszały się moce nie z tego świata, sytuacja wymyka się spod kontroli obu stronom konfliktu...\r\n\r\nWarszawskie Krakowskie Przedmieście, za dnia zdawało się być oranżerią pełną pstrokatych motyli, kwiatów i powabnych łątek o wysmukłych kibiciach. Natomiast po zmroku przechodziło iście wilkołaczą przemianę i zaczynały się tutaj dziać łotrzykowskie fenomeny. Tu najchętniej załatwiano wszelkie tajne porachunki, nawet nie bacząc na świętość miejsca - w kościołach miejscowych - które też okradano regularnie...\r\nMłody pisarz do szaleństwa zakochany w pięknej dwórce, śledząc najnowsze plotki z królewskiego dworu, wpada na trop intrygi, w którą zamieszane są najważniejsze postaci ówczesnej Rzeczypospolitej. Rozwikłania zagadki noszącej znamiona czarnoksięskich praktyk podejmuje się - z osobistych powodów - Stanisław Jakub Lawendowski herbu Paprzyca, obecnie namiestnik warszawskiej Straży Marszałkowskiej. Pomagają mu zarówno młodzi zakochani, jak i tajemnicza żydowska wiedźma. Rezultaty śledztwa szybko przekraczają najśmielsze oczekiwania, a zaangażowanym w nie bohaterom zaczyna grozić śmiertelne niebezpieczeństwo...\r\nAutor odkurzył stare warszawskie legendy, z przewrotnym poczuciem humoru opisując kulisy wystawienia kolumny króla Zygmunta. Barwny portret siedemnastowiecznej stolicy, wyraziste postaci i nieprzewidywalna intryga na najwyższych szczeblach władzy w Rzeczpospolitej Obojga Narodów składają się na diabelnie interesującą powieść!","torrent":{"xt":"urn:btih:4c17ecd35b7ebe57bb527b569b9a9b8debff06e1","amp;dn":"K.T.Lewandowski+-Diablu+Ogarek-2-Kolumna+Zygmunta+%5BMP3%4096%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c17ecd35b7ebe57bb527b569b9a9b8debff06e1","infoHashBuffer":{"type":"Buffer","data":[76,23,236,211,91,126,190,87,187,82,123,86,155,154,155,141,235,255,6,225]},"announce":[],"urlList":[]}}