{"title":"Peter Gabriel - Biko (Live at Blossom Music Centre) - Vinyl Rip","uid":7198231,"size":90422501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4c3b879332ad5cafd7b820d1c522e20c240b2f50&amp;dn=Peter+Gabriel+-+Biko+%28Live+at+Blossom+Music+Centre%29+-+Vinyl+Rip+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":6,"time":1334850351,"description":"Peter Gabriel - Biko (Live) - Vinyl Rip - Flac\n\nVinyl details:\n\nLabel: Virgin PGS 612\nCountry: UK\nType: Vinyl 12 inch (reissue)\nReleased: Nov 1987\n\n\nTracks:\n\nSide 1 - Biko (6.17)\n\nSide 2 - No More Apartheid (7.29)\n\n\nFormat: Flac\nSize: 86MB\n\n\nVinyl ripped at: 16 bit 44,100 Hz\n\n\nNotes:\n\nRecorded live at The Blossom Music Centre (Cleveland, 27th July 1987)\n\n\nHistory:\n\nOn the 18th of August, 1977, Biko was arrested at a police roadblock under the Terrorism Act No 83 of 1967 and interrogated by officers of the Port Elizabeth security police including Harold Snyman and Gideon Nieuwoudt. This interrogation took place in the Police Room 619. The interrogation lasted twenty-two hours and included torture and beatings resulting in a coma. He suffered a major head injury while in police custody, and was chained to a window grille for a day.\n\nOn 11 September 1977, police loaded him in the back of a Land Rover, naked and restrained in manacles, and began the 1100 km drive to Pretoria to take him to a prison with hospital facilities. However, he was nearly dead owing to the previous injuries. He died shortly after arrival at the Pretoria prison, on 12 September. The police claimed his death was the result of an extended hunger strike, but an autopsy revealed multiple bruises and abrasions and that he ultimately succumbed to a brain hemorrhage from the massive injuries to the head, which many saw as strong evidence that he had been brutally clubbed by his captors. Then journalist and now political leader, Helen Zille, along with Donald Woods, another journalist, editor and close friend of Biko's, exposed the truth behind Biko's death.\n\n(Extract from Wikipedia)\n","torrent":{"xt":"urn:btih:4c3b879332ad5cafd7b820d1c522e20c240b2f50","amp;dn":"Peter+Gabriel+-+Biko+%28Live+at+Blossom+Music+Centre%29+-+Vinyl+Rip+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c3b879332ad5cafd7b820d1c522e20c240b2f50","infoHashBuffer":{"type":"Buffer","data":[76,59,135,147,50,173,92,175,215,184,32,209,197,34,226,12,36,11,47,80]},"announce":[],"urlList":[]}}