{"title":"Color Atlas of Pharmacology","uid":6584108,"size":13032619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c98e92f3e16c019cbcae501df08d1caacb6146f&amp;dn=Color+Atlas+of+Pharmacology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_F1_","files":-1,"time":1312541094,"description":"Heinz Luellmann, Klaus Mohr, Lutz Hein and Detlef Bieger, &quot;Color Atlas of Pharmacology. 3 Rev Exp edition&quot; \nISBN: 158890332X, 2005\n414 pages \n\n&quot;This resource provides 170 color plates with accompanying easy-to-read text explaining key features of basic and therapeutic applications of drugs used in medicine. The quality and usefulness of the color plates are unique. The authors have developed an excellent resource for the visual learner. Many students who are strong visual learners will love this pocket atlas. It is well done.&quot; --Doody's Book Reviews\n\nUpdated with the most important new substances and scientific developments, the third edition of The Color Atlas of Pharmacology makes it easier than ever for students, nurses, and practicing physicians to keep up with the latest developments in this constantly changing field. Featuring a user-friendly layout, jargon-free language, and more than 160 spectacular color charts and illustrations, the atlas is divided in to four, color-coded sections: \nPart 1 - General pharmacology - includes descriptions of substance formulation, absorption, distribution, elimination, and molecular mechanisms of action \nPart 2 - Systems pharmacology - with special emphasis on the functional and therapeutic aspects of a wide range of medicinal agents \nPart 3 - Therapy of selected diseases - such as osteoporosis, acute myocardial infarction, migraine, asthma, tropical diseases, and many more \nPart 4 - Drug Index - helpfully listed by substance, generic, and brand names \nConcise, portable, and packed with information, the third edition of The Color Atlas of Pharmacology is the most practical first-stop reference for today's busy healthcare professional.","torrent":{"xt":"urn:btih:4c98e92f3e16c019cbcae501df08d1caacb6146f","amp;dn":"Color+Atlas+of+Pharmacology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c98e92f3e16c019cbcae501df08d1caacb6146f","infoHashBuffer":{"type":"Buffer","data":[76,152,233,47,62,22,192,25,203,202,229,1,223,8,209,202,172,182,20,111]},"announce":[],"urlList":[]}}