{"title":"Blodwyn Pig - Getting To This (1970)","uid":3366709,"size":115614700,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4dafc6bbfc8693bc2741bec5c169866c93c8f167&amp;dn=Blodwyn+Pig+-+Getting+To+This+%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"papystones","files":15,"time":1123433319,"description":"Blodwyn Pig - Getting To This\nRelease Date: 1970\n\nCD &gt; EAC&gt;Lame 320 kbps\n\n01 - Drive Me \n02 - Variations On Nainos \n03 - See My Way \n04 - Long Bomb Blues \n05 - The Squirreling Must Go On \n06 - San Francisco Sketches \n   - Beach Scape \n   - Fisherman's Wharf \n   - Telegraph Hill \n   - Close The Door, I'm Falling Out Of The Room \n07 - Worry \n08 - Toys \n09 - To Rassman \n10 - Send Your Son to Die \n11 - Summertime (UK Single)[Bonustrack]\n12 - Walk On The Water (UK Single)[Bonustrack]\n\n \nMick Abrahams: guitar, vocals, seven-string guitar, tenor guitar\nJack Lancaster: flute, violin, electric violin, tenor sax, baritone sax, soprano sax, phoon horn, cornet\nAndy Pyle: electric bass, six-string bass\nRon Berg: drums, tympani\n\n\nA quirky detour of late-'60s British progressive/blues rock, Blodwyn Pig was founded by former Jethro Tull guitarist Mick Abrahams, who left Tull after the This Was album. Abrahams was joined by bassist Andy Pyle, drummer Ron Berg, and Jack Lancaster, who gave the outfit their most distinctive colorings via his saxophone and flute. On their two albums, they explored a jazz/blues/progressive style somewhat in the mold of (unsurprisingly) Jethro Tull, but with a lighter feel. They also bore some similarities to John Mayall's jazzy late-'60s versions of the Bluesbreakers, or perhaps Colosseum, but with more eclectic material. Both of their LPs made the British Top Ten, though the players' instrumental skills were handicapped by thin vocals and erratic (though oft-imaginative) material. The group were effectively finished by Abrahams' departure after 1970's Getting to This. They briefly reunited in the mid-'70s, and Abrahams was part of a different lineup that reformed in the late '80s; \n'Getting To This' has to be one of the most innovative and creative products of the Underground Revolution, and yes, I say Underground with pride, as opposed to it's contrived 'Prog Rock' and 'Heavy Metal' dirivatives. So yes, I am an old tosspot, but one who still has enough marbles to treasure the golden age of true British Pop creativity and originality, and nothing epitomises these attributes more so than this album from Mick Abrahams and Co. Unforgettable songs, riffs and groundbreaking saxophony take this album far away from any other work of its time - listen to San Francisco Sketches a few times and you'll begin to break the surface. 'See My Way' sums up all the driving beat and thuddery that is uniquely Blodwyn - equalled only by the wonderful 'Sing Me A Song That I Know' from the 'Ahead' album.\nthey have since issued a couple of albums in the 1990s.\n\nhttp://www.mickaby.freeola.com/\nhttp://www.chromeoxide.com/blodwyn.htm\n\nartwork included\n\nenjoy \n\n|papy|\n.\n\n\n","torrent":{"xt":"urn:btih:4dafc6bbfc8693bc2741bec5c169866c93c8f167","amp;dn":"Blodwyn+Pig+-+Getting+To+This+%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dafc6bbfc8693bc2741bec5c169866c93c8f167","infoHashBuffer":{"type":"Buffer","data":[77,175,198,187,252,134,147,188,39,65,190,197,193,105,134,108,147,200,241,103]},"announce":[],"urlList":[]}}