{"title":"Gay- [Titan Men] Rx: Open Wide (2004)","uid":15617065,"size":1315265162,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4dd1cedc11b5b6897594825ba73f8151d408c22f&amp;dn=Gay-+%5BTitan+Men%5D+Rx%3A+Open+Wide+%282004%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"toepica","files":1,"time":1471838008,"description":"*****************THIS IS A FULL MOVIE SO PLEASE HELP BY SEEDING**********************\r\n\r\nIn the tradition of Laid Up, directors Harold Creg and Brian Mills bring kink and fetish to the medical arena and the results are unexpected, inventive, and undeniably sexy. You'll never be able to get a check-up without popping a boner after seeing Rx: Open Wide, where eight hot and masculine TitanMen examine each other's chiseled bodies and cum-filled cocks using all sorts of medical equipment. Ulizes Carpelli brings new meaning to the term &quot;bedside manner&quot; while attending to his patent, Joey Dino (Holler). Two casts and a severe ball-stretcher don't get in the way of Joey giving Carpelli's ass a pounding that must be seen to be believed. Napping surgeon Leo Bramm is given a friendly wake-up call by security guard Mario Ortiz, who knocks on the sleeping stud's head with his nightstick of a cock before the two engage in a steamy flip-flop session. The newest Titanmen Exclusive Marcos David has got a bit of a problem -- his rock-hard, uncut cock just won't go down even after his physician -- stacked hottie Jason Hawk -- examines Marcos' massive meat with all the tools in his bag (stethoscope, reflex hammer and sphygmomanometer). Even after a furious flip-flop fuck and two cum shots each, Marcos' cock is still rock hard","torrent":{"xt":"urn:btih:4dd1cedc11b5b6897594825ba73f8151d408c22f","amp;dn":"Gay-+%5BTitan+Men%5D+Rx%3A+Open+Wide+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dd1cedc11b5b6897594825ba73f8151d408c22f","infoHashBuffer":{"type":"Buffer","data":[77,209,206,220,17,181,182,137,117,148,130,91,167,63,129,81,212,8,194,47]},"announce":[],"urlList":[]}}