{"title":"Jan Fabel Series - Craig Russell (Mystery, Thriller)","uid":10133805,"size":3458893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4dd9e92cbef0525efdbc89aec49bba6148fa87f2&amp;dn=Jan+Fabel+Series+-+Craig+Russell+%28Mystery%2C+Thriller%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1399926501,"description":"Blood Eagle (Jan Fabel #1)\nThe first woman had her lungs ripped out. When the same gruesome ritualistic method was used again, it was clear that the same killer was responsible. But there is no precise evidence to link the two cases, except for the tantalising email. In his first crime novel, Craig Russell introduces us to a new detective hero, Jan Fabel -half-Scottish, half-German -a man of conscience and imagination. Russell has also created a richly textured scenario where the City of Hamburg plays a central role -it is a city where the old Germany combines increasingly with the new, where gangs from Turkey and the Ukraine battle for supremacy. Blood Eagle is a violently exciting thriller and Fabel's desperate attempt to solve the case before more victims are discovered, gradually uncovers layer upon layer of intrigue. How can he track a murderer who leaves no trail, whose victims seem purposefully random and whose motive reaches far beyond greed and lust, into the darkest recesses of the human soul?\n\nBrother Grimm (Jan Fabel #2)\nA girl's body lies, posed, on the pale sand of a Hamburg beach, a message concealed in her hand. 'I have been underground, and now it is time for me to return home...'\n\nJan Fabel, of the Hamburg Murder Squad, struggles to interpret the twisted imagery of a dark and brutal mind. Four days later, a man and a woman are found deep in woodland, their throats slashed deep and wide, the names 'Hansel' and 'Gretel', in the same tiny, obsessively neat writing, rolled tight and pressed into their hands.\n\nAs it becomes clear that each new cime is a grisly reference to folk stories collected almost two hundred years ago by the Brothers Grimm, the hunt is on for a serial killer who is exploring our darkest, most fundamental fears. A predator who kills and then disappears into the shadows.\n\nA monster we all learned to fear in childhood.\n\nEternal (Jan Fabel #3)\n'We are eternal'. 'The Buddhists believe that each life, each consciousness, is like a single candle flame, but that there is a continuity between each flame. Imagine lighting one candle with the flame of another, then using that flame to light the next, and that to light the next, and on and on forever. A thousand flames, all passed from one to another across the generations. Each is a different light, each burns in a totally different way. But it is, nevertheless, the same flame'. 'Now, I'm afraid, it is time for me to extinguish your flame. But don't worry... the pain I give you will mean you will burn brightest at the end.' An environmental campaigner and former left-wing radical is murdered, his body scalped. When a second scalped murder victim, a geneticist researching the possibility of inherited memory, is found, the media latch on to a new serial killer. Jan Fabel and his murder team have nothing to go on other than a single red hair left as a signature at each scene, each hair cut from the same head, at least twenty years previously. Connections begin to appear: a long disbanded terrorist group and its infamous leader; a mummified body over 1500 years old; and a killer who believes he has been reincarnated to exact a terrible revenge on those who betrayed him in a previous life.\n\nThe Carnival Master (Jan Fabel #4)\nJan Fabel thought he was finished with death. Instead, while he is preparing for a new career outside the police, a Cologne murder detective asks for his help in tracking down the Carnival Cannibal, a terrifying serial killer who has killed each year for three years at the start of Cologne's world-famous annual Carnival.\n\nMaria Klee, Fabel's deputy, is close to mental breakdown and on extended sick leave. Unknown to anyone, Maria also heads for Cologne to hunt down a different, even more dangerous killer. One with whom she has a score to settle.\n\nTaras Buslenko, a Ukrainian special-forces commander prepares his hand-picked undercover spetznaz unit for a '-black' operation into Cologne. Their aim: to end, with extreme prejudice, the rule of an ex-pat Ukrainian crime-boss of legendary cruelty. Their orders: to let nothing or nobody get in their way.\n\nThree paths converging on Cologne at Carnival at a time when the world is traditionally turned on its head and Chaos rules. And everybody hides behind a mask.\n\nFabel finds himself on a trail of betrayal and vengeance, violence and death. And once more faces his greatest enemy: the true Master of the Carnival.\n\nThe Valkyrie Song (Jan Fabel #5)\nJan Fabel is a troubled man. His relationships with the women in his life are becoming increasingly complicated: his partner, Susanne, is looking for a deeper commitment. His daughter is considering joining the police and his ex-wife holds him responsible. If that werent enough, after a gap of ten years, a female serial killer - the Angel of St Pauli - again makes the headlines when an English pop star is found in Hamburg's red-light district, dying of the most savage knife wounds. death of a Serbian gangster. And a long-forgotten project by East Germany's Stasi conceived at the height of the Cold War, involving a highly-trained group of female assassins, known by the codename Valkyrie. Fabel's hunt for the truth will bring him up against the most terrifyingly efficient professional killer. The ultimate avenging angel. Fabel soon realizes the real danger he faces in hunting the Valkyrie.\n\nA Fear Of Dark Water (Jan Fabel #6)\nJust as a major environmental summit is about to start in Hamburg, a massive storm hits the city. When the flood waters recede, a headless torso is found washed up.\nInitially, Jan Fabel of the Murder Commission fears it may be another victim of a serial rapist and murderer who stalks his victims through internet social network sites, then dumps their bodies in waterways around the city.\n\nBut the truth of the situation is far more complex and even more sinister. Fabel's investigations lead him to a secretive environmental Doomsday cult called 'Pharos', the brainchild of a reclusive, crippled billionaire, Dominik Korn.\n\nFabel's skills as a policeman are tested to their utmost as he finds himself drawn into an unfamiliar, high tech world of cyberspace, where anyone can be anybody or anything they want. And he quickly realises that he is no longer the hunter, but the hunted.","torrent":{"xt":"urn:btih:4dd9e92cbef0525efdbc89aec49bba6148fa87f2","amp;dn":"Jan+Fabel+Series+-+Craig+Russell+%28Mystery%2C+Thriller%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dd9e92cbef0525efdbc89aec49bba6148fa87f2","infoHashBuffer":{"type":"Buffer","data":[77,217,233,44,190,240,82,94,253,188,137,174,196,155,186,97,72,250,135,242]},"announce":[],"urlList":[]}}