{"title":"Kpop  MV","uid":7757338,"size":5178476084,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4fe4d750cad312552ba391da1de9b8f520f45263&amp;dn=Kpop++MV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"katbasic","files":207,"time":1351137461,"description":"This is a diverse collection of KPOP Music videos. Just really good rock and roll. Enjoy. \n\nYes, it does include Gangnam Style. IF you don't know where to start, beyond Psy's hit, play these first. All have a great beat. Dance tunes. Super Junior - Sorry, Miss A - Bad Girl Good Girl, 2PM- Hands Up, Girl's Generation - Genie, Wonder Girls - so Hot, Kara - Step, or Hyuna (She's the babe in the Gangnam Style video) - Bubble Pop. \n\nThen there are songs that are hauntingly sad. I don't know a word of Korean, but I get the message. Try Younha - Take Care of my Boyfriend or Big Bang - Blue. And you'll see what I mean.\n\nIf you want to keep up on the best new KPOP songs, I highly recommend the TuneIn radio website which links to the Paris Internet Radio station called KPOP Generation. Here's the link. http://tunein.com/radio/Kpop-Generation-s169537/\n\nKPOP Generation lists their playlist in real time (if you refresh), so you can easily find the latest Artists and song. A quick scan of You Tube and you'll find the music videos (Hint: enter MV and ... 1080p or HD, gets you the best videos)","torrent":{"xt":"urn:btih:4fe4d750cad312552ba391da1de9b8f520f45263","amp;dn":"Kpop++MV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe4d750cad312552ba391da1de9b8f520f45263","infoHashBuffer":{"type":"Buffer","data":[79,228,215,80,202,211,18,85,43,163,145,218,29,233,184,245,32,244,82,99]},"announce":[],"urlList":[]}}