{"title":"Images in a Convent (Classic Lesbian-Bi Nun-Hirsute-Panty-Stocki","uid":3559970,"size":745892538,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4ff1a59abf0d7b733928df623cd5e412cfd5f634&amp;dn=Images+in+a+Convent+%28Classic+Lesbian-Bi+Nun-Hirsute-Panty-Stocki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"latricia2k6","files":7,"time":1163865432,"description":"Update! 2009-04-03 Screenshots: &lt;a href=&quot;\nhttp://www.motherless.com/3B4D5A&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.motherless.com/3B4D5A&lt;/a&gt; &lt;a href=&quot;\nhttp://www.motherless.com/3B4D5A?full&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.motherless.com/3B4D5A?full&lt;/a&gt; &lt;a href=&quot;\nhttp://www.motherless.com/EA7A7E?full&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.motherless.com/EA7A7E?full&lt;/a&gt;\n\nThis torrent is also DHT/ enabled. Consider enabling DHT in your client's preferences tab.\nA properly formatted web page of screen shots,synopsis, and this comprehensive review, are included in this .torrent.\nAlso Included:One Nun porn comic (warning! Extreme)\n \nImages in a Convent 1979 Feature Film DVD Rip\nFile Name: Images.in.a.Convent.1979.DvDRIP.XVID.avi\nFile Size: 697 MB\nResolution: 608x336 Xvid\nVideo Quality: Excellent\nDuration: 01:33:51\nLanguage: Italian with External English Subtitles (.srt file) Included\n\nScreens/Synopsis/Review: userx\n\nSynopsis: Absolute &quot;authenticity&quot; is the operative word for this (Classic) 1979 soft core (cutting edge for its time) feature film by Italian film director Joe D'Amato. From the authentic Catholic Nuns habits, with their appropriate head-dressings, shoes, leggings (stockings), and undergarments (panties), to the natural hirsute (hairy) pubic areas on &quot;ALL&quot; the female actors. This film is amazingly accurate.\n\nThe  Santa Fiora Convent is conducting what is business as usual for churches. That being such things as protecting the Countess Isabella from her evil uncle in accordance with her recently deceased fathers will. As the solution, they take her in and make her a novice Nun. The hopes are that in time she will lose her prideful,  worldly ways. All the while, however, a strange thing is happening  regarding an antique pagan statue in the courtyard. It seems that it's possessed. As such, it is causing the Convents inhabitants (all the Nuns) an  uncomfortable awakening of their fleshly desires. Their deep-rooted vows of celibacy require they resist, but the temptation proves to be far too compelling. With much guilt and emotional (some physical) suffering , they each, and with each other, finally succumb to these desires...\n\n It was truly a pleasure to watch these passionate struggles and sexual awakenings. Often though, with the beautifully tenacious tenderness that only two women together can display. The women depicting  Nuns in this film are all natural and beautiful, and upon being disrobed, are a gorgeous sight to behold. This reviewers personal favorite is Sister Lainia. Some might find her the lesser attractive of the group, but I found the passion she displays to be personally touching, and  having myself always favored passion (all types)  above all else, the cards were easily in her favor. Her body as well, was a real inspiration, with  breasts tipped with extremely taut, grape-sized nipples pointing towards the sky (screen shots below). Sister Angela (Mother Superior) was notable as well. Even the brief glimpse of her fondling  her hairy pussy, and seeing the crack of her round, full, fanny just below it (screen shot below), left me wanting to view much, much, more of her mature figure. Also, the very sight of a mature women's face when she is filled with sexual passion and wanton desire is just too incredibly sexy. Adding to that, the fact she is a Nun giving in to forbidden lust, makes the totality of this spectacle, impossible to adequately describe...\n\nWhether you view this film for the purpose of watching some really beautiful (Classic) Lesbian interaction, or you are just feeding an insatiable Nun fetish, this film is a five star winner with regards to both. The authenticity this movie brings to the Nun fetish fantasy in particular, is truly breathtaking!\n\nEnjoy!\n\nConsider becoming a member, of the BM torrents http:bmtorrents.net adult torrents community. And, please support the tracker/s where you got this .torrent file.","torrent":{"xt":"urn:btih:4ff1a59abf0d7b733928df623cd5e412cfd5f634","amp;dn":"Images+in+a+Convent+%28Classic+Lesbian-Bi+Nun-Hirsute-Panty-Stocki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff1a59abf0d7b733928df623cd5e412cfd5f634","infoHashBuffer":{"type":"Buffer","data":[79,241,165,154,191,13,123,115,57,40,223,98,60,213,228,18,207,213,246,52]},"announce":[],"urlList":[]}}