{"title":"Mac OS X leopard Install DVD5 bootable **ENGLISH ONLY**","uid":5002833,"size":4627361792,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:50ba259fe82fc456f54e84f654d350a1c730d557&amp;dn=Mac+OS+X+leopard+Install+DVD5+bootable+%2A%2AENGLISH+ONLY%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"vickmaker","files":1,"time":1247595257,"description":"torrent is a slimmed down version of leopard which if ur reading this will prolly be aware its an OS for MAC computers, .....\n\n`REMOVED:\n\nAll lang aprt from obvious hardcoded english\nAll Printer Driver pkg's (easy to get from vendor)\nDeveloper Tools(XTools)\nmibbe some other bits and pieces i forgot about.....\n\nliposuction was performed on the original developers image of OS X LEOPARD 10.5\nusing carbonCC to do the actual surgery, i cant remember if i just saved it as an cdr image with ccc but if i remember correctly i resized it a baw-hair with disk utility first. yeah thats what i done then burnt to a TDK SL DVD -R using the mac &quot;superdrive&quot; (total misnomer, fkin superSLOWdrive would be more accurate tbh)\nany way you burn it using your desired software of choice, disk util is slow as fck but gets the job done toast is faster i dunno its fkin academic anyway as everyone has there own likings, but whatever i sure i used disk util but it might have been &quot;burn&quot; but im leaning to disk util as im sure burn is schict, cant mind, lol ( would you guesss i smoke too much weed???? lol)\n\nso to confirm the score what we have here is a &quot;Bootable&quot; &quot;Installable&quot; (gets you access to time machine, disk util, passy changer etc from boot as per full size dvd9) i have burnt, booted and installed it to check it works so if you like it pls buy the real thing or even buy a license  to go with a downloadable. you know.\n\nthe *ONLY* (and i dont mean it wont work on others) mac this was tested on is a white 2ghz dual core intel based mac, \n\nIMPORTANT....\n\nthis dvd will take 20+ minutes to boot on your machine, some macs take 1 whole hour !! yeah a whole hour, hardly seems worth it but i know ppl want this disk.if it takes more than 1 hour just bite the bullet and get a dl capable burner cos when &quot;time + efort = wrong_result_annoyed_wanttosmashelectricals&quot; its easier to get 20 quid out your skip and buy the real mcoy dl-dvd burner, external if need be.\n\n**ALWAYS** boot while holding down the option key and select the disk that says &quot;EFI BooT&quot;\n\n( i have found that booting with C held down is hit and miss to say the least, pure kak would be more accurate)\n\n[/b]/siren_noise /randomness alert w00t w00t randommness alert w00t w00t .....&gt;\n\n+++++ but hey macs are better than PC;s LOLOLOL, well i have got both and macs are good fun to muck around on, mine looks like you just want to touch it !! oooooh :) and makes little to no noise, but everything is CASH oriantated with apple i have found and a tad harder to warezify it, games are sh1t on it and it kinda just does stuff wheter you like or not. its secure(oob) so im told, pc is noisy looks pretty good aswell things just &quot;work&quot; where on mac you need to make them work if u get me. right ffs im off on a mac v PC rant, so i will stfu and go bust out a few pipes of skunk :)+++++\n\n/end_siren_noise[/b]\n\n/IMPORTANT NOTE TO FOLLOW\n\nwhen you get to the part of the install where you tick or untick components make sure you take the tick out of any language you can find other than english any thing with the word printer and xcode tools also or you will get files not available errors at the end,\n\nnjoi..........","torrent":{"xt":"urn:btih:50ba259fe82fc456f54e84f654d350a1c730d557","amp;dn":"Mac+OS+X+leopard+Install+DVD5+bootable+%2A%2AENGLISH+ONLY%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50ba259fe82fc456f54e84f654d350a1c730d557","infoHashBuffer":{"type":"Buffer","data":[80,186,37,159,232,47,196,86,245,78,132,246,84,211,80,161,199,48,213,87]},"announce":[],"urlList":[]}}