{"title":"The Vaccination Crisis - Vance Ferrell","uid":11773470,"size":890600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50f594d8e03050057c2104e112d5a30696e17315&amp;dn=+The+Vaccination+Crisis+-+Vance+Ferrell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1427168962,"description":"\nWhy smallpox and anthrax vaccines are not safe. The government plan, in an emergency, requires smallpox and anthrax vaccination. Home remedies in case of a smallpox attack.\n\nThe eight required childhood disease vaccines and why they are so terribly dangerous. The combined shots: DPT and MMR. The truth about DPT and Sudden Infant Death Syndrome, and MMR Vaccine and Autism. The four other vaccines. What is in vaccines that make them so insidious? And what do they do inside your body.\n\nWhat to do if you must take immediate action to avoid having your child vaccinated. A carefully worded Letter, Requesting Exemption from Vaccination on Religious Grounds.\nIf You Are Taken to Court. A Federal Law You Should Know About. Vaccinations When Traveling Abroad. Vaccinations in the Armed Forces. Legal Exemption Statutes throughout the United States-- State by State, plus the District of Columbia.\n\nList of Toxic Materials in Vaccines. Out-standing Online Sources. Books on Childhood Vaccination.\nWhere to locate 189 authoritative medical research articles in professional journals, which verify in gory detail the dangers and ineffectiveness of vaccines.\n\n\nAbout the author:\nVance Ferrell was raised in San Francisco, Calif. He has been a very studious man who had 22 yrs of formal education. He received a BA in 1955 from Pacific Union College (Angwin, Calif.). 1965 he received a MA from the Potomac University in (Washington DC). In 1958 he received a BD from Andrews University (Berrien Springs, Mich.). Throughout the years Vance Ferrell has been in love with his Creator and compelled to defend a loving Heavenly Father. Vance Ferrell has spent much time doing extensive research in the fields of botany, biology, geology and other sciences","torrent":{"xt":"urn:btih:50f594d8e03050057c2104e112d5a30696e17315","amp;dn":"+The+Vaccination+Crisis+-+Vance+Ferrell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50f594d8e03050057c2104e112d5a30696e17315","infoHashBuffer":{"type":"Buffer","data":[80,245,148,216,224,48,80,5,124,33,4,225,18,213,163,6,150,225,115,21]},"announce":[],"urlList":[]}}