{"title":"The Saddest Music in the World (2003)audio:Rus or Eng,DVD9","uid":8798001,"size":7031619584,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:514de73b005c699405df70fa9c70def7885c4e89&amp;dn=The+Saddest+Music+in+the+World+%282003%29audio%3ARus+or+Eng%2CDVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"app1985","files":-1,"time":1376123208,"description":" &lt;a href=&quot;http://movie.douban.com/subject/1308081/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://movie.douban.com/subject/1308081/&lt;/a&gt;\n\n\nCountry: Canada\nGenre: Musical, Comedy, avant-garde, surrealism\nYear: 2003\nDuration: 1:40:30\n\n: Author (odnogolosy voice) (A.Alekseev)\nSubtitle: English, Spanish\nThe original audio track: English\n\nDirector: Guy Maddin / Guy Maddin\n\nCast: Mark McKinney, Isabella Rossellini, Maria de Medeiros, David Fox, Ross McMillan, Louis Negin, Darcy Fehr, Claude Dorzh, Talia Pura, Jeff Sutton\n\nDescription: Guy Maddin tells creepy surreal story through the snow-covered lens, mostly in black and white.\nCanadian beer queen gathers musicians from all over the world in search of the saddest tunes. The winner is waiting for a big cash prize. One after the other on the stage raised a variety of characters, as if born in the era of silent films: Serbian violinists, the Scots with bagpipes, Mexican guitarists ...\n&quot;Grief - it's the same happiness, only turning his back to us&quot; - a quote from the movie.\nHow to approach this film, it seems, did not know at the time, even Venetian selectors. Why put it in sverheksperimentalnuyu section &quot;New Territories&quot;. And despite the fact that Canadian Guy Madden in the movie is by no means new. On-winner of many prestigious national and international film awards, his retrospectives are constant in world capitals. But the premiere of his latest tape &quot;The Saddest Music in the World&quot; by Kazuo Ishiguro, the story became a real sensation for moviegoers.\n\nMadden stylized film at the cinema the first third of the twentieth century - from the early black-and-white comedies to the first social Kinodrom, the German Expressionists to the French Surrealists. But this does not exhaust the postmodern technique where the author plays styles of different eras for the &quot;deconstruction&quot; of high and low. Stylization Madden wants to be called nothing less than &quot;a magical movie,&quot; similar to the &quot;magical realism&quot; of Latin American fiction.\nAccording to the story, &quot;The Saddest Music in the World&quot; - an international competition for musicians and folk ensembles, arranged in Winnipeg and urban radio station broadcast. From the first to the last frame of the first to the last sound the film - a pure delight. Musical and visual images and motifs are woven into fine ligature, and all this would be desirable to consider, review and listen to again and again.\n\nThe central characters of &quot;the saddest music in the world&quot; - the producer Chester Kent, representing the United States, and his brother, a born melancholic, speaking from Serbia by the name of Gavrilo Principle. In fact the film Madden - is a parable about the artist, what - how ironic! -Is cheeky, rollicking, but deeply in love with the art of Chester. Final, when it is burned together with the tool, antique piano, and off-screen sound of his question: &quot;Tell me, is there a person happier than me?&quot; Looks like a real, almost religious holocaust. And in the pathos of sacrifice no notes hypocrisy - a natural final chord is very musical, easy and at the same time very deep picture.\n\nAward National Academy of Canadian Cinema and Television for the best work of the costume designer, editor, and best original music for the film. Nominated in the category &quot;Best Direction.&quot;\nProfessional Guild Award for Outstanding Canadian filmmakers work of the artist-director feature film. Nominations in the categories of outstanding achievement in directing, editing.\nAward of society to support independent film Chlotrudis (Massachusetts, USA) for Best Screenplay, adaptation, nominated for Best Director and Best Actress.\nThe prize for best director at the American comic arts festival.\n(Description Vladimironly)\n\n\n\nRelease Type: DVD9 \nContainer: DVD-Video\n\nVideo: NTSC 16:9 (720x480) VBR Auto Letterboxed 23.976 fps 4832 Kbps\nAudio: audio # 1: Russian (Dolby AC3, 2 ch, 48.0 KHz, 192 Kbps); \n       audio # 2: English (Dolby AC3, 6 ch, 48.0 KHz, 448 Kbps)\n","torrent":{"xt":"urn:btih:514de73b005c699405df70fa9c70def7885c4e89","amp;dn":"The+Saddest+Music+in+the+World+%282003%29audio%3ARus+or+Eng%2CDVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514de73b005c699405df70fa9c70def7885c4e89","infoHashBuffer":{"type":"Buffer","data":[81,77,231,59,0,92,105,148,5,223,112,250,156,112,222,247,136,92,78,137]},"announce":[],"urlList":[]}}