{"title":"Practical Packet Analysis","uid":7376179,"size":10503223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51a48fd81996db806e3e2b7450c853d6eb585dbd&amp;dn=Practical+Packet+Analysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1340324575,"description":"Practical Packet Analysis\n\nAuthor: Chris Sanders\nPublisher: No Starch Press May 2007\nPages: 172\nISBN: 978-1-59327-149-7\n\nIt's easy enough to install Wireshark and begin capturing packets off the wire--or from the air. But how do you interpret those packets once you've captured them? And how can those packets help you to better understand what's going on under the hood of your network? Practical Packet Analysis shows how to use Wireshark to capture and then analyze packets as you take an indepth look at real-world packet analysis and network troubleshooting. The way the pros do it.\n\nWireshark (derived from the Ethereal project), has become the world's most popular network sniffing application. But while Wireshark comes with documentation, there's not a whole lot of information to show you how to use it in real-world scenarios. Practical Packet Analysis shows you how to:\n\nUse packet analysis to tackle common network problems, such as loss of connectivity, slow networks, malware infections, and more\nBuild customized capture and display filters\nTap into live network communication\nGraph traffic patterns to visualize the data flowing across your network\nUse advanced Wireshark features to understand confusing packets\nBuild statistics and reports to help you better explain technical network information to non-technical users\nBecause net-centric computing requires a deep understanding of network communication at the packet level, Practical Packet Analysis is a must have for any network technician, administrator, or engineer troubleshooting network problems of any kind.\n\nTechnical review by Gerald Combs, creator of Wireshark.","torrent":{"xt":"urn:btih:51a48fd81996db806e3e2b7450c853d6eb585dbd","amp;dn":"Practical+Packet+Analysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51a48fd81996db806e3e2b7450c853d6eb585dbd","infoHashBuffer":{"type":"Buffer","data":[81,164,143,216,25,150,219,128,110,62,43,116,80,200,83,214,235,88,93,189]},"announce":[],"urlList":[]}}