{"title":"Thermodynamics of Surfaces and Capillary Systems","uid":15453015,"size":5544072,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:520aec07260e58c13b4423321072f74873115ab1&amp;dn=Thermodynamics+of+Surfaces+and+Capillary+Systems&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1469961306,"description":"Chemical Thermodynamics Set Vol 7. Thermodynamics of Surfaces and Capillary Systems - Michel Soustelle (Wiley-ISTE, 2016).pdf\r\n\r\nThis book is part of a set of books which offers advanced students successive characterization tool phases, the study of all types of phase (liquid, gas and solid, pure or multi-component), process engineering, chemical and electrochemical equilibria, and the properties of surfaces and phases of small sizes. Macroscopic and microscopic models are in turn covered with a constant correlation between the two scales. Particular attention has been given to the rigor of mathematical developments.\r\n\r\nThis volume, the final of the Chemical Thermodynamics Set, offers an in-depth examination of chemical thermodynamics. The author uses systems of liquids, vapors, solids and mixtures of these in thermodynamic approaches to determine the influence of the temperature and pressure on the surface tension and its consequences on specific heat capacities and latent heats.  Electro-capillary phenomena, the thermodynamics of cylindrical capillary and small volume-phases are also discussed, along with a thermodynamic study of the phenomenon of nucleation of a condensed phase and the properties of thin liquid films. The final chapters discuss the phenomena of physical adsorption and chemical adsorption of gases by solid surfaces. In an Appendix, applications of physical adsorption for the determination of the specific areas of solids and their porosity are given","torrent":{"xt":"urn:btih:520aec07260e58c13b4423321072f74873115ab1","amp;dn":"Thermodynamics+of+Surfaces+and+Capillary+Systems","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"520aec07260e58c13b4423321072f74873115ab1","infoHashBuffer":{"type":"Buffer","data":[82,10,236,7,38,14,88,193,59,68,35,50,16,114,247,72,115,17,90,177]},"announce":[],"urlList":[]}}