{"title":"Never Can Say Goodbye The Katherine Jackson Story(pdf){Zzzzz}","uid":11470652,"size":12535086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52208ad6779c2c7cdea02cb1faaff949be9316ab&amp;dn=Never+Can+Say+Goodbye+The+Katherine+Jackson+Story%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416078219,"description":"The untold story of Michael Jackson by his mother - Katherine Jackson. 150 pages of never-before-seen photos from The Jackson Family's Personal Archives.\n\nPublisher: Vintage Pop Media; 1st Edition edition (June 1, 2010)\nLanguage: English\nISBN-10: 0982800002\nISBN-13: 978-0982800003\n\nEditorial Reviews\nReview\nAs a collaborator on Katherine Jackson's book about her son Michael, Never Can Say Goodbye, Howard Mann has gotten to know the Jackson family intimately. Here, he and colleague Sonia Lowe of Vintage Pop Media open up about their work on the book and what readers can expect to find inside those very personal pages. What was it like working with Katherine Jackson on such a personal project? Working with Mrs. Jackson was surreal at first, but as we got to know her, it's quite easy to lose sight of who she is because she is so incredibly grounded, humble and welcoming of us into her home and her family. We arrived, and she served us milk and cookies and shared funny, touching and tragic moments with us. Working with her on such a personal project was nothing short of amazing! What's your favorite memory that's shared in the book? There are so many special memories and moments in the book, and as an avid fan, it is hard to pick the best one. But, I guess, my favorite is when Michael surprised Katherine on a trip to New York City where he took her to an airport to show her the lineup of food, supplies and charted jets he sent to Africa, as he held up on his promise to do something about the starving children there. --Oprah.com\n\nHow did you choose what to edit out of the book? We tried to build stories as chronologically as possible, and we tried to foster a good mix of family photos and Michael onstage as well. So sticking to a theme was one way to edit the photo selection process. We looked for shots the fans have not seen before, but also ones that tell a story. What will people be most surprised about by Never Can Say Goodbye? I think people will be most surprised by the personal moments and photos that Never Can Say Goodbye provides. The book takes the reader on a journey from childhood to superstardom and most of the moments in between. Katherine has several messages she wanted to deliver to Michael Jackson fans, and the reader will surely gain a more intimate perspective of Michael Jackson. What do you hope people will learn about Michael and the Jackson family by reading this book? The same thing that we've experienced in the past year getting to know the Jacksons: that they are not at all the people the tabloid media make them out to be. Mrs. Jackson in particular is one of the sweetest, kindest and most respectful people we've ever met. She is incredibly strong yet humble for what she has dealt with in her lifetime. --Oprah.com\n\nAbout the Author\nKatherine Esther Scruse Jackson (born Kattie B. Screws, May 4, 1930) is the matriarch of the Jackson musical family.\n\nMost Helpful Customer Reviews\n\nA Beautiful Book!\nBy Dianne's Narratives on November 29, 2010\nI thoroughly enjoyed reading this book of Katherine Jackson's, and loved the photos, many of which I had not seen before. Who has been photographed as often or as much as Michael? So to discover new photos of him and his family was lovely. I also liked seeing photos of the Jackson 5 as well...they were an important part of pop music history and were at the top of the charts for many years. Truly a first class song/dance group. This book is a retrospective of a mother's reflections, and a tribute to him as well. A book like this belongs in your library or on your coffee table","torrent":{"xt":"urn:btih:52208ad6779c2c7cdea02cb1faaff949be9316ab","amp;dn":"Never+Can+Say+Goodbye+The+Katherine+Jackson+Story%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52208ad6779c2c7cdea02cb1faaff949be9316ab","infoHashBuffer":{"type":"Buffer","data":[82,32,138,214,119,156,44,124,222,160,44,177,250,175,249,73,190,147,22,171]},"announce":[],"urlList":[]}}