{"title":"Paul Theroux - The Great Railway Bazaar (1975 ) + The Old Patago","uid":8253989,"size":2571572,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52230118faa01eb8479e47025cc7c6c5130e9221&amp;dn=Paul+Theroux+-+The+Great+Railway+Bazaar+%281975+%29+%2B+The+Old+Patago&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"RAYscum","files":-1,"time":1363216882,"description":"The Great Railway Bazaar \n\nPaul Theroux's strange, unique, and hugely entertaining railway odyssey has become a modern classic of travel literature. Here Theroux recounts his adventures on an unusual grand continental tour. Asia's fabled trains -- the Orient Express, the Khyber Pass Local, the Frontier Mail, the Golden Arrow to Kuala Lumpur, the Mandalay Express, the Trans-Siberian Express -- are the stars of a journey that takes him on a loop eastbound from London's Victoria Station to Tokyo Central, then back from Japan on the Trans-Siberian. Brimming with Theroux's signature humor and wry observations, this engrossing chronicle is essential reading for both the ardent adventurer and the armchair traveler.\n\nThe Old Patagonian Express: By Train Through the Americas \n\nStarting with a rush-hour subway ride to South Station in Boston to catch the Lake Shore Limited to Chicago, Theroux winds up on the poky, wandering Old Patagonian Express steam engine, which comes to a halt in a desolate land of cracked hills and thorn bushes. But with Theroux the view along the way is what matters: the monologuing Mr. Thornberry in Costa Rica, the bogus priest of Cali, and the blind Jorge Luis Borges, who delights in having Theroux read Robert Louis Stevenson to him.","torrent":{"xt":"urn:btih:52230118faa01eb8479e47025cc7c6c5130e9221","amp;dn":"Paul+Theroux+-+The+Great+Railway+Bazaar+%281975+%29+%2B+The+Old+Patago","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52230118faa01eb8479e47025cc7c6c5130e9221","infoHashBuffer":{"type":"Buffer","data":[82,35,1,24,250,160,30,184,71,158,71,2,92,199,198,197,19,14,146,33]},"announce":[],"urlList":[]}}