{"title":"Richard Dawkins - The Blind Watchmaker - PDF","uid":4684573,"size":8063017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52907c2b809e88694d5f4cfc4620b11dda3cbc0a&amp;dn=Richard+Dawkins+-+The+Blind+Watchmaker+-+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"amgine2007","files":1,"time":1233186564,"description":"Oxford zoologist Dawkins (The Selfish Gene, The Extended Phenotype trumpets his thesis in his subtitlealmost guarantee enough that his book will stir controversy. Simply put, he has responded head-on to the argument-by-design most notably made by the 18th century theologian William Paley that the universe, like a watch in its complexity, needed, in effect, a watchmaker to design it. Hewing to Darwin's fundamental (his opponents might say fundamentalist) message, Dawkins sums up: ``The theory of evolution by cumulative natural selection is the only theory we know of that is in principle capable of explaining the evolution of organized complexity.'' Avoiding an arrogant tone despite his up-front convictions, he takes pains to explain carefully, from various sides, why even such esteemed scientists as Niles Eldredge and Stephen Jay Gould, with their ``punctuated equilibrium'' thesis, are actually gradualists like Darwin himself in their evolutionary views. Dawkins is difficult reading as he describes his computer models of evolutionary possibilities. But, as he draws on his zoological background, emphasizing recent genetic techniques, he can be as engrossing as he is cogent and convincing. His concept of ``taming chance'' by breaking down the ``very improbable into less improbable small components'' is daring neo-Darwinism.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Blind_Watchmaker&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Blind_Watchmaker&lt;/a&gt;","torrent":{"xt":"urn:btih:52907c2b809e88694d5f4cfc4620b11dda3cbc0a","amp;dn":"Richard+Dawkins+-+The+Blind+Watchmaker+-+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52907c2b809e88694d5f4cfc4620b11dda3cbc0a","infoHashBuffer":{"type":"Buffer","data":[82,144,124,43,128,158,136,105,77,95,76,252,70,32,177,29,218,60,188,10]},"announce":[],"urlList":[]}}