{"title":"PART 5 - Gene Scott - 7 New Digitized Tape Albums and More","uid":4129050,"size":1060510447,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:52e41b99c7c8539cbc3f5a8be8bd6ff4cfaee976&amp;dn=PART+5+-+Gene+Scott+-+7+New+Digitized+Tape+Albums+and+More&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"baboonbob","files":223,"time":1207942665,"description":"*************************************************************\n*                                                           *\n*                      DR. GENE SCOTT                       *\n*            7 NEW DIGITIZED TAPE ALBUMS AND MORE           *\n*                                                           *\n*        This collection contains the complete albums:      *\n*                                                           *\n*                      DEMONOLOGY VOLS 3-5                  *\n*                                                           *   \n*              BIBLE AND CHURCH HISTORY VOLS 1-4            *\n*                                                           *\n*                                                           *\n*            plus several more very rare messages,          *\n*                 taken from various sources.               *\n*                                                           *\n*************************************************************\n\nThis collection includes 7 more cassette tape albums by Dr. Gene Scott,\nprofessionally digitized to MP3 format.  Cover art and index material are included\nin each directory.  Also included are several additional messages on various subjects, which have not been previously shared.\n\nAlso included is an extremely rare recording of a radio interview given by intelligence insider Dean Warwick.  Just a few weeks after this interview was given, Dean got up on stage to begin speaking at a conference when he was struck dead -- on stage -- by a directed-energy weapon of some sort to prevent him from speaking any further.   Certain parties had hoped that the radio interview he had recently given would be forgotten, but the host had recorded the show, and it is included here for mass distribution due to its overwhelming importance.\n\nCompleting this collection is a video clip of Agent Melissa Scott proudly proclaiming her devil-worship.\n\nGene Scott himself warned that once he died, those who took over the church\nwould destroy his entire life work.  This was because his teachings frequently went\ninto territory far beyond what one would normally expect from an ostensibly \\\\\\&quot;Christian\\\\\\&quot; preacher.  Indeed, he spent much time educating his listeners on subjects which were highly politically sensitive even to this day, and he knew that only he himself could guarantee the continued availability of his teachings.\n\nHis prophecy has unfortunately been fulfilled.\n\nNow if you go to his church, all you will see will be his wife Melissa prancing around on stage in front of a huge American flag which spans the entire back wall.  That is, if you can get in the door at all.   The church is guarded by a virtual army of private security goons masquerading as \\\\\\&quot;ushers,\\\\\\&quot; wearing three-piece suits and ear-phone communication systems.   This has all the earmarkings of a government-sponsored cult operation, working as expected to mind-control its followers and destroy the truth.  \n\nMelissa Scott is ABUSING her ownership of the copyright to this material as a means to DESTROY AND ERASE the life work of Dr. Gene Scott from the face of the Earth.  We feel that Dr. Scott did not produce his lifetime of work simply so that his former porn-producer wife Melissa aka \\\\\\&quot;Barbie Bridges\\\\\\&quot; could shut it all down the moment he passed on, in order to appease her handlers.  Dr. Scott\\\\\\'s work rightfully belongs to the world now, and so we are making it available to everyone free of charge.  \n\n","torrent":{"xt":"urn:btih:52e41b99c7c8539cbc3f5a8be8bd6ff4cfaee976","amp;dn":"PART+5+-+Gene+Scott+-+7+New+Digitized+Tape+Albums+and+More","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52e41b99c7c8539cbc3f5a8be8bd6ff4cfaee976","infoHashBuffer":{"type":"Buffer","data":[82,228,27,153,199,200,83,156,188,63,90,139,232,189,111,244,207,174,233,118]},"announce":[],"urlList":[]}}