{"title":"XTRO (1983)","uid":4021026,"size":782510562,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5301acfbbaa36d58a2fba7e2bdf28a722b773944&amp;dn=XTRO+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Rocksavage","files":8,"time":1202665947,"description":"XTRO (1983)\n\nThis is the Horror Science Fiction Movie Directed by Harry Bromley Davenport.\n\nI worked on this Picture and know how truly awful it really is. Inept is the perfect word for this low budget hokum. The acting is of an appalling standard. Special mention must go to the performance of the unlikable cockney kid and his monotone mother. The music is also composed by the Director and instantly invokes the standard of the picture. Cheap.\n\nThere are some good moments such as the rebirth of the Alien and my personal favorite: The Action Man scene performed by Tok of Tik and Tok an eighties Robotic Dance Act. Seeing Maryam d&amp;#039;Abo so young and so nude is also a bonus.\n\nTik was the monster. He had his hands and feet on the ground but was facing upwards. The Aliens face was then positioned on the back of Tik&amp;#039;s head. He would walk blindly forward but the effect difficult to shoot as the position was virtually impossible to keep and Tok could not breath too well through the back of the Aliens latex neck. The final result was creepy.\n\nI searched for a copy of this movie and on re-watching it, it brought back many memories. I still have some original toy props from the Kids bedroom. I post it here, on Pirate Bay as a curiosity, rather than any love I might have  for the film.\n\nIt is in AVI Format, English Language with no subtitles and some Art is Included.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0086610/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0086610/&lt;/a&gt;\n\nEnjoy if you can!","torrent":{"xt":"urn:btih:5301acfbbaa36d58a2fba7e2bdf28a722b773944","amp;dn":"XTRO+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5301acfbbaa36d58a2fba7e2bdf28a722b773944","infoHashBuffer":{"type":"Buffer","data":[83,1,172,251,186,163,109,88,162,251,167,226,189,242,138,114,43,119,57,68]},"announce":[],"urlList":[]}}