{"title":"911 - The Truth and Lies of 9-11 (2004)","uid":3407163,"size":736929792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5392a9997ffff199eefb00955ecaeedaf65e4464&amp;dn=911+-+The+Truth+and+Lies+of+9-11+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ReVIsed","files":1,"time":1131507258,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from a user named &quot;b2pilot187&quot;. Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be solved sooner than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won't even read this, because he simply searches for &quot;911&quot; and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\nReVIsed alias Masterpiece\n\nSynopsis:\n\nEver since the attacks on the World Trade towers and the Pentagon, disturbing questions have been raised about the possible involvement of some parts of the U.S. security apparatus or Administration. These questions have been supported by extensive circumstantial evidence and has been investigated by several U.S. Congressional Committees. Furthermore, the U.S. media have reported on the well known relationship which exists between President George W. Bush, the Carlyle Group, several oil companies and the Bin Laden Family. Former narcotics investigator Mike Ruppert was forced out of the LAPD in 1977 when he exposed evidence of drug trafficking by the CIA. The Truth &amp; Lies of 9-11 is a filmed lecture at Portland State University, where Ruppert uses only government documents, official statements and press reports as the basis of his investigative work. This pioneering, groundbreaking expose of 9-11, now two years old, paints a stark and accurate picture of our world today and TOMMORROW. You simply have to see this one!\n\nGenre: Documentary \nVideo Codec: Xvid (DX50) \nVideo: ~538 kbit/s \nAudio: ~128 kbit/s MP3 VBR \nRuntime: 144 Min \nFrame Size: 640x464 \nFramerate: 29.970 fps","torrent":{"xt":"urn:btih:5392a9997ffff199eefb00955ecaeedaf65e4464","amp;dn":"911+-+The+Truth+and+Lies+of+9-11+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5392a9997ffff199eefb00955ecaeedaf65e4464","infoHashBuffer":{"type":"Buffer","data":[83,146,169,153,127,255,241,153,238,251,0,149,94,202,238,218,246,94,68,100]},"announce":[],"urlList":[]}}