{"title":"The Harvard Medical School Guide to Lowering Your Cholesterol-Ma","uid":6009160,"size":6027508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53d8ce18f9055b4b612fc4ce78ee58a89c64c13b&amp;dn=The+Harvard+Medical+School+Guide+to+Lowering+Your+Cholesterol-Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MANTESH","files":3,"time":1291417769,"description":" &lt;a href=&quot;http://img819.imageshack.us/img819/1205/theharvardmedicalschool.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img819.imageshack.us/img819/1205/theharvardmedicalschool.jpg&lt;/a&gt;\n\n\n\n\n\n\nThe Harvard Medical School Guide to Lowering Your Cholesterol \n\n\n\n\nMcGH \n\nMASON W. FREEMAN\nCHRISTINE JUNGE\n \n2005 \n\nISBN: 0071444815 \n\nPDF \n\n272 pages \n\nEnglish \n\n5,7 MB\n\nThis title is from the experts at one of the world's most respected medical schools - your complete guide to managing cholesterol and staying healthy for life. Everybody knows that high cholesterol is something to be concerned about. But what does it really mean when your doctor tells you that your cholesterol levels are high, and what should you do about it? If you're worried about your cholesterol, here's your chance to get the answers you need from a top expert at the Harvard Medical School. As founder and chief of the prestigious Lipid Metabolism Unit at Massachusetts General Hospital, Dr. Mason W. Freeman treats hundreds of patients each year and oversees breakthrough cholesterol research.In &quot;The Harvard Medical School Guide to Lowering Your Cholesterol&quot; he explains: what cholesterol is and the difference between 'good' and 'bad' cholesterol; how to assess your risk for high cholesterol; how to work with your doctor to develop the best treatment plan for you cholesterol-lowering drugs - who should take them, what to look out for, and how to be sure your doctor is monitoring you properly; how to manage your cholesterol through diet and exercise; and, the latest scientific findings on alternative therapies. About the Harvard Medical School health guide series - Each book from Harvard Medical School gives you the knowledge you need to understand and take control of your health. In every book, a world-renowned expert from Harvard Medical School provides you with the latest information on diagnosis, traditional and alternative treatments, home remedies, and lifestyle changes that can make a powerful difference in your health............................\n\n[/color][/code][/b]","torrent":{"xt":"urn:btih:53d8ce18f9055b4b612fc4ce78ee58a89c64c13b","amp;dn":"The+Harvard+Medical+School+Guide+to+Lowering+Your+Cholesterol-Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53d8ce18f9055b4b612fc4ce78ee58a89c64c13b","infoHashBuffer":{"type":"Buffer","data":[83,216,206,24,249,5,91,75,97,47,196,206,120,238,88,168,156,100,193,59]},"announce":[],"urlList":[]}}