{"title":"Doco - BBC Horizon - Archimedes' Secret (how catholic church slo","uid":7174186,"size":1204532726,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:53db46ab437fe9f0c2a76eef7a97961d5e2f65a6&amp;dn=Doco+-+BBC+Horizon+-+Archimedes%27+Secret+%28how+catholic+church+slo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"psspss","files":2,"time":1334017232,"description":"Doco - BBC Horizon - Archimedes' Secret (how catholic church slowed down science progress) avi -Fixed Sharpened cropped\n\nI did some work on the original source which was a poorly ripped Video tap\nversion.. and only source i could find. its cleaner.. sharper and ascepted/cropped properly\n\nratio is 4:3 also\n\nThis is an interesting BBC doco from 2008 I think.. which shows how\nthe Catholic church destroyed some great mathematical calculations\nof Archimedes replacing his works with bible verses\n\nwhich suggests that calculus maths and other principles where\nerased and only rediscovered or reformulated 1000 of years\nlater\nhence held back people of the earth with advances in science and maths for over a 1000 of years\n\nenjoy and HELP seed if grabbing\n\n==I recommend VLC 2.0.1 alpha Mar 2012 to watch\nxvids and to set real-time sharpener on and slide\nthe knob a little to the right (not too much) it\nreally makes a big difference to the video output\ntry it and see what I mean .. get it from videolan.org\nit rid the noise and washed out feel and\nbrighten key white areas on the fly. also enable GPU\nacceleration can really help playback speeds\ntry this before complaining about corrupted video\nand bad video. also the 2.1 beta plays xvids\nworse in fact but maybe plays mp4s better\nhowever Im still wondering if ver 1.11.1 plays\nbetter as it seems more smooth. MPC with K-lite is\ngood to but lacks the sharpener filter VLC has\n===================================\nPs/3 , phone and xbox users may consider grabbing\nthe free tool umile encoder 3.1.1.2 it can convert\nto most devices to make compatible in 8mins\non dual core or higher. as some of my converts may\nfail for certain devices.. you will need a pc to run it\nthough. no link just google it.. \n======================================","torrent":{"xt":"urn:btih:53db46ab437fe9f0c2a76eef7a97961d5e2f65a6","amp;dn":"Doco+-+BBC+Horizon+-+Archimedes%27+Secret+%28how+catholic+church+slo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53db46ab437fe9f0c2a76eef7a97961d5e2f65a6","infoHashBuffer":{"type":"Buffer","data":[83,219,70,171,67,127,233,240,194,167,110,239,122,151,150,29,94,47,101,166]},"announce":[],"urlList":[]}}