{"title":"Kasey Chambers and Shane Nicholson - Wreck &amp; Ruin [2012][EAC","uid":8166201,"size":202497144,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53efb7dd7a3d1c1fe6e70ce012a7432cda4669d1&amp;dn=Kasey+Chambers+and+Shane+Nicholson+-+Wreck+%26amp%3B+Ruin+%5B2012%5D%5BEAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":16,"time":1361339846,"description":"Artists: Kasey Chambers, Shane Nicholson\nRelease: Wreck &amp; Ruin\nDiscogs: 3978643\nReleased: 2012-10-22\nLabel: Sugar Hill Records\nCatalog#: SUG-LP-4089 / SUG-CD-4089\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Rock, Folk, World, &amp; Country, Country Rock, Folk Rock\n\nTracklisting:\n\n01. 'Til Death Do Us Part (1:25)\n02. Wreck And Ruin (2:30)\n03. Adam And Eve (3:06)\n04. The Quiet Life (2:37)\n05. Dustbowl (2:43)\n06. Familiar Strangers (3:04)\n07. Your Sweet Love (2:31)\n08. Rusted Shoes (2:53)\n09. Flat Nail Joe (2:39)\n10. Have Mercy On Me (2:56)\n11. Up Or Down (2:30)\n12. Sick As A Dog (1:53)\n13. Troubled Mind (3:20)\n\nOne thing Australia has in common with the American South is that both became home to many of the descendents of the Scottish highlanders who lost their battle against the British when Bonnie Prince Charlie fumbled the Battle of Culloden in 1745. So if Kasey Chambers, born and raised in Southern Australia, sings Appalachian folk melodies as naturally as anyone following a similar musical path in the United States, you can probably chalk that up to a shared heritage and musical tradition. As for her skills as a vocalist and songwriter, that's a matter of talent, pure and simple, and Chambers and her husband, singer and songwriter Shane Nicholson, have teamed up for their second album of acoustic songs following 2008's superb Rattlin' Bones, which shows they're delivering some of the purest and most satisfying country sounds of anyone working in the 21st century. Most of the tunes on Wreck &amp; Ruin are love songs of a sort, though much of it doesn't seem all that romantic; &quot;Adam and Eve&quot; plays the story of the first couple as a tale of outlaws on the run from the law (in this case, the Lord), while &quot;Familiar Strangers&quot; is a heartbreaking study of a relationship gone bad, &quot;Your Sweet Love&quot; ponders just how much a good man can save a troubled woman, and the title tune is a joyous celebration of chaos and personal failings. Chambers and Nicholson's harmonies are excellent, technically strong, and emotionally powerful, and the 13 songs they wrote for this project are sublime, hitting their target with impressive skill whether they're trying to generate laughter, menace, or a pull on the heartstrings. Wreck &amp; Ruin has a natural, easygoing feel that never undercuts the skill or force of the performances, sounding like it was cut live in the studio (and with intros that find the songs falling into shape as the tape rolled), and Chambers and Nicholson are accompanied by some fine pickers who give this just the right feel, particularly fiddler John Bedggood, Jeb Cardwell on dobro, and Chambers' own simple but satisfying banjo. Wreck &amp; Ruin sounds fresh as the dew and old as the hills all at once, and anyone who doubts that Kasey Chambers and Shane Nicholson are two of the finest natural talents in country and folk music today need only listen to this to be convinced.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:53efb7dd7a3d1c1fe6e70ce012a7432cda4669d1","amp;dn":"Kasey+Chambers+and+Shane+Nicholson+-+Wreck+%26amp%3B+Ruin+%5B2012%5D%5BEAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53efb7dd7a3d1c1fe6e70ce012a7432cda4669d1","infoHashBuffer":{"type":"Buffer","data":[83,239,183,221,122,61,28,31,230,231,12,224,18,167,67,44,218,70,105,209]},"announce":[],"urlList":[]}}