{"title":"Windows XP Service Pack 2","uid":4392748,"size":281106124,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5450ad743cb5427efbf9654e9308051ebd3c32e9&amp;dn=Windows+XP+Service+Pack+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"readyman","files":1,"time":1221270306,"description":"The Windows XP Service Pack 2 (XP SP2) fixes a range of bugs in Windows XP. The file is a large download and can be applied to any version of Windows XP Home, Professional, TabletPC or Media Center. It doesn't matter what XP updates you have previously applied to your system, SP2 will update any unpatched, partially patched or completely updated system (it includes all previously released patches and updates). If you are going to reinstall the original release of Windows XP on a PC, it is important that you apply this Service Pack BEFORE connecting to the Web. Nasty viruses and worms like Sasser and Blaster can enter an unpatched system as soon as it is connected to the Web. They come through an open port on your system. You don't even have to receive email or go to a web site - just being connected is enough. XP SP2 fixes the security holes so you won't get attacked.\n\nThe advantage of this full download is that it can be used on any system - plus it doesn't require an Internet connection to install. You can download SP2, burn it to CD and use it on multiple PCs.\n\n\n\n\n","torrent":{"xt":"urn:btih:5450ad743cb5427efbf9654e9308051ebd3c32e9","amp;dn":"Windows+XP+Service+Pack+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5450ad743cb5427efbf9654e9308051ebd3c32e9","infoHashBuffer":{"type":"Buffer","data":[84,80,173,116,60,181,66,126,251,249,101,78,147,8,5,30,189,60,50,233]},"announce":[],"urlList":[]}}