{"title":"Sexually Broken--Roxy Rox bound, drilled down by machine, hardco","uid":9409331,"size":662303346,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5473fd041682d49f82c59ad2a7068af7badcf846&amp;dn=Sexually+Broken--Roxy+Rox+bound%2C+drilled+down+by+machine%2C+hardco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"merzedes","files":-1,"time":1388241935,"description":"Roxy Rox bound and drilled down by relentless fucking machine, hardcore blowjobs, multiple orgasms! | Roxy Rox | Matt Williams\n\nDecember 27, 2013\n\n\nMP4 only.\n\n\nRoxy Rox is long and lean with a model's body and the cunt of an unrepentant nympho. She got into doing porn because she is such a helpless sex addict she didn't know any other way to get her sexual needs met. We know of only one way to deal with sex addicts of that sort-bind them to a fucking machine and turn it on full blast.\n\nA fucking machine never gets tired, it never slows down, it never needs a break. It is the only solution for an insatiable pussy like Roxy's. Bolted down onto a custom made bondage device in a classic fuck me position with our unrelenting fucking machine screwed into place, Roxy is about to get the dicking down of a lifetime. This setup just might finally succeed in getting her attention. \n\nWith her head hanging down and exposed while the machine is having its way on the other end, we walk up and own the back of her throat. Stuffed from both ends without mercy, Roxy quickly realizes exactly what she has gotten herself into. She takes the cock balls deep, nose on the belly. Credit where credit is due, this one can suck some serious dick. Roxy is brutally throatblasted into subspace as the fucking machine pulls orgasm after orgasm out of that slutty little cunt.\n\nTo properly give her the full Sexuallybroken experience we add a vibrator to the mix. Vibrators, deep full blowjobs, kidney pounding dildos thrusting at maximum speed, they all combine to push this insatiable little nympho to the breaking point. What man can't do, technology can. Roxy lolls in her restraints, eyes clouded and vacant, drool flowing out of her well used mouthhole and juices flowing out of her well used pussy. Welcome to Sexuallybroken Roxy, we know exactly what to do with your type! \n \nScreens  &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_27rrox2/SexuallyBroken-Roxy-Rox-Matt-Williams-Roxy-Rox-bound-and-drilled-down-by-relentless-fucking-machine-hardcore-blowjobs-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_27rrox2/SexuallyBroken-Roxy-Rox-Matt-Williams-Roxy-Rox-bound-and-drilled-down-by-relentless-fucking-machine-hardcore-blowjobs-multiple-orgasms.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:5473fd041682d49f82c59ad2a7068af7badcf846","amp;dn":"Sexually+Broken--Roxy+Rox+bound%2C+drilled+down+by+machine%2C+hardco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5473fd041682d49f82c59ad2a7068af7badcf846","infoHashBuffer":{"type":"Buffer","data":[84,115,253,4,22,130,212,159,130,197,154,210,167,6,138,247,186,220,248,70]},"announce":[],"urlList":[]}}