{"title":"You Are a Brand!: How Smart People Brand Themselves","uid":8343090,"size":2111457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54ec69b9c2ff4853db2ec57d834dfbac39ef830a&amp;dn=You+Are+a+Brand%21%3A+How+Smart+People+Brand+Themselves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365135432,"description":"You Are a Brand!: In Person and Online, How Smart People Brand Themselves for Business Success by Catherine Kaputa\nNicholas Brealey Publishing | 2012 | ISBN: 1857885805 | English | 288 Pages | EPUB | 2 MB\n\nCelebrity entertainers, star athletes, and corporate icons didn't accidentally wind up at the top - they branded their way there. Now you, too, can leverage the power of a personal brand, harness your potential and take charge of your career. Using strategies from the playbook of the Mad Men of Madison Avenue, advertising guru Catherine Kaputa serves as your personal branding coach in YOU ARE A BRAND! 2nd Edition: In Person and Online, How Smart People Brand Themselves for Business Success. Kaputa has revamped her 2007 award-winning classic to include new chapters on crafting your own &quot;elevator speech&quot; and leveraging the power of social media. This updated edition explores strategies and tactics to tap into the power of words, learn the principles of visual identity, think in terms of markets, and execute a self-brand action plan that is unique and memorable. Combining today's hottest business concepts with the realities of the modern workplace, YOU ARE A BRAND! 2nd Edition highlights the self-branding odysseys of savvy professionals and budding entrepreneurs - Catherine Kaputa will coach you to take charge of your career through the one-of-a-kind brand that is YOU. ","torrent":{"xt":"urn:btih:54ec69b9c2ff4853db2ec57d834dfbac39ef830a","amp;dn":"You+Are+a+Brand%21%3A+How+Smart+People+Brand+Themselves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54ec69b9c2ff4853db2ec57d834dfbac39ef830a","infoHashBuffer":{"type":"Buffer","data":[84,236,105,185,194,255,72,83,219,46,197,125,131,77,251,172,57,239,131,10]},"announce":[],"urlList":[]}}