{"title":"Escape the Fate - Ungrateful (Deluxe) (2013) [FLAC] FiH","uid":8470578,"size":364708330,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:552c67efb5faa570023a24dbd5e3f8759706ef36&amp;dn=Escape+the+Fate+-+Ungrateful+%28Deluxe%29+%282013%29+%5BFLAC%5D+FiH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1368473726,"description":"\n  Escape the Fate - Ungrateful (Deluxe) (2013) [FLAC] FiH\n\n  Released: 2013\n  Duration: 46:32\n  Genre: Pop/Rock\n  Style: Post-Hardcore, Screamo, Alternative\n  Source: Scene CD (log + cue + proof)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kpbs\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  01 Ungrateful\n  02 Until We Die \n  03 Live Fast, Die Beautiful \n  04 Forget About Me\n  05 You're Insane \n  06 Chemical Love \n  07 Picture Perfect\n  08 Risk it All\n  09 Desire \n  10 One for the Money \n  11 Fire it Up\n  12 I Alone \n  13 Father, Brother\n\n  Appearing amid the fertile screamo scene of the 2000s, the Las Vegas quintet Escape the Fate prided itself, above all else, on an energetic and visceral live show. The band's formation was propelled in part by MySpace, which vocalist Ronnie Radke and bassist Max Green utilized while searching for new bandmembers after their previous group's demise. The networking site allowed them to recruit guitarist Bryan Money, who subsequently brought along Vegas transplant (and former Lovehatehero guitarist) Omar Espinoza. Drummer Robert Ortiz joined thereafter to complete the group. Debuting live barely one month later, the guys found early success via local radio outlets and quickly amassed a devoted hometown following.\n\n  By September 2005, Escape the Fate had won a local radio contest judged by My Chemical Romance. The gig awarded them the opportunity to open a show on the band's headlining tour with Alkaline Trio and Reggie and the Full Effect, which subsequently led to Escape the Fate's record deal with Epitaph. Their debut five-song EP, There's No Sympathy for the Dead, appeared in May 2006. Tour dates followed throughout the summer months, but the band took a break from the road several weeks before the September release of Dying Is Your Latest Fashion, citing personal issues. The album fared well, however, and the band resumed touring soon after. Guitarist Espinoza amicably left the group in 2007, and Ronnie Radke was ousted one year later due to continued drug problems and one charge of battery (which indirectly resulted in the death of an 18-year-old young man). Escape the Fate recruited former blessthefall vocalist Craig Mabbitt to fill the vacant frontman position, and the revised lineup immediately hit the studio in mid-2008 to record a sophomore album. This War Is Ours was released that October and debuted at number 35 on the Billboard charts.","torrent":{"xt":"urn:btih:552c67efb5faa570023a24dbd5e3f8759706ef36","amp;dn":"Escape+the+Fate+-+Ungrateful+%28Deluxe%29+%282013%29+%5BFLAC%5D+FiH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552c67efb5faa570023a24dbd5e3f8759706ef36","infoHashBuffer":{"type":"Buffer","data":[85,44,103,239,181,250,165,112,2,58,36,219,213,227,248,117,151,6,239,54]},"announce":[],"urlList":[]}}