{"title":"Sexually Broken--Tagteamed Twins Emma Hazie and Odette Delacroix","uid":9918506,"size":2339986833,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:55897a21c89858180427695d3ec5562ca227e428&amp;dn=Sexually+Broken--Tagteamed+Twins+Emma+Hazie+and+Odette+Delacroix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"merzedes","files":-1,"time":1396976364,"description":"\nTagteamed twosome! Twins Emma Hazie and Odette Delacroix take brutal deepthroat, sexually disgraced! | Odette Delacroix | Emma Haize | Matt Williams\n\nApril 7, 2014\n\n\niPod, High and Low bitrate MP4 + Pics.\n\n\nTag teamed twins Odette Delacroiz and Emma Haize are here today to be turned into a pair of throat pussies. Both these tiny things have proved their worth in completely opening up their faceholes for the dick. And today we are going to reward them properly for their hard earned skills acquired over the service of many a dick. These two are are going to get a front row seat to the action of the other right here on the Sexuallybroken stage as we make them face off.\n\nWe start off by binding their arms behind them, effectively immobilizing them on the spot. Then we mash their little faces together and have them kiss. The sight of these two sucking face inspires us and we drop them down to their knees to use them for their true purpose. Heads tilted back, mouth open, throats wide. Rock hard cock down the back of the gullet. The gurgles and moans that emerge are music to our ears. We pick up the pace.\n\nStanding them back up we have them strip off their panties and Emma is promptly bent over and railed. She takes every inch without protest. Now that their underwear is out of the way, it is time for the real action. Shoved back down to the ground, crotch rope is added to their smooth clean shaved pussies. The crotch rope provides just the right amount of tension and pressure to keep them focused on the task at hand.\n\nWe keep up the punishing pace of the deep throat, cranking their heads back. Both of them are locked in the zone of sexual subspace, used hard, fast and without mercy. After a though plowing of their throatmeat, we yank up the crotchrope. Both of these bunnies dangle, their thin limbs restrained, the pain shooting through their bound bodies. We leave them hanging out like drying laundry. It is a fitting fate for throat sluts such as them... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_07odelacroix_ehaize/SexuallyBroken-Odette-Delacroix-Emma-Haize-Matt-Williams-Tagteamed-twosome-Twins-Emma-Hazie-and-Odette-Delacroix-take-brutal-deepthroat-sexually-disgraced.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_07odelacroix_ehaize/SexuallyBroken-Odette-Delacroix-Emma-Haize-Matt-Williams-Tagteamed-twosome-Twins-Emma-Hazie-and-Odette-Delacroix-take-brutal-deepthroat-sexually-disgraced.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:55897a21c89858180427695d3ec5562ca227e428","amp;dn":"Sexually+Broken--Tagteamed+Twins+Emma+Hazie+and+Odette+Delacroix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55897a21c89858180427695d3ec5562ca227e428","infoHashBuffer":{"type":"Buffer","data":[85,137,122,33,200,152,88,24,4,39,105,93,62,197,86,44,162,39,228,40]},"announce":[],"urlList":[]}}