{"title":"DANGERDOOM (Danger Mouse, MF Doom) - The Mouse And The Mask, 200","uid":6787909,"size":33356372,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:560a22d4470fabcfd9a43df0632a8199765cbf61&amp;dn=DANGERDOOM+%28Danger+Mouse%2C+MF+Doom%29+-+The+Mouse+And+The+Mask%2C+200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dominant133","files":15,"time":1320167585,"description":"TWO OF THIS GENERATION\\\\\\\\\\\\\\'S MOST RESPECTED HIP-HOP ARTISTS, DANGER MOUSE AND MF DOOM, HAVE COME TOGETHER TO PRODUCE DANGERDOOM: THE MOUSE AND THE MASK, AN ALBUM INSPIRED BY ADULT SWIM, CARTOON NETWORK\\\\\\\\\\\\\\'S POPULAR LATE-NIGHT ANIMATION NETWORK. THE ALBUM, SET TO DEBUT IN OCTOBER 2005, WILL BE RELEASED ON EPITAPH RECORDS, IN ASSOCIATION WITH ADULT SWIM. THE ALBUM WILL CONTAIN CHARACTER VOICES AND SKITS FROM ADULT SWIM\\\\\\\\\\\\\\'S MOST POPULAR ORIGINAL SHOWS, INCLUDING AQUA TEEN HUNGER FORCE, SEALAB 2021 AND HARVY BIRDMAN, ATTORNEY AT LAW.\n\nDANGER MOUSE IS RECOGNIZED AS ONE OF THE MUSIC\\\\\\\\\\\\\\'S MOST INNOVATIVE ARTISTS AND PRODUCERS. DANGER MOUSE\\\\\\\\\\\\\\'S THE GREY ALBUM, AN INGENIOUS RE-PRODUCTION OF JAY-Z\\\\\\\\\\\\\\'S BLACK ALBUM WITH THE BEATLES\\\\\\\\\\\\\\' WHITE ALBUM, WAS NAMED THE ALBUM-OF-THE-YEAR IN 2004 BY ENTERTAINMENT WEEKLY AND CATAPULTED HIM INTO THE INTERNATIONAL SPOTLIGHT. DANGER MOUSE RECENTLY PRODUCED GORILLAZ DEMON DAYZ ALBUM, WHICH HAS SOLD MORE THAN 500,000 COPIES WORLDWIDE IN IT\\\\\\\\\\\\\\'S INITIAL FIRST WEEKS OF RELEASE. HIS NEXT PROJECT IS GNARLS BARKLEY, A COLLABORATION WITH MUSIC\\\\\\\\\\\\\\'S FLAMBOYANT, ONE OF A KIND FORCE OF NATURE CEE-LO.\n\nAFTER A FIVE-YEAR HIATUS, THAT ENDED IN 1998, A FORMER MEMBER OF KMD EMERGED AS MF DOOM, A PERSONA INSPIRED BY THE COMIC SUPERVILLAIN DR. DOOM, AND RELEASED THE CRITICALLY PRAISED ALBUMS OPERATION: DOOMSDAY AND MMM...FOOD. DOOM ALSO RELEASED ON OF 2004\\\\\\\\\\\\\\'S MOST ACCLAIMED ALBUMS, MADVILLAIN (FEATURED IN SPIN, ROLLING STONE, VIBE, THE NEW YORKER, ETC), UNDER THE SAME NAME AND VENOMOUS VILLIAN UNDER THE NAME VICTOR VAUGHT. HE HAS BEEN INVOLVED IN A NUMBER OF COLLABORATIONS WITH THE INDUSTRY\\\\\\\\\\\\\\'S FINEST AND HAS A PROJECT WITH GHOSTFACE KILLAH (WU-TANG CLAN) IN THE WORKS.\t\t","torrent":{"xt":"urn:btih:560a22d4470fabcfd9a43df0632a8199765cbf61","amp;dn":"DANGERDOOM+%28Danger+Mouse%2C+MF+Doom%29+-+The+Mouse+And+The+Mask%2C+200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"560a22d4470fabcfd9a43df0632a8199765cbf61","infoHashBuffer":{"type":"Buffer","data":[86,10,34,212,71,15,171,207,217,164,61,240,99,42,129,153,118,92,191,97]},"announce":[],"urlList":[]}}