{"title":"Objective-C for Absolute Beginners","uid":6492479,"size":14573597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:568b996bf79447b23706027b44d0b54a4515ddc7&amp;dn=Objective-C+for+Absolute+Beginners&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheBookie","files":-1,"time":1308937225,"description":"Objective-C for Absolute Beginners: iPhone and Mac Programming Made Easy (2010)\nPDF\n\nBy Gary Bennett, Brad Lees, Mitchell Fisher\nISBN13: 978-1-4302-2832-5\nISBN10: 1-4302-2832-6\n296 pp.\nWill Publish Aug 2010\n\nIt seems as if everyone is writing applications for Apples iPhone and iPad, but how do they all do it? ItÃƒÂ¢Ã‚â‚¬s best to learn Objective-C, the native language of both the iOSand Mac OS X, but where to begin? Right here, even if youve never programmed before!\n\nObjective-C for Absolute Beginners will teach you how to write software for your Mac, iPhone,or iPad using Objective-C, an elegant and powerful language with a rich set of developer tools. Using a hands-on approach, youll learn to think in programming terms, how to use Objective-C to build program logic, and how towrite your own applications and apps.\n\nWith over 50 collective years in software development and based on an approach pioneered at Carnegie Mellon University, the authors have developed a remarkably effective approach to learning Objective-C. Since the introduction of Apples iPhone, theauthors have taught hundreds of absolute beginners how to develop Mac, iPhone,and iPad apps, including many that became popular apps in the iTunes App Store.\n\nWhat youll learn\nThe fundamentals of computer programming: how to understand variables,design data structures, and work with file systems\nThe logic of object-oriented programming: how to use Classes, Objects, and Methods\nThe flexibility of Apples developer tools: how to install Xcode and write programs in Objective-C\nThe power of Cocoa and Cocoa touch: how to make Mac OS Xapplications or iOS apps that do cool stuff\nWho this book is for\nEveryone! This book is for anyone who wants to learn to develop applications for the Mac or apps for the iPhone and iPad using the Objective-C programming language. No previous programming experience is necessary.\n\n","torrent":{"xt":"urn:btih:568b996bf79447b23706027b44d0b54a4515ddc7","amp;dn":"Objective-C+for+Absolute+Beginners","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"568b996bf79447b23706027b44d0b54a4515ddc7","infoHashBuffer":{"type":"Buffer","data":[86,139,153,107,247,148,71,178,55,6,2,123,68,208,181,74,69,21,221,199]},"announce":[],"urlList":[]}}