{"title":"Greg Graffin - Cold as the Clay [2006][EAC,log,cue. FLAC]","uid":8700752,"size":214875569,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:570a82a669364ef5fb9ad666f8e4af4afc85424f&amp;dn=Greg+Graffin+-+Cold+as+the+Clay+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":14,"time":1374062025,"description":"Artist:Greg Graffin\nRelease:Cold as the Clay\nReleased: 2006\nLabel: ANTI-\nCatalog#: 86809-2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:Indie Folk rock\n\n1.\tDon't Be Afraid to Run (4:12)\n2.\tOmie Wise (3:54)\n3.\tCold as the Clay (3:20)\n4.\tLittle Sadie (2:36)\n5.\tHighway (2:34)\n6.\tRebel's Goodbye (3:53)\n7.\tTalk About Suffering (w. Jolie Holland) (3:37)\n8.\tWillie Moore (3:57)\n9.\tCalifornia Cotton Fields (w. Jolie Holland (2:32)\n10.\tThe Watchmaker's Dial (2:31)\n11.\tOne More Hill (3:03)\n\nFollowing a solo album released in 1997 under the alias American Lesion, Cold as the Clay comes as the first effort from Bad Religion frontman Greg Graffin issued under his own name. Unlike the simple singer/songwriter approach of American Lesion, this album finds Graffin -- backed by members of the Weakerthans, among other musicians -- paying homage to his early upbringing in Wisconsin (where family singalongs were prevalent) with what the album sticker proclaims as &quot;a heart-rending collection of old-timey American folk.&quot; And essentially, that's exactly what Cold as the Clay is. Recorded and mixed in a week with players sitting in the studio as though around a campfire, the reflective songs range from mere acoustic numbers to ones that further incorporate banjo, mandolin, harmonica, and more. Graffin penned five of the 11 songs presented, the rest of the record containing reworked versions of traditional classics; however, all tracks intermingle as though they were always from the same time period and nothing sounds contrived. And even with the absolute lack of the revved-up punk that Graffin is normally associated with -- which may catch some Bad Religion fans off guard -- his distinctive unwavering vocal delivery remains the exact same. From the weary resilience of &quot;Don't Be Afraid to Run&quot; to the spiritual lament of &quot;One More Hill&quot; to the harmony-laden (with Jolie Holland) &quot;Talk About Suffering,&quot; the album draws its strength from Graffin's compelling presence. Take away the banjos, turn up the speed, and Cold as the Clay could very well pass as a stripped-down Bad Religion record. This fact is even more interesting when one thinks about how much folk music has obviously inspired Graffin, and consequently, Bad Religion as well -- not to mention every band subsequently influenced by their music. As aforementioned, this album will not be everyone's cup of tea. Still, there's really nothing better than stripping such a potent singer as Graffin down to his roots. And when the folky result is as engaging as it is comforting, well, Cold as the Clay shouldn't be missed.","torrent":{"xt":"urn:btih:570a82a669364ef5fb9ad666f8e4af4afc85424f","amp;dn":"Greg+Graffin+-+Cold+as+the+Clay+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570a82a669364ef5fb9ad666f8e4af4afc85424f","infoHashBuffer":{"type":"Buffer","data":[87,10,130,166,105,54,78,245,251,154,214,102,248,228,175,74,252,133,66,79]},"announce":[],"urlList":[]}}