{"title":"Andy Wachowski + Larry Wachowski - Bound (1996)","uid":5076299,"size":1614169736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:577edff7c323fa82be77590149edcb7564be7348&amp;dn=Andy+Wachowski+%2B+Larry+Wachowski+-+Bound+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1251872020,"description":"Andy Wachowski + Larry Wachowski - Bound (1996)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0115736&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0115736&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51BRDFP1Y7L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51BRDFP1Y7L.jpg&lt;/a&gt;\n\nBefore the Wachowski Brothers did The Matrix, there was the erotic thriller, Bound, starring Jennifer Tilly, Gina Gershon, Joe Pantoliano, John P. Ryan, and Christopher Meloni. This was a low budget movie (four-and-a-half million dollars) that was to be the calling card for Andy and Larry Wachowski so that they could eventually do The Matrix series. They both wrote and directed Bound, demonstrating their unbelievable talent in making a film that would quickly become a cult classic in just a few short years. The script was sharp and fresh with more twists in it than a pretzel. They were able to get the two sexiest women in Hollywood at the time (Tilly and Gershon) to play the leads with Joe Pantoliano agreeing to take a cut in salary for his role as Caesar. They got a great Production Designer, Editor and Director of Photography to make Bound's appearance to be more film noir in essence with its dark tones and shadows and sparse cutting. The rest as they say is history.\n\nBound deals with Corky (played by Gershon), who just got out of prison after having served five years for what she calls a distribution of funds, or stealing. She was betrayed by her female partner and therefore has a severe lack of trust in those around her. She takes a job as a maintenance repair guy in a Chicago condo building and soon meets the vibrant and sexy Violet (played to the hilt by Tilly), who's the girlfriend of Caesar, a money launderer for the Mob. The couple live in the condo right next to the one that Corky is doing repairs in. The attraction between Corky and Violet is immediate, and it isn't long before Violet sexually seduces her. Corky knows trouble when she sees it, but that doesn't stop her from giving in to Violet's manipulations. It isn't long, however, before Violet makes the suggestion to her new lover that they steal two million dollars of the Mob's money, allowing Caesar to take the fall for its lost. What a deal--two million dollars, plus Violet. How could any man, or woman, say no to that. Of course, nothing goes according to the plan as all hell breaks lose with Caesar doing just the opposite of what the two ladies had hoped for. Then, there's the question of whether or not Corky will once again find herself being betrayed by the woman she cares about. Any and everything can happen before the ending is reached as betrayal, torture and murder become the norm for this outstanding film.\n\nThis movie is everything a viewer could hope for. It's scary, funny and sexy to the ninth degree. Tilly and Gershon heat up the screen with their lovemaking and dubious intentions. They capture theirs roles with perfect aplomb, delighting in the subtle nuances that each brings to their particular character and playing off of it. Joe Pantoliano does a great job as the man who's caught in the middle of these two black widows, refusing to go down without a fight. One big surprise is how great John Ryan is as Mickey, a boss for the Mob. The guy is downright scary in his performance. He never raises his voice or over reacts--just a steady force to be reckoned with. Christopher Meloni as crazy Johnnie Marzzone brings in the laughs with his wicked sense of humor in the most dour of situations like when an accountant for the Mob is being tortured about the money he's stolen. When a finger is cut off and falls to the bathroom floor, Johnnie says, &quot;Oops. You dropped something.&quot; Bound is a slick, classy film with top performances by its actors that totally deserves all of the recognition it's received over the years. It's a movie that you can certainly watch over and over. I will say that there isn't much in the way of extras on the DVD, but the film commentary is great. Jennifer Tilly shows up during the last third of the commentary and basically steals the show away from the Wachowski Brothers and Joe Pantoliano. She won't let anyone get in a word edgewise and acknowledges that she sometimes talks too much. Gershon shows up a few minutes later, and they both have fun razing Joe about his semi-nude scenes in the movie and his overall acting. Needless to say, the commentary is loads of fun. Bound is the type of movie that gives me hope for Hollywood. This is what filmmaking is all about, and it goes to show that fantastic movies can be made on a shoestring budget. You don't need two-hundred million dollars to make a classic.\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b2.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b3.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b4.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b5.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b5.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b6.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/b6.png&lt;/a&gt;\n\n----------my rip----------\n\n------dual audio with commentary------\n\n\t~~~~~~ Bound.avi ~~~~~~\n\nFile Size (in bytes):...........................1,569,935,360\n\n--- Video Information ---\nVideo Codec Name:...............................XviD ISO MPEG-4\nDuration (hh:mm:ss):............................1:48:31\nFrame Count:....................................156091\nFrame Width (pixels):...........................624\nFrame Height (pixels):..........................336\nAspect Ratio:...................................1.857\nFrames Per Second:..............................23.976\nVideo Bitrate (kbps):...........................1531\n......MPEG-4......B-VOP........................\nQuality Factor (bits/pixel)/frame:..............0.305&quot;\n\n--- Audio Information ---\nAudio Codec:....................................0x0055 MPEG-1 Layer 3\nAudio Sample Rate (Hz):.........................48000\nAudio Bitrate(kbps):............................192\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR\nAudio Channel Count:............................2 \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:577edff7c323fa82be77590149edcb7564be7348","amp;dn":"Andy+Wachowski+%2B+Larry+Wachowski+-+Bound+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"577edff7c323fa82be77590149edcb7564be7348","infoHashBuffer":{"type":"Buffer","data":[87,126,223,247,195,35,250,130,190,119,89,1,73,237,203,117,100,190,115,72]},"announce":[],"urlList":[]}}