{"title":"The Specials - Ghost Town","uid":4528682,"size":40177966,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:58390b16bcfe5e543813e57c445e5064a714ced6&amp;dn=The+Specials+-+Ghost+Town&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Blindpew","files":-1,"time":1227465182,"description":"Video promo\n640x480\nxvid\n\nThe song was written in response to Margaret Thatcher&amp;#039;s policies which the band believed would increase the large-scale unemployment already present in United Kingdom, particularly in Scotland and England&amp;#039;s industrialised north and Midlands regions. This was highly relevant to The Specials as they formed and lived in Coventry and saw the effects of the policies first-hand, as their city experienced some of the UK&amp;#039;s worst unemployment at levels of 20%. It was also the summer of large-scale riots in Brixton, London and Toxteth, Liverpool amongst others, where there was alleged heavy-handed police treatment of young black men. Indeed the single was unusual in that it hit the top of the UK Top 40 at the exact time that riots occurred on the streets of Great Britain. It was one of those rare occasions when music reflected the social circumstances of the country succinctly.\n\nThe song spent three weeks at number one and ten weeks in the top 40 of the UK Singles Chart overall and is thought to be their honest impression of Coventry in 1981, although some believe it was inspired following one of the band&amp;#039;s concerts in Glasgow. The track was recorded at the Woodbine Street Recording Studios in Leamington Spa, Warwickshire.\n\nDespite being a song about Coventry, the band chose to film the video of themselves driving a Vauxhall Cresta around some empty London streets.\n\nGhost Town was at number one in the UK charts during the run-up to the wedding of Prince Charles and Lady Diana Spencer amid much royalty-inspired patriotic rejoicing. This ironic juxtaposition is similar to the notorious events of the Silver Jubilee of 1977 when the Sex Pistols version of &quot;God Save the Queen&quot; was widely believed to have been the rightful number one during the week of celebrations despite being officially eclipsed by Rod Stewart.\n\nThe club referred to in the lines &quot;All the clubs are being closed down&quot; and &quot;Too much fighting on the dance floor&quot; was The Locarno - which was also the club setting the scene for the b-side song, &quot;Friday Night Saturday Morning&quot;. It is now Coventry Central Library.","torrent":{"xt":"urn:btih:58390b16bcfe5e543813e57c445e5064a714ced6","amp;dn":"The+Specials+-+Ghost+Town","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58390b16bcfe5e543813e57c445e5064a714ced6","infoHashBuffer":{"type":"Buffer","data":[88,57,11,22,188,254,94,84,56,19,229,124,68,94,80,100,167,20,206,214]},"announce":[],"urlList":[]}}