{"title":"Forever Love Series (1-2) by J.S. Cooper [MU]","uid":8663124,"size":2384470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58b24e38f95eb414844916543a56249a6d2853c1&amp;dn=Forever+Love+Series+%281-2%29+by+J.S.+Cooper+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1373351306,"description":"Forever Love Series (1-2) by J.S. Cooper in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nCalibre - http://calibre-ebook.com/\nOnline - http://ebook.online-convert.com \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter\n\nThe Last Boyfriend (Forever Love #1) by J.S. Cooper (May 5th 2013)\n\nLucky Morgan has had her share of heartbreak. She is devastated when her boyfriend dumps her after sleeping with him and she vows to herself that she won't be used again. She decides that the next guy she dates and sleeps with, will be her one true love.\n\nZane Beaumont is the mysterious and snooty guy that comes into her diner every Friday night with a different girl. He's the type of guy she's learned to avoid: carefree, fast, handsome, rich, and sarcastic. Unfortunately, she can't stop thinking about the devilish gleam in his eyes.\n\nWhen Lucky's car breaks down one night after a party, it is Zane who comes to her rescue. As Zane attempts to sweep Lucky off of her feet, she soon realizes that nothing is as it seems and that Zane may very well be the guy for whom she changes the rules. That is until she meets Braydon.\n\nThe Last Husband (Forever Love #2) by J.S. Cooper (June 26th 2013)\n\nThousands of readers fell in love with Lucky and Zane in The Last Boyfriend and now their story of love, hope and redemption is continued in The Last Husband.\n\nLucky Morgan gave up her dating rules for Zane Beaumont and allowed him to sweep her off of her feet; even though he didn't really believe in love. However, as their relationship progresses, Lucky realizes that Zane isn't the man she thought he was.\n\nZane Beaumont has spent the last few months trying to ignore Lucky's smile and trying to exact revenge on Braydon Eagle. Zane will stop at nothing to bring down the man he holds responsible for his brothers death; even if it means risking his new relationship with Lucky. \n\nWhen heartbreaking secrets from the past are revealed, the fragile trust and love they have built together is put in jeopardy.. Lucky and Zane are left to decide if they can overcome the new painful revelations that are threatening to break both of their hearts so that they can focus on their future together.\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:58b24e38f95eb414844916543a56249a6d2853c1","amp;dn":"Forever+Love+Series+%281-2%29+by+J.S.+Cooper+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58b24e38f95eb414844916543a56249a6d2853c1","infoHashBuffer":{"type":"Buffer","data":[88,178,78,56,249,94,180,20,132,73,22,84,58,86,36,154,109,40,83,193]},"announce":[],"urlList":[]}}