{"title":"Soul Made Flesh- Carl Zimmer [Epub &amp; Mobi] [StormRG]","uid":11568174,"size":2496681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:596456ebe1ce971b8d3f488780461d4f6b8f37b3&amp;dn=Soul+Made+Flesh-+Carl+Zimmer+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":4,"time":1416976948,"description":"TITLE/EDITION Soul Made Flesh: The Discovery of the Brain--and How it Changed the World\nAuthor: Carl Zimmer \nPaperback: 384 pages\nPublisher: Atria Books; Reprint edition (June 6, 2005)\nLanguage: English\nISBN-10: 0743272056\nISBN-13: 978-0743272056\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nIn this unprecedented history of a scientific revolution, award-winning author and journalist Carl Zimmer tells the definitive story of the dawn of the age of the brain and modern consciousness. Told here for the first time, the dramatic tale of how the secrets of the brain were discovered in seventeenth-century England unfolds against a turbulent backdrop of civil war, the Great Fire of London, and plague. At the beginning of that chaotic century, no one knew how the brain worked or even what it looked like intact. But by the century's close, even the most common conceptions and dominant philosophies had been completely overturned, supplanted by a radical new vision of man, God, and the universe. \nPresiding over the rise of this new scientific paradigm was the founder of modern neurology, Thomas Willis, a fascinating, sympathetic, even heroic figure at the center of an extraordinary group of scientists and philosophers known as the Oxford circle. Chronicled here in vivid detail are their groundbreaking revelations and the often gory experiments that first enshrined the brain as the physical seat of intelligence -- and the seat of the human soul. Soul Made Flesh conveys a contagious appreciation for the brain, its structure, and its many marvelous functions, and the implications for human identity, mind, and morality","torrent":{"xt":"urn:btih:596456ebe1ce971b8d3f488780461d4f6b8f37b3","amp;dn":"Soul+Made+Flesh-+Carl+Zimmer+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"596456ebe1ce971b8d3f488780461d4f6b8f37b3","infoHashBuffer":{"type":"Buffer","data":[89,100,86,235,225,206,151,27,141,63,72,135,128,70,29,79,107,143,55,179]},"announce":[],"urlList":[]}}