{"title":"Harley Quinn (1992-2014) Batman Animated COMPLETE COLLECTION","uid":12193604,"size":13432869633,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:596f90f0e8d20bc42b0387ea171f9eb71db3c345&amp;dn=Harley+Quinn+%281992-2014%29+Batman+Animated+COMPLETE+COLLECTION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0nixx","files":88,"time":1438701706,"description":"__________________________________________\n\nâ–‚â–ƒâ–„â–…â–†â–‡â–ˆâ–“â–’â–‘the 0nixx Pearlâ–‘â–’â–“â–ˆâ–‡â–†â–…â–„â–ƒâ–‚\n__________________________________________\n\nHarley Quinn (1992-2014) Batman Animated Cartoon Series COMPLETE \n\nCOLLECTION All Episodes\n\n\nCreated for all the Harley Quinn fans!!!\n\nThis is my first torrent creation.  I have been enjoying \n\ndownloads for years and have always wanted to create one, but it \n\nseems that anything I thought of was already uploaded.  With the \n\nannouncement of the new new Suicide Squad 2016 movie, I became \n\ncurious about Harley Quinn's origins.  So I looked into it and \n\ndiscovered that her comic book origin collection had already \n\nbeen created, but not her animated cartoon origins.  Thus, this \n\ntorrent was created.   \n\nI deserve no credit.  This is just a collection of other video \n\nfiles that I have combined together.  I changed the files names \n\nso that they are all uniformly labeled so that they may be \n\nplayed easily in chronological order.  It contains all of the \n\nepisodes in which HARLEY QUINN makes an appearance and also \n\nmovies and tv specials.  It contains every episode from her \n\ndebut in the 1992 Batman Animated Series episode &quot;Joker's Favor&quot; \n\nto the 2015 online webisode &quot;Twisted&quot;.  I did not encode or rip \n\nany of these files except for the Gotham Girls (2002) episodes.  \n\nGotham Girls was originally in Shockwave Flash format that I \n\nconverted to mp4's for easy viewing.  I used freeware to do it \n\nso they have a watermark in the upper left corner, but it \n\ndoesn't affect the videos.  I also included the original \n\nShockwave files encase you wanted to view them in their original \n\nformat.\n\nHarley Quinn plays major supporting role in most of the episodes \n\nexcept for a few.  She has small cameo appearances in the Robot \n\nChickens, Lego Batman, and Batman Beyond to name a few, but \n\nnevertheless she's in them so I included them.  Overall, I am \n\npretty pleased with how it turned out.  \n\nI'd like to say thank you to the piratebay and all the seeders \n\nfor making information and entertainment easily accessible to \n\nall.\n\n\n0nixx","torrent":{"xt":"urn:btih:596f90f0e8d20bc42b0387ea171f9eb71db3c345","amp;dn":"Harley+Quinn+%281992-2014%29+Batman+Animated+COMPLETE+COLLECTION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"596f90f0e8d20bc42b0387ea171f9eb71db3c345","infoHashBuffer":{"type":"Buffer","data":[89,111,144,240,232,210,11,196,43,3,135,234,23,31,158,183,29,179,195,69]},"announce":[],"urlList":[]}}