{"title":"Banner Saga 2 v1.0.20 Android","uid":15963160,"size":39713171,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:599d9b9fdad243042fd7dba8ea96553ab48019d7&amp;dn=Banner+Saga+2+v1.0.20+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":".BONE.","files":1,"time":1475696342,"description":"The epic award winning story-based role-playing game continues its emotional journey across a breaking world. \r\nLead your Viking clans across hostile country on the brink of collapse. Make bold leadership decisions, manage resources wisely and strike skillfully in battle to survive another day in the harsh wild.\r\nExperience the epic story that took the indie gaming world by storm in Banner Saga 2!\r\n\r\nFeatures:\r\n• Hand-drawn visuals – Gorgeous 2D combat sequences, animations and effects\r\n• The saga continues – Carry on your story and choices from The Banner Saga or jump into the adventure from scratch with pre-set character options.\r\n• Viking mythology – A truly epic setting inspired by real Viking myths\r\n• Tactical combat – Improved, turn-based battles demand precision and strategy\r\n• RPG upgrades – Level up your characters’ stats and unlock devastating new moves\r\n• Hard choices – Choose wisely in and out of battle as danger lurks around each corner\r\n• Real consequences – Permanent loss of characters will weigh heavy on your mind\r\n• New characters and a new race – New faces, including the new Horseborn race, join your epic journey\r\n• Manage your caravan - Your role in building and managing your caravan is critical to not only your own survival but the survival of an entire civilization\r\n• Evocative score - Soundtrack by Grammy-nominated composer Austin Wintory\r\nStruggle for survival in a brutal and breaking world in Banner Saga 2, the merciless strategy role-playing game where your choices really matter.\r\nDownload Banner Saga 2 and begin your epic journey today.\r\n\r\nWhat's in this version : (Updated : 28 September 2016)\r\nNo recent changes\r\nRequired Android O/S : 4.1 and up\r\n\r\nInstall APK\r\nDownload DATA via wifi in app\r\nENJOY","torrent":{"xt":"urn:btih:599d9b9fdad243042fd7dba8ea96553ab48019d7","amp;dn":"Banner+Saga+2+v1.0.20+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"599d9b9fdad243042fd7dba8ea96553ab48019d7","infoHashBuffer":{"type":"Buffer","data":[89,157,155,159,218,210,67,4,47,215,219,168,234,150,85,58,180,128,25,215]},"announce":[],"urlList":[]}}