{"title":"Phantasia - The Woman in White Suite. Julian Lloyd Webber, Sarah","uid":4047418,"size":146141304,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5a6b69017ca4343264c32b7b25d6ec3efac86672&amp;dn=Phantasia+-+The+Woman+in+White+Suite.+Julian+Lloyd+Webber%2C+Sarah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rblac","files":4,"time":1203989111,"description":"Phantasia\nJulian Lloyd Webber (Performer), Geoffrey Alexander (Composer), Andrew Lloyd Webber (Composer), Simon Lee (Conductor), London Orchestra (Orchestra), Sarah Chang (Performer) \n\n--------------------------------------------------------------------------------\n\nOn this CD: \nPhantasia, for violin, cello &amp; orchestra (after Lloyd Webber&amp;#039;s Phantom of the Opera) \nComposed by Geoffrey Alexander \nPerformed by Sylvia Addison, Peter Manning, The London Orchestra \nwith Julian Lloyd Webber, Sarah Chang \nConducted by Simon Lee \n\n\nThe Woman in White Suite, for orchestra (arr. Laurence Roman) \nComposed by Andrew Lloyd Webber \nPerformed by Sylvia Addison, Peter Manning, The London Orchestra \nConducted by Simon Lee \n\n--------------------------------------------------------------------------------\n\nEditorial Reviews\n\nAmazon.com\nThe arrangers of these Andrew Lloyd Webber works aspire to carry on the operatic tradition of Mozart, Verdi, and Wagner by transforming his vocal compositions into independent instrumental pieces. But the music&amp;#039;s origin in theater and film is unmistakable, and the transitions between the tunes and sections are pretty bumpy. Phantasia combines material from both the stage and movie versions of The Phantom of the Opera in a double concerto which showcases a virtuoso violinist and cellist with brilliant cadenzas, runs, and soaring stratospheric flights. It also casts them as the play&amp;#039;s protagonists in ardently passionate love duets. Although the cello part was written for the composer&amp;#039;s brother, who plays it very well, Sarah Chang easily steals the show, especially in this technically and tonally stunning, all-out performance. The two soloists play with and off each other, projecting an infectious sense of sheer exuberant enjoyment. The Woman in White Suite conveys the spooky as well as the pastoral and passionate elements of Collins&amp;#039;s gothic mystery story and features dances in various styles: straight and parodistic waltzes and tangos and jazzy rhythms. The composer&amp;#039;s orchestrations are lush, veering between whispers and crashes, so keep a finger on the volume control. --Edith Eisler ","torrent":{"xt":"urn:btih:5a6b69017ca4343264c32b7b25d6ec3efac86672","amp;dn":"Phantasia+-+The+Woman+in+White+Suite.+Julian+Lloyd+Webber%2C+Sarah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a6b69017ca4343264c32b7b25d6ec3efac86672","infoHashBuffer":{"type":"Buffer","data":[90,107,105,1,124,164,52,50,100,195,43,123,37,214,236,62,250,200,102,114]},"announce":[],"urlList":[]}}