{"title":"Isabel Wilkerson The Warmth of Other Suns 2010 Retail EPUB eBook","uid":8214320,"size":2766743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b15ed5046d0dfe931f6e90daa64766b6eeed258&amp;dn=Isabel+Wilkerson+The+Warmth+of+Other+Suns+2010+Retail+EPUB+eBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BlackTar","files":3,"time":1362310672,"description":" |                       The Warmth of Other Suns                             |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n | DATE: 2012-06-06  SIZE: 2,59MB   DISKS: 01_______4,77MB      PAGES:        |\n |                                                                            |\n | PUBLISHER: Knopf Doubleday Publishing Group  GENRE: Fiction                |\n |                                                                            |\n | AUTHOR: Isabel Wilkerson                                                   |\n |                                                                            |\n | FORMAT: EPUB   PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL:                                                  |\n |                                                                            |\n | LANGUAGE: English   ISBN: 978-0-679-60407-5                                |\n :                                                                            :\n : In this epic, beautifully written masterwork, Pulitzer Prize--winning      :\n : author Isabel Wilkerson chronicles one of the great untold stories of      :\n : American history: the decades-long migration of black citizens who fled the:\n : South for northern and western cities, in search of a better life. From    :\n : 1915 to 1970, this exodus of almost six million people changed the face of :\n : America. Wilkerson compares this epic migration to the migrations of other :\n : peoples in history. She interviewed more than a thousand people, and gained:\n : access to new data and official records, to write this definitive and      :\n : vividly dramatic account of how these American journeys unfolded, altering :\n : our cities, our country, and ourselves.                                    :\n :                                                                            :\n : With stunning historical detail, Wilkerson tells this story through the    :\n : lives of three unique individuals: Ida Mae Gladney, who in 1937 left       :\n : sharecropping and prejudice in Mississippi for Chicago, where she achieved :\n : quiet blue-collar success and, in old age, voted for Barack Obama when he  :\n : ran for an Illinois Senate seat; sharp and quick-tempered George Starling, :\n : who in 1945 fled Florida for Harlem, where he endangered his job fighting  :\n : for civil rights, saw his family fall, and finally found peace in God; and :\n : Robert Foster, who left Louisiana in 1953 to pursue a medical career, the  :\n : personal physician to Ray Charles as part of a glitteringly successful     :\n : medical career, which allowed him to purchase a grand home where he often  :\n : threw exuberant parties.                                                   :\n :                                                                            :\n : Wilkerson brilliantly captures their first treacherous and exhausting      :\n : cross-country trips by car and train and their new lives in colonies that  :\n : grew into ghettos, as well as how they changed these cities with southern  :\n : food, faith, and culture and improved them with discipline, drive, and hard:\n : work. Both a riveting microcosm and a major assessment, The Warmth of Other:\n : Suns is a bold, remarkable, and riveting work, a superb account of an      :\n : &quot;unrecognized immigration&quot; within our own land. Through the breadth of its :\n : narrative, the beauty of the writing, the depth of its research, and the   :\n : fullness of the people and lives portrayed herein, this book is destined to:\n : become a classic.                                                          :","torrent":{"xt":"urn:btih:5b15ed5046d0dfe931f6e90daa64766b6eeed258","amp;dn":"Isabel+Wilkerson+The+Warmth+of+Other+Suns+2010+Retail+EPUB+eBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b15ed5046d0dfe931f6e90daa64766b6eeed258","infoHashBuffer":{"type":"Buffer","data":[91,21,237,80,70,208,223,233,49,246,233,13,170,100,118,107,110,238,210,88]},"announce":[],"urlList":[]}}