{"title":"Dreamcast Official magazine [USA] COMPLETE PDF","uid":12749602,"size":3545109490,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b518c3bf1629c470489261428920340045bdaea&amp;dn=Dreamcast+Official+magazine+%5BUSA%5D+COMPLETE+PDF&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":13,"time":1447361495,"description":"The Official Dreamcast Magazine was a video game magazine for the Dreamcast published in the United States. The magazine's initial issue &quot;0&quot; was released in June 1999, a full 3 months before the launch of the system. This issue featured Sonic the Hedgehog on a black cover, along with the launch date and some of the system's unique features. The magazine then ran for twelve issues from the September 1999 Dreamcast launch to March/April 2001, shortly after Dreamcast was discontinued. Each issue came with a GD-ROM with demos of Dreamcast games. The final issue did not come with a disc. This was explained as Sega looking for a new way to distribute demos. The cancellation was apparently unexpected as the magazine promised more information about demo distribution in future issues and had a preview for the next issue where Phantasy Star Online was to be reviewed. Many of the staff went on to work for Official Xbox Magazine.\r\n\r\nThe magazine was published bimonthly, but during the 2000 holiday season, issues were sold monthly due to additional relevant content being available for the shopping season.\r\n\r\nThis set of Dreamcast Official Magazine (USA Version) is complete. \r\n\r\nVisitfor more on game manuals and magazines!\r\n\r\nHave something to contribute? Visit /r/vgmanuals and/or upload them to sites like oldgamemags.com, retromags.com, archive.org, vimm.net and replacementdocs.com \r\n\r\nThese items are no longer available for purchase and as such should be free to share. The files in this collection were already available on the web; they have just been archived here for sake of ease and backup. Please go check out the above mentioned sites as they deserve the credit for most of the source files :) \r\n\r\nPlease keep seeding these files for as long as possible so that others may enjoy them too!","torrent":{"xt":"urn:btih:5b518c3bf1629c470489261428920340045bdaea","amp;dn":"Dreamcast+Official+magazine+%5BUSA%5D+COMPLETE+PDF","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b518c3bf1629c470489261428920340045bdaea","infoHashBuffer":{"type":"Buffer","data":[91,81,140,59,241,98,156,71,4,137,38,20,40,146,3,64,4,91,218,234]},"announce":[],"urlList":[]}}