{"title":"Handel - Rinaldo  (Hogwood, Bartoli, Daniels)","uid":4749886,"size":803913463,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b9598ff8d1371a2bcfc4cf754ebc02f6acde401&amp;dn=Handel+-+Rinaldo++%28Hogwood%2C+Bartoli%2C+Daniels%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sheila6","files":9,"time":1236117073,"description":"Music : Classical : Lossless\n\n\nGeorge Frideric Handel - Rinaldo (3CD) [Hogwood-Bartoli-Daniels]\n\nFormat: [FLAC+cue]\n\nfront/back cover scans included\n\n\n\nHandel opera, for many, is an impenetrable world of opera seria with its faintly ridiculous libretti, blockbuster showpiece arias, oh and with some story line rushed in as recitative. With recordings such as this one by Christopher Hogwood (who has also made a recording of Handel's Orlando) then Handelian opera may be more accessible to all music lovers. Whilst perhaps at the pricy end of the spectrum, there is an abundance of high class singing and playing that will have you listening to this recording time and again.\n\nWhilst Ms Bartoli's main forte in the past has been in Mozart and Rossini, she makes an admirable Almirena as foil to David Daniels' Rinaldo, and her enunciation of 'Lascia ch'io pianga', amongst others, will take some beating. There is certainly no rival among presently recorded versions.\n\nBernarda Fink, a Handel veteran by now, makes a strident Goffredo, Rinaldo's able lieutenant and Gerald Finley a blustering and convincing King of Jerusalem, Argante. His queen, Armida, is spectacularly portrayed by Czech soprano Luba Organasova who consistently never fails to surprise with her power and feeling for this music, particularly in her end of Act Two showstopper Vo' far guerra.\n\nFor one who is an unashamed admirer of countertenor singing, this recording is a fantastic opportunity to hear three of the best. Daniel Taylor (Canada) makes a superb fist of the least convincing character in the opera - Eustazio, whilst former treble prodigy Bejun Mehta (USA) 'breathes fire' in the small part of the Christian sorcerer.\n\nBut it is the name part that makes or breaks this recording, and in David Daniels Hogwood has brought the character of Rinaldo to life. Gone are the days of the castrati, but I suspect Nicolini (the original Rinaldo) would have approved of Daniels' passionate and technically unrivalled performance. Whether indulging in coloratura pyrotechnics in 'Venti Turbini' and 'Or la tromba', pathos in 'Cara Sposa' or vivid interplay alongside Bartoli in the love music (viz. 'Scherza sul tuo volto'), Daniels struts his astonishing technique and interpretation to make him the leading operatic countertenor around, which is saying something with the current competition.\n\nIt is hard to imagine that this recording will be surpassed in the near future projecting, as it does convincingly, the thrill of live performance. Highly recommended for the casual opera lover, this is a must for Handelian admirers to have in their collection. \n\n\n\nEnjoy and Seed!","torrent":{"xt":"urn:btih:5b9598ff8d1371a2bcfc4cf754ebc02f6acde401","amp;dn":"Handel+-+Rinaldo++%28Hogwood%2C+Bartoli%2C+Daniels%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b9598ff8d1371a2bcfc4cf754ebc02f6acde401","infoHashBuffer":{"type":"Buffer","data":[91,149,152,255,141,19,113,162,188,252,76,247,84,235,192,47,106,205,228,1]},"announce":[],"urlList":[]}}