{"title":"The Ascendant: A Thriller (2014) Drew Chapman (multi)","uid":9540393,"size":1992236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cbeee9dc337e1fced07ec38e178d2cfa6ec35c2&amp;dn=The+Ascendant%3A+A+Thriller+%282014%29+Drew+Chapman+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"7","files":-1,"time":1391031973,"description":"The Ascendant: A Thriller by Drew Chapman\n\n\nFormat: mobi/epub/azw3\nLength: 400 pages\nGenre: Thriller\nDate: 7 January 2014\n\nIn this taut and cunning novel, Drew Chapman takes readers into a scenario that is eerily plausible and utterly terrifying--an unconventional war capable of bringing a superpower to its knees. The Ascendant is a brilliant new twist on the art of the white-knuckle thriller.\n\nNumbers don't lie. Not according to Garrett Reilly who, just two weeks past his twenty-sixth birthday, thinks he's probably the best bond analyst at his brokerage--maybe even the best in all of Manhattan. Garrett's memory for numbers is photographic. But he doesn't just memorize them; he sorts them, ranks them, senses patterns in them. As he watches buy and sell numbers float across his Bloomberg terminal, Garrett notices what nobody else can: that US Treasury bonds are being sold off at an alarming rate--two hundred billion dollars' worth. It's a discovery that he knows will make him incredibly rich.\n\nThen the United States military arrives at his office, and Garrett's life is blown to pieces. As Captain Alexis Truffant explains, Garrett has stumbled upon something much larger--and scarier--than he could have imagined: the first attack in a covert war of unthinkable proportions. His biggest problem? Numbers don't lie...but governments can.\n\nAuthor:\n\nDrew Chapman has written on numerous studio movies, including Pocahontas for Walt Disney Pictures and the original Iron Man for 20th Century Fox. He also directed the indie film Standoff. Currently, he creates and writes TV shows for network television, most recently having worked for ABC and Sony. Married with two children, he divides his time between Los Angeles and Seattle. ","torrent":{"xt":"urn:btih:5cbeee9dc337e1fced07ec38e178d2cfa6ec35c2","amp;dn":"The+Ascendant%3A+A+Thriller+%282014%29+Drew+Chapman+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cbeee9dc337e1fced07ec38e178d2cfa6ec35c2","infoHashBuffer":{"type":"Buffer","data":[92,190,238,157,195,55,225,252,237,7,236,56,225,120,210,207,166,236,53,194]},"announce":[],"urlList":[]}}