{"title":"Throne of the Crescent Moon By Saladin Ahmed [PDF, ePub, Mobi]","uid":8472391,"size":2540706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cd45cb6464e11436be0fc04416d11007389a3de&amp;dn=Throne+of+the+Crescent+Moon+By+Saladin+Ahmed+%5BPDF%2C+ePub%2C+Mobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"theBooks","files":-1,"time":1368518198,"description":" &lt;a href=&quot;http://www.plentyofebooks.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.plentyofebooks.net/&lt;/a&gt;\n\nThrone of the Crescent Moon (Crescent Moon Kingdoms)\nAuthor(s): Saladin Ahmed\nPublisher: DAW Hardcover\nDate: 2012\nPages: 557 in ePub format\nFormat: PDF, ePub, Mobi\nLanguage: English\nISBN-10: 0756407117\nASIN: B00B9ZEMN6\nSize: 2.48 MB\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nDescription:\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nFrom Saladin Ahmed, finalist for the Nebula and Campbell Awards, comes one of the year's most anticipated fantasy debuts, THRONE OF THE CRESCENT MOON, a fantasy adventure with all the magic of The Arabian Nights.\n\nThe Crescent Moon Kingdoms, land of djenn and ghuls, holy warriors and heretics, Khalifs and killers, is at the boiling point of a power struggle between the iron-fisted Khalif and the mysterious master thief known as the Falcon Prince. In the midst of this brewing rebellion a series of brutal supernatural murders strikes at the heart of the Kingdoms. It is up to a handful of heroes to learn the truth behind these killings:\n\nDoctor Adoulla Makhslood, &quot;The last real ghul hunter in the great city of Dhamsawaat,&quot; just wants a quiet cup of tea. Three score and more years old, he has grown weary of hunting monsters and saving lives, and is more than ready to retire from his dangerous and demanding vocation. But when an old flame's family is murdered, Adoulla is drawn back to the hunter's path.\n\nRaseed bas Raseed, Adoulla's young assistant, a hidebound holy warrior whose prowess is matched only by his piety, is eager to deliver God's justice. But even as Raseed's sword is tested by ghuls and manjackals, his soul is tested when he and Adoulla cross paths with the tribeswoman Zamia.\n\nZamia Badawi, Protector of the Band, has been gifted with the near-mythical power of the Lion-Shape, but shunned by her people for daring to take up a man's title. She lives only to avenge her father's death. Until she learns that Adoulla and his allies also hunt her father's killer. Until she meets Raseed.\n\nWhen they learn that the murders and the Falcon Prince's brewing revolution are connected, the companions must race against time--and struggle against their own misgivings--to save the life of a vicious despot. In so doing they discover a plot for the Throne of the Crescent Moon that threatens to turn Dhamsawaat, and the world itself, into a blood-soaked ruin.\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nReviews:\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n&quot;Ahmed's debut masterfully paints a world both bright and terrible.&quot; \n--Publishers Weekly\n\n&quot;An arresting, sumptuous and thoroughly satisfying debut.&quot; \n--Kirkus Reviews\n\n&quot;Readers yearning for the adventures of Fafhrd and the Gray Mouser will delight in the arrival of Adoulla and Raseed. In addition to these two marvelous characters, Saladin Ahmed has given us the wonderful, colorful city of Dhamsawaat, ghuls and demons and manjackals, and the ferocious tribeswoman Zamia, who gives new meaning to the words 'wild girl.'&quot; \n--Walter Jon Williams, Nebula award-winning author of DEEP STATE \n\n&quot;THRONE OF THE CRESCENT MOON is colorful, magical, exciting, and moving. Saladin Ahmed delivers a beautiful story of a demon hunter in an Arabian Nights setting. An excellent first novel!&quot; \n--Kevin J. Anderson, international bestselling coauthor of HELLHOLE \n\n&quot;This promising debut offers a glimpse of a dusty and wonderful fantasy city through the eyes of three engaging, unconventional protagonists.&quot; \n--Elizabeth Bear, Hugo award-winning author of GRAIL \n\n&quot;Ahmed is a master storyteller in the grand epic tradition. Swashbuckling adventure, awesome mystery, a bit of horror, and all of it written beautifully. A real treat!&quot;\n--N. K. Jemisin, Locus award-winning author of THE HUNDRED THOUSAND KINGDOMS \n\n&quot;Saladin Ahmed is not your typical fantasy writer, and this is no ordinary debut novel. With deft plotting, painstaking characterization, and fluid prose, Ahmed brings us a riveting adventure, complete with stunning magics and compelling intrigue. A thoroughly enjoyable read from one of the genre's rising stars.&quot; \n--David B. Coe, Crawford award-winning author of THE DARK-EYES' WAR\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nAbout the Author:\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nSaladin Ahmed has been a finalist for the Nebula, Campbell, and Harper's Pen awards. His short fiction has appeared in magazines and podcasts including Strange Horizons, Orson Scott Card's Intergalactic Medicine Show, Beneath Ceaseless Skies, Apex Magazine, StarShipSofa and PodCastle, and has been translated into Portuguese, Czech, Dutch, and Romanian. His poetry has earned fellowships from several universities, and has appeared in over a dozen journals and anthologies. His debut fantasy novel Throne of the Crescent Moon is forthcoming from DAW Books in February 2012.\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nAmazon Customer Ratings (105 Reviews):\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n5 star: (60)\n4 star: (31)\n3 star: (5)\n2 star: (7)\n1 star: (2)\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nNo Password or Surveys. Guaranteed!!!\n\nPlease seed the torrent if you want to Help :)\n &lt;a href=&quot;\nhttp://www.plentyofebooks.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.plentyofebooks.net/&lt;/a&gt;\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:5cd45cb6464e11436be0fc04416d11007389a3de","amp;dn":"Throne+of+the+Crescent+Moon+By+Saladin+Ahmed+%5BPDF%2C+ePub%2C+Mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cd45cb6464e11436be0fc04416d11007389a3de","infoHashBuffer":{"type":"Buffer","data":[92,212,92,182,70,78,17,67,107,224,252,4,65,109,17,0,115,137,163,222]},"announce":[],"urlList":[]}}