{"title":"Horace Silver - Finger Poppin' (1959, Blue Note-RVG)","uid":9439000,"size":296910321,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5cdbdfb9f1a6f913438cd898d052b34eaec7c530&amp;dn=Horace+Silver+-+Finger+Poppin%27+%281959%2C+Blue+Note-RVG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1388961296,"description":"Finger Poppin' was the first album Horace Silver recorded with the most celebrated version of his quintet, which featured trumpeter Blue Mitchell, tenor saxophonist Junior Cook, bassist Gene Taylor, and (this time around) drummer Louis Hayes. It's also one of Silver's all-time classics, perfectly blending the pianist's advanced, groundbreaking hard bop style with the winning, gregarious personality conveyed in his eight original tunes. Silver always kept his harmonically sophisticated music firmly grounded in the emotional directness and effortless swing of the blues, and Finger Poppin' is one of the greatest peaks of that approach. A big part of the reason is the chemistry between the group -- it's electrifying and tightly knit, with a palpable sense of discovery and excitement at how well the music is turning out. As a bandleader, Silver helps keep the ensemble's solo statements as concise and rhythmic as his own, concentrating the impact of the performances and keeping the pieces moving along without ever letting the listener's attention span wane. There's a nice variety of tempos and moods over the well-paced program; particularly memorable are the hard-swinging, bluesy &quot;Juicy Lucy&quot;; the bopping, up-tempo &quot;Cookin' at the Continental&quot;; and the gritty groove of &quot;Come on Home.&quot; Also breaking things up are a couple of spare, reflective ballads and a frenetic exploration of Brazilian rhythms, &quot;Swingin' the Samba.&quot; Finger Poppin' is everything small-group hard bop should be, and it's a terrific example of what made the Blue Note label's mainstream sound so infectious. ","torrent":{"xt":"urn:btih:5cdbdfb9f1a6f913438cd898d052b34eaec7c530","amp;dn":"Horace+Silver+-+Finger+Poppin%27+%281959%2C+Blue+Note-RVG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cdbdfb9f1a6f913438cd898d052b34eaec7c530","infoHashBuffer":{"type":"Buffer","data":[92,219,223,185,241,166,249,19,67,140,216,152,208,82,179,78,174,199,197,48]},"announce":[],"urlList":[]}}