{"title":"Mandrake the Magician Part 4","uid":4327988,"size":228228582,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5d07871aa5d6bcbb4f9eddcac8c9693424bfcfd4&amp;dn=Mandrake+the+Magician+Part+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"DieSmurfDie","files":54,"time":1217880565,"description":"This is part 4 of 4 Mandrake the Magician torrents.  Included here are the available Sunday newspaper strips.  Unlike the Phantom strips many of these haven&amp;#039;t been fully scanned yet.  After some reflection I&amp;#039;ve included some partial scans to whet our collective appetites. Also it appears that some of these scans are not actually from newspaper runs but from reprinted editions. I did not do anything about that, except to note it here.  There may be a fill torrent in the future if enough new scans become available.  Otherwise, this concludes the Mandrake the Magician series.\n\nfrom Wikipedia:\n\nMandrake the Magician is a U.S. comic strip created in 1934 by Lee Falk (also creator of The Phantom) and mainly appearing in syndication in newspapers. Falk soon gave the job of drawing the comic strip to artist Phil Davis, while continuing to write the storylines. Davis worked on the strip until his death in 1964; Falk then recruited current artist Fred Fredericks. On Falk&amp;#039;s death in 1999, Fredericks took over writing the strip as well. Mandrake is widely believed to have been the first bona fide superhero.\n\nMandrake was an illusionist whose work was based on an impossibly fast hypnotic technique. As the narrator informed us: &quot;Mandrake gestured hypnotically&quot; and the subject or subjects of this hypnosis would suddenly see the illusions he wanted. Mandrake fought criminals and other villains in his spare time. This would include common gangsters, mad scientists, and aliens from outer space or other dimensions.\n\nThe Mandrake the Magician article can be found here: http://en.wikipedia.org/wiki/Mandrake_the_magician\n\nThanks to Lee Falk for creating this character.  And to the army of writers, artists, scanners and uploaders that got us to this point.\n\n","torrent":{"xt":"urn:btih:5d07871aa5d6bcbb4f9eddcac8c9693424bfcfd4","amp;dn":"Mandrake+the+Magician+Part+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d07871aa5d6bcbb4f9eddcac8c9693424bfcfd4","infoHashBuffer":{"type":"Buffer","data":[93,7,135,26,165,214,188,187,79,158,221,202,200,201,105,52,36,191,207,212]},"announce":[],"urlList":[]}}