{"title":"Billy Joel - Storm Front (1989/2014) 24/96 official download","uid":11815702,"size":1105979670,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5d3f9a912887c343559904d5638e7e24f5dd7fc8&amp;dn=Billy+Joel+-+Storm+Front+%281989%2F2014%29+24%2F96+official+download&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sidmal","files":13,"time":1429086414,"description":"\nBilly Joel - Storm Front (1989/2014)\n FLAC (tracks) 24-bit/96 kHz | Time - 45:00 minutes | 1,08 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Storm Front is the product of a collaboration between singer-songwriter Billy Joel and producer Mick Jones. The first single &quot;We Didn't Start The Fire&quot; reached number one on Billboard charts in 1989 after its release. The album itself received numerous Grammy nominations including: Best Pop Vocal Performance, Male and Producer of the Year, Record of the Year, Song of the Year for &quot;We Didn't Start The Fire&quot;, and Best Male Pop Vocal Performance.\n\n\n When he went for a masterpiece on The Nylon Curtain, Billy Joel worked with his band and producer Phil Ramone, crafting a Beatlesque song suite that was perfectly in step with Turnstiles. For Storm Front, he decided it was time to change things. He fired Ramone. He fired everyone in his band, save longtime drummer Liberty DeVito. He hired Mick Jones, the architect behind Foreigner's big AOR sound, to man the boards. He wrote a set of sober, somber songs, save &quot;That's Not Her Style,&quot; a weirdly defensive song about his model wife, Christie Brinkley. He was left with an album that is singularly joyless. Joel makes no bones about his ambitions for Storm Front -- when you lead with a history lesson as your first single (the monotonous chant &quot;We Didn't Start the Fire&quot;), it's clear that you're not interested in fun. That wouldn't have been a problem if his melodic skills weren't in decline. Joel packed all the strongest numbers into the first half of Storm Front, from the rocking &quot;That's Not Her Style&quot; and &quot;I Go to Extremes&quot; to the fisherman's plight &quot;The Downeaster 'Alexa'&quot; and the power ballad &quot;Shameless,&quot; which Garth Brooks later made a standard. Compared to the murky second side, which perks up only mildly with &quot;Leningrad&quot; and &quot;And So It Goes,&quot; it's upbeat, varied, melodic, and effective, but when it's compared to his catalog -- not only such high-water marks as The Stranger or Glass Houses, but with a record as uneven as The Bridge -- it pales musically and lyrically. The five singles (&quot;Fire,&quot; &quot;Style,&quot; &quot;Extremes,&quot; &quot;'Alexa',&quot; &quot;Goes&quot;) were catchy enough on the radio to propel the album to multi-platinum status, but in retrospect, Storm Front sounds like the beginning of the end.  \n\n\nTracklist:\n\n 01 - That's Not Her Style\n 02 - We Didn't Start the Fire\n 03 - The Downeaster &quot;Alexa&quot;\n 04 - I Go to Extremes\n 05 - Shameless\n 06 - Storm Front\n 07 - Leningrad\n 08 - State of Grace\n 09 - When In Rome\n 10 - And So It Goes","torrent":{"xt":"urn:btih:5d3f9a912887c343559904d5638e7e24f5dd7fc8","amp;dn":"Billy+Joel+-+Storm+Front+%281989%2F2014%29+24%2F96+official+download","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d3f9a912887c343559904d5638e7e24f5dd7fc8","infoHashBuffer":{"type":"Buffer","data":[93,63,154,145,40,135,195,67,85,153,4,213,99,142,126,36,245,221,127,200]},"announce":[],"urlList":[]}}