{"title":"Golden Boy","uid":3398679,"size":899903488,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5d5db7daf5681377f7c80ce554bf8ff81cdc9e67&amp;dn=Golden+Boy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"geenidee","files":6,"time":1129710998,"description":"http://www.fortunecity.com/lavendar/attenborough/314/gb/gb17.jpg\nhttp://www.fortunecity.com/lavendar/attenborough/314/gb/gb03.jpg\nhttp://www.fortunecity.com/lavendar/attenborough/314/gb/gb02.jpg\n\nNext text blatantly copied from http://www.fortunecity.com/lavendar/attenborough/314/gb/gbinfo.html\n\n------------------------  \n\nStory...\n&quot;Kintaro Oe is the ultimate daydreamer,&quot; (ADV) current age twenty-five... male. He studied law at Tokyo University, but left the school before graduating although he had completed all of the required courses. Now he considers himself a freer, a person who specializes in part-time jobs. Kintaro lives his life going from job to job learning new things all while studing life.\n\nRiding along on his trusty bike, we meet Kintaro (tape1). He's on his way to his next job; however, before making it to his destination, he gets side tracked into the pavement as a Ferrari blazes down the street. The driver is a well endowed woman, who makes quick work of our Golden Boy, and speeds away. \n\nRecovering, Kintaro, finally makes it to T.N. Software. Noticing that all of the employees are female... he begins to imagine heaven. Heaven or not, he is brought to the CEO of the corporation who is know other than the well endowed woman in the Ferrari. In disgust she sends him to clean the toilet, a common thing we'll see him do throughout the series. It's here were we also see another one of his habits, toilet hugging. O well...\n\nThe scene progresses as he almost gets fired and chases the employees around, it aall winds up to a climax when he pulls the plug to a server that held a program which was to be the companies future. It's the first adventure of Golden Boy... \nReview...\nLets get down to it, I was a little hesitant in buying the first tape of the series, but eventually did. It's a definate favorite of mine, the art is decent, and the story his hilarious, but besides the comedy in the thing I find that at the end of every tape (except the 5th) there is a lesson or aspect he teaches his female admirer. Something like a moral I guess. It gives the series a good mixture of everything. Back to the art for a sec... Kintaro's facial expressions are funny. He has some of the most original looks I've ever seen, from those of awe, to those of anger. The expressions are a great aspect of the series, beyound all others. I can't but not give it two flamers up.\n\n--------------------\n\nThere are 6 episodes in this one:\n\n01 - Computer Studies.avi\n02 - Temptation Of The Maiden.avi\n03 - The Virgin's First Love.avi\n04 - Swimming In The Sea Of Love.avi\n05 - Balls To The Wall.avi\n06 - Animation Is Fun.avi\n\n","torrent":{"xt":"urn:btih:5d5db7daf5681377f7c80ce554bf8ff81cdc9e67","amp;dn":"Golden+Boy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5db7daf5681377f7c80ce554bf8ff81cdc9e67","infoHashBuffer":{"type":"Buffer","data":[93,93,183,218,245,104,19,119,247,200,12,229,84,191,143,248,28,220,158,103]},"announce":[],"urlList":[]}}