{"title":"Tweaking.com - Windows Repair Pro v3.9.5","uid":15320404,"size":32961600,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5dca4ca0f7c83f64c38b2cf78ecc0f5f0605f913&amp;dn=Tweaking.com+-+Windows+Repair+Pro+v3.9.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ZarkBit","files":1,"time":1468639264,"description":"Tweaking.com - Windows Repair Pro v3.9.5\r\n\r\nv3.9.5\r\nMajor bug fix and improvement. On Windows 8, 8.1 and 10 after you applied any repairs, when you would create a new user the apps would be broken for that new user.\r\nThis was because the registry key &quot;HKEY_Current_UserSoftwareClassesLocal SettingsSoftwareMicrosoftWindowsCurrentVersionAppModelRepositoryPackages&quot; had Administrators set as the owner instead of the System account (This shows how fragile the Windows Apps are) simply changing the owner back to System would fix the apps for the user.\r\nAfter spending 6 days non stop working on this and why it happened, I thought it was permissions related since the owner of the key was different.\r\nTurns out having the SYSTEM account added to the administrators group was the trigger. For some reason when Windows would create a new user it would set the owner based off the group instead of the account, very odd I know.\r\nThe program normally added the system account to the administrators group as it was a fix from xp and windows 7 where sometimes the system account wouldn't have full access (Before the repairs where applied). The program no longer does this for Windows 7 and newer and even now removes system from the administrators group, so if you ran Windows repair on a system before and run it again it will remove it for you.\r\n\r\nCreating New users on Windows 8, 8.1 and 10 after running all repairs have been tested and confirmed working just fine after this update.\r\n\r\nBug fix and improvement. When restoring the default registry permissions to HKEY_USERS, if any other user hives, other than the current user, where loaded their permissions would got messed up (Their defaults where never restored). Yet another reason to run the repairs in safe mode is to make sure no other user hives are loaded.\r\nWell just in case other user hives are loaded, the program now applies the defaults properly for each loaded user hive.\r\nSo not only will this keep from messing up the permissions it will now even fix the permissions for any loaded users as well.\r\n\r\nBug fix and improvement. Some users who are still on Windows 8 and not 8.1 reported problems after running the repairs. It appears the default permissions from 8 to 8.1 have changed a lot and so the 8.1 defaults can no longer be used with 8.\r\nSo I have now added the default permissions for Windows 8 up to all updates MS has put out for 8 before requiring the user to update to 8.1 to get new updates.\r\nWhile this makes the program a little bigger having the default permissions for 8 stored as well, it now makes sure Windows 8 users get the proper permissions set (Which even helps them update to 8.1 if they where having trouble)\r\n\r\nIncreased the speed of the pre scan tool. Also removed the text telling the user to post in the forums if they needed help getting missing cat or mum files. There are millions of these files, myself and my forum moderators simply cant keep up with so many. A guide will be written soon to help users get the files they need themselves.\r\n\r\nImproved the permissions repairs greatly. In my task to find the cause of another problem, I was determined to get the default permissions applied back as close as possible. Microsoft gives you a lot of different ways to set the permissions, each one with its own pros and cons. Before this update on the same machine I would take the defaults from, there would be a few hundreds registry keys where the permissions where not identical in the SDDL string format after restoring the default permissions. This was because of how the Windows API was applying the permissions it would combine permissions, so even though the permissions where still technically correct, they where not identical to the defaults. After this update the differences where now down to under 15, much much better :-)\r\n\r\nUpdated default permissions for Windows 7,8, 8.1 &amp; 10 with all updates as of July 13, 2016.\r\n\r\nUpdated Tweaking.com - ManageACL to v1.3.0\r\n\r\nUpdated Tweaking.com - Registry Backup to v3.5.0\r\n\r\nLarge amounts of code changes, improvements and bug fixes.\r\n\r\n\r\nTweaking.com - Windows Repair is a tool designed help fix a large majority of known Windows problems including; registry errors, file permissions, issues with Internet Explorer, Windows Updates, Windows Firewall and more. Malware and poorly installed programs can modify your default settings resulting in your machine working badly - or worse. With Tweaking.com Windows Repair you can restore Windows original settings fixing many of these problems outright.\r\n  \nhttp://www.tweaking.com/content/page/windows_repair_all_in_one.html","torrent":{"xt":"urn:btih:5dca4ca0f7c83f64c38b2cf78ecc0f5f0605f913","amp;dn":"Tweaking.com+-+Windows+Repair+Pro+v3.9.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dca4ca0f7c83f64c38b2cf78ecc0f5f0605f913","infoHashBuffer":{"type":"Buffer","data":[93,202,76,160,247,200,63,100,195,139,44,247,142,204,15,95,6,5,249,19]},"announce":[],"urlList":[]}}