{"title":"I-Doser Premium v1.2.1 [PD]","uid":8843544,"size":401394236,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5dec2a37188adcd2122ed267abcc08530d2fe1a0&amp;dn=I-Doser+Premium+v1.2.1+%5BPD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Androider","files":-1,"time":1377313171,"description":"\nDon't be fooled by the cheap imitations out there! We are the REAL DEAL!\nUpdated Premium Version is now UNIVERSAL! Works across all your mobile and tablet devices, is in glorious HD, and completely overhauls previous versions of I-Doser.\n\nI-Doser.com is the Industry Leader in Binaural Brainwave Technology. \n\nUsing proven, safe, and scientific methods of synchronizing your brainwaves, a simulated state can be achieved through the use of the I-Doser Player Application for the iPhone and iPad.\n\nNow includes 50% MORE SIMULATIONS making this the largest mobile collection of binaural brainwave doses ever collected.\n\nThe ONLY binaural simulator to offer integrated ambient soundscape custom tailored to each and every simulation.\nThe ONLY binaural simulator that allows you to SlipStream Doses.\nThe ONLY binaural simulator to offer real-time tuning. Fine tune your experience in real-time, on the fly, for the best results possible!\nThe ONLY binaural simulator to offer integrated guides and methods to guarantee success!\nThe ONLY binaural simulator to offer in app purchases!\n\nReach a state previously only achievable through recreational or prescription methods.\n\nI-Doser is the only on-the-go mobile brainwave modification tool based on proven and effective sequencing. All you need is your headphones.\n\nWhat's New:\n\nThe long awaited update is here! A complete UI overhaul, 50% more simulations, and MUCH MORE! This version adds support for all tablet and mobile devices, and upgrades to amazing HD graphics and fixes crash and restore bugs.\nRESTORING NOTE: To restore purchases from previous versions go to the Information &quot;i&quot; button in the upper right and choose &quot;RESTORE PURCHASES&quot;\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.yudiz.idoser&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.yudiz.idoser&lt;/a&gt;\n\n\nInstructions:\n\n1.Install APK\n2.Copy 'com.yudiz.idoser' folder to 'sdcard/Android/Obb'\n3.Launch the app\n4.Enjoy! ;)\n","torrent":{"xt":"urn:btih:5dec2a37188adcd2122ed267abcc08530d2fe1a0","amp;dn":"I-Doser+Premium+v1.2.1+%5BPD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dec2a37188adcd2122ed267abcc08530d2fe1a0","infoHashBuffer":{"type":"Buffer","data":[93,236,42,55,24,138,220,210,18,46,210,103,171,204,8,83,13,47,225,160]},"announce":[],"urlList":[]}}