{"title":"Vital Remains - discography [Metal] (1989 - 2007) (mp3)","uid":11093043,"size":995893745,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e0eeb1745cf998e648024c15a23bac646d50460&amp;dn=Vital+Remains+-+discography+%5BMetal%5D+%281989+-+2007%29+%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TetsElPilsen","files":-1,"time":1411555473,"description":"Vital Remains - discography [Metal] (1989 - 2007) (mp3)\n\nThe definition of extreme can be interpreted in many ways, VITAL REMAINS, however, takes its meaning to a whole new level, be it through using their instruments as weapons for mass annihilation or through unrelenting, blasphemous lyrics that display their hatred of religion and all that it stands for. Add death metal Legend Glen Benton (DEICIDE) to the mix, and you have all the elements of a Nuclear Warhead waiting to explode on the unsuspecting masses. Very few extreme metal bands are able to reinvent their musical styles, yet VITAL REMAINS are one of the few to stand the test of time.The group formed in 1989 in Providence, RI, and after recording two demos, they signed to Peaceville's subsidiary Deaf Records. They soon recorded the legendary cult albums Let Us Pray and Into Cold Darkness, but due to poor distribution and promotion from the label, the band asked to be let go from the contract. Two years later they signed a two album deal with French label Osmose Records and unleashed Forever Underground and Dawn of The Apocalypse.The dark lords revamped their line-up in 2001 with original member Tony Lazaro on guitars, Dave Suzuki on bass, drums and lead guitars and Glen Benton on vocals. They also signed a new deal with Olympic Recordings to unleash Dechristianize, an album that all other bands in the genre will soon strive to conquer. This 9-track epic, recorded at Morrissound Studios (Morbid Angel, Six Feet Under) combines melody with an evil atmosphere and a traditional metal feel, with no shortage of satanic verses. Lazaro put it best when he described the new album: &quot;It's got the brutality, but also it's very dynamic and textured. &quot; The world of extreme metal will soon be rejuvenated as VITAL REMAINS return to Dechristianize the weak and lay waste to the non-believer!\n\nYear: 1989 - 2007\nCountry: United States\nGenre: Death Metal\nCodec: Mp3\nBitrate: 56 - 320Kbps\n\nDISCOGRAPHY:\nVital Remains_-_(1989) Reduced to ashes (demo)\nVital Remains_-_(1990) Excruciating Pain (Demo)\nVital Remains_-_(1991) The Black Mass (Single)\nVital Remains_-_(1992) Let Us Pray\nVital Remains_-_(1995) Into Cold Darkness\nVital Remains_-_(1997) Forever Underground\nVital Remains_-_(2000) Dawn Of The Apocalypse (320)\nVital Remains_-_(2003) Dechristianize\nVital Remains_-_(2006) Horrors Of Hell\nVital Remains_-_(2007) Icons Of Evil","torrent":{"xt":"urn:btih:5e0eeb1745cf998e648024c15a23bac646d50460","amp;dn":"Vital+Remains+-+discography+%5BMetal%5D+%281989+-+2007%29+%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e0eeb1745cf998e648024c15a23bac646d50460","infoHashBuffer":{"type":"Buffer","data":[94,14,235,23,69,207,153,142,100,128,36,193,90,35,186,198,70,213,4,96]},"announce":[],"urlList":[]}}