{"title":"Manfred Mann's/Messin' [1973][2012][320 KBPS][RMSTD][LE]","uid":11684906,"size":107326373,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e3f667ccbf5f94aaa4cbc2abd7bab02429cf4c5&amp;dn=Manfred+Mann%27s%2FMessin%27+%5B1973%5D%5B2012%5D%5B320+KBPS%5D%5BRMSTD%5D%5BLE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LameDuck69","files":10,"time":1423278861,"description":"Manfred Mann's Earth Band - Messin' [1973][2012][RMSTD][LE]\n\n\n\n01. Messin'  \n02. Buddah  \n03. Cloudy Eyes  \n04. Get Your Rocks Off  \n05. Sadjoy  \n06. Black And Blue  \n07. Mardi Gras Day \n---------------------------------------\n**320 KBPS CBR\n**Cover Art\n------------------------------------------------- \nManfred Mann's Earth Band are an English rock band formed by South African musician Manfred Mann. The band's hits include covers of Bruce Springsteen's &quot;Blinded By The Light&quot; and &quot;Spirit In The Night&quot;. After forming in 1971 and despite a short hiatus in the late 80s/early 90s, the Earth Band has continued to perform and tour through the present.\n-----------------------------------------------------------------------\nMann started in the 1960s with the self-titled British invasion band that had such hits as &quot;Do Wah Diddy Diddy&quot; and &quot;The Mighty Quinn&quot; and then moved on to jazz fusion-inspired Manfred Mann Chapter Three before forming the Earth Band in 1971. In his 2003 biography, Klaus Voormann, former member of original Manfred Mann group and Beatles-associate, is alleged to have inspired the Earth Band's name by having suggested several times throughout the 1960s that Mann's soft pop style of those days had to become &quot;earthier&quot; and rockier, not least of all because of the seemingly effeminate image of Mann's earlier band which had led to a number of close encounters with violence, particularly in Ireland.[1]\n\nThe original line-up consisted of Mick Rogers (guitar and vocals), Manfred Mann (organ, synthesizer and vocals), Colin Pattenden (bass guitar) and Chris Slade (drums and vocals). In its very earliest stages, the band was simply billed as &quot;Manfred Mann&quot; and thus a continuation of the 1960s group. The quartet released their first single, &quot;Please Mrs. Henry&quot;, in 1971. Their second single, Randy Newman's &quot;Living Without You,&quot; was also released by &quot;Manfred Mann&quot; in Europe, but by &quot;Manfred Mann's Earth Band&quot; in the USA, where the track became a minor chart hit. On two non-charting single releases in the UK in 1972/73, the group was billed simply as &quot;Earth Band&quot;, but otherwise, from 1972 forward &quot;Manfred Mann's Earth Band&quot; was the band name used on all releases. The membership of the Earth Band was stable between 1971 and 1976, during which time they released their first six albums.\n--------------------------------------------------------------------------------\nMessin' is a rock album released in 1973 by Manfred Mann's Earth Band.\n\nMessin' followed Glorified Magnified and preceded Solar Fire, and like all Earth Band albums contains a mixture of originals and covers.\n\n&quot;Buddah&quot; also appeared on the Vertigo budget sampler double album Suck It And See, along with tracks by then-labelmates Kraftwerk, Jade Warrior and the Sensational Alex Harvey Band, amongst others.\n\nThe album was produced by Manfred Mann and engineered by John Edwardes at Maximum Sound Studios, London in 1973.\n\nFor the United States release, the album was re-titled Get Your Rocks Off and the track &quot;Pretty Good&quot; was included in place of &quot;Black And Blue&quot;, seemingly because the latter was about slavery and deemed unsuitable for the US market. Both tracks were included on the 1998 re-mastered re-issue.\n--------------------------------------------------------------------------------\nPersonnel:\n\nManfred Mann: synthesiser, organ\nMick Rogers: guitar, vocals\nColin Pattenden: bass guitar\nChris Slade: drums\n\nWith: \n\nLaurie Baker: Machines and Zoo on &quot;Messin' &quot;\nLiza Strike: backing vocals\nVicki Brown: backing vocals\nJudith Powell: backing vocals\nRuby James: backing vocals","torrent":{"xt":"urn:btih:5e3f667ccbf5f94aaa4cbc2abd7bab02429cf4c5","amp;dn":"Manfred+Mann%27s%2FMessin%27+%5B1973%5D%5B2012%5D%5B320+KBPS%5D%5BRMSTD%5D%5BLE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e3f667ccbf5f94aaa4cbc2abd7bab02429cf4c5","infoHashBuffer":{"type":"Buffer","data":[94,63,102,124,203,245,249,74,170,76,188,42,189,123,171,2,66,156,244,197]},"announce":[],"urlList":[]}}