{"title":"MARCEL PROUST - Auf der Suche nach der verloreren Zeit - Buch 1-","uid":6607193,"size":9018257016,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e53c3bf3acc4c6693d717964552e00fe6fe357e&amp;dn=MARCEL+PROUST+-+Auf+der+Suche+nach+der+verloreren+Zeit+-+Buch+1-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":25,"uploader":"Petrosilius","files":-1,"time":1313447461,"description":"MARCEL PROUST - Auf der Suche nach der verloreren Zeit - Buch 1-7\n\n17 MP3 CD Mono 44100Hz 128kb/s\nVerlag: der HÃƒÂ¶rverlag (19. Oktober 2010)\nSprache: Deutsch\nISBN-10: 3867176825\nISBN-13: 978-3867176828\n\nKurzbeschreibung\nZehn Jahre lang schrieb Marcel Proust an seinem grandiosen und zeitlosen Meisterwerk Auf der Suche nach der verlorenen Zeit. Auf ÃƒÂ¼ber 4000 Seiten entfaltet er eine ganze Welt im Verstreichen ihrer Zeit: das Drama von Liebe und Eifersucht, die Intrigen der Gesellschaften in den Pariser Salons, Gedanken ÃƒÂ¼ber Literatur, Musik und Kunst, die Poesie der Landschaft und den Geschmack der Erinnerung. Acht Jahre lang las Peter Matic jeden Winter mehrere Wochen lang im Studio des Rundfunks Berlin-Brandenburg Prousts Roman. Wort fÃƒÂ¼r Wort, Zeile fÃƒÂ¼r Zeile. Seine kluge, nuancierte Interpretation bringt alle Facetten des vielschichtigen Werks zum Glaenzen. Ein Hoerbuch, das seinesgleichen sucht.\n\nÃƒÅ“ber den Autor\nMarcel Proust, 1871 geboren, gilt neben Joyce und Kafka als BegrÃƒÂ¼nder der literarischen Moderne. Er fuehrte - schon frueh an Asthma leidend - nach Studium und Taetigkeit in der BibliothÃƒÂ¨que Mazarine in Paris ein Salonleben, das nur von Reisen unterbrochen wurde. Nach dem Tod seiner Mutter zog sich Proust aus dem sozialen Leben in die Einsamkeit eines schallisolierten, mit Kork ausgeschlagenen Zimmers am Boulevard Haussmann zurÃƒÂ¼ck und machte die Arbeit an dem Roman Auf der Suche nach der verlorenen Zeit zum einzigen Inhalt seiner Existenz. Im Maerz 1922 beendete er das Werk und betrachtete dies als ErfÃƒÂ¼llung seines Lebens. Proust starb kurze Zeit spÃƒÂ¤ter in Paris.\n\nPressestimmen\nUnd sollten Sie wirklich mit dem Gedanken spielen, sich an dieses Mammutwerk heranzuwagen, so tun Sie dies unter allen Umstaenden mit der Hoerbuch-Version von Matic. Nie hat jemand einfÃƒÂ¼hlsamer, furchtloser und mit sonorerer Stimme ein Werk von solcher Bedeutung gelesen. (Berliner Zeitung )\n\nIn der Tat kann diese Aufnahme sÃƒÂ¼chtig machen. Matic versteht es wie kein Zweiter, Prousts Prosa, die an kunstvollen BandwurmsÃƒÂ¤tzen ebenso reich ist wie an Reflexionen und ausfuehrlichen Beschreibungen scheinbar nebensaechlicher Dinge, zum Schwingen zu bringen......Die Gesamtausgabe ist ein Meilenstein in der Geschichte des Hoerbuchs und Matics Lesung eine Meisterleistung der Sprecherkunst. (Buchjournal )\n\nPeter Matic wurde in Wien geboren, wo er 1960 seinen Weg als Schauspieler am Theater in der Josefstadt begann. Nach kurzen Stationen am Basler Theater und an den Kammerspielen in Muenchen war er seit 1972 und bis zu deren SchlieÃƒÅ¸ung 1994 Mitglied der Staatlichen Schauspielbuehnen Berlin.\nSeither gehoert er dem Ensemble des Burgtheaters in Wien an. Neben Gastspielen bei den Salzburger Festspielen, an der Bayerischen Staatsoper und in Berlin an der Deutschen Oper, am Theater des Westens und am Renaissance-Theater zahlreiche Arbeiten fÃƒÂ¼r Fernsehen und Hoerfunk.\nLiteraturlesungen gehoeren zu seinen bevorzugten Taetigkeiten.","torrent":{"xt":"urn:btih:5e53c3bf3acc4c6693d717964552e00fe6fe357e","amp;dn":"MARCEL+PROUST+-+Auf+der+Suche+nach+der+verloreren+Zeit+-+Buch+1-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e53c3bf3acc4c6693d717964552e00fe6fe357e","infoHashBuffer":{"type":"Buffer","data":[94,83,195,191,58,204,76,102,147,215,23,150,69,82,224,15,230,254,53,126]},"announce":[],"urlList":[]}}