{"title":"Hello Cheeky (1973-1979) BBC ABEE","uid":12246294,"size":452273405,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e7a50b1396d67177c2b949042334737c107f9d6&amp;dn=Hello+Cheeky+%281973-1979%29+BBC+ABEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"The_Abee","files":66,"time":1439918089,"description":"Hello Cheeky (1973-1979) BBC ABEE\n__\n &lt;a href=&quot;\nhttp://s29.postimg.org/wt747z187/99653.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s29.postimg.org/wt747z187/99653.jpg&lt;/a&gt;\n__\n\nThis series first began on Radio 2 in 1973 and was a sort of follow on to the hugely successful I'm Sorry I'll Read That Again, and was written by and starred Barry Cryer, John Junkin and Tim Brooke-Taylor. The show was full of puns, zany humour, and jokes so appalling it quite rightly has attained a reputation of being in the comedy sewers. That said, it still made 5 series, later transferred to television, and spawned two LPs (one of which, The Least Worst of Hello Cheeky is detailed later), so must have had a following. It is a shame then that the BBC in it's infinite wisdom only decided to hold on to two editions of the show. Luckily for us, there are a number of recordings about.\n\nThe first series constisted of 11 shows in 1973. Details of this series to follow.\n\nXmas Special 25.12.73\n\nThe second series was a further 15 shows and was broadcast between 10th February and 19th May 1974.\n\nEdition\tIntro...\tDate\n1\tDid I catch my what in a mangle?\t10.2.74\n2\tGive me liberty or give me death. Gunshot.\t17.2.74\n3\tThat's why the lady is a tramp.\t24.2.74\n4\tIn answer to an urgent enquiry from someone who just signs himself 'Mark of Sandhurst.\t3.3.74\n5\tLadies and Gentlemen and Gladys Swathley - What do you mean Gladys Swathley?\t10.3.74\n6\tWelcome to the sixteenth series of 'Hello Cheeky'.\t17.3.74\n7\t'The String Vest Of Infinity', an epic poem by John Junkin.\t24.3.74\n8\tHi there, this is Tim again. You know Ladies and Gentlemen....life is funny, isn't it?\t31.3.74\n9\tAnd now for those of you who like that kind of thing, here is the same tune backwards.\t7.4.74\n10\tHi there fans, Denis King Hyperstar here. I wrote that tune!\t14.4.74\n11\tAnd so it doth behove that we should cling like limpets and so insanity sit out the storm.\t21.4.74\n12\tAs most of you may remember, Addie Minter is convalescing in the Harpenden Hilton after a phantom pregnancy.\t28.4.74\n13\tMusic....hello! Goodbye...Music.\t5.5.74\n14\tHello everyone and welcome to an evening with me. After my dance I shall do some paper tearing. With Aimi Macdonald.\t12.5.74\n15\tAnd that music tells us its time for this week's quiet thought from Patience Strong.\t19.5.74\n\nXmas Special 25.12.74\n\nSeries Three consisted of 13 shows and was broadcast between 9th March and 1st June 1975. The recording of the Least Worst LP coincided with the recording sessions for this series.\nEdition\tIntro...\tDate\n1\tKnickers, Knickers, boobs, fat ladies and poofs. Get all the rude bits out of the way.\t9.3.75\n2\tHere are the answers to last week's programme. Yes, no, once in a while, when I can get it.\t16.3.75\n3\tThe next programme has been cancelled due to an outbreak of good taste, however never at a loss we present an awkward silence.\t23.3.75\n4\tSound effects....then 'wish they gave us a dressing-room nearer the studio.\t30.3.75\n5\tListen you chaps, I've had a good idea!\t6.4.75\n6\tAnd our special studio guest today is Enid Bolsolver newly crowned 'Rupture Appliance' Queen of Sunningdale.\t13.4.75\n7\tThe rain in Spain stays mainly in the plain.\t20.3.75\n8\tGood evening and welcome to this edition of Cheeky Digest.\t27.4.75\n9\tHere's Mr. Rupert Lump who is spokesman for Budgerigar Lib.\t4.5.75\n10\tHello Cheeky tonight comes from a Trappist Monastery.\t11.5.75\n11\tOoh, aah, come on Tim!' 'Well, that's got his trousers on!\t18.5.75\n12\tThat's funny....that's very funny. Hello Cuddles Brooke Taylor!\t25.5.75\n13\tHere is John Junkin with this week's appeal....Come on darlin - get 'em off!' (guest Joan Bakewell)\t1.6.75\n\nA further 16 shows made up the fourth series, broadcast between 15th May and 29th August 1976.\n\nEdition\tIntro...\tDate\n1\tLadies and Gentlemen we are priviliged tonight to devote the whole programme to that aspect of life which interests every red-blooded Englishman....Sport. (guest Frank Bough)\t15.5.76\n2\tGood morning and welcome to Open Wound.\t23.5.76\n3\tPlease is there a man with a soul so dead who never to himself has said...?\t30.5.76\n4\tI checked out my 45s for slugs...\t6.6.76\n5\tWell now it's time to call another contestant in our first ever radio Spot The Ball competition.\t13.6.76\n6\tIf music be the food of love could you whistle me and egg and chips twice?\t20.6.76\n7\tCheese sandwich attacks cabinet minister, chorus girl to rescue.\t27.6.76\n8\tLet's Go fo'ard Barry. Aye Aye Mush.\t4.7.76\n9\tHail Caesar! Beware the Ides of March.\t11.7.76\n10\tFrance. The Somme. Through the early morning mist a tattered band of khaki figures appear.\t18.7.76\n11\tMy dog's got no nose. How does he smell?\t25.7.76\n12\tLadies and gentlemen before the next programme here is the end of the next programme...\t1.8.76\n13\tI've done it; I've done it at last!\t8.8.76\n14\tTo be or not to be...that is the question\t15.8.76\n15\tLadies and gentlemen...to get this particular show off to a light frothy start I would like to tell you about my hernia.\t22.8.76\n16\tTim, Tim where are you? In my dressing room....coming!\t29.8.76\n\n &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Hello_Cheeky&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Hello_Cheeky&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.britishcomedy.org.uk/comedy/hcheeky.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.britishcomedy.org.uk/comedy/hcheeky.html&lt;/a&gt;\n\nSee a tiny collection of my torrents. And, find your favorite stuff there.  ;)\n_____________________________________\n                                                                                                                                                                                                          &lt;a href=&quot;\nhttp://thepiratebay.org/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.org/user/The_Abee/&lt;/a&gt;\n_____________________________________\n \n\nAnd, My Link On Suprbay:\n                                                         &lt;a href=&quot;\nhttps://pirates-forum.org/Thread-Promising-ebooks-Audio-Books-Torrents-by-The-Abee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/Thread-Promising-ebooks-Audio-Books-Torrents-by-The-Abee&lt;/a&gt;\n\nGet me there. :)\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                     :)__Abee","torrent":{"xt":"urn:btih:5e7a50b1396d67177c2b949042334737c107f9d6","amp;dn":"Hello+Cheeky+%281973-1979%29+BBC+ABEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7a50b1396d67177c2b949042334737c107f9d6","infoHashBuffer":{"type":"Buffer","data":[94,122,80,177,57,109,103,23,124,43,148,144,66,51,71,55,193,7,249,214]},"announce":[],"urlList":[]}}