{"title":"Touch Typing in Ten Hours Spend a Few Hours Now and Gain a Valua","uid":6272797,"size":12008308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e8055ed5e17c308742d611326b0fda3dfad980b&amp;dn=Touch+Typing+in+Ten+Hours+Spend+a+Few+Hours+Now+and+Gain+a+Valua&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"daemonx0x","files":1,"time":1301145471,"description":"Touch Type in Ten Hours contains easy-to-use lessons divided into manageable one hour blocks, and there are plenty of exercises to consolidate what you have learned. There is also a reference guide giving useful 'tips of the trade'. This new edition goes on to show you how to use Microsoft Word 2007 to best advantage. Most of us want to learn all the basics as quickly as possible and in no time at all you should be able to do everything from simple word processing tasks such as moving blocks of text, to more complex tasks such as mail merge, graphics and creating newspaper style columns. Spend a few hours now and reap the benefits for a lifetime, whether you are using a keyboard at work or at home.\nIf you use a keyboard you need this book. Most of us use computers - many of us all the time - but how many of us can type properly? 'When you've learned how to touch type a 3000 word report will take you less than 1 hour to type!' With this book you can learn to 'touch type' in ten hours at a fraction of the cost of a course. It will also take you less time than the average course and, best of all, you can learn in your own home or office. Just think how much time you will save in your working day - and you will be able to concentrate on the content rather than finding the correct letters.\n","torrent":{"xt":"urn:btih:5e8055ed5e17c308742d611326b0fda3dfad980b","amp;dn":"Touch+Typing+in+Ten+Hours+Spend+a+Few+Hours+Now+and+Gain+a+Valua","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e8055ed5e17c308742d611326b0fda3dfad980b","infoHashBuffer":{"type":"Buffer","data":[94,128,85,237,94,23,195,8,116,45,97,19,38,176,253,163,223,173,152,11]},"announce":[],"urlList":[]}}