{"title":"Relient K - Discography (1998-2013) [FLAC]","uid":8646743,"size":5446516227,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5e83c3bec47ca226595fc643d2ddc7e58f9f50ef&amp;dn=Relient+K+-+Discography+%281998-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"politux","files":-1,"time":1373007198,"description":"\n  Relient K - Discography (1998-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Punk-Pop, Alternative\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bits Per Sample: 16\n  Sampling Rate: 44,100 Hz\n\n  Albums\n \n  1998 All Work &amp; No Play\n  2000 2000 A.D.D\n  2000 Relient K\n  2001 The Creepy EP\n  2002 The Pirates Who Don't Do Anything\n  2003 Deck The Halls Bruise Your Hand \n  2003 Two Lefts Don't Make a Right...But Three Do\n  2004 Mmhmm\n  2005 Apathetic EP\n  2006 The Anatomy of the Tongue In Cheek (Remastered)\n  2007 Five Score and Seven Years Ago\n  2007 Let it Snow Baby... Let it Reindeer\n  2008 The Nashville Tennis EP (The Bird and the Bee Sides)\n  2009 Forget and Not Slow Down\n  2010 The First Three Gears 2000-2003\n  2013 Collapsible Lung\n\n  Canton, Ohio's Relient K formed in 1998 and joined the parade of Christian punk-pop artists (MxPx, Ghoti Hook, Slick Shoes, etc.) with their self-titled 2000 debut, mixing catchy melodies and snotty attitude with spiritual concerns. The record was produced by dc Talk guitarist Mark Townsend, and the band was comprised of vocalist/guitarist/pianist Matt Thiessen, guitarist Matthew Hoopes, bassist Brian Pittman, and drummer Stephen Cushman. David Douglas joined up in place of Cushman by the year's end, and Relient K followed up in August 2001 with The Anatomy of the Tongue in Cheek. \n\n  The album sold 300,000 copies and Relient K's momentum continued to build as they played nearly 200 shows in North America before the year closed out. A third full-length, Two Lefts Don't Make a Right... But Three Do, debuted at number 38 on Billboard's Top 200 album chart upon its release in spring 2003. The band didn't waste any time recording a fourth album; MMHMM, produced by lead singer Thiessen and dc Talk's Townsend and mixed by Tom Lord-Alge, was released in November 2004 by Gotee/Capitol. MMHMM scanned over 51,000 copies sold during its first week, hitting number 15 on the Top 200 and number one for Christian albums. It eventually went gold, Relient K's third consecutive album to do so, and the band's mainstream crossover was in full swing with singles &quot;Be My Escape&quot; and &quot;Who I Am Hates Who I've Been&quot; doing very well on modern rock radio and MTV.\n\n  Pittman left the group after MMHMM's release (later going on to play with Inhale/Exhale), and John Warne (ex-Ace Troubleshooter) filled in on bass for touring purposes, becoming a permanent member in 2005. Relient K further added Jonathan Schneck as a third guitarist (who also played banjo and bells) that year, bumping them up to quintet status. With Relient K touring constantly in support of MMHMM, Apathetic EP followed in November 2005 as another treat to hold over fans as the guys readied their next album. Five Score &amp; Seven Years Ago (as in their fifth album in seven years), largely produced by Howard Benson (My Chemical Romance, Less Than Jake), was released in early March 2007. \n\n  True to form, Relient K set out on a full round of nationwide dates, including spring shows with Mae and Sherwood, before releasing the Christmas-themed album Let It Snow Baby... Let It Reindeer (containing several tracks from the band's previous holiday release, Deck the Halls, Bruise Your Hand) later that fall. In October, Douglas announced that he would be leaving Relient K to dedicate himself full-time to his side project Gypsy Parade. He was replaced in early 2008 by Ethan Luck, who would accompany the group during its appearances on that year's Warped Tour. In July, the group released the B-side album The Bird and the Bee Sides, which was packaged with The Nashville Tennis EP. The band released its sixth studio album, Forget and Not Slow Down, in 2009. The seven-song covers EP K Is for Karaoke appeared in 2011.","torrent":{"xt":"urn:btih:5e83c3bec47ca226595fc643d2ddc7e58f9f50ef","amp;dn":"Relient+K+-+Discography+%281998-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e83c3bec47ca226595fc643d2ddc7e58f9f50ef","infoHashBuffer":{"type":"Buffer","data":[94,131,195,190,196,124,162,38,89,95,198,67,210,221,199,229,143,159,80,239]},"announce":[],"urlList":[]}}