{"title":"Tracy Nelson - Tracy Nelson [1974] [FLAC]","uid":8054352,"size":232509000,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5eb444c29d35437197ffec805ba9a86d9271bd8b&amp;dn=Tracy+Nelson+-+Tracy+Nelson+%5B1974%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":14,"time":1358924080,"description":"1 Slow Fall\n2 Love Has No Pride\n3 Hold An Old Friend's Hand\n4 Rock Me In Your Cradle\n5 It Takes A Lot To Laugh, It Takes A Train To Cry\n6 After The Fire Is Gone\n7 Lean On Me\n8 I Wish Someone Would Care\n9 Lay Me Down Easy\n10 Down So Low\n\nContaining the hit duet with Willie Nelson (&quot;After The Fire is Gone&quot;), this early 70s Atlantic Records solo outing from the Mother Earth lead singer is a stone classic. Also features harmony vocals by Linda Ronstadt and a guest appearance by New Orleans legend Allen Toussain\nTracy Nelson has always done things her way and has sometimes paid a commercial price for having done so. This album marked her move away from recording with her band, Mother Earth. It was not technically her first solo venture since she had recorded a solo blues oriented album (DEEP ARE THE ROOTS) at age 19 for the independent Prestige label and had done a classic solo C&amp;W album while still with the band. The full title of that album (MOTHER EARTH PRESENTS TRACY NELSON COUNTRY) reflected her ties to the group and emphasized that that one was primarily a spin-off product. Mother Earth, an originally San Francisco based band joined Tracy on her move to Nashville, but there was always a kind of San Fran hippie looseness about them. By 1974, either Tracy or her record company decided to try and move beyond that. This time out, she was recording officially as a solo act (she was however still TOURING with Mother Earth, to make matters more complicated).\n\nThe result was anything but a typical Mother Earth styled album. TRACY NELSON was much more of a production job than any of the preceding Mother Earth records had been. Where Mother Earth had been known for making &quot; a joyful noise&quot;--gospel rave-ups like BRING ME HOME released just a few years before demonstrated a winning exuberence--here Tracy sounded a bit more constrained and solemn (exception: the just-for-fun duet with Willie &quot;No Relation&quot; Nelson, which was justifiably Grammy nominated--and yes, that's Linda Ronstadt doing the background vocal).\n\nThe result was impressive, but actually moodier and darker than her previous work. So even though she may have been knuckling in a bit to record company pressure to be more commercial and &quot;tighter,&quot; I suspect still that this was the album that Tracy wanted to make. The mood is too consistently solemn to have been determined by some marketing exec's whim. Tracy has always had a flair for finding appropriate material and the somewhat solemn mood of the album(as exemplified in songs like &quot;Slow Fall,&quot; &quot;Hold an Old Friend's Hand,&quot; and &quot;Rock Me In Your Cradle&quot; and especially her emotive take on the Irma Thomas classic &quot;I Wish Someone Could Care&quot; and the second recorded version of her own signature song &quot;Down So Low&quot;) no doubt reflected her mood at the time.\n\nThis is a different sort of Tracy Nelson album\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:5eb444c29d35437197ffec805ba9a86d9271bd8b","amp;dn":"Tracy+Nelson+-+Tracy+Nelson+%5B1974%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb444c29d35437197ffec805ba9a86d9271bd8b","infoHashBuffer":{"type":"Buffer","data":[94,180,68,194,157,53,67,113,151,255,236,128,91,169,168,109,146,113,189,139]},"announce":[],"urlList":[]}}