{"title":"An Introduction to Islamic Law","uid":5965865,"size":993068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fc0269f94359b1fb46ee8a0cbdebddd8cfdc6a2&amp;dn=An+Introduction+to+Islamic+Law&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1290108353,"description":"The study of Islamic law can be a forbidding prospect for those entering\nthe field for the first time. Wael Hallaq, a leading scholar and practitioner\nof Islamic law, guides students through the intricacies of the subject in\nthis absorbing introduction. The first half of the book is devoted to a\ndiscussion of Islamic law in its pre-modern natural habitat. The author\nexpounds on the roles of jurists, who reasoned about the law, and of judges\nand others who administered justice; on how different legal schools came\nto be established, and on how a moral law functioned in early Muslim\nsociety generally. The second part explains how the law was transformed\nand ultimately dismantled during the colonial period. As the author\ndemonstrates, this rupture necessitated its reinvention in the twentiethcentury\nworld of nation-states. In the final chapters, the author charts\nrecent developments and the struggles of the Islamists to negotiate\nchanges which have seen the law emerge as a primarily textual entity\nfocused on fixed punishments and ritual requirements. The book, which\nincludes a chronology, a glossary of key terms and lists for further reading,\nwill be the first stop for those who wish to understand the fundamentals\nof Islamic law, its practices and its history.\n\nCambridge University Press, 2009","torrent":{"xt":"urn:btih:5fc0269f94359b1fb46ee8a0cbdebddd8cfdc6a2","amp;dn":"An+Introduction+to+Islamic+Law","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc0269f94359b1fb46ee8a0cbdebddd8cfdc6a2","infoHashBuffer":{"type":"Buffer","data":[95,192,38,159,148,53,155,31,180,110,232,160,203,222,189,221,140,253,198,162]},"announce":[],"urlList":[]}}