{"title":"Alex Through the Looking-Glass: How Life Reflects Numbers and Nu","uid":10377769,"size":21926507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fd0426024ddd7e05f26aeb21bdcd72dd78332b0&amp;dn=Alex+Through+the+Looking-Glass%3A+How+Life+Reflects+Numbers+and+Nu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":4,"time":1403025785,"description":"Hardcover: 352 pages\nPublisher: Bloomsbury Publishing (10 April 2014)\nISBN-10: 1408817772\nISBN-13: 978-1408817773\n\nFrom triangles, rotations and power laws, to fractals, cones and curves, bestselling author Alex Bellos takes you on a journey of mathematical discovery with his signature wit, engaging stories and limitless enthusiasm. As he narrates a series of eye-opening encounters with lively personalities all over the world, Alex demonstrates how numbers have come to be our friends, are fascinating and extremely accessible, and how they have changed our world.\n\nHe turns even the dreaded calculus into an easy-to-grasp mathematical exposition, and sifts through over 30,000 survey submissions to reveal the world's favourite number. In Germany, he meets the engineer who designed the first roller-coaster loop, whilst in India he joins the world's highly numerate community at the International Congress of Mathematicians. He explores the wonders behind the Game of Life program, and explains mathematical logic, growth and negative numbers. Stateside, he hangs out with a private detective in Oregon and meets the mathematician who looks for universes from his garage in Illinois.\n\nRead this captivating book, and you won't realise that you're learning about complex concepts. Alex will get you hooked on maths as he delves deep into humankind's turbulent relationship with numbers, and proves just how much fun we can have with them.\n &lt;a href=&quot;\nhttp://i.imgur.com/xDn3zSy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/xDn3zSy.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5fd0426024ddd7e05f26aeb21bdcd72dd78332b0","amp;dn":"Alex+Through+the+Looking-Glass%3A+How+Life+Reflects+Numbers+and+Nu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fd0426024ddd7e05f26aeb21bdcd72dd78332b0","infoHashBuffer":{"type":"Buffer","data":[95,208,66,96,36,221,215,224,95,38,174,178,27,220,215,45,215,131,50,176]},"announce":[],"urlList":[]}}