{"title":"Arshin Adib-Moghaddam - A Metahistory of the Clash of Civilisati","uid":10307371,"size":6184725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60bb5d200737a6e9cde331887b8255a725adb7d3&amp;dn=Arshin+Adib-Moghaddam+-+A+Metahistory+of+the+Clash+of+Civilisati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Anette14","files":-1,"time":1402149031,"description":"Description\nProduct Details\nBook Title: A Metahistory of the Clash of Civilisations: Us and Them Beyond Orientalism (Columbia/Hurst)\t\nBook Author: Arshin Adib-Moghaddam (Author)\nSeries: Columbia/Hurst\nHardcover: 288 pages\nPublisher: Columbia University Press; 1St Edition edition (May 17, 2011)\nLanguage: English\nISBN-10: 0231702124\nISBN-13: 978-0231702126\n\n===================================================================================\nBook Description\nBeginning with the wars of ancient Persia and Greece, Arshin Adib-Moghaddam searches for the theoretical underpinnings of the &quot;clash of civilizations&quot; that has determined so much of our political and cultural discourse. He revisits the Crusades, colonialism, the Enlightenment, and our contemporary war on terror, and he engages with both eastern and western thinkers, such as Adorno, Derrida, Farabi, Foucault, Hegel, Khayyam, Marcuse, Marx, Said, Ibn Sina, and Weber.\nAdib-Moghaddam's investigation explains the conceptual genesis of the clash of civilizations and the influence of western and Islamic representations of the other. He highlights the discontinuities between Islamism and the canon of Islamic philosophy, which distinguishes between Avicennian and Qutbian discourses of Islam, and he reveals how violence became inscribed in western ideas, especially during the Enlightenment. Expanding critical theory to include Islamic philosophy and poetry, this metahistory refuses to treat Muslims and Europeans, Americans and Arabs, and the Orient and the Occident as separate entities.\n\n===================================================================================\nReview\n'This passionate and elegant work is a vigorous antidote to a constellation of discourses steeped in the Weltanschauung that the title of Samuel Huntington's infamous book encapsulates so well. Arshin Adib-Moghaddam's reflections are a stimulating contribution to Edward Said's legacy of radical critique of all essentialist constructions of otherness.'- Prof. Gilbert Achcar, author of The Arabs and the Holocaust and (with Noam Chomsky) Perilous Power: The Middle East and US foreign policy 'What Adib-Moghaddam has done is to establish an exceptionally powerful refutation of clashing civilizations. Eloquently, rigorously and imaginatively, he traces and critiques genealogies of binary and simple oppositional thought and argues that the future of the world depends on our accepting and understanding complexities and internal oppositions.'-Prof. Stephen Chan, 2010 International Studies Association (ISA) Eminent Scholar in Global Development 'Eloquent, powerful, incisive and impressive in its range, A Metahistory of the Clash of Civilisations is a masterly work of critical deconstruction in the finest tradition of Michel Foucault and Edward Said. For anyone wishing to better understand the current state of international politics, this book is absolutely essential.' -Richard Jackson, Secretary of the British International Studies Association (BISA)\n\nThis passionate and elegant work is a vigorous antidote to a constellation of discourses steeped in the Weltanschauung that the title of Samuel Huntington's infamous book encapsulates so well. Arshin Adib-Moghaddam's reflections are a stimulating contribution to Edward Said's legacy of radical critique of all essentialist constructions of otherness. (Gilbert Achcar, author (with Noam Chomsky) of Perilous Power: The Middle East and U.S. Foreign Policy)\n\n===================================================================================\nAbout the Author\nArshin Adib-Moghaddam is Reader in Comparative Politics and International Relations at the School of Oriental and African Studies, University of London. He is the author of Iran in World Politics: The Question of the Islamic Republic and The International Politics of the Persian Gulf: A Cultural Genealogy.\n===================================================================================","torrent":{"xt":"urn:btih:60bb5d200737a6e9cde331887b8255a725adb7d3","amp;dn":"Arshin+Adib-Moghaddam+-+A+Metahistory+of+the+Clash+of+Civilisati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60bb5d200737a6e9cde331887b8255a725adb7d3","infoHashBuffer":{"type":"Buffer","data":[96,187,93,32,7,55,166,233,205,227,49,136,123,130,85,167,37,173,183,211]},"announce":[],"urlList":[]}}