{"title":"The Barrow by Mark Smylie","uid":9732632,"size":2748188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:611062cb87bc91c3f06e372139a86a2b7ad54f08&amp;dn=The+Barrow+by+Mark+Smylie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1394407416,"description":"\nAction, horror, politics, and sensuality combine in this debut epic fantasy novel for fans of George R. R. Martin and Michael J. Sullivan, set in the world of the Eisner Award-nominated Artesia comic books.\n\nTo find the Sword, unearth the Barrow. To unearth the Barrow, follow the Map.\n\nWhen a small crew of scoundrels, would-be heroes, deviants, and ruffians discover a map that they believe will lead them to a fabled sword buried in the barrow of a long-dead wizard, they think they've struck it rich. But their hopes are dashed when the map turns out to be cursed and then is destroyed in a magical ritual. The loss of the map leaves them dreaming of what might have been, until they rediscover the map in a most unusual and unexpected place.\n\nStjepan Black-Heart, suspected murderer and renegade royal cartographer; Erim, a young woman masquerading as a man; Gilgwyr, brothel owner extraordinaire; Leigh, an exiled magus under an ignominious cloud; Godewyn Red-Hand, mercenary and troublemaker; Arduin Orwain, scion of a noble family brought low by scandal; and Arduin's sister Annwyn, the beautiful cause of that scandal: together they form a cross section of the Middle Kingdoms of the Known World, united by accident and dark design, on a quest that will either get them all in the history books...or get them all killed.\n\nGenre: Fiction, Fantasy","torrent":{"xt":"urn:btih:611062cb87bc91c3f06e372139a86a2b7ad54f08","amp;dn":"The+Barrow+by+Mark+Smylie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"611062cb87bc91c3f06e372139a86a2b7ad54f08","infoHashBuffer":{"type":"Buffer","data":[97,16,98,203,135,188,145,195,240,110,55,33,57,168,106,43,122,213,79,8]},"announce":[],"urlList":[]}}