{"title":"Graham Bonnet - Here Comes The Night [1991] ex-Rainbow, MSG, Alc","uid":4443224,"size":56453610,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6183fe2a94f7885276e2f34eee6d7c37cc782145&amp;dn=Graham+Bonnet+-+Here+Comes+The+Night+%5B1991%5D+ex-Rainbow%2C+MSG%2C+Alc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sweetthing","files":15,"time":1223922311,"description":"Early days \n\nBonnet had his first hit single with the duo, The Marbles in 1968, with the single &quot;Only One Woman&quot; (Polydor 56 272), which reached Number 5 in the UK Singles Chart. This and its follow up were both written by Barry Gibb and Robin Gibb of the Bee Gees who had recorded in Australia with Bonnet&amp;#039;s fellow Marble Trevor Gordon.\n\nBonnet then quit to do advert jingles. He appeared in the 1974 British comedy film, Three for All as lead singer of &amp;#039;Billy Beethoven&amp;#039;, a fictional band, along with several notable UK comedy personalities and his then partner Adrienne Posta, although his character&amp;#039;s lines were limited to only two words.\n\n\n\nMiddle years\n\nIn 1977 he released an eponymous album, which was certified gold in Australia. The single, &quot;It&amp;#039;s All Over Now, Baby Blue&quot;, a cover version of the Bob Dylan song, also reached the top five in Australia in 1977, and the following year the single &quot;Warm Ride&quot;, written by the Bee Gees, and a leftover from the Saturday Night Fever sessions, reached number one there.\n\nChosen by Ritchie Blackmore to replace Ronnie James Dio in the ranks of Rainbow, he sang on the Down to Earth album, which spawned two hit singles in 1980; &quot;Since You Been Gone&quot; and &quot;All Night Long&quot;. Bonnet also appeared with the group headlining the inaugural Monsters of Rock festival at Donington Park, Castle Donington.\n\nBonnet&amp;#039;s time with Rainbow was short and he left to resume his solo career, releasing the Line Up album in 1981, handled by producer, John Eden. For the recording of Line Up Bonnet managed to enlist several well-known rock musicians including Deep Purple and Whitesnake keyboard player Jon Lord, Whitesnake and Rainbow drummer Cozy Powell, Status Quo guitarist Francis Rossi, Whitesnake guitarist Micky Moody and bassist Gary Twigg. Around this time Bonnet sang on an advertisement for Levi&amp;#039;s jeans (the song was entitled &quot;These Eyes&quot;), although his version has never been released.\n\nTempted by an offer from ex-UFO guitarist Michael Schenker, Bonnet joined the Michael Schenker Group for the Assault Attack album. Bonnet then co-founded Alcatrazz, with Gary Shea (bass), and Jimmy Waldo (keyboards) of the band New England, former Alice Cooper drummer Jan Uvena and Swedish guitarist Yngwie Malmsteen. The band had major success in Japan with No Parole from Rock N&amp;#039; Roll in 1983, Live Sentence, Disturbing the Peace with new guitarist Steve Vai (formerly with Frank Zappa) and Dangerous Games with Danny Johnson on guitar. The latter album featured a remake of the Marbles&amp;#039; &quot;Only One Woman&quot;.\n\nUK television viewers were given vocal tips by Bonnet on the second BBC TV Rock School series shown around this time, which also included clips of Alcatrazz in rehearsal. Alcatrazz disbanded in 1987. Bonnet recently reformed Alcatrazz with three new musicians. Shea, Uvena and Waldo have also regrouped as Alcatrazz. Both bands have official pages on\n\n\n\nLater career\n\nBonnet&amp;#039;s post-Alcatrazz projects have all been short-lived and included Blackthorne (working with ex-Balance guitarist Bob Kulick), backing vocals for the Danish heavy metal band Pretty Maid&amp;#039;s Future World and numerous session work for Forcefield, appearing on To Oz and Back and Let The Wild Run Free. In 1988 the singer joined Impellitteri, for their album Stand In Line.\n\nAn appearance on Eddie Hardin and Pete York&amp;#039;s musical adaptation of Wind in The Willows, performed live in Germany in 1991, saw Bonnet sing on around six of the songs alongside fellow musicians Jon Lord, Don Airey and Ray Fenwick amongst others. Fenwick and Airey also featured heavily on Bonnet&amp;#039;s 1991 solo album Here Comes The Night which includes several covers as well as songs written by his wife Jo Eime, and another remake of the Marbles&amp;#039;, &quot;Only One Woman&quot;.\n\nIn 1997 he released Underground, a new solo album, which helped re-establish him with his fan base in Japan. 1999&amp;#039;s The Day I Went Mad featured guitarist Slash, Def Leppard guitarist Vivian Campbell, Bruce Kulick plus guitarist, Mario Parga.\n\nBonnet contributed lead vocals to the Japanese metal band Anthem&amp;#039;s 2000 release Heavy Metal Anthem, which had reworks of classic Anthem tracks. Bonnet rejoined Impellitteri in 2000 for their System X album. Meanwhile, his 1999 Japanese solo album got a UK release in September 2001.\n\nAt the back end of 2001, Bonnet went on a solo UK tour. His band included keyboard player Don Airey, bassist Chris Childs and drummer Harry James of Thunder and guitarist Dario Mollo.\n\nIn early 2004 Bonnet joined Italian guitarist Dario Mollo&amp;#039;s new project Elektric Zoo, touring Europe during April. Maintaining the Italian connection, the singer also participated in Matteo Filippini&amp;#039;s project, Moonstone, featuring on the track &quot;Not Dead Yet&quot;.\n\nIn 2006 Bonnet contributed vocals to the Welcome to America album by Taz Taylor. The following year he toured the UK with Taylor. A recovering alcoholic, Bonnet revealed onstage during this tour that he has been sober since 2004.\n\nHe also appeared in the Countdown Spectacular concert series in Australia between August and September 2007. He sang two songs, including &quot;Warm Ride&quot;.\n\nCurrently resident in Los Angeles, California, he continues to record and tour extensively.\n\n","torrent":{"xt":"urn:btih:6183fe2a94f7885276e2f34eee6d7c37cc782145","amp;dn":"Graham+Bonnet+-+Here+Comes+The+Night+%5B1991%5D+ex-Rainbow%2C+MSG%2C+Alc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6183fe2a94f7885276e2f34eee6d7c37cc782145","infoHashBuffer":{"type":"Buffer","data":[97,131,254,42,148,247,136,82,118,226,243,78,238,109,124,55,204,120,33,69]},"announce":[],"urlList":[]}}