{"title":"George Jones, Tammy &amp; Gospel","uid":4588101,"size":920705041,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61c385a92d4e2aef76a10f4a175f77d1c3b90588&amp;dn=George+Jones%2C+Tammy+%26+Gospel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tamroi","files":210,"time":1229715149,"description":"George &amp; Tammy\n\nBy most accounts, George Jones is the finest vocalist in the recorded history of country music. Initially, he was a hardcore honky tonker in the tradition of Hank Williams, but over the course of his career he developed an affecting, nuanced ballad style. In the course of his career, he never left the top of the country charts, even as he suffered innumerable personal and professional difficulties.\n\nMusicor wound up flooding the market with George Jones records during the '60s. That meant that while Jones was one of the most popular and acclaimed singers in country music, there was still a surplus of material.\n\nLike his discography, Jones' personal life was spinning out of control. He was drinking heavily and began missing concerts. His second wife, Shirley, filed for divorce in 1968, and Jones moved to Nashville, where he met Tammy Wynette, the most popular new female singer in country music. \n\nSoon, Jones and Wynette fell in love; they married on February 16, 1969. At the same time Jones married Wynette, tensions that had been building between Jones and longtime producer Daily culminated. Jones was unhappy with the sound of his Musicor records, and he placed most of the blame on Daily. After his marriage, Jones wanted to record with Wynette, but Musicor wouldn't allow him to appear on her label, Epic, and Epic wouldn't let her sing on a Musicor album. Furthermore, Epic wanted to lure Jones away from Musicor. Jones was more than willing to leave, but he had to fulfill his contract before the company would let him go.\n\nWhile he continued recording material for Musicor, Epic entered contract negotiations with their rivals, and halfway through 1971, Jones severed ties with Musicor and Daily. He signed away all the rights to his Musicor recordings in the process. Jones signed with Epic Records in October of 1971. It was the culmination of a busy year for Jones, one that saw him and Wynette becoming the biggest stars in country music, racking up a number of Top Ten hits as solo artists and selling out concerts across the country as a duo. Jones had successfully remade his image from a short-haired, crazed honky tonker to more relaxed, sensitive balladeer. At the end of the year, he cut his first records for Epic.\n\nThough every single he released in 1973 went into the Top Ten, Jones' personal life was getting increasingly difficult. Wynette filed for divorce in August 1973. Shortly after she filed the papers, the couple decided to reconcile and her petition was withdrawn. Following her withdrawal, the duo had a number one single with the appropriately titled &quot;We're Gonna Hold On.&quot; In the summer of 1974, Jones had his first number one hit since &quot;Walk Through This World With Me&quot; with &quot;The Grand Tour,&quot; a song that drew a deft portrait of a broken marriage. He followed it with another number one hit, &quot;The Door.&quot; Not long after its release, he recorded &quot;These Days (I Barely Get By),&quot; which featured lyrics co-written by Wynette. Two days after he recorded the song, Wynette left Jones; they divorced within a year.\nAMG","torrent":{"xt":"urn:btih:61c385a92d4e2aef76a10f4a175f77d1c3b90588","amp;dn":"George+Jones%2C+Tammy+%26+Gospel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61c385a92d4e2aef76a10f4a175f77d1c3b90588","infoHashBuffer":{"type":"Buffer","data":[97,195,133,169,45,78,42,239,118,161,15,74,23,95,119,209,195,185,5,136]},"announce":[],"urlList":[]}}