{"title":"How Apollo Flew to the Moon","uid":6603851,"size":30250245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62803f8e9e15e740f71d32e1a17d82245621c067&amp;dn=How+Apollo+Flew+to+the+Moon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"_F1_","files":-1,"time":1313280861,"description":"How Apollo Flew to the Moon\n(Springer Praxis Books / Space Exploration)\n\nPaperback: 586 pages\nPublisher: Springer; 2nd Edition. edition (August 31, 2011)\nLanguage: English\nISBN-10: 1441971785\nISBN-13: 978-1441971784\n\nStung by the pioneering space successes of the Soviet Union - in particular, Gagarin being the first man in space, the United States gathered the best of its engineers and set itself the goal of reaching the Moon within a decade. In an expanding 2nd edition of How Apollo Flew to the Moon, David Woods tells the exciting story of how the resulting Apollo flights were conducted by following a virtual flight to the Moon and its exploration of the surface. From launch to splashdown, he hitches a ride in the incredible spaceships that took men to another world, exploring each step of the journey and detailing the enormous range of disciplines, techniques, and procedures the Apollo crews had to master. While describing the tremendous technological accomplishment involved, he adds the human dimension by calling on the testimony of the people who were there at the time. He provides a wealth of fascinating and accessible material: the role of the powerful Saturn V, the reasoning behind trajectories, the day-to-day concerns of human and spacecraft health between two worlds, the exploration of the lunar surface and the sheer daring involved in traveling to the Moon and the mid-twentieth century. Given the tremendous success of the original edition of How Apollo Flew to the Moon, the second edition will have a new chapter on surface activities, inspired by reader's comment on Amazon.com. There will also be additional detail in the existing chapters to incorporate all the feedback from the original edition, and will include larger illustrations.","torrent":{"xt":"urn:btih:62803f8e9e15e740f71d32e1a17d82245621c067","amp;dn":"How+Apollo+Flew+to+the+Moon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62803f8e9e15e740f71d32e1a17d82245621c067","infoHashBuffer":{"type":"Buffer","data":[98,128,63,142,158,21,231,64,247,29,50,225,161,125,130,36,86,33,192,103]},"announce":[],"urlList":[]}}