{"title":"Pasolini - Un delitto italiano [DVDrip - Ita] [TNT Village]","uid":5544777,"size":947642368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:62ad55ffff8faa95e14098f85f0b70739e3b637b&amp;dn=Pasolini+-+Un+delitto+italiano+%5BDVDrip+-+Ita%5D+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"l.diliberto","files":1,"time":1273347250,"description":" &lt;a href=&quot;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=19876&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=19876&lt;/a&gt;\n\nDiversamente da quanto affermano numerosi critici, &quot;Pasolini, un delitto italiano&quot; non ÃƒÂ¨ il contrario di &quot;JFK&quot; di Oliver Stone, ma ne costituisce una buona imitazione. &quot;JFK&quot; a sua volta riprendeva e spingeva al suo parossismo la tecnica di racconto dei film di Costa Gravas.\nIl film di Marco Tullio Giordana si inserisce quindi nella tradizione del &quot;thriller politico&quot; di cui &quot;Z, l'orgia del potere&quot; rimane l'archetipo incontrastato. Questo non ÃƒÂ¨ affatto un demerito. Al contrario, l'onestÃƒÂ  con cui Marco Tullio Giordana riconosce l'esistenza di una tradizione cinematografica di genere, e desideri inserirsi sulla sua scia, per utilizzarne al meglio le tecniche narrative, ÃƒÂ¨ il motivo che fa del suo &quot;Pasolini&quot; un film quasi riuscito. Sospettiamo tuttavia che la vera mente creativa si annidi nei cervelli dei due sceneggiatiori, Stefano Rulli e Sandro Petraglia, che consideriamo oggi i migliori sceneggiatori del cinema italiano. Essi garantiscono ad ogni film che scrivono, uno standard di struttura, di ritmo e di emozioni primarie molto elevato, e sanno modificare il loro linguaggio a secondo che si tratti di un film televisivo o di un'opera cinematografica. Affermare che &quot;Pasolini, un delitto italiano&quot; sia televisivo ÃƒÂ¨ superficiale e sbagliato: il ritmo che Rulli e Petraglia hanno impresso al film ÃƒÂ¨ tipicamente cinematografico; basta paragonarlo alla voluta lentezza &quot;soaperistica&quot; delle loro Piovre per rendersene conto.\nL'altro loro merito ÃƒÂ¨ la chiarezza. &quot;Pasolini...&quot; ÃƒÂ¨ un film che ha come obbiettivo principale di fare chiarezza sulla confusione sospetta dell'indagine che seguÃƒÂ¬ la morte dello scrittore, per aprire la porta ad altre ipotesi sul suo assassinio; e su questo punto, il film coglie nel segno. Riprendendo la tecnica di &quot;JFK&quot;, il film si apre sulla versione ufficiale, secondo la quale lo scrittore fu ucciso da un solo uomo per motivi personali; questa versione viene a poco a poco scardinata con la presentazione delle controprove: gli indizi che la sconfessano, la mancanza di una seria indagine poliziesca, i moventi di un possibile delitto politico, che gli autori fanno risalire agli scritti di Pasolini contro il potere e all'epoca storica che il paese attraversava in quel periodo.\nE' soprattutto nella ricostruzione epocale che il film ÃƒÂ¨ efficace. Ricostruire gli anni settanta ha sempre costituito uno scoglio estetico sul quale si sono infranti numerosi film, non solo italiani. Giordana riesce invece a ricreare l'atmosfera di quegli anni grazie sopratutto alla scelta delle facce, dei costumi, e del modo di parlare dei personaggi. A tal punto che le immagini d'archivio in bianco e nero che vengono spesso inserite nell'azione sembrano la naturale continuitÃƒÂ  delle scene di ricostituzione.\nPurtroppo, come accade sempre nei film italiani contemporanei, il rigore non viene mantenuto fino all'ultimo, e il film cade in alcune trappole che ne compromettono la completa riuscita. Le trappole in questione sono quelle che potremmo definire &quot;il pathos&quot;, ovvero l'abuso di strumenti cinematografici per creare senza sforzo un'emozione patetica nello spettatore: il ricorso ripetuto alle note di Morricone quando si accenna alla orrenda morte di Pasolini, la messa in scena della reazione emotiva di coloro che gli stavano vicino, tolgono al film il pudore necessario ad ogni requisitoria efficace. L'intenzione di Giordana di trascendere la dimensione di cronaca del suo film esprimendo il rimpianto per l'enorme perdita subita con la morte del grande intelletuale ÃƒÂ¨ legittima e anzi doverosa. E' un peccato quindi che Giordana non abbia studiato con maggiore attenzione i suoi modelli (Gavras, Stone), per cercare di far passare questa emozione senza cadere nella retorica.\nSi rimprovera spesso a Oliver Stone di essere manicheo e melodrammatico, ma in &quot;JFK&quot; il lutto per la figura scomparsa ÃƒÂ¨ portato con estrema discrezione, l'emozione patetica viene inserita solo in alcuni momenti precisi - i momenti &quot;di riposo&quot; per il pubblico, quando l'accumulazione di informazioni sul complotto diventa insostenibile per lo spettatore e la sua indignazione raggiunge il culmine - per dilagare solo nel &quot;climax&quot;, al momento della requisitoria finale.\nQuello di cui stiamo parlando ÃƒÂ¨ l'arte della manipolazione. Il cinema ÃƒÂ¨ manipolazione, manipolazione delle emozioni dello spettatore. Calcolare come e quando bisogna giocare sulla nota patetica per non abusarne, ragionare sull'economia dell'emozione. Questo aspetto diventa ancora piÃƒÂ¹ importante quando si usa il cinema per difendere una giusta causa morale e politica. Non ÃƒÂ¨ improbabile che Giordana, Rulli e Petraglia, intimiditi dalla figura di Pasolini al punto di sentirsi in colpa per il solo fatto di dedicargli un film &quot;commerciale&quot;, non abbiano osato applicare alla gestione delle loro emozioni sul grande uomo quel ragionamento scrupoloso che hanno dimostrato nella ricostruzione giudiziaria della sua morte.\n\nNazionalitÃƒÂ :Italia / Francia\nAnno: 1995\nGenere: Drammatico, Giallo\nRegia: Marco Tullio Giordana\nData di uscita: 03 Settembre 1995\nCast:\nCarlo DeFilippi\nNicoletta Braschi\nToni Bertorelli\nAndrea Occhipinti\nVictor Cavallo\n\nDimensione: 903,7\nDurata: 01:37\n\nVideo Codec: msmpeg4\nVideo Bitrate: 1301kb/sB]\n[B]FPS: 25\n\nAudio Codec: mp3\nAudio Bitrate: 127kb/s\nFreq Audio: 44100Hz Stereo","torrent":{"xt":"urn:btih:62ad55ffff8faa95e14098f85f0b70739e3b637b","amp;dn":"Pasolini+-+Un+delitto+italiano+%5BDVDrip+-+Ita%5D+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62ad55ffff8faa95e14098f85f0b70739e3b637b","infoHashBuffer":{"type":"Buffer","data":[98,173,85,255,255,143,170,149,225,64,152,248,95,11,112,115,158,59,99,123]},"announce":[],"urlList":[]}}