{"title":"[Rebecca A. Bader,David A. Putnam]Engineering Polymer Systems fo","uid":11200085,"size":6976198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62d78510338de787623e7fb8fe26f1c46f7d560a&amp;dn=%5BRebecca+A.+Bader%2CDavid+A.+Putnam%5DEngineering+Polymer+Systems+fo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413160204,"description":"Product Description\n\nPolymers have played a critical role in the rational design and application of drug delivery systems that increase the efficacy and reduce the toxicity of new and conventional therapeutics. Beginning with an introduction to the fundamentals of drug delivery, Engineering Polymer Systems for Improved Drug Delivery explores traditional drug delivery techniques as well as emerging advanced drug delivery techniques. By reviewing many types of polymeric drug delivery systems, and including key points, worked examples and homework problems, this book will serve as a guide to for specialists and non-specialists as well as a graduate level text for drug delivery courses.\nFrom the Back Cover\nReviews new and emerging polymer systems that improve the accuracy of drug delivery High-throughput technology has dramatically increased the pace of new drug development; however, negative side effects remain a significant problem in the field, hampering our ability to bring safe and effective drugs to market. Drawing from the latest advances in pharmaceutical science and polymer engineering, this text explains the role of polymers in the rational design and application of drug delivery systems that increase the efficacy and reduce the toxicity of therapeutics. As a result, readers will learn how to maximize the potential of therapeutics, including those previously eliminated as viable candidates due to undesirable interactions. Engineering Polymer Systems for Improved Drug Delivery features contributions from a team of leading experts and pioneers in the field. The text begins with an exploration of the fundamentals and challenges of drug delivery, setting a solid foundation for the text's core topics: Injectable polymeric drug delivery systems Implantable polymeric drug delivery systems Oral polymeric drug delivery systems Advanced polymeric drug delivery Each chapter covers the basics to engage novice investigators and students as well as more advanced topics to support experienced researchers. Worked examples in every chapter help readers better understand the ins and outs of designing successful polymeric drug delivery systems. There are also practice problems that challenge readers to apply their newfound knowledge. With its systematic and logical approach, Engineering Polymer Systems for Improved Drug Delivery is recommended both as a textbook for courses in pharmaceutical science and drug delivery as well as a reference for professionals in drug delivery. \n\nPublisher: Wiley; 1 edition (17 January 2014)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00HXUSRPK","torrent":{"xt":"urn:btih:62d78510338de787623e7fb8fe26f1c46f7d560a","amp;dn":"%5BRebecca+A.+Bader%2CDavid+A.+Putnam%5DEngineering+Polymer+Systems+fo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62d78510338de787623e7fb8fe26f1c46f7d560a","infoHashBuffer":{"type":"Buffer","data":[98,215,133,16,51,141,231,135,98,62,127,184,254,38,241,196,111,125,86,10]},"announce":[],"urlList":[]}}