{"title":"Dirty Daddy - Bob Saget - Audiobook MP3","uid":10507817,"size":199927054,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:63550ef0ce4dc7067f7e226de37472d0a39f2836&amp;dn=Dirty+Daddy+-+Bob+Saget+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404804032,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nDirty Daddy: The Chronicles of a Family Man Turned Filthy Comedian\n\nWritten by: Bob Saget\nNarrated by: Bob Saget\nLength: 6 hrs and 45 mins\nFormat: Unabridged\nRelease Date:04-08-14\nProgram Type: Audiobook\n\nMillions of viewers know and love Bob Saget from his role as the sweetly neurotic father on the smash hit Full House, and as the charming wisecracking host of America's Funniest Home Videos. And then there are the legions of fans who can't get enough of his scatological, out-of-his-mind stand-up routines, comedy specials, and outrageously profane performances in such shows as HBO's Entourage and the hit documentary The Aristocrats.\n\nIn his bold and wildly entertaining publishing debut, he continues to embrace his dark side and gives listeners the audiobook they have long been waiting for - hilarious and often dirty. Bob believes there's a time and a place for filth. From his never-before-heard stories of what really went on behind the scenes of two of the most successful family shows of all times, with co-stars like John Stamos and Mary-Kate and Ashley Olsen, to his tales of legendary friends and colleagues like Rodney Dangerfield, Richard Pryor, Don Rickles, and other show business legends, Saget opens up about some of his personal experiences with life and death, his career, and his reputation for sick humor - all with his highly original blend of silliness, vulgarity, humor, and heart, and all framed by a man who loves being funny above all else.","torrent":{"xt":"urn:btih:63550ef0ce4dc7067f7e226de37472d0a39f2836","amp;dn":"Dirty+Daddy+-+Bob+Saget+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63550ef0ce4dc7067f7e226de37472d0a39f2836","infoHashBuffer":{"type":"Buffer","data":[99,85,14,240,206,77,199,6,127,126,34,109,227,116,114,208,163,159,40,54]},"announce":[],"urlList":[]}}