{"title":"Streghe Stagione 4 Completa [TVrip ITA] TNT Village","uid":6187037,"size":8092028936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:63eaab5eed65949b5fd729923c80a4536563b242&amp;dn=Streghe+Stagione+4+Completa+%5BTVrip+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"l.diliberto","files":22,"time":1298141862,"description":"Streghe Stagione 4 Completa [TVrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=239777&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=239777&lt;/a&gt;\n\n.: Trama :.\n\nLe tre sorelle Halliwell (Prue Halliwell, Piper Halliwell e Phoebe Halliwell) vivono in una grande casa vittoriana ereditata dalla loro nonna e qui, in una notte di luna piena scoprono che qualcosa di misterioso ed ignoto ÃƒÂ¨ entrato a far parte della loro vita. Una serie di misteriosi indizi porta una di loro a salire le scale dell'oscura soffitta dove guardando in un baule Phoebe scopre un antico libro di stregoneria e capisce di essere una prescelta e di avere, insieme alle sue sorelle, un destino al quale non puÃƒÂ² sfuggire.\nDopo aver letto la prima pagina del libro Phoebe capisce di avere poteri magici e di formare insieme alle sue sorelle una cerchia di streghe al servizio del bene dotate del potente Potere del Trio. Le sorelle sono destinate a salvare e proteggere innocenti combattendo contro demoni e stregoni.\n\nNella quarta stagione Piper ÃƒÂ¨ addolorata per la morte di Prue e tenta qualsiasi tipo di incantesimo per farla ritornare, ma senza successo. Durante il funerale dell'amata sorella, Phoebe, toccando la mano di una ragazza di nome Paige, ha una premonizione: la vede aggredita dal demone Shax, lo stesso che aveva, poco tempo prima, ucciso Prue. Phoebe, aiutata da Cole, riesce a salvarla. PiÃƒÂ¹ tardi scopre che Paige ÃƒÂ¨ la loro sorella illegittima nata dal rapporto tra la loro madre Patty ed il suo angelo bianco, Sam. Le tre riusciranno ad uccidere il Demone, vendicando la morte di Prue.\n\nMentre le sorelle insegnano a Paige l'arte della magia, la Sorgente tenta piÃƒÂ¹ volte di eliminarle con subdoli piani che perÃƒÂ² falliscono miseramente. Nel frattempo un demone molto simile a Belthazor attacca le sorelle e Cole per sconfiggerlo ÃƒÂ¨ costretto a trasformarsi completamente in Belthazor. Tuttavia una volta vinto il demone Belthazor non riesce a tornare Cole e attacca le sorelle ma grazie a una providenziale pozione perde i suoi poteri ritornando a essere Cole. Ora che non ÃƒÂ¨ piÃƒÂ¹ un demone ed ÃƒÂ¨ senza poteri, Cole chiede a Phoebe di sposarlo; all'inizio Phoebe ÃƒÂ¨ indecisa ma alla fine decide di sposarlo.\n\nAlcuni mesi dopo la sorgente per eliminare le Streghe decide di usare il potere del Vuoto per privarle dei loro poteri. La Veggente (un demone di livello superiore alleata con la Sorgente) perÃƒÂ² teme che la Sorgente perda il controllo del potere del Vuoto portando a conseguenze catastrofiche sia per la magia buona sia per quella cattiva e decide quindi di contattare Cole convincendolo ad assorbire il Vuoto. Cole assorbe i poteri della sorgente proprio nel momento in cui la Sorgente stava per eliminare il Trio, ora privo di poteri per colpa del Vuoto, permettendo cosÃƒÂ¬ alle Sorelle di eliminare la Sorgente con un incantesimo e di riavere indietro i loro poteri. Tuttavia la Sorgente ha approfittato del vuoto creatosi in Cole dopo l'eliminazione di Belthazor entrando dentro di lui e prendendo il controllo di lui. Inconsapevole che l'uomo che sta sposando ÃƒÂ¨ posseduto dalla Sorgente, Phoebe lo sposa (episodio 4x15).\n\nPiÃƒÂ¹ tardi scopre di essere incinta, ma ben presto, dopo avere eliminato Cole/La Sorgente, si rende conto che l'essere che cresce dentro di lei non ÃƒÂ¨ umano, ÃƒÂ¨ un piccolo diavolo destinato a divenire una delle creature malvagie piÃƒÂ¹ potenti in assoluto, e fa acquisire a Phoebe poteri demoniaci. Dopo aver compreso che la Veggente sta tramando contro il Trio, desiderosa di impossessarsi del piccolo demone dentro di Phoebe e prendere il potere assoluto, le Sorelle a seguito di numerosi scontri uccidono La Veggente. Nello scontro Phoebe perde il bambino,dopo che questo si ÃƒÂ¨ sacrificato per salvare la madre. Cole, non piÃƒÂ¹ posseduto dalla Sorgente e ora privo di poteri, chiede aiuto a Phoebe, chiedendole di salvarlo dall'inferno dov'ÃƒÂ¨ finito. Dopo il rifiuto di Phoebe, Cole assorbe i poteri degli altri demoni finiti nel Limbo riuscendo grazie ad essi a tornare sulla Terra e a salvare Phoebe da un cacciatore di Streghe. Un angelo del destino comunica a Piper che avrÃƒÂ  un bambino. Il nemico principale sarÃƒÂ  Cole Turner.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://www.casahalliwell.net/merchandising/4f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.casahalliwell.net/merchandising/4f.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nTitolo originale: Charmed\nPaese: Stati Uniti d'America\nAnno: 1998-2006\nFormato: serie TV\nGenere: fantasy, commedia, drammatico, horror\nDurata: 40 min circa ad episodio\nLingua originale: inglese\nIdeatore: Constance M. Burge\nCast: * Shannen Doherty: Prudence &quot;Prue&quot; Halliwell\n* Holly Marie Combs: Piper Halliwell\n* Alyssa Milano: Phoebe Halliwell\n* Brian Krause: Leo Wyatt\n* Dorian Gregory: Darryll Morris\n* Greg Vaughan: Dan Gordon\n* Karis Paige Bryant: Jenny Gordon\n\n.: Screenshot :.\n &lt;a href=&quot;\nhttp://img89.imageshack.us/img89/1715/streghes4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img89.imageshack.us/img89/1715/streghes4.png&lt;/a&gt;\n\n0=============================0\n\n.: Scheda tecnica del ripping medio degli episodi :.\n\nTitolo:Streghe - 4x01 - Il Ritorno Del Trio (Parte 1).avi\nDimensione File (in bytes):369,127,424\nDurata(hh:mm:ss):41:43.560\n\nNome Codec Video:DivX 5.0.5\nNumero Frame:62589\nLarghezza Frame(pixels):640\nAltezza frame(pixels):480\nDisplay Aspect Ratio (&quot;DAR&quot;):1.333\nFPS:25.000\nVideo Bitrate (kbps):1041\nQF:0.136\n\nCodec audio:0x0055 MPEG-1 Layer 3\nFreq.audio (Hz):48000\nBitrate(kbps):128\nTipo:CBR\nCanali:2","torrent":{"xt":"urn:btih:63eaab5eed65949b5fd729923c80a4536563b242","amp;dn":"Streghe+Stagione+4+Completa+%5BTVrip+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63eaab5eed65949b5fd729923c80a4536563b242","infoHashBuffer":{"type":"Buffer","data":[99,234,171,94,237,101,148,155,95,215,41,146,60,128,164,83,101,99,178,66]},"announce":[],"urlList":[]}}