{"title":"Kyoto - An Urban History of Japans Premodern Capital (Architectu","uid":11015715,"size":3543818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:649b9ec05534609106daf972d32250a6c3b4b5a0&amp;dn=Kyoto+-+An+Urban+History+of+Japans+Premodern+Capital+%28Architectu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1410470652,"description":"Matthew Stavros, &quot;Kyoto: An Urban History of Japan's Premodern Capital &quot; \n2014 | ISBN-10: 0824838793 | 224 pages | PDF | 3 MB\n\nKyoto was Japan's political and cultural capital for more than a millennium before the dawn of the modern era. Until about the fifteenth century, it was also among the world's largest cities and, as the eastern terminus of the Silk Road, it was a place where the political, artistic, and religious currents of Asia coalesced and flourished. Despite these and many other traits that make Kyoto a place of both Japanese and world historical significance, the physical appearance of the pre-modern city remains largely unknown. Through a synthesis of textual, pictorial, and archaeological sources, this work attempts to shed light on Kyoto's pre-modern urban landscape with the aim of opening up new ways of thinking about key aspects of pre-modern Japanese history. The book begins with an examination of Kyoto's highly idealized urban plan (adapted from Chinese models in the eighth century) and the reasons behind its eventual failure. The formation of the suburbs of Kamigy? and Shimogy? is compared to the creation of large exurban temple-palace complexes by retired emperors from the late eleventh century. Each, it is argued, was a material manifestation of the advancement of privatized power that inspired a medieval discourse aimed at excluding &quot;outsiders.&quot; By examining this discourse, a case is made that medieval power holders, despite growing autonomy, continued to see the emperor and classical state system as the ultimate sources of political legitimacy. This sentiment was shared by the leaders of the Ashikaga shogunate, who established their headquarters in Kyoto in 1336. The narrative examines how these warrior leaders interacted with the capital's urban landscape, revealing a surprising degree of deference to classical building protocols and urban codes. Remaining chapters look at the dramatic changes that took place during the Age of Warring States (1467-1580s) and Kyoto's post-war revitalization under the leadership of Oda Nobunaga and Toyotomi Hideyoshi. Nobunaga's construction of Nij? Castle in 1569 transformed Kyoto's fundamental character and, as Japan's first castle town, it set an example soon replicated throughout the archipelago. In closing, the book explores how Hideyoshi--like so many before him, yet with much greater zeal--used monumentalism to co-opt and leverage the authority of Kyoto's traditional institutions. Richly illustrated with original maps and diagrams, Kyoto is a panoramic examination of space and architecture spanning eight centuries. It narrates a history of Japan's pre-modern capital relevant to the fields of institutional history, material culture, art and architectural history, religion, and urban planning. Students and scholars of Japan will be introduced to new ways of thinking about old historical problems while readers interested in the cities and architecture of East Asia and beyond will benefit from a novel approach that synthesizes a wide variety of sources.","torrent":{"xt":"urn:btih:649b9ec05534609106daf972d32250a6c3b4b5a0","amp;dn":"Kyoto+-+An+Urban+History+of+Japans+Premodern+Capital+%28Architectu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649b9ec05534609106daf972d32250a6c3b4b5a0","infoHashBuffer":{"type":"Buffer","data":[100,155,158,192,85,52,96,145,6,218,249,114,211,34,80,166,195,180,181,160]},"announce":[],"urlList":[]}}