{"title":"Star Wars Episode 1 - Balance of the Force (Magnoliafan edit)","uid":3494448,"size":938387456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:64a172508100696c6f5fe34a1eb5714adb3e75f7&amp;dn=Star+Wars+Episode+1+-+Balance+of+the+Force+%28Magnoliafan+edit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AyJay","files":1,"time":1149981342,"description":"This is the fan-edit of Star Wars EpI by Magnoliafan\n\nAccording to this page: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Phantom_Edit#Episode_I:_Balance_of_the_Force&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Phantom_Edit#Episode_I:_Balance_of_the_Force&lt;/a&gt;\n\nBalance of the Force is a re-titled version of The Phantom Menance edited by someone using the name &quot;MagnoliaFan&quot;?a reference to the screenname of a notorious opponent of Bluntman and Chronic in the movie Jay and Silent Bob Strike Back. This is a darker version of the film that follows many of the previous fan edits, re-dubbing and subtitling aliens as well as droids so they speak their native language.\n\nA short list of the changes to the film include:\n\n* Alternate title and crawl, giving more history on the Jedi, Republic and Trade Federation \n\n* The plot has been altered from revolving around taxation to slave labor \nJar Jar is dubbed and subtitled. He is now a pompous, Han Solo-like character, who believes he saved Qui-Gon&amp;#039;s life by dragging him down and thinks Qui-Gon owes him a life debt \n\n* The Gungans now hate the Naboo because they stole a Gungan relic, the &quot;Kyber crystal&quot;, from them, explaining the big glowing globe at the end of the film. The crystal was first mentioned in the novel Splinter of the Mind&amp;#039;s Eye, although it was spelled Kaiburr \n\n* When Qui-Gon tries the mind trick on Watto, Watto becomes much angrier, throwing Qui-Gon out and shouting, &quot;Get lost! Come back when you gotta some money!&quot;. Also, as Qui-Gon embarrassedly exits the shop, Jar Jar knocks over a bunch of stuff and Watto shouts, &quot;Hey! You break it, you buy it! Eh?!&quot; This is one of Watto&amp;#039;s lines in Star Wars Episode I: Podracing for N64 and PlayStation. \n\n* Many scenes have been resequenced with music from other films, including cantina music from Star Wars, and the Imperial theme from The Empire Strikes Back","torrent":{"xt":"urn:btih:64a172508100696c6f5fe34a1eb5714adb3e75f7","amp;dn":"Star+Wars+Episode+1+-+Balance+of+the+Force+%28Magnoliafan+edit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64a172508100696c6f5fe34a1eb5714adb3e75f7","infoHashBuffer":{"type":"Buffer","data":[100,161,114,80,129,0,105,108,111,95,227,74,30,181,113,74,219,62,117,247]},"announce":[],"urlList":[]}}