{"title":"THE TESTAMENTS OF ONE FOLD AND ONE SHEPHERD - ENGLISH","uid":7365157,"size":647914028,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:651eadf3074a553aa5d454d29482cbd98461de0b&amp;dn=THE+TESTAMENTS+OF+ONE+FOLD+AND+ONE+SHEPHERD+-+ENGLISH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ldsmayan","files":-1,"time":1340087186,"description":"The Testaments of One Fold and One Shepherd.\nA 67-minute film produced by The Church of Jesus Christ of Latter-day Saints.\nThe Testaments depicts the life of Jesus in Jerusalem while also depicting the events happened in the American continent described in the Book of Mormon from the same time period.\nThe film's climax occurs after Christ's resurrection, when Jesus Christ appears in the Americas to visit the native american people and teach them His Gospel.\n\nPlot:\nAlthough in America, Helam witnesses the star heralding the birth of Christ, and 33 years later he faithfully awaits the promised coming of The Messiah despite persecution for this belief.\nHelam's son, Jacob, is interested more in the ways of the world, including the lovely Laneah, and when his abilities as an artisan bring an offer to work for the wealthy and powerful Kohor, he jumps at the chance and is estranged from his father's house.\nKohor is plotting to destabilize the existing government and become the absolute ruler.\nIn contrast, Amaron, a holy man, preaches to people of Christ, whose ministry and miracles are concurrently taking place across the seas in The Holy Land. As Jacob becomes more immersed in the secular life of Kohor's house, Laneah becomes more interested in the humble faith he is forsaking.\nHer conversion to Christ, and the death of Amaron at the hand of Kohor's men, brings Jacob to his senses, but he knows of Kohor's plans and is imprisoned when he refuses to join the conspiracy.\nIn Jerusalem, Jesus is crucified and the far away city of Zarahemla is plunged into darkness and destruction as Helam pushes through the crowds and ruins to help his son.\nAll seems hopeless when he is blinded, has not found Jacob, and thinks that he failed in  his quest to see The Messiah.\n\n\n\nLanguage: English\nSubtitles: None\nDuration: 67 Minutes\nFile Extension: .avi\nVideo Format: 16:9 Widescreen\n\n===========================================================================\n\nOther LDS Movies in varius languages available at\n\nOtras Peliculas SUD en varios idiomas disponibles en\n\nAltri Film SUG in varie lingue disponibili in","torrent":{"xt":"urn:btih:651eadf3074a553aa5d454d29482cbd98461de0b","amp;dn":"THE+TESTAMENTS+OF+ONE+FOLD+AND+ONE+SHEPHERD+-+ENGLISH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"651eadf3074a553aa5d454d29482cbd98461de0b","infoHashBuffer":{"type":"Buffer","data":[101,30,173,243,7,74,85,58,165,212,84,210,148,130,203,217,132,97,222,11]},"announce":[],"urlList":[]}}