{"title":"Lighting For Film and Television (with Barry Green)","uid":12114498,"size":3637748444,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:660bac970f6a4b74250b11e4b172069e02a407cb&amp;dn=Lighting+For+Film+and+Television+%28with+Barry+Green%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"cinematog","files":10,"time":1436655279,"description":"LIGHTING for Film and Television with Barry Green.\n\nDuration: 6 Hours | Video: h264, yuv420p, 864x480, 23.98 fps | Audio: aac, 48000 Hz | 3.4 GB\n\nGenre: eLearning | Language: English\n\nIf cinematic lighting is what you're after, then LIGHTING FOR FILM AND TELEVISION is for you! EmmyÂ® award-winning producer Barry Green, joined by co-host David Jimerson, take you through what you need to know to start seeing great lighting in your own projects! Through detailed instruction, tongue-in-cheek sketch illustrations, and hands-on examples, we'll show you the fundamentals of cinematic lighting and how you can use light as a paintbrush to tell your stories like the pros, with just the right look, exposure - and feeling!\n\nLearn to tell stories with light in a 6-hour, immersive, funny course with sketch comedy and two complete short films\n\nA 6-hour, deeply immersive look into cinematic lighting, with parodies of programs such as Mythbusters, Buffy the Vampire Slayer, and What Not to Wear. We cover common mistakes, hard and soft light, using shadows, proper exposure and exposure tools, lighting technique, creating a mood with light, all built around meeting the ARTISTIC GOALS of your film/video project. We then talk about all of the lighting and grip gear, have an interview with Levie Isaacks, A.S.C, and more.\n\nAnd then, we showcase two short films we made specifically for this set(watch them now, for free!), and sit down with the cinematographer and director in an hour-long, behind-the-scenes featurette breaking down everything that was done to light the films, and we show our lighting lessons as applied to in real-world film production settings -- with the results to show for it!\n\nDisc 1: Introduction/How Light Works\nExposure &amp; Dynamic Range\nShadows\nLighting Technique\n\nDisc 2: Lighting Gear/Credits\nLevie Isaaks, A.S.C. Interview\n\nDisc 3: CASE STUDIES\nBoth Short Films\nLessons Applied: Bringing the Scripts to Light","torrent":{"xt":"urn:btih:660bac970f6a4b74250b11e4b172069e02a407cb","amp;dn":"Lighting+For+Film+and+Television+%28with+Barry+Green%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"660bac970f6a4b74250b11e4b172069e02a407cb","infoHashBuffer":{"type":"Buffer","data":[102,11,172,151,15,106,75,116,37,11,17,228,177,114,6,158,2,164,7,203]},"announce":[],"urlList":[]}}