{"title":"Crocodile (A-go), 1996, Kim Ki-duk","uid":3350600,"size":734057097,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6612c678d6b18695cec3ddfd3af213b4c8076fde&amp;dn=Crocodile+%28A-go%29%2C+1996%2C+Kim+Ki-duk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"matt74","files":4,"time":1120156950,"description":"Kim Ki-duk's first film.\n\nThis was released by a production company that went out of business, so who knows when a dvd will be released (if ever).\n\nPlot:\nA vagrant named &quot;Crocodile&quot; lives on the water's edge around Han River with an aging homeless man and a panhandling boy. Crocodile is a shameless thug who fishes the bodies of the suicides from the river and extorts money from their families. One day, betrayed by her lover, Hyun-Jung jumps in the river. Crocodile saves her life, but only to use her for sex. Nevertheless, the sad-faced Hyun-Jung stays with Crocodile since she has nowhere to return to and he gradually falls in love with her. He presents paints to her and she draws his face with the paints. Finally he empathizes with her pain. Just as their relationship develops into one of true love, Hyun-Jung attempts to suicide again. Watching her desolation, Crocodile makes no attempt to save her. Instead, he follows her into the river to be with her forever. The two head towards the chamber inside the water, never to return to the outside.\n\nThis is a TV rip from Italian television, with the RAI logo in the top corner for the entire running time.\n\nHardcoded Italian subs.  Soft English subs were just made available at Kloofys and are included here, though they aren't amazing.  Check back at kloofys to see if better edited subs turn up.\n\nVideo - 512x384 Xvid 120 kbps\nAudio - mp3 120 kbps\n\nThe picture quality isn't excellent, but isn't bad at all.  It's likely the only chance you'll have to find this film.","torrent":{"xt":"urn:btih:6612c678d6b18695cec3ddfd3af213b4c8076fde","amp;dn":"Crocodile+%28A-go%29%2C+1996%2C+Kim+Ki-duk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6612c678d6b18695cec3ddfd3af213b4c8076fde","infoHashBuffer":{"type":"Buffer","data":[102,18,198,120,214,177,134,149,206,195,221,253,58,242,19,180,200,7,111,222]},"announce":[],"urlList":[]}}