{"title":"Designing With The Mind In Mind - Simple Guide To Understanding","uid":8407588,"size":11767391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:665b4b6c9a8928900253e7e5027ddcd3e5b8bc53&amp;dn=Designing+With+The+Mind+In+Mind+-+Simple+Guide+To+Understanding+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AwfullyAwesome","files":1,"time":1366836483,"description":"Designing With The Mind In Mind - Simple Guide To Understanding User Interface Design Rules\n\nBy Jeff Johnson\nPublisher: Morgan Kaufmann Publishers\nReleased: June 2010\nISBN-10: 012375030X\nISBN-13: 978-0123750303\nPages: 188\n\n\nDescription :\nEarly user interface (UI) practitioners were trained in cognitive psychology, from which UI design rules were based. But as the field evolves, designers enter the field from many disciplines. Practitioners today have enough experience in UI design that they have been exposed to design rules, but it is essential that they understand the psychology behind the rules in order to effectively apply them. In Designing with the Mind in Mind, Jeff Johnson, author of the best selling GUI Bloopers, provides designers with just enough background in perceptual and cognitive psychology that UI design guidelines make intuitive sense rather than being just a list of rules to follow.\n\n\n\n* The first practical, all-in-one source for practitioners on user interface design rules and why, when and how to apply them.\n* Provides just enough background into the reasoning behind interface design rules that practitioners can make informed decisions in every project.\n* Gives practitioners the insight they need to make educated design decisions when confronted with tradeoffs, including competing design rules, time constrictions, or limited resources.","torrent":{"xt":"urn:btih:665b4b6c9a8928900253e7e5027ddcd3e5b8bc53","amp;dn":"Designing+With+The+Mind+In+Mind+-+Simple+Guide+To+Understanding+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"665b4b6c9a8928900253e7e5027ddcd3e5b8bc53","infoHashBuffer":{"type":"Buffer","data":[102,91,75,108,154,137,40,144,2,83,231,229,2,125,220,211,229,184,188,83]},"announce":[],"urlList":[]}}