{"title":"Guild Wars novel - Ghosts of Ascalon","uid":6578977,"size":1885466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66af78acdfd774c85e3af5faf90869df7e9880bf&amp;dn=Guild+Wars+novel+-+Ghosts+of+Ascalon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1312328206,"description":"For hundreds of years mankind and the ferocious cat-like charr have been locked in a death struggle. When the charr invaded the human kingdom of Ascalon centuries ago, King Adelbern invoked the devastating Foefire to keep the enemy from the gates. Now, over two hundred years later, the first real chance for peace between the warring races has appeared. Both charr and humans are exhausted by continual fighting and deadly new threats such as the ascendant power of the Elder Dragons. The battle weary humans want to discuss a truce, but before the charr will talk peace with their old enemies, they require a relic of their glorious past - an artifact that disappeared many years ago in the Foefire.\n\nDougal Keane is one of the few people to have walked within the haunted walls within Ascalon City and lived to tell the tale. Now, against his better judgment, he leads a team of adventurers back into the ruins of the fallen kingdom on a desperate search for the charr relic. Dougal will have to face both the undead spirits of forgotten Ascalon as well as his own personal ghosts if he and his comrades are going to survive the experience!\n\nIf there are not enough seeder:\n\nIf you like this book, then buy it! It's not expensive.","torrent":{"xt":"urn:btih:66af78acdfd774c85e3af5faf90869df7e9880bf","amp;dn":"Guild+Wars+novel+-+Ghosts+of+Ascalon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66af78acdfd774c85e3af5faf90869df7e9880bf","infoHashBuffer":{"type":"Buffer","data":[102,175,120,172,223,215,116,200,94,58,245,250,249,8,105,223,126,152,128,191]},"announce":[],"urlList":[]}}