{"title":"Buffalo Killers - Buffalo Killers [2006][EAC,log,cue. FLAC]","uid":9036620,"size":329257452,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:66b7c6e2169e9e177ab4e467a64847e10a3e7ddd&amp;dn=Buffalo+Killers+-+Buffalo+Killers+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":11,"time":1381521602,"description":"Artist: Buffalo Killers\nRelease:Buffalo Killers\nReleased:  2006\nLabel:   Alive Records\nCatalog#:  ALIVE 0070CD\nFormat: FLAC / Lossless / Log / Cue\nCountry: USA\nStyle:  rock \n\n01 (4:25) San Martine Des Morelle\n02 (4:06) S.S. Nowhere\n03 (6:43) Heavens You Are\n04 (3:30) The Path Before Me\n05 (4:04) River Water\n06 (5:31) With Love\n07 (4:32) Children Of War\n08 (3:44) Down In The Blue\n09 (6:07) Fit To Breathe\n10 (4:27) Something Real\n\nIn their days as members of the Shams, the Gabbard brothers kicked out down and dirty, high adrenaline rock, slamming the Rolling Stones straight into the heart of psychedelic garage. Now with their new project, Buffalo Killers, the brothers are joined by drummer/pianist/harpsichordist Joseph Sebaali and have closed the garage door and embarked on a journey into classic rock. &quot;San Martine des Morelle,&quot; which opens the Buffalo Killers eponymous set, makes their evolution crystal clear, presenting a slowly simmering track that's bluesy to the core, but lashed with Jimi Hendrix-esque wah-wah guitar. &quot;Down in the Blue&quot; is even slower-paced, all the better to luxuriate in the heaving blues riff, while &quot;Children of War&quot; is even heavier, a pointed reminder of that time in the late '60s when bands discovered the power of slowing R&amp;B down and thrusting up the bottom end. But these Killers aren't totally detached from their old roots, &quot;SS Nowhere&quot; adapts the riff from the Stones' &quot;Jumping Jack Flash&quot; twining it through Rubber Soul-era Beatles (now that's an inspired match), &quot;River Water,&quot; in contrast, sounds like the Stones covering Gregg Allman's &quot;Midnight Rider.&quot;\n&quot;Fit to Breathe&quot; and &quot;The Path Before Me&quot; move strongly into Cream territory, although the former drags the Stones along for the ride, while the latter's ringing guitars remind you of U2.\nAnd that's the incredible beauty of this set: rock fans will recognize all of these influences within virtually every vocal inflection, guitar riff and solo, and many of the rhythms as well, but each is lovingly showcased in an entirely new context. And for all its &quot;classic&quot; sound, the Buffalo Killers incorporate more modern ones as well, a shade of Brit-pop atmosphere here, a tinge of the New Wave of British Heavy Metal there. What the Jesus and Mary Chain were to the '80s, Buffalo Killers may well be to this decade, brilliantly bringing the beloved sounds of yesterday into a new millennium.","torrent":{"xt":"urn:btih:66b7c6e2169e9e177ab4e467a64847e10a3e7ddd","amp;dn":"Buffalo+Killers+-+Buffalo+Killers+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b7c6e2169e9e177ab4e467a64847e10a3e7ddd","infoHashBuffer":{"type":"Buffer","data":[102,183,198,226,22,158,158,23,122,180,228,103,166,72,71,225,10,62,125,221]},"announce":[],"urlList":[]}}