{"title":"Ecco The Dolphin [Pal/Ntsc] [MULTI5], Ps2","uid":5062165,"size":696868043,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:66bcee1a83c0b2fbaec705ca4d73690b059db1de&amp;dn=Ecco+The+Dolphin+%5BPal%2FNtsc%5D+%5BMULTI5%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Big_dude","files":-1,"time":1250758182,"description":"Ecco The Dolphin Defender of the Future for the Ps2                   \n\nRel. 02/20/2002                       \n\n\nFormat:        DVD5 PAL/NTSC Selector\nLang:          English, Deutsch, French, Spanish, Italian\nDiscs:         1\nImage:         ISO\nRequirements:  Modded/Chipped Ps2, or Swap Magic Disc Method.\n\n\nCompressed with WinRar, game was tested and works.\n\nTry 7zip its free google it, if don't have WinRar.\n\nNote the screen will start in pal and roll choose x english then wait carefully choose 60 hz (Ntsc) to the right it will highlight..press with x your good it may be frustrating at first but you'll get it.\n\n(You could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n       &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n       &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n      &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n      &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nYou will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with \n\nESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nHundreds of years in the future, mankind and dolphins live peacefully together and share the earth. Dolphins, who are much more intelligent than they seem, act as the earth's caretakers, while dolphins and humans explore the galaxy. An alien force, known as the Foe, seeks to end this happy existence. The Foe damages the Earth's defense system, and alters history for the worse. One extraordinary dolphin, Ecco, must travel through time to set things right.\n\nEcco is a 3d underwater adventure game. There are more than 25 aquatic environments to explore. Ecco must communicate with other ocean creatures and learn to manipulate his environment if he is to succeed in defeating the Foe.\n\n\nGame Pics included.\n\nBurn with DVD Decrypter, (Included in download).  \n\nBest to burn at 8x or 4x speed.\n\nUse Verbatim Or use Tayio Yuden DVD+R or DVD-R Media only.\n\nUsing any other media might not work at all.\n\nIf using DVD+R then booktype to DVD-ROM.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:66bcee1a83c0b2fbaec705ca4d73690b059db1de","amp;dn":"Ecco+The+Dolphin+%5BPal%2FNtsc%5D+%5BMULTI5%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66bcee1a83c0b2fbaec705ca4d73690b059db1de","infoHashBuffer":{"type":"Buffer","data":[102,188,238,26,131,192,178,251,174,199,5,202,77,115,105,11,5,157,177,222]},"announce":[],"urlList":[]}}