{"title":"IPv6 Network Administration","uid":9156133,"size":4889296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66be04e155f72ab24d1faa6d82b4afd8be5dde96&amp;dn=IPv6+Network+Administration&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cabrao","files":-1,"time":1383781255,"description":"What once seemed nearly impossible has turned into reality. The number of available Internet addresses is now nearly exhausted, due mostly to the explosion of commercial websites and entries from an expanding number of countries. This growing shortage has effectively put the Internet community--and some of its most brilliant engineers--on alert for the last decade.\n\nTheir solution was to create IPv6, a new Internet standard which will ultimately replace the current and antiquated IPv4. As the new backbone of the Internet, this new protocol would fix the most difficult problems that the Internet faces today--scalability and management. And even though IPv6's implementation has met with some resistance over the past few years, all signs are now pointing to its gradual worldwide adoption in the very near future. Sooner or later, all network administrators will need to understand IPv6, and now is a good time to get started.\n\nIPv6 Network Administration offers administrators the complete inside info on IPv6. This book reveals the many benefits as well as the potential downsides of this next-generation protocol. It also shows readers exactly how to set up and administer an IPv6 network.\n\nA must-have for network administrators everywhere, IPv6 Network Administration delivers an even-handed approach to what will be the most fundamental change to the Internet since its inception. Some of the other IPv6 assets that are covered include:\n\nrouting\nintegrated auto-configuration\nquality-of-services (QoS)\nenhanced mobility\nend-to-end security\nIPv6 Network Administration explains what works, what doesn't, and most of all, what's practical when considering upgrading networks from the current protocol to IPv6. ","torrent":{"xt":"urn:btih:66be04e155f72ab24d1faa6d82b4afd8be5dde96","amp;dn":"IPv6+Network+Administration","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66be04e155f72ab24d1faa6d82b4afd8be5dde96","infoHashBuffer":{"type":"Buffer","data":[102,190,4,225,85,247,42,178,77,31,170,109,130,180,175,216,190,93,222,150]},"announce":[],"urlList":[]}}