{"title":"Divekick -3DM","uid":8834383,"size":704289285,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6816b31547e7460dbf812030b67f1e17c904140d&amp;dn=Divekick+-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1377075192,"description":" &lt;a href=&quot;http://store.steampowered.com/app/244730/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://store.steampowered.com/app/244730/&lt;/a&gt;\n\nReviews\nSimply put, Divekick is a fighting game that you can and should!  play even if you're not usually good at fighting games.\nA-  Gaming Age\n\nAbout the Game\nDivekick is the worlds first two-button fighting game. It distills the essence of the fighting game genre into just two buttons with no d-pad directional movement. Divekicks focused gameplay demonstrates how much depth a single move actually has, and introduces (or reinforces) skills fundamental to the genre: mind games, spacing, timing, and quick reactions.\n\nAt Iron Galaxy we love fighting games. To the average fan, most of what makes them fun is hidden behind a never-ending series of input combinations that they have to memorize. Thats why Divekick has just two buttons: Dive (into the air) makes your character jump straight up. Kick causes your character to fly foot first at a downward angle. If you press Kick on the ground, you can jump away from your opponent. Utilizing these moves, the first hit will win the round, and the player that wins five rounds first wins the game. Its pure adrenaline, awareness, and outsmarting your enemy. Its a fighting game deconstructed into its purest form.\n\n\nKey Features\n\n13 Completely unique and original characters, each with their own fighting style and special techniques. That's 91 unique match-ups to play and learn.\nA story for every character in the game, including an intro, ending, and rival battles. You will be moved to tears!\nRanked and non-ranked GGPO-powered online play, the most trusted netcode in fighting games. Includes ranking boards for each character, as well as overall.\nLocal VS play for two players, with quick and easy button reconfiguration to accommodate a room full of unique personalities.\nFull Steamworks integration, including Big Picture Mode.\n\nInstructions:\n1. Extract\n2. Play","torrent":{"xt":"urn:btih:6816b31547e7460dbf812030b67f1e17c904140d","amp;dn":"Divekick+-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6816b31547e7460dbf812030b67f1e17c904140d","infoHashBuffer":{"type":"Buffer","data":[104,22,179,21,71,231,70,13,191,129,32,48,182,127,30,23,201,4,20,13]},"announce":[],"urlList":[]}}