{"title":"Popular Psychology  - An Encyclopedia (Malestrom)","uid":4819520,"size":3665967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69be0c2d4a7d8b8a3546cb56824ad348c3dadcb3&amp;dn=Popular+Psychology++-+An+Encyclopedia+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238696579,"description":" &lt;a href=&quot;http://www.image-upload.net/images/z2fi5ttfxh5dkfwrbynq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/z2fi5ttfxh5dkfwrbynq.jpg&lt;/a&gt;\n\nPublisher: Greenwood Press (January 30, 2005)\nLanguage: English\nISBN-10: 0313324573\nISBN-13: 978-0313324574\n\nFrom Booklist\nThe 120 or so entries in this volume cover a wide range of topics, including, for example, Alien abduction, Birth order, Insanity defense, Mad cow disease, Multiple personality disorder, Parenting styles, and Satanic ritual abuse. Also represented are individuals such as Carl Jung and Dr. Phil. The goal is &quot;to try to counteract the tide of misleading information about the field of psychology with a concise guide to some things that the well-informed student of psychology and the interested general public ought to know.&quot;\n\nThe length of each entry varies from just a few lines to nine or more pages (for Memory) and there are a few black-and-white illustrations scattered throughout. Nearly all entries include a limited &quot;Further Reading&quot; list, generally offering both supporting and critical sources. Following the A-Z entries is an annotated bibliography that includes Web sites.\n\nThe book cover states readers will &quot;want to consult this work to understand what is good in the popular presentation of psychology and what is unworthy of serious attention.&quot; That may well be too expansive a goal as some topics that could have been valuable for both students and lay readers appear to be missing. Two specific contemporary topics that have apparently not been included are transpersonal psychology and tissue memory. Another curiously missing topic is counseling. In the entry Psychiatry, there is a relatively straightforward discussion of the difference in practice between psychiatrists and clinical psychologists. There is, however, no mention of counseling psychologists, though this discipline is licensed by most of the individual states and is also certified nationally in the U.S.\n\nPopular Psychology is easy to read, easy to browse, and would be of value in public and undergraduate libraries that have limited information on this topic. It would also be appropriate in high-school libraries, where it could be used as a basic reference for class-based study. Scottie Wallace\nCopyright Ã‚Â© American Library Association. All rights reserved","torrent":{"xt":"urn:btih:69be0c2d4a7d8b8a3546cb56824ad348c3dadcb3","amp;dn":"Popular+Psychology++-+An+Encyclopedia+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69be0c2d4a7d8b8a3546cb56824ad348c3dadcb3","infoHashBuffer":{"type":"Buffer","data":[105,190,12,45,74,125,139,138,53,70,203,86,130,74,211,72,195,218,220,179]},"announce":[],"urlList":[]}}