{"title":"Mick Taylor album","uid":4998727,"size":3323726311,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b3ce8b8d14c03aa8b230026bb6e8fcd3b24068f&amp;dn=Mick+Taylor+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1247416357,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nVA-The Motown Story-25 Years Of Great Original Hits-cd 1-6\n\nMichael &quot;Mick&quot; Kevin Taylor born 17 January 1949 in Welwyn Garden City, Hertfordshire) is an English musician best known as a former guitarist and contributing member of The Rolling Stones.\nTaylor grew up in Hatfield, Hertfordshire. He began playing guitar at age nine. As a teenager, he formed bands with schoolmates and started performing concerts under names such as The Juniors and the Strangers. They also appeared on television and put out a single. Part of the band was recruited for a new group called The Gods, which included Ken Hensley (later of Uriah Heep fame). In 1966, The Gods opened for Cream at the Starlite Ballroom in Wembley.\nIn 1965, when Taylor was 16, he went to see a John Mayall's Bluesbreakers performance at &quot;The Hop&quot; Community Centre, Welwyn Garden City. Former drummer with the Juniors, Danny Bacon remembers, &quot;On the night in question, I had gone to The Hop with some guys from our band, former schoolmates and Ex-Juniors Mick Taylor and Alan Shacklock. It was after John Mayall had finished his first set without a guitarist that it became clear that for some reason Eric Clapton was not going to show up. A group of local musicians, which included myself, Robert &quot;Jab&quot; Als, Herbie Sparks, and others, along with three local guitarists--Alan Shacklock, Mick Casey (formerly of the Trekkas) and Mick Taylor--were in attendance&quot;. Mick Taylor approached John Mayall during the intermission and ended up filling in as the guitarist for the second set, playing Clapton's guitar, which had already been set up on the stage.\nDespite his young age, Taylor began to earn respect for his guitar skills], and when Peter Green resigned from the Bluesbreakers, Taylor was asked to take his place. Taylor made his debut with the Bluesbreakers at the Manor House, an old blues club in North London. For those in the music scene the night was an event... &quot;Let's go and see this 17-year-old kid try and replace Eric&quot;. Before he turned 18, Taylor toured and recorded the album Crusade with John Mayall's Bluesbreakers. From 1966 to 1969, Taylor developed a guitar style that is blues-based with latin and jazz influences. Later on in his career, he further developed his skills as a slide guitarist.\n\n\n","torrent":{"xt":"urn:btih:6b3ce8b8d14c03aa8b230026bb6e8fcd3b24068f","amp;dn":"Mick+Taylor+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b3ce8b8d14c03aa8b230026bb6e8fcd3b24068f","infoHashBuffer":{"type":"Buffer","data":[107,60,232,184,209,76,3,170,139,35,0,38,187,110,143,205,59,36,6,143]},"announce":[],"urlList":[]}}