{"title":"MTCDC-NMC 23 DC from H-Hh (joshua13","uid":6562085,"size":19982572135,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6baf1b04ceecc3885d44ea1502336b1534d399f2&amp;dn=MTCDC-NMC+23+DC+from+H-Hh+%28joshua13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":11,"uploader":"joshua13","files":-1,"time":1311525143,"description":"MTCDC-NMC 23 DC from H-Hh (joshua13\n\nThe More than Complete DC-Now More Completerer!\n\nThis twenty-third alphabetical installment is: DC from H-Hh\n\nWhat's This?\n     It's a project to upload everything that's been scanned that DC ever published or distributed, whatever name was on the cover. That's DC, Vertigo (ugghh!)Ã‚Â®, Wildstorm, Helix, Milestone, Minx, Paradox, Piranha, Tangent, America's Best Comics, Cliffhanger, CMX, Homage, Humanoids, and MC.Gaines among others.\n       Plus, for characters and titles DC picked up from other companies, as much of those &quot;Pre-DC&quot; comics as I can find. This includes many major and minor DC superheroes, war comics, romance comics and various licensed characters such as Tarzan, Star Trek, Loony Toons, Scooby-Doo etc. A few of the heros include Shazam!, Blue Beetle, Plastic Man, Gen13, The Web, The Shield, Phantom Lady, Captain Atom and many more. There may be a lot of things you didn't know started with a different company. There will some &quot;Post DC&quot; comics of characters like Fallen Angel that have moved on. But that will be arbitrarily selective on my part. Assorted related material will be included. It's going to be 800-850gb in total. It will take a year or two. I've already done a 600+gb subset of this in an earlier project (MTCDC). So clearly, I'm insane, which is what you look for in a guy promising this. So here we go again, but bigger.\n\n\n================================\nI'M GOING TO ANNOUNCE IN THE NEXT FEW TORRENTS THAT I WILL BE ON VACATION WITH FAMILY THE WEEK OF JULY 30-AUG 5. I may not upload during that week. If I can get some ready in advance I may remotely access the machine I seed from and start some. Just don't be alarmed at a gap.\n\n\tThis reminds me that one reason for the rapid pace of this series is because DC has announced that along with the forthcoming DC Universe reboot they are going into the digital comics business. This may change the game. When Marvel did this a few years ago they used legal threats to shut down some comics only torrent sites, got Marvel removed form some direct download sites, and sent at least one prominent scanner a personal cease and desist letter.  Fear ruled the land, for a while. A bit later at least one prominent uploader of Marvel Comics also got a threat. DC joined them in part of this, then both seemed to lose interest again. DC made less effort. For example DC comics are still on a prominent direct download site that removed all Marvel after a threat. DC just needs to send one letter to them and they'd be off too, but they haven't bothered. Nor have they worried about me. I'm afraid I'd have to cave in if threatened.\n\tIt concerns me that they may soon start caring about comics sharing as a threat to their digital sales, especially of the latest issues. I would not be hard for them to find. I think it will  be some time before they worry about the downloaders like you, so you'd have lots of warning it was happening, and would just get a warning letter from your ISP at most. The obvious first  targets are the torrent sites, scanners, and the zero day uploaders. An uploader like me is probably in the second round of targets since while I doubt anyone on earth uploads more DC than me, most of it is out of print.\n\n\tOK let's all think  positively, cross our fingers. toes, or tentacles, pray, beg the comic gods, repeat our &quot;affirmations&quot;, take a wait and see attitude, and say &quot;Que sera sera, whatever will be, will be, the futures not ours to see, que sera sera&quot;\n\n     This torrents includes among other thing, Hellblazer. My devotion to using the title as indicated in the indica no matter what the cover says, tells me each Hellblazer  book may start with H or J, or in some cases neither. So anything at all in fact, including undefined unicode characters. (that may be slightly exaggerated.)\n     This is one of those vexing questions. I tell you I am so vexed I stayed up all night vexing. Vex Vex Vex! Should I put the &quot;John Constantine&quot; and other titles here or where they rightfully belong by exact title? The thing of it is, (2x3.1415926535897932384600 x2) percent of many many many many many people (perhaps as may as 6.626069) think of all or at least 2.71828182845904 percent of these books as &quot;Hellblazer xxxxxxx&quot; even those that are really &quot;John Constantine, Hellblazer xxxxxxx&quot;  or other, so they'll look here. Of course I'm doing both, but such an easy solution  does not stop me from discussing it, as ignoring it would not allow me to insert &quot;pep&quot; into this.  An exercise for the reader -  Why did I use the word pep, and how is it applicable? \n\n\tWe also have Heroes. DC printed some collections as they have done for quite a few comics originally published by others, in this case web comics from NBC. The DC TPBs are not scanned, so I include the complete run of the original web series which is the same story material.\n\t\n\tSince I brought up names above  I might as well say I do compromise on the exact tiles frequently. This is because windows will not except a umber of characters used in the actual names most commonly the colon (:) and slashes (\\) are not allowed by windows in file names. The full list  of banned characters is  &lt; &gt; &quot; / \\ \\ | ? * ^ and leading or trailing spaces. It also does not like spaces or periods (which would make a double period) before the .xxx file extension. It may tolerate but not be happy with periods in the middle of the name. This is why for example the title H.E.R.O. in this collections is H-E-R-O and lots of titles have dashes where the indica has a colon. I experimented  in the past with semicolons (;) instead of colons but didn't like the look and it defies conventional usage. The dash is an acceptable alternative.\n\tThis has bit me in some past torrents as I use Mac OS X which allows anything except a colon in the GUI. The command line of the Mac is UNIX based and does not like the &quot;/&quot; character which is used as a path divider as &quot;\\&quot; is in Windows. The variation between the GUI and the command line has to do with ancient history which I will spare you.\n\tI now run all my torrents though a name checker which replaces any bad characters with a &quot;-&quot;to prevent issues for Windows folks. I try to catch those that are changed and make changes where the &quot;-&quot; is not the best choice. Most modern torrent clients will automatically translate any illegal character into a legal one so most folks won't have any problem even If I  don't do this. It is for the sake of the minority using BitComet, BitLord and some other old clients that will choke on bad names that I do it. I strongly encourage anyone using these to move to Ã‚ÂµTorrent, Transmission or Vuse. Not all Mac or Linux users are as aware of the issues as I am.\n\n\nToday's offering: DC from H-Hh\n\nEnjoy! \n\nH-E-R-O 01-22 (2003-2005)\nHacker Files 01-12 (1992-1993)\nHammer, The-Season 1 p1-p60 (zudacomics-DC web(2009)\nHammerlocke 01-09 (1992-1993)\nHangman Comics 02-08 after Special Cmcs 01(MLJ(1942-1943)\nSpecial Comics 001-Hangman (1942)\nHappydale-Devils in the Desert 01-02 (Vertigo(1999)\nHard Time Season Two 01-07 (2006)\nHard Time v1 01-12 (2004-2005)\nHardcore GN (Piranha Press-unscanned.jpg\nHardcore Station 01-06 (1998)\nHardware 01-50 (DC-Milestone(1993-1997)\nM1-Hardware-Skybox Trading Card.jpg\nHarley Quinn 01-38 (2000-2004)\nHarley Quinn-Our Worlds at War (2001)\nHarley and Ivy-Love on the Lam\nHaunted Tank 01-05 (Vertigo(2009)\nHaven-The Broken City 01-09 (2002)\nHawk &amp; Dove v2 01-05 (1988)\nHawk &amp; Dove v3 01-02 Annual (!990-1991)\nHawk &amp; Dove v3 01-28 (1989-1991)\nHawk &amp; Dove v4 01-05 (1997)\nHawk and the Dove, The v1 01-06 (1968-1969)\n\nHawkgirl v1 50-66 after Hawkman v4 49 (2006)\nHawkman Secret Files &amp; Origins (2002)\nHawkman Special v2 001 (1985)\nHawkman Special v3 001 (2008)\nHawkman TPB (1989)\nHawkman v1 01-27 (1964-1968)\nHawkman v2 01-17 (1986-1987)\nHawkman v3 000 (10-1994)\nHawkman v3 01-33 (1993-1996)\nHawkman v3 Annual 01-02 (1993-1995)\nHawkman v4 01-49 (2002-2006)\nHawkman, The Essential-presumed DCP v1-27\nHawkworld v1 01-03 (1989)\nHawkworld v2 01-32 (1990-1993)\nHawkworld v2 Annual 01-03 (1990-1992)\n\nHaywire 01-13 (1988-1989)\nHazard 01-07 (WS-image(1996)\nHeart Throbs v1 001-046(i) (Quality(1949-1956)\nHeart Throbs v2 047-146(i) (DC(1957-1972)\nHeart Throbs v3 01-04 (Vertigo(1999)\nHeart Throbs-The Best of DC Romance 001 228p (1979)\nHeart of the Beast, The-Dean Motter (Vertigo(1994)\nHeartland (Vertigo(1997)\nHeavy Liquid 01-05 (Vertigo(1999-2000)\nHeckler, The 01-06 (1992-1993)\nHell Eternal-Vertigo VÃƒÂ©ritÃƒÂ© (1998)\n\nHellblazer (Vertigo\nConstantine-The Official Movie Adaptation\nDark Entries TPB-A John Constantine Novel (2009)\nDave Mckean Hellblazer Original Art for 1987 UKCAC.jpg\nHellblazer Annual 001 (1989)\nHellblazer Presents-Chas-The Knowledge 01-05 (2008-2009)\nHellblazer Special 001-Confessional (1993)\nHellblazer Special Constantine DVD Issue (2005)\nHellblazer Special-Bad Blood 01-04 (2000)\nHellblazer Special-Lady Constantine 01-04 (2003)\nHellblazer v1 01-xx (1988-20xx)\nHellblazer-Constantine Bookmark (2004).jpg\nHellblazer-Shoot (Unpublished Warren Ellis Story)\nHellblazer-The Books of Magic 01-02 (1997-1998)\nJohn Constantine, Hellblazer-Original Sins (Vertigo\nJohn Constantine, Hellblazer-Pandemonium HC ctc (2010)\nJohn Constantine-Hellblazer Special-Papa Midnite 01-05 (Vertigo(2005)\nJohn Constantine-Hellblazer-All His Engines HC\nJohn Constantine-Hellblazer-All His Engines TPB (2005)\nJohn Constantine-Hellblazer-City of Demons 01-05 (2010-2011)\nJohn Constantine-Hellblazer-Dangerous Habits TPB Extras (1994)\nJohn Constantine-Hellblazer-Hard Time (2001)\n\nHelmet of Fate-Black Alice 001\nHelmet of Fate-Detective Chimp 001 ctc\nHelmet of Fate-Ibis The Invincible 001\nHelmet of Fate-Sargon The Sorcerer 001\nHelmet of Fate-Zauriel 001\n\nFour Color Comics s2 1006-Hercules.cbr\nFour Color Comics s2 1121-Hercules Unchained.cbr\nCharlton Classics-Hercules\nHercules 001 ctc (1967).cbr\nHercules 011 ctc (1968).cbr\nHercules Unbound 01-12 (DC(1975-1977)\nThe Marriage of Hercules and Xena Warrior Princess 001.cbr\nHere's Howie Comics 01-18 (1952-1954)\nHero Hotline 01-06 (1989)\nHeroes 01-06 (DC-Milestone(1996)\nHeroes Against Hunger 001 (1986)\nHeroes 001-173 (NBC(2007-2009)-substitute for DC Heroes TPBs \nHeroes and Villains Origin Stories (DC Comics.com(2009)\nHeroscape 01-02 (2004)-Milton Bradly Toy promo\nHex 01-18 (1985-1987)\n\n\n========================================================================\n\nFeel free to post this to other sites if you know how and are so inclined\n\n========================================================================\n\nPlease Seed! Lots of people will start on the series months\nor even a year or two from now. You are their only hope to complete\ntheir downloads.\n\n=========================================================================\nThanks to the Scanners and editors, and thanks to the seeders, the\nanonymous folk that make the work of the scanners and uploaders multiply!\n=========================================================================\nBe seeing you.\n\n13\n\nYou can see my other torrents at \n\nd-e-m-o-n-o-id.me/files/?uid=1213225&amp;seeded=2\n\nor\n-h-3-3-t.com-/userdetails.php?id=72866\n\nor &lt;a href=&quot;\nhttp://thepiratebay.se/user/joshua13/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/joshua13/&lt;/a&gt;","torrent":{"xt":"urn:btih:6baf1b04ceecc3885d44ea1502336b1534d399f2","amp;dn":"MTCDC-NMC+23+DC+from+H-Hh+%28joshua13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6baf1b04ceecc3885d44ea1502336b1534d399f2","infoHashBuffer":{"type":"Buffer","data":[107,175,27,4,206,236,195,136,93,68,234,21,2,51,107,21,52,211,153,242]},"announce":[],"urlList":[]}}