{"title":"Libertarian Philosophy in the Real World (2015) pdf","uid":11539286,"size":1801257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d37df252ceec54ae7db212aa4638ff4105be9b2&amp;dn=Libertarian+Philosophy+in+the+Real+World+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1416615213,"description":"Robert Nozick's Anarchy, State, and Utopia is widely recognized as one of the most influential works of modern political philosophy. Libertarian Philosophy in the Real World not only provides a concise and accessible introduction to Nozick's ideal rights-based, minimal libertarian state, but for the first time applies this moral framework to America's liberal democracy. \n\n Mark D. Friedman clearly presents Nozick's arguments for natural rights, showing that his theory undermines the very idea of social justice, and enables libertarians to rebut the most common objections to their doctrine. The book delivers a withering moral critique of the American welfare state, with chapters devoted to property rights, freedom of expression and association, paternalism, and the state's intervention in discrete aspects of modern life such as public education and healthcare. Friedman argues that reducing the liberal democratic state to its core functions would not produce the sort of moral catastrophe that might make us reconsider our commitment to individual rights. So, what is to be done? Friedman concludes with effective argumentative strategies for moving American politics in a more libertarian direction. \n\n Ideal for undergraduates and above studying political philosophy, political science, political ideology, rights and public policy, this text provides crucial insights into libertarian theory and its application","torrent":{"xt":"urn:btih:6d37df252ceec54ae7db212aa4638ff4105be9b2","amp;dn":"Libertarian+Philosophy+in+the+Real+World+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d37df252ceec54ae7db212aa4638ff4105be9b2","infoHashBuffer":{"type":"Buffer","data":[109,55,223,37,44,238,197,74,231,219,33,42,164,99,143,244,16,91,233,178]},"announce":[],"urlList":[]}}