{"title":"Victoria 2 Heart of Darkness (1-click run)(registred)","uid":8420909,"size":372251833,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6ee8ae0dc804dfb5db19740c18dacafb9d966f1d&amp;dn=Victoria+2+Heart+of+Darkness+%281-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1367189053,"description":"No need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from USB-Stick.\nEasy Uninstall with the Windows control panel.\nThese are a few things that makes a '1-click run' version a, better version.\n\nVictoria II: Heart of Darkness is the second expansion for the grand strategy and political simulator Victoria II. This expansion focuses on the Scramble for Africa. Compete with other colonial powers and experience international crises which require Great Power mediation if the world is to avoid war in this experience crafted by Paradox Development Studio.\n\n Features:\n Experience a brand new colonization system: Use your navy to expand your empire, compete against other colonial powers and struggle to maintain your overseas control. Colonial conflicts can spiral out of control and become international crises. They will have to be decided by diplomatic negotiations or risk costly wars  \n Battle your enemies in the new naval combat system: Together with the new colonization system, your navies are more important than ever. A new system of gun ranges brings more depth and strategy to warfare on the high seas. Powerful new battleships also join the other classes of ships to bridge the gap to Dreadnoughts  \n Prepare for International Crises: Around the world international crises continually call on the Great Powers to mediate and compromise, with war always being the last resort. As one of the lesser powers, use your influence to stir up local flash points so you can use fleet footed diplomacy to get the Great Powers to right the wrongs that have been committed against your nation!  \n Follow the global events with the new newspaper system: Attain a greater sense of immersion by receiving local and global reports on world events. Over 60 newspapers, both historic and otherwise, periodically present you with the latest news reports of war, major events, royal gossip and other matters of interest\n\nMinimum System Requirements:\nOS: XP/Vista/Windows7\nProcessor: Intel?Â« Pentium?Â« IV 2.4 GHz or AMD 3500+\nMemory: 2 GB RAM\nGraphics:NVIDIA?Â« GeForce 8800 or ATI Radeon?Â« X1900\nDirectX: 9.0\nHard Drive: 2 GB HD space\nSound: DirectX Compatible","torrent":{"xt":"urn:btih:6ee8ae0dc804dfb5db19740c18dacafb9d966f1d","amp;dn":"Victoria+2+Heart+of+Darkness+%281-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ee8ae0dc804dfb5db19740c18dacafb9d966f1d","infoHashBuffer":{"type":"Buffer","data":[110,232,174,13,200,4,223,181,219,25,116,12,24,218,202,251,157,150,111,29]},"announce":[],"urlList":[]}}