{"title":"Rebirth of Mothra I, II and III","uid":15506253,"size":2214904004,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:702ddcfa627bd9f3412a0f025f6f6625a5774ee7&amp;dn=Rebirth+of+Mothra+I%2C+II+and+III&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Psychodad149","files":45,"time":1470588787,"description":"Rebirth of Mothra, I, II, &amp; III\r\n\r\nWhat a delight this series is! \r\n\r\nJust a few remarks here. See included text file for full comments.\r\n\r\n\r\nOf all Toho's monsters, Mothra is closer to being a magical creature than a standard &quot;space monster&quot; or radioactive mutation. The two &quot;fairies&quot; who attend her (yes, Mothra is a girl, at least in this series!) testify to this. Mothra here has the ability to transform herself into various configurations, much as an anime Magical Girl. She becomes an aquatic creature in the second movie, looking more like a flying fish, and in the third, a heavily armored flying lance. Also in the second, she transforms into a fleet of small X-Wing fighters to do battle with little creatures inside the main villain-monster, Dagahra. (Refer to the Wikizilla referenced before for all the many Mothra variations.) Somewhat related, the second movie references Okinawa's reputation as a magical land, rather the way the West conceives of Ireland as the home of the &quot;Little People&quot; and other mystic phenomena.\r\n\r\nAs for the girls, Lora and Mona, they are in this series distinct individuals, in contrast to the original Mothra series where they were not only identical, but moved and spoke together in unison. They are really quite delightful characters here in their own right, and Belvera provides a rather likeable &quot;evil twin&quot; - type foil to them. In the third movie, there is a story thread which lends some unintentional (I think!) humor. All three of the Elias must work together to defeat Ghidorah, to form the &quot;Elias Triangle&quot;: an unbeatable combination of Wisdom, Love, and Courage. In other words: A brain . . . a heart . . . the noive! Yes, I found myself whistling &quot;If I Only Had A Brain&quot; through a couple of bits. Anyway, in the end we find Belvera isn't really all that bad, though -- and that's all I'll say on that!\r\n\r\nAs many Japanese kaijuu movies, there is a strong environmentalist theme to these (the first two, at least) which is not at all subtle. In the first, Death Ghidorah is awoken due in part to the activities of a logging company, and in the end, Mothra restores the loggers' ravages. The second abandons any pretense of subtlety. Dagahra, living relic of an ancient civilization, Nilai-Kanai, sunken like Atlantis, has awoken and is infesting Earth with small starfish-like creatures which feed on pollution and threaten to overrun and destroy all other life. (The third is entirely absent such a theme.)\r\n\r\n\r\nBut all in all, this is a delightful series and well worth the watching for any fan of the Japanese monster movie genre","torrent":{"xt":"urn:btih:702ddcfa627bd9f3412a0f025f6f6625a5774ee7","amp;dn":"Rebirth+of+Mothra+I%2C+II+and+III","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"702ddcfa627bd9f3412a0f025f6f6625a5774ee7","infoHashBuffer":{"type":"Buffer","data":[112,45,220,250,98,123,217,243,65,42,15,2,95,111,102,37,165,119,78,231]},"announce":[],"urlList":[]}}