{"title":"Metric - Fantasies (2009) [FLAC] politux","uid":5739307,"size":304911818,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:70f330a694f470540006760fbd4d2393425b07a9&amp;dn=Metric+-+Fantasies+%282009%29+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1280940601,"description":"Metric's third full-length album, Fantasies, is a glossy, slick, and so-clean-you-could-eat-off-it slice of modern rock that may scare off some of the band's early fans due to the unrepentant commercial nature of the album. Anyone who isn't repelled by the band's professionalism and ambition to sound perfect will find it to be quite good. You can't begrudge them taking a shot at the big \ntime, especially when the result is as good as this. And it's not like they are doing anything radically different here; it just sounds freshly painted and shorn of any defects. In other words, it sounds just like an album by one of the bands that inspire them, finely tuned machines like the Cars, Garbage, Blondie, and Missing Persons. Or conversely, they sound sort of how you'd imagine the ideal Idol contestant's album would sound -- huge with an excess of glittering and hooks. Indeed, most of the songs on Fantasies wouldn't sound out of place on a Kelly Clarkson record; they are finely crafted, totally focused, and powerful pop songs that blend '80s new wave, '90s alt-rock, and timeless pop songcraft into compact pop nuggets. If &quot;Sick Muse&quot; were given a push on radio, it could easily be a big smash for the band. The hand-waving chorus, the pulverizing drumming, and the smooth-as-glass production are perfect for the airwaves. Quite a few others sound like they too should be blasting out of car radios on summer streets; the laser beam-tight &quot;Gold Guns Girls,&quot; the shimmering &quot;Front Row,&quot; and the propulsive &quot;Gimme Sympathy&quot; all fit this bill perfectly. The few ballads that dot the album like frozen teardrops betray none of the warm introspection that Emily Haines brought to her solo albums; her singer/songwriter demons sound like they've been exorcised once and for all here. Instead, they sound big enough to reach the back row of a stadium, as does the whole album. That Metric title a song &quot;Stadium Love&quot; gives you a clue to the ambition of the band. There's nothing small or careful about Fantasies -- it's a full-on bid for pop glory and it's a smashing success.\n\nSource: CD\nReleased: 2009\nGenre: Rock\nStyle: Indie\nQuality: FLAC\n\nTracks: \n\n  1. Help I'm Alive\n  2. Sick Muse\n  3. Satellite Mind\n  4. Twilight Galaxy\n  5. Gold Guns Girls\n  6. Gimmie Sympathy\n  7. Collect Call\n  8. Front Row\n  9. Blindness\n  10. Stadium Love","torrent":{"xt":"urn:btih:70f330a694f470540006760fbd4d2393425b07a9","amp;dn":"Metric+-+Fantasies+%282009%29+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70f330a694f470540006760fbd4d2393425b07a9","infoHashBuffer":{"type":"Buffer","data":[112,243,48,166,148,244,112,84,0,6,118,15,189,77,35,147,66,91,7,169]},"announce":[],"urlList":[]}}