{"title":"Breath of Fire-Hart Liliana","uid":8838962,"size":845823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:712f5336e41514bc7f5f3c8dbe11aac757885db1&amp;dn=Breath+of+Fire-Hart+Liliana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":2,"time":1377197642,"description":"&quot;Born to be mates destined to be enemies.&quot;\n\nA &quot;Rena Drake&quot; Novel\n\nSince the Banishment, Rena has become the Drakan Enforcer, cleaning up the messes her dragon brethren make in order to keep their presence in the human world hidden.\n\nWhen a group of rogue Drakan begins killing dragons who refuse to join the army of the Destroyer the dragon they believe will become their true king Rena has no choice but to take action.\n\nSpecial Agent Noah Ford appears, seemingly out of nowhere, to offer his assistance and protection. Protection, from a human? Hell, no. But something about him draws her hypnotically, erotically close. Some secret he refuses to reveal.\n\nEvery clue Rena uncovers indicates Julian, leader of one of the five clans, is the Destroyer. But when she confronts Julian, the blue mating fire a phenomenon that hasn t been seen since the Banishment engulfs them both.\n\nBurning with need for two very different men, Rena must choose to kill the one destined to be her mate. Or see her people s dreams of home turned to a pile of ashes.\n\nWarning: This novel contains high-speed car chases, crackling thighs, magic duels, naughty words, and sex on ceilings, tables, high in a tower, in the shower and you get the drift.","torrent":{"xt":"urn:btih:712f5336e41514bc7f5f3c8dbe11aac757885db1","amp;dn":"Breath+of+Fire-Hart+Liliana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"712f5336e41514bc7f5f3c8dbe11aac757885db1","infoHashBuffer":{"type":"Buffer","data":[113,47,83,54,228,21,20,188,127,95,60,141,190,17,170,199,87,136,93,177]},"announce":[],"urlList":[]}}