{"title":"Queens of the Stone Age - Go with the Flow [MTV Unplugged, 2005]","uid":8699927,"size":82405376,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7170aab970c462325ba47ff2270743ad9bc58a09&amp;dn=Queens+of+the+Stone+Age+-+Go+with+the+Flow+%5BMTV+Unplugged%2C+2005%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1374038819,"description":"Queens of the Stone Age - Go with the Flow [MTV Unplugged, 2005].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Go with the Flow&quot; is a song by Queens of the Stone Age from the album Songs for the Deaf, released as a single in 2003. At the 46th Grammy Awards, the song was nominated for Best Hard Rock Performance.\n\nMTV Unplugged is a TV series showcasing many popular musical artists usually playing acoustic instruments. The show has received the George Foster Peabody Award and 3 Primetime Emmy nominations among many accolades.\n\nThe underlying concept behind the Unplugged series has been attributed to the popularity among musicians of a variety of informal musical performances on stage, film, television and record in earlier decades. The casual &quot;in-the-round&quot; sequence in Elvis Presley's 1968 Comeback Special, and The Beatles' informal studio jams documented in the 1970 film Let It Be were both precursors of the &quot;Unplugged&quot; concept, though they were neither conceived nor promoted as such at the time they occurred.\n\nQueens of the Stone Age is an American rock band from Palm Desert, California, United States, formed in 1996. The band's line-up includes founder Josh Homme (lead vocals, guitar, piano), alongside longtime members Troy Van Leeuwen (guitar, lap steel, keyboard, percussion, backing vocals), Michael Shuman (bass guitar, keyboard, backing vocals), Dean Fertita (keyboards, guitar, percussion, backing vocals), and recent addition Jon Theodore (drums, percussion).\n\nFormed after the dissolution of Homme's previous band, Kyuss, Queens of the Stone Age developed a style of riff-oriented, heavy rock music. Their sound has since evolved to incorporate a variety of different styles and influences, including working with ZZ Top member Billy Gibbons and steady contributor Mark Lanegan.\n(video has a &quot;100% MTV&quot; logo and a &quot;MTV Day&quot; logo at the top)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Go_with_the_Flow&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Go_with_the_Flow&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/LANlKAaEM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LANlKAaEM&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 528x576 (4:3) 25fps 2750kbps\n   Audio: MPEG Digital Audio 48000Hz stereo 192kbps\n   Duration: 00:03:40\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:7170aab970c462325ba47ff2270743ad9bc58a09","amp;dn":"Queens+of+the+Stone+Age+-+Go+with+the+Flow+%5BMTV+Unplugged%2C+2005%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7170aab970c462325ba47ff2270743ad9bc58a09","infoHashBuffer":{"type":"Buffer","data":[113,112,170,185,112,196,98,50,91,164,127,242,39,7,67,173,155,197,138,9]},"announce":[],"urlList":[]}}