{"title":"120 Banned Books: Censorship Histories of World Literature","uid":7810370,"size":2495500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7210ad76682013f1353a6a8dba91c2e5cd3db28c&amp;dn=120+Banned+Books%3A+Censorship+Histories+of+World+Literature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352512946,"description":"120 Banned Books: Censorship Histories of World Literature by Nicholas J. Karolides, Margaret Bald, Dawn B. Sova\nCheckmark Books; 2 edition | 2011 | ISBN: 0816082324 | English | 560 pages | PDF | \n\nFrom Gossip Girl to The Kite Runner a completely updated look at the history of censorship in world literature.\n\nPraise for the previous editions:\n&quot;A must-have for all of us who enjoy the right to choose what we read.&quot; Nadine Strossen, President, American Civil Liberties Union\n\nThroughout history, nations, peoples, and governments have censored writers and their works on political, religious, sexual, and social grounds. Although the literary merit of the majority of these books has been proven time and time again, censorship efforts are still in place today. From Animal Farm to The Grapes of Wrath, The Koran to The Talmud, Ulysses to the Harry Potter series, The Canterbury Tales to The Bell Jar, this revised edition examines the many struggles these books faced in order to be read.\n\nTracing the censorship histories of 120 works from across the world, 120 Banned Books, Second Edition provides a summary of each work, its censorship history, and suggestions for further reading. Many new titles have been added to reflect some of the controversies in recent years, and updates have been made to existing entries on such classic books as Huckleberry Finn and To Kill a Mockingbird.\n\nNew entries include:\n\n-The Absolutely True Diary of a Part-time Indian by Sherman Alexie (banned on social grounds)\n-The Da Vinci Code by Dan Brown (banned on religious grounds)\n-Girls of Riyadh by Rajaa Alsanea (banned on political grounds)\n-Gossip Girl series by Cecily von Ziegesar (banned on sexual grounds)\n-His Dark Materials by Philip Pullman (banned on religious grounds)\n-The Kite Runner by Khaled Hosseini (banned on social grounds)\n-and many more.","torrent":{"xt":"urn:btih:7210ad76682013f1353a6a8dba91c2e5cd3db28c","amp;dn":"120+Banned+Books%3A+Censorship+Histories+of+World+Literature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7210ad76682013f1353a6a8dba91c2e5cd3db28c","infoHashBuffer":{"type":"Buffer","data":[114,16,173,118,104,32,19,241,53,58,106,141,186,145,194,229,205,61,178,140]},"announce":[],"urlList":[]}}