{"title":"Sheer Terror - Just Can't Hate Enough [@320]","uid":7222868,"size":103616805,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:72805f2c454c5a2c28664f7f124e957c7c3d47c7&amp;dn=Sheer+Terror+-+Just+Can%27t+Hate+Enough+%5B%40320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DrVladdy","files":-1,"time":1335578791,"description":"Sheer Terror's 1989 album &quot;Just Can't Hate Enough&quot;. I guess it's my favorite album from them, if not from the entire genere itself.\n\nReview From ALLMusic:\n&quot;Originally released by Germany's positively tiny Starving Missile label in 1989, Sheer Terror's Just Can't Hate Enough album only gained decent distribution in the U.S. when it was picked up by Blackout! Records the following year. However you get your hands on it, though, it was a top-shelf example of the New York City hardcore movement's twilight years, when crossover had breached any remaining resistance to openly metallic aspirations, and a band with punk roots such as Sheer Terror could feel comfortable sounding just as heavy as Metallica. Well, almost. Anyway, as was to be expected, it was mostly Alan Blake's furious guitar work driving semi-thrashers like &quot;Ashes, Ashes&quot; and &quot;Owe You Nothing&quot; (complete with what could pass for a guitar solo -- shock!), but don't overlook the emergence of Jason Martin's hyperactive double bass drums on much of these tracks, as well. Sure, the memorable title track is far less overt with its metallic nuances, and in a genre virtually built on brazen statements of intent, raging opener &quot;Here to Stay&quot; is as good as NYHC ever gave, but it's conspicuous to see a bunch of relatively straight-up hardcore entries such as &quot;Walls&quot; and &quot;Only 13&quot; shoved all the way to the end, as if they were no longer on the band's priority list. The intolerably leaden &quot;Cup O' Joe&quot; sounds terribly dated by any standards, and Paul Bearer's attempts at actual singing (&quot;Roses,&quot; &quot;Burning Time&quot;) are thankfully rare -- his untutored grunt is far more convincing and, for that matter, effective. And &quot;effective&quot; is about the best possible word to describe Just Can't Hate Enough and, for that matter, most all of Sheer Terror's albums.&quot;","torrent":{"xt":"urn:btih:72805f2c454c5a2c28664f7f124e957c7c3d47c7","amp;dn":"Sheer+Terror+-+Just+Can%27t+Hate+Enough+%5B%40320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72805f2c454c5a2c28664f7f124e957c7c3d47c7","infoHashBuffer":{"type":"Buffer","data":[114,128,95,44,69,76,90,44,40,102,79,127,18,78,149,124,124,61,71,199]},"announce":[],"urlList":[]}}