{"title":"The Beach Boys - Surfin' Safari &amp; Surfin' USA (HDCD Remastered","uid":4281883,"size":321898290,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:72bae43a0a39e7d1b5bc4b1533739db27775e093&amp;dn=The+Beach+Boys+-+Surfin%5C%27+Safari+%26+Surfin%5C%27+USA+%28HDCD+Remastered&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SergioPlayboy","files":47,"time":1215463181,"description":"Surfin&amp;#039; Safari (1962)\n-----------------------------------------------------------------------------------\nThe Beach Boys&amp;#039; debut album, recorded in an era in which little was expected of rock groups in the way of strong LP-length statements, is mostly thin and awkward in both the songwriting and production departments. The title track, their first true smash, is great, as is its flip side (&quot;409&quot;), which was not only a hit in its own right, but was the first vocal hot rod classic. &quot;Surfin&amp;#039;,&quot; their debut single (and small national hit), is also good, and one of the few Beach Boys tracks that could be said to have a garage-like quality. Unfortunately, most of the other cuts (most of which are group originals) are substandard ditties, as Brian Wilson had a way to go before honing his compositional genius. It does, however, afford a glimpse of the group as they sounded when they were a true band in the studio, before most of their parts were played by session musicians. Two of the better cuts, &quot;The Shift&quot; and the instrumental &quot;Moon Dawg,&quot; have a grittier-than-usual surf rock base that would flower on 1963 hits like &quot;Surfin&amp;#039; U.S.A.&quot;\n\nSurfin&amp;#039; U.S.A. (1963)\n-----------------------------------------------------------------------------------\nThe real breakthrough, as Brian Wilson asserts himself in the studio as both songwriter and arranger on a set of material that was much stronger than Surfin&amp;#039; Safari. Besides the hit title track and its popular drag-racing flip side (&quot;Shut Down&quot;), this has a lovely, heartbreaking ballad (&quot;Lonely Sea&quot;) and a couple of strong Brian Wilson originals (&quot;The Noble Surfer&quot; and &quot;Farmer&amp;#039;s Daughter&quot;). There are also a surprisingly high quotient of instrumentals (five) that demonstrate that, before session musicians took over most of the parts, the Beach Boys could play respectably gutsy surf rock as a self-contained unit. Indeed, the album as a whole is the best they would make, prior to the late &amp;#039;60s, as a band that played most of their instruments, rather than as a vehicle for Brian Wilson&amp;#039;s ideas. The LP was a huge hit, vital to launching surf music as a national craze, and one of the few truly strong records to be recorded by a self-contained American rock band prior to the British Invasion. [Surfin&amp;#039; Safari/Surfin&amp;#039; U.S.A, a Capitol two-fer CD, combines this and Surfin&amp;#039; Safari onto one disc, with the addition of three rare bonus cuts from the same era.]\n\nRichie Unterberger, AMG\n\n\n\nEAC Log, Cue &amp; Complete Artwork Included.\n\nEnjoy!\n\n\n\nP.S.: After you&amp;#039;ve done, please someone upload this to Demonoid. Thanks!\n\n","torrent":{"xt":"urn:btih:72bae43a0a39e7d1b5bc4b1533739db27775e093","amp;dn":"The+Beach+Boys+-+Surfin%5C%27+Safari+%26+Surfin%5C%27+USA+%28HDCD+Remastered","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72bae43a0a39e7d1b5bc4b1533739db27775e093","infoHashBuffer":{"type":"Buffer","data":[114,186,228,58,10,57,231,209,181,188,75,21,51,115,157,178,119,117,224,147]},"announce":[],"urlList":[]}}