{"title":"PetiteBallerinasFucked - Ivana Sugar (Dancing Beauty) NEW 04 Sep","uid":15748143,"size":158883138,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:738b44aca6437434257f8cd4bd0d6703fe9153bf&amp;dn=PetiteBallerinasFucked+-+Ivana+Sugar+%28Dancing+Beauty%29+NEW+04+Sep&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"xxxlavalxxx","files":2,"time":1472996641,"description":"Tall blonde Ivana Sugar is practicing her pirouettes when her ballet partner Dan joins her at the barre. He wastes no time letting Ivana know he's horny, and finds Ivana a willing partner. Soon he has peeled her out of her leotard and miniskirt and leaned her over the barre so that he can lustily eat out her creamy fuck hole.After a wet and wild blowjob delivered while they both lay on the floor, Ivana once again puts the barre to work to help her keep her balance as she slides down cowgirl style on Dan's dick. His stiffie fits perfectly as she goes to town bouncing and grinding against his member. When it's Dan's turn to do some of the work, Ivana bends over the barre and lifts one leg to give her partner the ultimate standing fuck position to bring her off in.Taking things to a nearby couch, Ivana lays down and lets Dan continue to fuck her hard. Her welcoming twat is warm and tight and just what Dan needs to get right to the edge of cumming. Reaching out her small hand, Ivana brings him the rest of the way home and guides his cum shot so that he covers her soft belly in the evidence of his love.\r\nCategories:Small Boobs Landing Strip Pussy Blonde Long hair Hardcore Girl-Boy Blowjob European Pussy Licking Ballerina\r\n \nhttp://imgdone.com/viewer.php?file=49787723966855857085.jpg\r\n \nhttp://imgdone.com/viewer.php?file=92560586914393338318.jpg","torrent":{"xt":"urn:btih:738b44aca6437434257f8cd4bd0d6703fe9153bf","amp;dn":"PetiteBallerinasFucked+-+Ivana+Sugar+%28Dancing+Beauty%29+NEW+04+Sep","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"738b44aca6437434257f8cd4bd0d6703fe9153bf","infoHashBuffer":{"type":"Buffer","data":[115,139,68,172,166,67,116,52,37,127,140,212,189,13,103,3,254,145,83,191]},"announce":[],"urlList":[]}}