{"title":"Modern Chess Preparation - Vladimir Tukmakov","uid":8858442,"size":6794222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74125fd4de4d27566d6a3c7f3924c64b3ba9a316&amp;dn=Modern+Chess+Preparation+-+Vladimir+Tukmakov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1377717685,"description":"Opening, middlegame and endgame are the three universally recognized stages of a game of chess, but what about the art of preparation? Winning starts with planning before the game, teaches legendary chess trainer Vladimir Tukmakov in this enlightening and entertaining work on a neglected subject.\n\nExploring and understanding, prior to the game, the strengths and weaknesses of your next opponent and being aware of your own strong points and shortcomings, are a key to success. Tukmakov describes how planning has become a systematic process, how methodical preparation works, and which critical steps you have to take.\n\nThe role of the computer in preparing for a game has grown tremendously, and Modern Chess Preparation explains how it is used by top players to get organized for success. But you will also learn the limitations on the use of chess engines and databases and how disastrous it can be to overly respect them and rely on them. A separate chapter is devoted on how to prepare for all-important games, games that will decide a tournament, a match or a even an entire career.\n\nModern Chess Preparation is about more than just opening preparation. It also teaches you how to immerse yourself in order to find the best approach to the game. With powerful anecdotes and many instructive high-level games, Tukmakov explains how, as a competitive chess player, you can organize your homework, focus your efforts, and arrive at a viable game plan.\nVladimir Tukmakov is a chess grandmaster and a former national champion of Ukraine. In his active career he won many tournaments as well as gold medals in international team competitions. He is universally acknowledged as an outstanding chess trainer and coach.","torrent":{"xt":"urn:btih:74125fd4de4d27566d6a3c7f3924c64b3ba9a316","amp;dn":"Modern+Chess+Preparation+-+Vladimir+Tukmakov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74125fd4de4d27566d6a3c7f3924c64b3ba9a316","infoHashBuffer":{"type":"Buffer","data":[116,18,95,212,222,77,39,86,109,106,60,127,57,36,198,75,59,169,163,22]},"announce":[],"urlList":[]}}