{"title":"Dennis Wilson - Pacific Ocean Blue (Beach Boys) RARE","uid":3956283,"size":53039812,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7423821d3c4bebc2c7b19e7dc23a008f08a5368c&amp;dn=Dennis+Wilson+-+Pacific+Ocean+Blue+%28Beach+Boys%29+RARE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"st2580smile","files":1,"time":1199164193,"description":"The most obviously untalented Wilson brother at the beginning of the Beach Boys, Dennis Wilson later matured into an excellent songwriter, producer, and vocalist. Though he only released one LP before drowning at the age of 39, his assortment of heart-rending ballads and pop curios were major assets to the Beach Boys&amp;#039; late-&amp;#039;60s and early-&amp;#039;70s output.\n\nBorn in Inglewood, CA, in 1944, Dennis was the middle of the three Wilson brothers, also including Brian (b. 1942) and Carl (b. 1946). While growing up, Dennis was the rebel of the family, constantly in trouble with the notoriously harsh Wilson father Murry. Dennis was also the closest person to a true surfer who Brian knew, though his lack of musical talent made him a liability when the band was formed. Stuck on drums since Brian played bass and Carl had taken guitar, he played a rudimentary rhythm on their first session, 1961&amp;#039;s &quot;Surfin&amp;#039;.&quot; An obvious target of female enthusiasm, Dennis was assigned lead vocals for a few early novelty songs: &quot;Little Girl (You&amp;#039;re My Miss America),&quot; &quot;Surfers Rule,&quot; and &quot;This Car of Mine.&quot; His first hit came in 1965 when &quot;Do You Wanna Dance&quot; opened the The Beach Boys Today! LP and cracked the Top 20.\n\nAfter the high peaks and deep valleys of the Beach Boys career during the late &amp;#039;60s, Dennis began writing songs, and finally rated serious compositions (&quot;Little Bird,&quot; &quot;Be Still&quot;) for 1968&amp;#039;s Friends. Throughout the early &amp;#039;70s, Beach Boys fans counted on at least two Dennis songs on each LP, often tender ballads flaunting his gruff voice and naked persona. He made his first attempt at a solo album as early as 1970, but quietly released only a single (&quot;Dragon&quot;) credited to Dennis Wilson and Rumbo. He again started work in 1975, recording with friend and producer Gregg Jakobsen during 1976 to complete Pacific Ocean Blue. The middle Wilson had completed his solo debut before either of his brothers, and it charted inside the Top 100 ? higher than either of the Beach Boys&amp;#039; next two LPs, M.I.U. and L.A. (Light Album).\n\nThough Dennis had started work on his second (provisionally titled Bamboo) even before the release of Pacific Ocean Blue, increasing problems ? centered on his personal life and substance abuse ? caused several holdups. While two songs ended up on L.A. (Light Album) (&quot;Baby Blue&quot; and &quot;Love Surrounds Me&quot;), the sale of the Beach Boys&amp;#039; Brother Studios prevented him from having a ready haven for experimenting. Though he and Carl Wilson temporarily left the band during 1980, he eased back into the regular touring rotation during the early &amp;#039;80s. In late 1983, however, Wilson drowned while diving around his boat in Marina del Ray, CA. \n(All Music Guide)\n\n1   River Song  D. Wilson     \n2   What&amp;#039;s Wrong  D. Wilson     \n3   Moonshine  D. Wilson     \n4   Friday Night  D. Wilson     \n5   Dreamer  D. Wilson     \n6   Thoughts of You  D. Wilson     \n7   Time  D. Wilson     \n8   You and I  D. Wilson     \n9   Pacific Ocean Blues  D. Wilson     \n10  Farewell My Friend  D. Wilson     \n11  Rainbows  D. Wilson     \n12  End of the Show  D. Wilson  \n","torrent":{"xt":"urn:btih:7423821d3c4bebc2c7b19e7dc23a008f08a5368c","amp;dn":"Dennis+Wilson+-+Pacific+Ocean+Blue+%28Beach+Boys%29+RARE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7423821d3c4bebc2c7b19e7dc23a008f08a5368c","infoHashBuffer":{"type":"Buffer","data":[116,35,130,29,60,75,235,194,199,177,158,125,194,58,0,143,8,165,54,140]},"announce":[],"urlList":[]}}