{"title":"The Hood Internet - The Mixtape Volume Three","uid":4475696,"size":178175917,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74407de6c7d2afe38c3257f4e40c499f6226107a&amp;dn=The+Hood+Internet+-+The+Mixtape+Volume+Three&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xxmonkeys","files":34,"time":1225328437,"description":"The Hood Internet - The Mixtape Volume Three\nMP3 320kbps\n\n01 Intro (feat. Ninjasonik).mp3\n02 Estelle (feat. Kanye West) vs The Ting Tings - Shut Up, American Boy.mp3\n03 Rick Ross (feat. R. Kelly) vs Hercules &amp; Love Affair - Blind Speed.mp3\n04 Chromeo vs Rihanna - Don't Stop The Fancy Footwork.mp3\n05 The-Dream vs Cut Copy - Light Falsetto Music.mp3\n06 El Perro Del Mar - Inner Island (The Hood Internet Remix).mp3\n07 Stacey Q vs YeasayerÃ‚Â - Sunrise Of Hearts.mp3\n08 Flo Rida vs Hot Chip - Hold On To That Low.mp3\n09 New Young Pony Club vs Simian Mobile Disco - Bomb Deprivation.mp3\n10 Shawty Lo vs Trans Am - Dey Know Obscene Strategies.mp3\n11 Three 6 Mafia vs Joan As Policewoman - Fuck That, I Defy.mp3\n12 Wiz Khalifa vs The Black Ghosts - Say Someway.mp3\n13 Ludacris vs She &amp; Him - Sentimental Hearts.mp3\n14 Crime Mob vs The Dodos - Stilettos In The Park.mp3\n15 The Cool Kids vs Le Loup - We Are Mikey! We Are Rock!.mp3\n16 Jay-Z (feat. Lil Wayne) vs Xiu Xiu - I Do Brooklyn When I Want.mp3\n17 Webbie vs Black Moth Super Rainbow - Drippy I-N-D-E-P-E-N-D-E-N-T.mp3\n18 Pimp C (feat. Lil Keke) vs The New Pornographers - Knocking Fablez Down.mp3\n19 Ghostface Killah vs Caribou - Apollo Narrows.mp3\n20 Ol' Dirty Bastard (feat. Kelis) vs White Williams - Got Your Smoke.mp3\n21 MF DOOM vs Ladytron - My Favorite Ladytrons.mp3\n22 T-Pain vs TV On The Radio - Frozen Age.mp3\n23 Birdman (feat. DJ Khaled, Rick Ross) vs Sebastien Tellier vs SebastiAn - $100 Million Sportswear.mp3\n24 Lil Mama (feat. Chris Brown, T-Pain) vs MSTRKRFT - Shawty Get Looks.mp3\n25 Bun B (feat. Rick Ross, David Banner, 8Ball) vs Of Montreal - Gallery Piece Of Everything.mp3\n26 Lil Kim (feat. Missy Elliott) vs MGMT - Can You Hear My Kids Now.mp3\n27 The Cardigans vs Ratatat - Mirando Birdfool.mp3\n28 Fleetwood Mac vs Daft Punk - You Make Lovin' Harder, Better, Faster, Stronger.mp3\n29 Three 6 Mafia vs The Long Blondes - Lolli Lolli Pop That Century.mp3\n30 Lil Wayne (feat. Static Major) vs The Bloody Beetroots - We Are From Venice (Lil Weezy Ana).mp3\n31 Big Boi (feat. Purple Ribbon All-Stars) vs Ghislain Poirier - Blazin Kryptonite.mp3\n32 Spank Rock vs Burial - Bumpangel.mp3\n33 Usher (feat. Young Jeezy) vs Los Campesinos! - The Year This Club Broke (My Heart).mp3\n34 R. Kelly (feat. Huey) vs Rogue Wave - Endless Hookup.mp3\n\nwww.thehoodinternet.com\n","torrent":{"xt":"urn:btih:74407de6c7d2afe38c3257f4e40c499f6226107a","amp;dn":"The+Hood+Internet+-+The+Mixtape+Volume+Three","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74407de6c7d2afe38c3257f4e40c499f6226107a","infoHashBuffer":{"type":"Buffer","data":[116,64,125,230,199,210,175,227,140,50,87,244,228,12,73,159,98,38,16,122]},"announce":[],"urlList":[]}}