{"title":"Born Again (Deluxe Edition) - Newsboys 2010","uid":5690699,"size":154260016,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:744f31e04f3d310e17c919dd273dca1c13e1a81e&amp;dn=Born+Again+%28Deluxe+Edition%29+-+Newsboys+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"appleteen","files":19,"time":1279082405,"description":"The GRAMMYÃ‚Â®-nominated and Dove Award-winning band newsboys has achieved what few artists have in their lifetime. They have sold over 6.5 million units, garnered five Gold albums and 26 #1 hits, and are renown for their heart-pumping live shows. Now, newsboys are more eager than ever to release their 15th studio project, BORN AGAIN, on July 13th courtesy of inpop records. \n\nWhen longtime members Jody Davis (guitar), Jeff Frankenstein (keys) and Duncan Phillips (drums) welcomed the vocal strengths, writing talents and boundless energy of Michael Tait (of the platinum-selling trio dc Talk) to the band in 2009, newsboys and their fans began to relish the positives and possibilities of this brand new start. Tait immediately, and easily, became part of the unique and tight newsboys unit. With headlining gigs across the U.S. and Canada along with a brand new stage show, the band is embarking on a momentous year with BORN AGAIN, a project chock full of fresh and innovative tunes. With songs penned by The Write Bros* (who also produced the project), newsboys, Mark Stuart, Steve Taylor and more, BORN AGAIN lives out its title with songs such as &quot;When The Boys Light Up&quot; and &quot;Way Beyond Myself,&quot; as well as a new recording of &quot;Jesus Freak&quot; featuring KJ-52.","torrent":{"xt":"urn:btih:744f31e04f3d310e17c919dd273dca1c13e1a81e","amp;dn":"Born+Again+%28Deluxe+Edition%29+-+Newsboys+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744f31e04f3d310e17c919dd273dca1c13e1a81e","infoHashBuffer":{"type":"Buffer","data":[116,79,49,224,79,61,49,14,23,201,25,221,39,61,202,28,19,225,168,30]},"announce":[],"urlList":[]}}