{"title":"The Motels - Celia [The Midnight Special, 1979].VOB","uid":9758795,"size":198813696,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7501e4b7acf1ebd07a9084dbffa4835f83c1258b&amp;dn=The+Motels+-+Celia+%5BThe+Midnight+Special%2C+1979%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1394780717,"description":"The Motels - Celia [The Midnight Special, 1979].VOB\n\n\nHQ rare live performance music video from a promo DVD. &quot;Celia&quot; is a song from  Motels, the first studio album by the band The Motels, recorded in May, 1979, released in September, 1979, and was produced by John Carter. The first single, &quot;Closets and Bullets,&quot; did not chart, but the second single, &quot;Total Control,&quot; became a Top 10 hit in Australia and a Top 20 hit in France by early 1980. A third single, &quot;Anticipation,&quot; was released in Japan in early 1980. The album became ceritified gold in Australia in 1980. \n\nIn March 1978, Davis and lead guitarist Jeff Jourard (formerly of a pre-fame version of Tom Petty and the Heartbreakers) decided to reform The Motels. Extensive auditions resulted in a new line-up of the band being formed, consisting of Jourard's brother Marty, who played both the saxophone and keyboards, Michael Goodroe on bass, and Brian Glascock on drums. Short on funds, the band shared rehearsal space with The Go-Go's at L.A.'s notorious punk basement, The Masque, and they played in Chinatown, at Madame Wong's restaurant/nightclub with such regularity that they were almost considered the house band. The Motels began to draw faithful crowds around the L.A. music scene and on Mother's Day 1979 the group signed with Capitol Records, releasing their debut album The Motels four months later. Their first single, &quot;Closets and Bullets&quot;, made no impact on the charts, but their second single release, &quot;Total Control&quot;, found its way to the Top 20 in France and the Top 10 in Australia.\n\nThe Midnight Special was noted for featuring musical acts performing live, which was unusual since most television appearances during the era showed performers lip-synching to prerecorded music. The series also occasionally aired vintage footage of older acts (such as Bill Haley &amp; His Comets). As the program neared the end of its run in the early 1980s, it began to frequently use lip-synched performances rather than live. The program also featured occasional comedic performances such as Richard Pryor and Andy Kaufman.\n\nThe Motels are a New Wave music band from the Los Angeles area best known for &quot;Only the Lonely&quot; and &quot;Suddenly Last Summer&quot;, each of which peaked at number nine on the Billboard Hot 100, in 1982 and 1983, respectively. Their song &quot;Total Control&quot; reached No. 4 on the Australian charts in 1980. Martha Davis (born January 19, 1951), the lead singer, reformed a version of the band called &quot;The Motels featuring Martha Davis&quot; in 1998; as of 2010 she continues to appear under that name with various line-ups of musicians.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Motels_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Motels_(album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/fAlFFaAfK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/fAlFFaAfK&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video : MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio1: Dolby Digital AC3 48000Hz 6ch 448kbps\n   Audio2: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:02\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:7501e4b7acf1ebd07a9084dbffa4835f83c1258b","amp;dn":"The+Motels+-+Celia+%5BThe+Midnight+Special%2C+1979%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7501e4b7acf1ebd07a9084dbffa4835f83c1258b","infoHashBuffer":{"type":"Buffer","data":[117,1,228,183,172,241,235,208,122,144,132,219,255,164,131,95,131,193,37,139]},"announce":[],"urlList":[]}}