{"title":"Putumayo Presents-Music from the Coffee Lands 2 By Ulysses56","uid":3511121,"size":65479505,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:756b1a53b763ba2b3744277e483738de193528f5&amp;dn=Putumayo+Presents-Music+from+the+Coffee+Lands+2+By+Ulysses56&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ulysses56","files":14,"time":1155231451,"description":"Putumayo Records Presents:\nMusic from the Coffee Lands, Vol. II 2001 \nA Putumayo Blend: Music from the Coffee Lands features melodic music evocative of aromatic cafes around the world.  \nRip 192kbs\nCovers Included\n\nFortunately for the Putumayo label, the nations that grow coffee also produce some of the best music on the planet. Otherwise, we might have something as unattractive as Songs from the Linseed-Oil-Processing Countries instead of this savory disc. Marketing devices aside, there is undeniable romance to a cup of fine coffee, and compiler Jacob Edgar superbly captures that mild but heady exotica in songs from Central and South America, Africa, and Asia. The Dominican Republic&amp;#039;s Titico y Los Caracoles del Amargue brew a spicy mug of bachata with popping guitar lines and conch-shell &quot;trumpet&quot; parts. Mexico&amp;#039;s Correo Aero bring a lush harp lead and a definite high-altitude feel to the Venezuelan traditional song &quot;Fiesta Lianera.&quot; Ex-3 Mustaphas 3 bass man and vocalist Sabah Habbas Mustapha joins forces with Java&amp;#039;s Jugala All-Stars for a cosmopolitan romp blending Sudanese instruments (including the haunting suling flute) and Congolese bass and drum patterns. Though not well known for caffeinated drinks, Martinique enjoys fame for its Creole pop. Wielding his trademark banjo, Martinican Kali hitches a gentle reggae bounce to local sensibilities on &quot;Monte la Rivie,&quot; a song about finding the source of the river of life. Nicely documented with liner notes that even contain coffee drink recipes, Music from the Coffee Lands II is good to the last cut.\n\nTracklist:\n1. Dindinha - Ceumar  \n2. Nzaji - Mario Rui Silva  \n3. Quem e Muito Querido a Mim - Geraldo Azevedo  \n4. Et Atabal De Mi Negra - Titico y Los Caracoles del Amargue     \n5. Fiesta Llanera - Correo Aereo \n6. Di Nagara Deungeun - Sabah Habas Mustapha &amp; The Jugula All Stars  \n7. Guramayle - Gigi   \n8. Bunde Tolimense - Jose Luis Martinez Vesga   \n9. Moso Manman - Emeline Michel  \n10. Monte La Rivie - Kali   \n11. Nge Na Munu - Denis Tshibayi \n\n\nThis is one of the many PutumayoÂ´s records I have in mind to upload, so please help keep seeding after you downloaded.\nEnjoy It!\nUlysses56\n\n\nFor more info: http://www.putumayo.com/ \n\n","torrent":{"xt":"urn:btih:756b1a53b763ba2b3744277e483738de193528f5","amp;dn":"Putumayo+Presents-Music+from+the+Coffee+Lands+2+By+Ulysses56","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"756b1a53b763ba2b3744277e483738de193528f5","infoHashBuffer":{"type":"Buffer","data":[117,107,26,83,183,99,186,43,55,68,39,126,72,55,56,222,25,53,40,245]},"announce":[],"urlList":[]}}