{"title":"[MarkT.Conard] The Philosophy of Martin Scorsese (pdf){Zzzzz}","uid":11440966,"size":2596987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76a05c0a29db302c0dffb8e90cac2500ba751f69&amp;dn=%5BMarkT.Conard%5D+The+Philosophy+of+Martin+Scorsese+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415807979,"description":"Academy Award--winning director Martin Scorsese is one of the most significant American filmmakers in the history of cinema. Although best known for his movies about gangsters and violence, such as Mean Streets, Goodfellas, Casino, and Taxi Driver, Scorsese has addressed a much wider range of themes and topics in the four decades of his career. In The Philosophy of Martin Scorsese, an impressive cast of contributors explores the complex themes and philosophical underpinnings of Martin Scorsese's films. The essays concerning Scorsese's films about crime and violence investigate the nature of friendship, the ethics of vigilantism, and the nature of unhappiness. The authors delve deeply into the minds of Scorsese's tortured characters and explore how the men and women he depicts grapple with moral codes and their emotions. Several of the essays explore specific themes in individual films. The authors describe how Scorsese addresses the nuances of social mores and values in The Age of Innocence, the nature of temptation and self-sacrifice in The Last Temptation of Christ and Bringing Out the Dead, and the complexities of innovation and ambition in The Aviator. Other chapters in the collection examine larger philosophical questions. In a world where everything can be interpreted as meaningful, Scorsese at times uses his films to teach audiences about the meaning in life beyond the everyday world depicted in the cinema. For example, his films touching on religious subjects, such as Kundun and The Last Temptation of Christ, allow the director to explore spiritualism and peaceful ways of responding to the chaos in the world.Filled with penetrating insights on Scorsese's body of work, The Philosophy of Martin Scorsese shows the director engaging with many of the most basic questions about our humanity and how we relate to one another in a complex world.\n\nPublisher: The University Press of Kentucky; Updated edition (June 8, 2009)\nLanguage: English\nISBN-10: 0813192188\nISBN-13: 978-0813192185","torrent":{"xt":"urn:btih:76a05c0a29db302c0dffb8e90cac2500ba751f69","amp;dn":"%5BMarkT.Conard%5D+The+Philosophy+of+Martin+Scorsese+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76a05c0a29db302c0dffb8e90cac2500ba751f69","infoHashBuffer":{"type":"Buffer","data":[118,160,92,10,41,219,48,44,13,255,184,233,12,172,37,0,186,117,31,105]},"announce":[],"urlList":[]}}