{"title":"Blouse - Imperium [2013][FLAC/WEB]","uid":8941882,"size":240425321,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:772a0162ed92317017a1917c86e8582a85e64342&amp;dn=Blouse+-+Imperium+%5B2013%5D%5BFLAC%2FWEB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":11,"time":1379637524,"description":"Artist:Blouse\nRelease:Imperium\nReleased: 2013\nLabel: Captured Tracks\nCatalog#: CT-187\nFormat: FLAC / Lossless / WEB\nCountry: USA\nStyle: electronic, pop, dream.pop, post.punk\n\n1 Imperium \n2 Eyesite \n3 1000 Years\n4 In A Glass \n5 Capote \n6 In A Feeling Like This\n7 No Shelter \n8 Happy Days \n9 Arrested\n10 Trust Me\n\nEvolution is a tricky word when discussing current trends in music, especially when it comes to sophomore albums. The critically lauded &quot;BLOUSE,&quot; the 2011 debut from the Portland band of the same name was a lush, melodic and dreamy affair spiked with whoozy synths and delicate vocals. For &quot;Imperium,&quot; their 2nd LP for Captured Tracks, Blouse have shed the synths, done away with drum machines and wrote and recorded with &quot;instruments that don't plug into the wall,&quot; as enforced by bandmember/producer Jacob Portrait.\n\nSonically speaking, that comes through on the LP immediately. Perhaps bolstered by the ongoing construction occurring next to the studio while the record was being made, the sense of force and urgency propelling the record is evident. Patrick Adams' driving bass and plodding drums in the title track usher in this new guitar-friendlier Blouse; more direct and clearer of vision, but still mysterious and beautiful.\n\nJacob and Patrick's Pacific Northwest alt-rock roots (filtered through post-punk and V/U) are a great counterpoint to ex-pat Southern CA transplant Charlie Hilton's Cohen/Patti/Nico singer/songwriter nature. The dichotomy of those two forces on tracks like &quot;No Shelter&quot; and &quot;1000 Years&quot; are at the core of Imperium. These are delicate songs from the perspective of a valley girl who grew up with gurus and ashrams played by indie lifers on a steady diet of NEU! It makes it all the more understandable to have showers of acoustic guitars and (real, not synthesized) cellos interrupted by fuzz guitar.\n\nBut these interruptions aren't a bad thing, they're what makes Imperium the great record it is. &quot;In a Feeling Like This&quot; describes it perfectly, it's a strange place that you're weirdly familiar with. Warm but also kind of spooky and imposing, you want to stay there for longer than you're invited. Thankfully, it's ok to flip it over and listen to it again.","torrent":{"xt":"urn:btih:772a0162ed92317017a1917c86e8582a85e64342","amp;dn":"Blouse+-+Imperium+%5B2013%5D%5BFLAC%2FWEB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"772a0162ed92317017a1917c86e8582a85e64342","infoHashBuffer":{"type":"Buffer","data":[119,42,1,98,237,146,49,112,23,161,145,124,134,232,88,42,133,230,67,66]},"announce":[],"urlList":[]}}