{"title":"100 Lessons of Russian Sambo by Igor Yakimov","uid":10595634,"size":4700517658,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7740f5b11fc9ef18afc60d114cbba8d7a934446d&amp;dn=100+Lessons+of+Russian+Sambo+by+Igor+Yakimov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"T1T","files":199,"time":1405814772,"description":"Igor Yakimov, the worlds leading authority on Russian Sambo returns to video with his most explosive series ever, Ultimate Armbars! In his famous Ultimate Leglocks series, Igor wrote the book on using leglocks in competition and street situations. In this new series, Igor covers hundreds of armbars and combinations including shoulder locks, wrist locks and elbow locks, from every possible position imaginable. Learn to immediately place your opponent into the most brutal armbars possible from takedowns, side-control, guard, mount, turtle position and more! This new tape set will forever be considered the armbar bible for grapplers and is a must have for all fighters regardless of style. If you think you have seen every way to submit someone with an armbar, you will be more then impressed with this new series. Another World Martial Arts exclusive!\n\nVOLUME 1: Lessons 1-10\nThe first ten important lessons learned in Russia. Learn break falls, turnovers, takedowns and more. Key submissions prepare you for more intricate submissions in the future. Over 25 techniques in all.\n\nVOLUME 2: Lessons 11-20\nThese next ten lessons will take you into more techniques like escapes, Double Leg Takedown, Double Grip Forward Sweeping Throw and much, much more. Over 20 techniques in all.\n\nVOLUME 3: Lessons 21-30\nTen more important lessons will teach a variety of highly effective throws like the Windmill Throw, Outside Leg Forward Body Drop and many more. You will also learn numerous arm and elbow submissions. Almost 25 techniques in all.\n\nVOLUME 4: Lessons 31-40\nAt this time you will start to learn more advanced techniques like the Top Knee Knob Submission and Guard Sweep With Arm. Every technique is so accurate that you will feel like you are learning in Russia. Over 25 techniques in all.\n\nVOLUME 5: Lessons 41-50\nThis next ten lessons will bring you to the half way-point in your lessons. Learn more devastating submissions like Turning Ankle Lock, Leg Stretch Submission from the guard and many, many more. Also includes many more takedowns. Over 20 techniques in all.\n\nVOLUME 6: Lessons 51-60\nLearn wicked submissions and takedowns like the Scissors Armbar from Scarf Hold and Suplex Throw. This tape also covers sparring drills and more. Over 20 techniques in all.\n\nVOLUME 7: Lessons 61-70\nThis video really picks up the pace with more advanced takedowns, submissions and turnovers. Learn the devastating Elbow Knot from the bottom, Outside Leg Windmill Takedown and many, many more!\n\nVOLUME 8: Lessons 71-80\nMore exotic techniques like the Inside Lion Sweep and the Propeller Throw Takedown. Learn more submissions like the Shoulder Bar Submission over hip and Ankle Lock Submission from takedown. Get this video!\n\nVOLUME 9: Lessons 81-90\nAt this point you will be learning advanced techniques like the Double Nelson Turnover and the Inside Grip Forward Dumping Takedown. Many, many more submissions and takedowns. 20 techniques in all.\n\nVOLUME 10: Lessons 91-100\nYour final ten lessons are very advanced, to say the least. Learn leglock counter submissions and calf crush submissions. More advanced takedowns like Reverse Step Lion Sweeping Throw and more. Lots and lots of techniques. A great video.","torrent":{"xt":"urn:btih:7740f5b11fc9ef18afc60d114cbba8d7a934446d","amp;dn":"100+Lessons+of+Russian+Sambo+by+Igor+Yakimov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7740f5b11fc9ef18afc60d114cbba8d7a934446d","infoHashBuffer":{"type":"Buffer","data":[119,64,245,177,31,201,239,24,175,198,13,17,76,187,168,215,169,52,68,109]},"announce":[],"urlList":[]}}