{"title":"Gordon Bigelow - Fiction, Famine, and the Rise of Economics in V","uid":9942557,"size":2457882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77b1d8cffd968e6500c04f4f5e3c53c4a5a77529&amp;dn=Gordon+Bigelow+-+Fiction%2C+Famine%2C+and+the+Rise+of+Economics+in+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1397271376,"description":"Description\nProduct Details\nBook Title: Fiction, Famine, and the Rise of Economics in Victorian Britain and Ireland (Cambridge Studies in Nineteenth-Century Literature and Culture)\nBook Author: Gordon Bigelow (Author)\nSeries: Cambridge Studies in Nineteenth-Century Literature and Culture (Book 40)\nHardcover: 244 pages\nPublisher: Cambridge University Press (November 24, 2003)\nLanguage: English\nISBN-10: 0511062818\nISBN-13: 978-0521828482\n\nBook Description\nPublication Date: November 24, 2003 | ISBN-10: 0521828481 | ISBN-13: 978-0521828482\nDuring the Irish Famine of 1845-52, novels by Dickens and Gaskell, as well as a range of commentaries on the Irish disaster, argued for a new theory of individual expression in opposition to the systemized approach to economic life that political economy proposed. These romantic views of human subjectivity eventually provided the foundation for a new theory of capitalism based on the desires of the individual consumer.\n\n\nReviews\n&quot;...a clearly argued work which brings the industrial novels of Dickens and Gaskell into dialogue with contemporary theories of political economy. The value of Bigelow's book lies primarily in his demonstration of his thesis through a meticulous examination of the language of economic theorists.&quot; Kate Flint, Studies in English Literature\n\n&quot;In 1884, Arnold Toynbee described the debate between advocates of culture and political economy as &quot;a bitter argument between economists and human beings.&quot; Gordon Bigelow's excellent study traces the result of this argument, analyzing the transformation of economics in the nineteenth century, from being accepted as a social discourse integral to politics and literature to being rejected as a cultural pariah and perpetrator of genocide to being relegated to scientific objectivity in the 1870s to cleanse economics of political associations linking it to catastrophic events such as the Great Famine.&quot; Working, Melissa Fegan, University College Chester\n\n&quot;Powerful.&quot; EH-NET\n\nBook Description II\nBefore the emergence of modern economics, political economy was a worldly discipline, of interest to readers of novels, and to novelists. At the time of the Irish Famine of 1845 52, novels by Dickens and Gaskell, and a range of commentaries on the Irish disaster, argued for a new theory of individual expression in opposition to the systemized approach to economic life that political economy proposed. Gradually these romantic views of human subjectivity provided the foundation for a new theory of capitalism based on the desires of the individual consumer.\n\nAbout the Author\nGordon Bigelow is Assistant Professor of English at Rhodes College in Memphis, Tennessee. His work has appeared in the journals ELH and New Orleans Review and in the volume Reclaiming Gender: Transgressive Identities in 19th-century Ireland (1999).\n","torrent":{"xt":"urn:btih:77b1d8cffd968e6500c04f4f5e3c53c4a5a77529","amp;dn":"Gordon+Bigelow+-+Fiction%2C+Famine%2C+and+the+Rise+of+Economics+in+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b1d8cffd968e6500c04f4f5e3c53c4a5a77529","infoHashBuffer":{"type":"Buffer","data":[119,177,216,207,253,150,142,101,0,192,79,79,94,60,83,196,165,167,117,41]},"announce":[],"urlList":[]}}