{"title":"Security Monitoring: Incident Detection on Enterprise Networks ","uid":7785044,"size":6050553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78fa7423be819f6dd143e517843e6b30d8832ce9&amp;dn=Security+Monitoring%3A+Incident+Detection+on+Enterprise+Networks+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1351873196,"description":"Security Monitoring: Proven Methods for Incident Detection on Enterprise Networks\n2009 | Chris Fry, Martin Nystrom | O'Reilly Media | ISBN: 0596518161 | CHM | 248 pages | 5.8 Mb\n\nHow well does your enterprise stand up against today's sophisticated security threats? With this book, security experts from Cisco Systems demonstrate how you can detect damaging security incidents on your global network - first by discovering which assets you need to monitor closely, then by helping you develop targeted strategies and pragmatic techniques to identify security incidents.\n\nSecurity Monitoring offers six steps to improve network monitoring, based on the authors' years of experience conducting incident response to keep Cisco's global network secure.\nThese steps will guide you through the following:\nDevelop Policies: define the rules, regulations, and criteria against which to monitor\nKnow Your Network: build knowledge of your infrastructure with network telemetry\nSelect Your Targets: define the subset of infrastructure where you'll focus monitoring\nChoose Event Sources: identify the event types needed to discover policy violations\nFeed and Tune: collect data and generate alerts, tuning systems using context\nMaintain Dependable Event Sources: prevent critical gaps in your event collection and monitoring","torrent":{"xt":"urn:btih:78fa7423be819f6dd143e517843e6b30d8832ce9","amp;dn":"Security+Monitoring%3A+Incident+Detection+on+Enterprise+Networks+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78fa7423be819f6dd143e517843e6b30d8832ce9","infoHashBuffer":{"type":"Buffer","data":[120,250,116,35,190,129,159,109,209,67,229,23,132,62,107,48,216,131,44,233]},"announce":[],"urlList":[]}}