{"title":"The Impostor Queen - Sarah Fine","uid":13144870,"size":4731747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79260cb48172b8a95d27a727b73ac32b0c1720cc&amp;dn=The+Impostor+Queen+-+Sarah+Fine&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1452017048,"description":"The elders chose Elli to be queen, but they chose wrong in this beautifully crafted novel in the tradition of Kristin Cashore and Victoria Aveyard.\r\n\r\nSixteen-year-old Elli was a small child when the Elders of Kupari chose her to succeed the Valtia, the queen who wields infinitely powerful ice and fire magic. Since then, Elli has lived in the temple, surrounded by luxury and tutored by priests, as she prepares for the day when the Valtia perishes and the magic finds a new home in her. Elli is destined to be the most powerful Valtia to ever rule.\r\n\r\nBut when the queen dies defending the kingdom from invading warriors, the magic doesn’t enter Elli. It’s nowhere to be found.\r\n\r\nDisgraced, Elli flees to the outlands, the home of banished criminals—some who would love to see the temple burn with all its priests inside. As she finds her footing in this new world, Elli uncovers devastating new information about the Kupari magic, those who wield it, and the prophecy that foretold her destiny. Torn between the love she has for her people and her growing loyalty to the banished, Elli struggles to understand the true role she was meant to play. But as war looms, she must align with the right side—before the kingdom and its magic are completely destroyed","torrent":{"xt":"urn:btih:79260cb48172b8a95d27a727b73ac32b0c1720cc","amp;dn":"The+Impostor+Queen+-+Sarah+Fine","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79260cb48172b8a95d27a727b73ac32b0c1720cc","infoHashBuffer":{"type":"Buffer","data":[121,38,12,180,129,114,184,169,93,39,167,39,183,58,195,43,12,23,32,204]},"announce":[],"urlList":[]}}