{"title":"The Life and Lies of Jimmy Savile  (2014 - Retail epub)","uid":10589012,"size":2383202,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79607cd288a588f694d27d92862d93ea9a948530&amp;dn=The+Life+and+Lies+of+Jimmy+Savile++%282014+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Robin1966","files":4,"time":1405780917,"description":"Books : Biography : English\n\n'To my mind, the best and hottest non-fiction property of the decade is Dan Davies's book on Jimmy Savile. He had amazing access for years and stuck with the story before anybody knew how interesting it was. His book will be a must-read and will hit British culture like a cluster-bomb. I can't wait' Andrew O'Hagan.\n\n\nDan Davies has spent more than twenty-five years on a quest to find the real Jimmy Savile, and interviewed him extensively over a period of seven years before his death. In the course of his quest, he spent days and nights at a time quizzing Savile at his homes in Leeds and Scarborough, lunched with him at venues ranging from humble transport cafes to the Athenaeum club in London and, most memorably, joined him for a short cruise aboard the QE2. Dan thought his quest had come to an end in October 2011 when Savile's golden coffin was lowered into a grave dug at a 45-degree angle in a Scarborough cemetery. He was wrong.\n\nIn the last two and a half years, Dan has been interviewing scores of people, many of them unobtainable while Jimmy was alive. What he has discovered was that his instincts were right all along and behind the mask lay a hideous truth. Jimmy Savile was not only complex, damaged and controlling, but cynical, calculating and predatory. He revelled in his status as a Pied Piper of youth and used his power to abuse the vulnerable and underage, all the while covering his tracks by moving into the innermost circles of the establishment.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:79607cd288a588f694d27d92862d93ea9a948530","amp;dn":"The+Life+and+Lies+of+Jimmy+Savile++%282014+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79607cd288a588f694d27d92862d93ea9a948530","infoHashBuffer":{"type":"Buffer","data":[121,96,124,210,136,165,136,246,148,210,125,146,134,45,147,234,154,148,133,48]},"announce":[],"urlList":[]}}