{"title":"Blur - Song 2 [promo].VOB","uid":11775314,"size":84049920,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7979f4d31c031c5d37c48566138c2cfe68c6c848&amp;dn=Blur+-+Song+2+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SgtRlee","files":1,"time":1427260114,"description":"Blur - Song 2 [promo].VOB\n\n\nHQ promo music video from a promo DVD. &quot;Song 2&quot; is a song by English rock band Blur, the second track from their 1997 eponymous fifth studio album. The hook features Damon Albarn yelling &quot;woo-hoo!&quot; as the distorted bass comes in. Released in April 1997, &quot;Song 2&quot; appropriately reached number two in the UK Singles Chart, number four on the Australian ARIA Charts, and number six on US Billboard Alternative Songs, (previously called Billboard Modern Rock Tracks).\n\nAt the 1997 MTV Video Music Awards, &quot;Song 2&quot; was nominated for Best Group Video, and Best Alternative Video. At the 1998 Brit Awards the song was nominated for Best British Single, and Best British Video. In December 1998, BBC Radio 1 listeners voted &quot;Song 2&quot; the 15th Best Track Ever. In October 2011, NME placed it No. 79 on its list &quot;150 Best Tracks of the Past 15 Years&quot;.\n\nBlur intended &quot;Song 2&quot; to be a satire of grunge. The song was nonetheless their biggest hit in the United States. The song has often featured in popular culture, and first appeared in the hit video game FIFA: Road to World Cup 98.\n \nThis music video for this song was directed by Sophie Muller, and it features the band playing in a small, secluded room with loud amplifiers behind them. During the choruses, the volume of the song sends the band members crashing against the walls and ground. This video bears striking resemblances to Blur's video for &quot;Popscene&quot;.\n\n\nBlur are an English rock band, formed in London in 1988. The group consists of singer/keyboardist Damon Albarn, guitarist/singer Graham Coxon, bassist Alex James and drummer Dave Rowntree. Blur's debut album Leisure (1991) incorporated the sounds of Madchester and shoegazing. Following a stylistic change influenced by English guitar pop groups such as the Kinks, the Beatles and XTC, Blur released Modern Life Is Rubbish (1993), Parklife (1994) and The Great Escape (1995). As a result, the band helped to popularise the Britpop genre and achieved mass popularity in the UK, aided by a chart battle with rivals Oasis in 1995 dubbed the &quot;Battle of Britpop&quot;.\n\nIn recording their follow-up, Blur (1997), the band underwent another reinvention, showing influence from the lo-fi style of American indie rock groups. The album, including the &quot;Song 2&quot; single, brought Blur mainstream success in the United States. Their next album, 13 (1999) saw the band members experimenting with electronic and gospel music, and featured more personal lyrics from Albarn. In May 2002, Coxon left Blur during the recording of their seventh album Think Tank (2003). Containing electronic sounds and more minimal guitar work, the album was marked by Albarn's growing interest in hip hop and African music. After a 2003 tour without Coxon, Blur did no studio work or touring as a band, as members engaged in other projects.\n\nBlur reunited, with Coxon back in the fold, for a series of concerts in 2009. In the following years they released several singles and retrospective compilations, and toured internationally. In 2012, the group received a Brit Award for Outstanding Contribution to Music. Blur are set to release their first studio album in twelve years, The Magic Whip, in April 2015.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Song_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Song_2&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/s5rwwg4jn/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/s5rwwg4jn/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8500kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 224kbps\n   Duration: 00:02:10\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:7979f4d31c031c5d37c48566138c2cfe68c6c848","amp;dn":"Blur+-+Song+2+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7979f4d31c031c5d37c48566138c2cfe68c6c848","infoHashBuffer":{"type":"Buffer","data":[121,121,244,211,28,3,28,93,55,196,133,102,19,140,44,254,104,198,200,72]},"announce":[],"urlList":[]}}