{"title":"(Contemporary Endocrinology) - Pediatric Obesity Etiology, Patho","uid":11142684,"size":10369395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a48fcc3e7b70733196776d2a7df086dfb8ec1d0&amp;dn=%28Contemporary+Endocrinology%29+-+Pediatric+Obesity+Etiology%2C+Patho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"vickey1992","files":1,"time":1412200548,"description":"Author: Michael Freemark\nChildhood obesity and its co-morbidities -- including type 2 diabetes, hypertension, dyslipidemia, sleep apnea, and fatty liver disease -- have seen striking increases in recent years. Despite a wealth of investigation, there is considerable controversy regarding the etiology of childhood obesity and the optimal approaches for prevention and treatment. Pediatric Obesity: Etiology, Pathogenesis, and Treatment addresses the controversy with a range of features that make it a unique resource for those who care for obese children and their families. Written from a perspective that is international in scope, the distinguished authors re-assess the roles of genetic and environmental factors in the pathogenesis of childhood obesity and critically review new studies of the effects of lifestyle, pharmacologic, and surgical interventions. The evidence-based approach of Pediatric Obesity: Etiology, Pathogenesis, and Treatment provides a comprehensive and invaluable guide for all healthcare providers concerned with the evaluation and care of children with nutritional and metabolic disease and with the societal implications of the obesity epidemic.\n\nCopyright to the respective owners.If you like this book then please buy it.\nSharing is caring,Seed this torrent so others could enjoy it too.","torrent":{"xt":"urn:btih:7a48fcc3e7b70733196776d2a7df086dfb8ec1d0","amp;dn":"%28Contemporary+Endocrinology%29+-+Pediatric+Obesity+Etiology%2C+Patho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a48fcc3e7b70733196776d2a7df086dfb8ec1d0","infoHashBuffer":{"type":"Buffer","data":[122,72,252,195,231,183,7,51,25,103,118,210,167,223,8,109,251,142,193,208]},"announce":[],"urlList":[]}}