{"title":"The.Sims.Medieval.Pirates.and.Nobles-RELOADED","uid":6643261,"size":1608704566,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7a6a37f9276fad942f45ed411ccaa9933d9632ca&amp;dn=The.Sims.Medieval.Pirates.and.Nobles-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1314833232,"description":"The.Sims.Medieval.Pirates.and.Nobles-RELOADED\n\n\nThe Sims: Medieval - Pirates and Nobles (c) Electronic Arts Inc.\n    \n08/2011 :..... RELEASE.DATE .. PROTECTION .......: Securom/Custom\n      1 :.......... DISC(S) .. GAME.TYPE ........: Sims\n\n\nGAME INFOS\n\nThe Sims Medieval: Pirates &amp; Nobles Adventure Pack gives players the sandbox\nstyle freedom to play as they want, without neglecting guided gameplay in\nwhich they will find new quests and one new Kingdom Ambition.\n  \nA player's heroic story begins when the Pirates of Aarbyville and the Nobles\nof Tredony arrive in the kingdom, followed quickly by sword fights, love\naffairs, grand adventures and mysteries. For those who enjoy the rush of\nheroic missions, new exhilarating quests expand upon the original adventures\nlike finding the fountain of youth or protecting the kingdom from an evil\nsorcerer. The war between Tredony and Aarbyville creates the new Kingdom\nAmbition and opportunity for players to suit up their kingdoms. Players can\nchoose to be anyone from a king or queen to a knight or blacksmith, and with\nthat, prepare for voyage accordingly. Treasure hunting is an exciting new\ngameplay feature in the pack with maps, shovels, rare treasures and\nsurprising dangers, while challenging players to find hidden objects and\nsearch for desirable rewards that will benefit their hero Sims. Other new\nitems include birds that you can name and train, and interrogation chairs.\n\n\nINSTALL NOTES\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game and use the keygen located in the Crack dir on the disc\n   when asked for a serial. Or use this: 9SM5-VYBG-QVFF-2QVM-MRLD\n4. Copy over the cracked content from the same Crack dir to the\n   &lt;install&gt;\\Game\\Bin of the main The Sims: Medieval game.\n5. Play the game. Don't allow the launcher to connect online.\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:7a6a37f9276fad942f45ed411ccaa9933d9632ca","amp;dn":"The.Sims.Medieval.Pirates.and.Nobles-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a6a37f9276fad942f45ed411ccaa9933d9632ca","infoHashBuffer":{"type":"Buffer","data":[122,106,55,249,39,111,173,148,47,69,237,65,28,202,169,147,61,150,50,202]},"announce":[],"urlList":[]}}