{"title":"The Journal 4.1.0.253 + Steve Pavlina's Templates + Serials","uid":4722762,"size":5253628,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7a8c71eeb4a28a1fd37137d987f2924afd269d9d&amp;dn=The+Journal+4.1.0.253+%2B+Steve+Pavlina%5C%27s+Templates+%2B+Serials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"maxrush","files":-1,"time":1234606386,"description":"This torrent includes, David RM's The Journal inclusive of Steve Pavlinas Templates and the serial to activate!\n\nHappy Journaling!\n\n============================================================================\n\nDavidRM Software's The Journal\nJournal Software for Windows\n\nDownload The Journal today! \t\n\nKeep a journal on your computer!\nWhatever your journaling or writing needs, The Journal gives you unmatched convenience, flexibility, and security. The Journal is always available when you need it, and lets you make entries with text, images, and just about anything else. Plus, with The Journal's password-protection and encryption you can rest assured that your secrets remain secret.\n\nThe Journal runs on Windows Vista, Windows XP, Windows NT/2000, and Windows 95/98/ME. (Mac &amp; Linux users click here.)\nMore than just &quot;diary software&quot;!\n\nThe Journal is a powerful journaling and writing tool that can help you take control of your life.\n\n    * Create a digital scrapbook of your life!\n    * Organize your notes about your family, about your work, about a hobby, about anything.\n    * Write a short story, a magazine article, or even a novel.\n    * Remember your appointments, events, tasks &amp; special days!\n    * Find whatever you're looking for with The Journal's powerful searching.\n    * Get inspired! \n\n\t\n\nWhat a great program! I have been journaling on my computer for several years now, but have never been happy with the program I was using. Once I found yours I immediately moved all of my data over...and registered. Thanks!\n\n--Craig Miller, GIS Applications Developer, Pacific Northwest Geographics\n\nKeep a journal Your Way! The Journal is highly flexible and can be personalized to suit your style. Whether for business or personal use, you can customize The Journal to be exactly right for you.\n\nRelax! To make The Journal even easier to use, if you have any questions at all, just ask (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9eedebeeeef1eceadefaffe8f7faecf3b0fdf1f3&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) Email your question about The Journal. I'm here for you. We're here for you!\n\nStart today! If you have ever wanted to keep a personal journal, start a diary, or simply organize your many notes, now is the time. The Journal offers a Free 45-day Trial. So Download The Journal today!\n\nView Screen Shots of The Journal View Screen Shots of The Journal View Screen Shots of The Journal\nSee what You can Do with The Journal!\n\nThe Journal is Perfect for...\n\n    * Professionals! Use The Journal to track your daily progress on all your projects! Keep your professional secrets secret.\n    * Students! Take The Journal with you to class. Never misplace notes or struggle with deciphering your handwriting ever again. There is also a Special Discount Offer for Students.\n    * Writers! Whether you are a professional writer or an aspiring author, The Journal can help you organize your manuscripts and ideas. The Journal even provides writing exercises to help you hone your skills.\n    * Self Improvement! Journaling is a powerful tool of self analysis. With The Journal, you can quickly and easily record your thoughts and feelings throughout the day.\n    * Daily Devotionals! Record your spiritual insights and know that you can always find them again.\n    * Family Historians! Combined with the MemoryGrabber, The Journal makes it easy to write your own memoirs. You can also help your parents, grandparents, or even great-grandparents record the exciting story of their life.\n    * Recording your dreams! Let The Journal help you remember and analyze your dreams.\n","torrent":{"xt":"urn:btih:7a8c71eeb4a28a1fd37137d987f2924afd269d9d","amp;dn":"The+Journal+4.1.0.253+%2B+Steve+Pavlina%5C%27s+Templates+%2B+Serials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a8c71eeb4a28a1fd37137d987f2924afd269d9d","infoHashBuffer":{"type":"Buffer","data":[122,140,113,238,180,162,138,31,211,113,55,217,135,242,146,74,253,38,157,157]},"announce":[],"urlList":[]}}