{"title":"Woods Randall - Shadow Warrior.epub","uid":9207893,"size":3348341,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7aabfa6e47ab1f9f3fdb857a83143a04cb005dbb&amp;dn=Woods+Randall+-+Shadow+Warrior.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":1,"time":1384728933,"description":" World War II commando, Cold War spy, and CIA director under presidents Nixon and Ford, William Egan Colby played a critical role in some of the most pivotal events of the twentieth century. A quintessential member of the greatest generation, Colby embodied the moral and strategic ambiguities of the postwar world, and first confronted many of the dilemmas about power and secrecy that America still grapples with today. In &quot;Shadow Warrior,&quot; eminent historian Randall B. Woods presents a riveting biography of Colby, revealing that this crusader for global democracy was also drawn to the darker side of American power. Aiming to help reverse the spread of totalitarianism in Europe and Asia, Colby joined the U.S. Army in 1941, just as America entered World War II. He served with distinction in France and Norway, and at the end of the war transitioned into America's first peacetime intelligence agency: the CIA. Fresh from the fight against fascism, Colby zealously redirected his efforts against international communism. He insisted on the importance of fighting communism on the ground, doggedly applying guerilla tactics for counterinsurgency, sabotage, surveillance, and information-gathering on the new battlefields of the Cold War. Over time, these strategies became increasingly ruthless; as head of the CIA's Far East Division, Colby oversaw an endless succession of assassination attempts, coups, secret wars in Laos and Cambodia, and the Phoenix Program, in which 20,000 civilian supporters of the Vietcong were killed. Colby ultimately came clean about many of the CIA's illegal activities, making public a set of internal reports--known as the &quot;family jewels&quot;--that haunt the agency to this day. Ostracized from the intelligence community, he died under suspicious circumstances--a murky ending to a life lived in the shadows. Drawing on multiple new sources, including interviews with members of Colby's family, Woods has crafted a gripping biography of one of the most fascinating and controversial figures of the twentieth century.","torrent":{"xt":"urn:btih:7aabfa6e47ab1f9f3fdb857a83143a04cb005dbb","amp;dn":"Woods+Randall+-+Shadow+Warrior.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aabfa6e47ab1f9f3fdb857a83143a04cb005dbb","infoHashBuffer":{"type":"Buffer","data":[122,171,250,110,71,171,31,159,63,219,133,122,131,20,58,4,203,0,93,187]},"announce":[],"urlList":[]}}