{"title":"An Introduction to Medical Teaching, 2E (Springer) [PDF] [StormR","uid":11328553,"size":3854117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7af1342dd327e118b54c549048ce4b9191ecf1d3&amp;dn=An+Introduction+to+Medical+Teaching%2C+2E+%28Springer%29+%5BPDF%5D+%5BStormR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"0xmovva","files":2,"time":1414648218,"description":"TITLE/EDITION An Introduction to Medical Teaching Second Edition\nAuthor: Huggett, Kathryn, Jeffries, William B\nISBN:9401790663\nISBN-13:9789401790666\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nIt offers brief, focused chapters with content that is assimilated easily by the reader\nThe topics are relevant to basic science and clinical teachers\nThe authors emphasize the application of concepts to teaching practice\nIt does not presume readers possess prerequisite knowledge of education theory or instructional design\n\nFew faculty members in academic medical centers are formally prepared for their roles as teachers. This work is an introductory text designed to provide medical teachers with the core concepts of effective teaching practice and information about innovations for curriculum design, delivery and assessment. It offers brief, focused chapters with content that is assimilated easily by the reader. The topics are relevant to basic science and clinical teachers and the work does not presume readers possess prerequisite knowledge of education theory or instructional design. The authors emphasize the application of concepts to teaching practice. Topics include: Facilitating Student Learning; Teaching Large Groups; Teaching in Small Groups; Flipping the Classroom; Problem-Based Learning; Team-Based Learning; Teaching Clinical Skills; Teaching with Simulation; Teaching with Practicals and Labs; Teaching with Technological Tools; Teaching to Develop Scientific Engagement in Medical Students; Designing a Course; Establishing and Teaching Elective Courses; Designing Global Health Experiences; Assessing Student Performance; Documenting the Trajectory of Your Teaching and Teaching as Scholarship.\n\nThis is a complete revision of the first edition of this work with new chapters and up to date information. Similar to the first edition, chapters were written by leaders in medical education and research who draw upon extensive professional experience and the literature on best practices in education. Although designed for teachers, the work reflects a learner-centered perspective and emphasizes outcomes for student learning. The book is accessible and visually interesting and the work contains information that is current, but not time-sensitive. Each chapter concludes with references, many include recommendations for additional reading, and the work includes an appendix with resources for medical education","torrent":{"xt":"urn:btih:7af1342dd327e118b54c549048ce4b9191ecf1d3","amp;dn":"An+Introduction+to+Medical+Teaching%2C+2E+%28Springer%29+%5BPDF%5D+%5BStormR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7af1342dd327e118b54c549048ce4b9191ecf1d3","infoHashBuffer":{"type":"Buffer","data":[122,241,52,45,211,39,225,24,181,76,84,144,72,206,75,145,145,236,241,211]},"announce":[],"urlList":[]}}