{"title":"Kool &amp; the Gang Greatest Hits","uid":5034073,"size":80001432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7bdf0e1e5b9f87a66ab5b99fa1fb9dd454be1183&amp;dn=Kool+%26+the+Gang+Greatest+Hits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Duracell72","files":12,"time":1249032019,"description":"I Kool &amp; the Gang sono un gruppo musicale statunitense. Si formarono nel 1964 a Jersey City, in New Jersey ed attraversarono diverse fasi nella loro carriera. Iniziarono come praticanti dell'R&amp;B e del funk. Sicuramente attraversarono una fase durante la quale erano un'icona della musica, e segnarono il periodo di successo della loro carriera registrando canzoni che erano un misto tra il pop e l'R&amp;B.\nLa grafia iniziale del gruppo era Kool and the Gang, come l'album di debutto omonimo del 1969. Dall'album Wild and Peaceful del 1973 adottarono la grafia Kool &amp; the Gang, mantenuta da allora in poi.\nI membri principali del gruppo tra gli anni inclusero i fratelli Robert Bell (conosciuto come &quot;Kool&quot;) al basso (nato l'8 ottobre 1950 a Youngstown, in Ohio) e Ronald Bell al sassofono tenore (nato l'1 novembre 1951 a Youngston, in Ohio); George Brown alla batteria (nato il 5 gennaio 1949); Robert Mickens alla trombetta; Dennis Thomas all'altro sassofono; Claydes Charles Smith alla chitarra (nato il 6 settembre 1948 e morto il 20 giugno 2006), il trombonista Clifford Adams e Rick Westfield alla tastiera. Il padre dei fratelli Bell era uno dei manager dei Thelonious Monk e i fratelli erano amici con Leon Thomas. Da notare che l'ultimo chitarrista dei Kool &amp; the Gang, Claydes Charles Smith, scrisse molti dei successi del gruppo, tra cui &quot;Joanna&quot;, &quot;Hollywood Swinging&quot; e &quot;Celebration&quot;.\nNel 1964, Robert formÃƒÂ² una banda strumentale chiamata &quot;The Jazziacs&quot; con cinque amici del liceo. Cambiarono il loro nome in &quot;Kool &amp; the Gang&quot; e segnarono le pop-charts mondiali con l'uscita del loro debutto musicale, &quot;Kool and the Gang&quot;.\nNonostante nessuno dei tre single dell'album riuscÃƒÂ¬ a scalare la vetta delle pop-charts, i loro successi R&amp;B furono veloci e di massa. Seguirono diversi album dal vivo e in studio, ma Wild and Peaceful del 1973 suscitÃƒÂ² parecchio interesse nel mondo della musica con i singoli &quot;Jungle Boogie&quot; (che in futuro verrÃƒÂ  utilizzata in Pulp Fiction di Quentin Tarantino, &quot;Hollywood Swinging&quot; e nel videogioco GTA: San Andreas). Molte critiche giudicano l'album The Spirit of the Boogie del 1975 come il piÃƒÂ¹ grande successo della band. Comunque, dopo quell'album la band abbandonÃƒÂ² la musica funk e passÃƒÂ² alla disco. Generalmente, gli albumi realizzati dopo il 1975 non vennero accolti come i primi lavori.\nAlla fine degli anni settanta, i Kool &amp; the Gang iniziarono a scemare lentamente - con l'ingresso del nuovo cantante James &quot;J.T.&quot; Taylor. Nel 1979 la loro carriera sembrÃƒÂ² finire totalmente con Ladies' Night. La canzone principale dell'album divenne un incredibile insuccesso. Le loro uniche numero 1 in quegli anni furono &quot;Fresh&quot; e &quot;Celebration&quot;, dal CD &quot;Celebrate!&quot;, prodotto da Eumir Deodato. Alcune tracce riuscirono ad ottenere successo come ad esempio, &quot;Big Fun&quot;, &quot;No Show&quot;, &quot;Get Down on It&quot; e &quot;Joanna&quot;. Il loro album del 1984, Emergency si posizionÃƒÂ² quattro volte entro le 20 hit del momento. Il gruppo si fermÃƒÂ² del tutto dopo l'album Forever, quando sia Taylor che Ronald Bell abbandonarono il gruppo; entrambi sarebbero in seguito ritornati, ma le canzoni non sarebbero piÃƒÂ¹ state quelle di un tempo.\nL'ultimo album pubblicato dai Kool &amp; the Gang ÃƒÂ¨ Still Kool, rilasciato nel 2007.\n\nCuriositÃƒÂ  \n\n&quot;Hollywood Swinging&quot; fu usata anche da Jon Arons nel suo numero di danza sullo &quot;Steve Harvey Show&quot;.\nFrammenti di &quot;Hollywood Swinging&quot; si possono ascoltare nella canzone &quot;Let Me Clear My Throat&quot; di DJ Kool.\nDall'album Light of worlds, del 1974, ÃƒÂ¨ stata piÃƒÂ¹ volte utilizzata la canzone &quot;Summer Madness&quot;. DJ Jazzy Jeff e Fresh Prince l'hanno usata per la loro hit Summertime; la canzone ÃƒÂ¨ stata utilizzata anche in Rocky del 1976. PiÃƒÂ¹ recentemente, &quot;Summer Madness&quot; ÃƒÂ¨ servita come musica di sottofondo per uno spot della Nike ed ÃƒÂ¨ stata una delle canzoni di sottofondo ai giochi Tony Hawk's Project 8 e GTA: Vice City.\nAi Kool &amp; the Gang ÃƒÂ¨ spesso attribuita la canzone &quot;Car Wash&quot;, ma questo single venne in realtÃƒÂ  registrato da Rose Royce.\nLa canzone &quot;Joanna&quot; ha una grande somiglianza con &quot;Last Christmas&quot; di George Michael; le canzoni sono spesso confuse quando viene suonata la parte strumentale. La canzone di Michael venne realizzata nel 1984.\nJungle Boogie ÃƒÂ¨ stata utilizzata nella colonna sonora di Pulp Fiction , mentre il gruppo stesso ÃƒÂ¨ citato in Kill Bill, entrambi i film sono di Quentin Tarantino.","torrent":{"xt":"urn:btih:7bdf0e1e5b9f87a66ab5b99fa1fb9dd454be1183","amp;dn":"Kool+%26+the+Gang+Greatest+Hits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bdf0e1e5b9f87a66ab5b99fa1fb9dd454be1183","infoHashBuffer":{"type":"Buffer","data":[123,223,14,30,91,159,135,166,106,181,185,159,161,251,157,212,84,190,17,131]},"announce":[],"urlList":[]}}