{"title":"Free Energy - Nanotechnology Nanotopia","uid":3425560,"size":214085484,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:7cd9ab190a504bcb035e8f9d2f68d4714a2aabff&amp;dn=Free+Energy+-+Nanotechnology+Nanotopia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Stonecutter","files":2,"time":1135856556,"description":"A documentary on optical computing, nanotechnology and the post silicon revolution.\n\nFuturists have described the brave new world of nanotechnology as the &quot;shotgun marriage of science and engineering.&quot; They foresee a world of supercomputers the size of a single cell, safe and affordable space travel, medical devices that will end disease, molecular food synthesis, and technological advances that will eradicate pollution.\n\nSometimes referred to as &quot;molecular manufacturing,&quot; nanotechnology is really a process of building teeny, tiny things one atom or molecule at a time. Utilizing well-understood chemical properties of atoms and molecules, nanotechnology holds out the promise of being able to construct molecular devices capable of extraordinary tasks. The trick is to manipulate atoms individually and place them exactly where you want them. It's challenging work, given the scale?a nanometer is one billionth of a meter, or three or four atoms wide.\n\nTo many people it still sounds like the stuff of science fiction. However experts says that all this?and engineering feats we can't even imagine?are just around the corner.","torrent":{"xt":"urn:btih:7cd9ab190a504bcb035e8f9d2f68d4714a2aabff","amp;dn":"Free+Energy+-+Nanotechnology+Nanotopia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd9ab190a504bcb035e8f9d2f68d4714a2aabff","infoHashBuffer":{"type":"Buffer","data":[124,217,171,25,10,80,75,203,3,94,143,157,47,104,212,113,74,42,171,255]},"announce":[],"urlList":[]}}