{"title":"Captain America by Brubaker (2005-2013|100%|D+S|MM+E+DCP|1/6)","uid":9618264,"size":531408033,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7d2607b77ca2068cb2fd893da753d7951624f5f8&amp;dn=Captain+America+by+Brubaker+%282005-2013%7C100%25%7CD%2BS%7CMM%2BE%2BDCP%7C1%2F6%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1392453363,"description":"In 2005, writer Ed Brubaker began his epic, legendary run on Captain America - which ended up spanning 8 years, numerous volumes, one-shots and minis, and a total redefinition of the character from the ground up. The story was a tale of fractured psyche, of death and rebirth, of ghosts long forgotten and evil yet to be defeated. It also featured the return of a major character from Captain America's past, who would go on to become a modern hero in his own right. The second Captain America film, The Winter Soldier, takes much inspiration from this source material, so now is a good time to catch up and read one of the greatest comic book runs ever written.\n\nThis set of torrents is the entirety of Brubaker's run, 100% COMPLETE, in the correct order, and in the best quality I could find (the vast majority of which are digital releases). Because of the hefty size of this collection, I have divided it into six parts, all clearly labeled and organized by folders for maximum comprehension and ease of access. AFAIK this is EVERYTHING that Brubaker wrote in relation to Captain America and the Winter Soldier, and as an added bonus the relevant material from other writers is included as part of the set - either because it is absolutely necessary to the ongoing story, or because it completes a volume or is simply relevant bonus material of the era. I will list the contents of each section and add comments if required, so you know exactly what is in each torrent.\n\nPart 1 - The Winter Soldier &amp; Civil War (10 Folders): The first part of Brubaker's run focuses on Steve Rogers' state of mind after the events of Avengers Disassembled, and the rise of a mysterious threat from the past as well as the apparent death of the Red Skull. Who exactly is the Winter Soldier? Why is he after Captain America and his allies? This section culminates with the reveal and confrontation of the assassin and the Civil War storyline - in which Captain America is famously killed. \n\n[*Note - all issue numbers listed in the titles are from Captain America Vol. 5]\n\n01 Out of Time (CA 01-06)\n02 Interlude: The Lonesome Death of James Monroe (CA 07)\n03 The Winter Solder Part 1-2 (CA 08-09)\n04 House of M - Captain America Tie-In (CA 10)\n05 The Winter Soldier Part 3-6 (CA 11-14)\n06 Red is the Darkest Color (CA 15)\n07 Collision Courses (CA 16-17)\n08 65th Anniversary Special - Secrets of Iron and Fire\n09 Twenty-First Century Blitz (CA 18-21)\n10a Civil War 01-07 [by Mark Millar]\n\nThe individual issues are Digital, courtesy of Zone-Empire, and the same is true for the Civil War TPB in section 10a. The 65th Anniversary Special is care of Bchry-DCP. Much thanks to all the great scanners, as well as nemesis43, gesserit, and STFMaryville for initially uploading some of this content. Please seed and enjoy! :-)\n","torrent":{"xt":"urn:btih:7d2607b77ca2068cb2fd893da753d7951624f5f8","amp;dn":"Captain+America+by+Brubaker+%282005-2013%7C100%25%7CD%2BS%7CMM%2BE%2BDCP%7C1%2F6%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d2607b77ca2068cb2fd893da753d7951624f5f8","infoHashBuffer":{"type":"Buffer","data":[125,38,7,183,124,162,6,140,178,253,137,61,167,83,215,149,22,36,245,248]},"announce":[],"urlList":[]}}