{"title":"The Death of Hitler: The Full Story With New Evidence From Secre","uid":11779373,"size":59722818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d79fc1aa2770bf9598b907f3966f2ec1cb24ed2&amp;dn=The+Death+of+Hitler%3A+The+Full+Story+With+New+Evidence+From+Secre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427497011,"description":"For the past fifty years the Iron Curtain and the Cold War have prevented the truth from being told about one of the most enduring mysteries of the twentieth century: how, exactly, Adolf Hitler died on April 30, 1945, and what happened to his remains. In this groundbreaking book, which reads like a riveting detective story, Ada Petrova and Peter Watson provide the answers to these two questions. Given access to the Russians' hitherto unseen Hitler Archive - File I-G-23, the so-called Operation Myth File - they reveal not only the truth of what went on in Berlin in May 1945 after the Russians captured the bunker in which Hitler, Eva Braun, and their entourage spent their last days, but also why the Soviet regime felt the details of the Fuhrer's death had to be kept secret for so long. Further, they explain how and why his body and those of Braun, Josef and Magda Goebbels, and the Goebbels' six children were secretly buried in Magdeburg, East Germany, and finally disinterred and cremated in 1970 by order of the then KGB chief Yuri Andropov. Besides the Myth File, Petrova and Watson have also been given access to much more: unpublished interrogations that the Russians conducted of those close to Hitler - including his pilot, his valet, and the commander of the bunker; new forensic evidence from the secret autopsies carried out on the bodies of Hitler, Braun, and the Goebbels; photographs from Hitler's private album; and some thirty-six unpublished watercolors that Hitler painted in his youth and that he kept with him right up to the end in the bunker. Most sensationally, however, they have been shown, and allowed to examine, fragments of Hitler's skull that the Russians have had in theirpossession since 1945. The location of the bullet hole in one of the fragments and the results of an independent forensic examination settle once and for all the manner of Hitler's death","torrent":{"xt":"urn:btih:7d79fc1aa2770bf9598b907f3966f2ec1cb24ed2","amp;dn":"The+Death+of+Hitler%3A+The+Full+Story+With+New+Evidence+From+Secre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d79fc1aa2770bf9598b907f3966f2ec1cb24ed2","infoHashBuffer":{"type":"Buffer","data":[125,121,252,26,162,119,11,249,89,139,144,127,57,102,242,236,28,178,78,210]},"announce":[],"urlList":[]}}