{"title":"Sir Isaiah Berlin - Karl Marx: His Life and Environment","uid":5483323,"size":14248296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d7b9c9a10d62b91c75be2cbee13966a4db53385&amp;dn=Sir+Isaiah+Berlin+-+Karl+Marx%3A+His+Life+and+Environment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"artpepper","files":-1,"time":1270565239,"description":"Sir Isaiah Berlin - Karl Marx: His Life and Environment, Fourth Edition\n\nPublisher: Oxford University Press, USA | 1996-09-12 | ISBN: 0195103262 | PDF | 256 pages | 13.59 MB\n\n\nFirst published over fifty years ago, Isaiah Berlin's compelling portrait of the father of modern Communism has long been considered a classic of modern scholarship and the best short account written of Marx's life and thought. \n\nIt provides a penetrating, lucid, and comprehensive introduction to Marx as theorist of the socialist revolution, illuminating his personality and ideas, and concentrating on those which have historically formed the central core of Marxism as a theory and practice. \n\nIn turn, Berlin presents an account of Marx's life as one of the most influential and incendiary social philosophers of the nineteenth century and depicts the social and political atmosphere in which Marx wrote.\n\n\nThis edition includes a new introduction by Alan Ryan which traces the place of Berlin's Marx from its pre-World War II publication to the present, and elucidates why Berlin's portrait, in the midst of voluminous writings about Marx, remains a classic account of the personal and political side of this monumental figure.","torrent":{"xt":"urn:btih:7d7b9c9a10d62b91c75be2cbee13966a4db53385","amp;dn":"Sir+Isaiah+Berlin+-+Karl+Marx%3A+His+Life+and+Environment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d7b9c9a10d62b91c75be2cbee13966a4db53385","infoHashBuffer":{"type":"Buffer","data":[125,123,156,154,16,214,43,145,199,91,226,203,238,19,150,106,77,181,51,133]},"announce":[],"urlList":[]}}