{"title":"[PS3] LA Noire [USA / RUS]","uid":6871631,"size":24661525479,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7df4448a475172209abbf7b600f5d8481527bb45&amp;dn=%5BPS3%5D+LA+Noire+%5BUSA+%2F+RUS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FatFredd229","files":34,"time":1323288561,"description":"Release date: May 17, 2011 Genre: Action \\ Adventure Developer: Team Bondi Publisher: Rockstar Games Code disc: BLUS30554 Publication Type: pirates Serviceability checked releasers: Yes Driver / Manager for Launch: 3.55 [Kmeaw] / multiMAN 9/2/02 + Media Type: Blu-ray Language: Russian Language: English\n\n\n\nDescription:\n    America, the end of the 1940s - the golden age of Hollywood. In Cole Phelps, a detective of the police department of Los Angeles, there is no quiet everyday life - in the booming metropolis rife with corruption and drug trafficking, every now and then committed the murder and robbery. Phelps is a fair law, relentlessly battling crime, taking root even in the ranks of his colleagues. Arson attacks racketeers, brutal murders, conspiracies - untangling the ball of the atrocities, meticulous police gradually will be selected to most closely guarded secrets of the crime the City of Angels ... Key features: * In the best tradition. Interactive detective thriller with a thought-out plot, plenty of unexpected twists and intrigue. * Between the Lines. The game utilizes the latest technology of facial animation, through which all of the virtual characters have surprisingly rich facial expressions. Communicating with them, you can see the widest range of emotions that will undoubtedly be very helpful in the search for truth. * Not a minute idle. Fascinating varied gameplay: involvement in the shootings, fights and chases, and the search for clues, interrogate suspects, interview witnesses. To get to the truth in a city where everyone is hiding something, have to be very persistent and attentive to every detail.\n","torrent":{"xt":"urn:btih:7df4448a475172209abbf7b600f5d8481527bb45","amp;dn":"%5BPS3%5D+LA+Noire+%5BUSA+%2F+RUS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7df4448a475172209abbf7b600f5d8481527bb45","infoHashBuffer":{"type":"Buffer","data":[125,244,68,138,71,81,114,32,154,187,247,182,0,245,216,72,21,39,187,69]},"announce":[],"urlList":[]}}