{"title":"Mulatu Astatqee - Ethiopiques Vol 4: Ethio Jazz (1998) [FLAC]","uid":13757479,"size":313213762,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7e09080ae99aad3545e0558a49adb478cefe9636&amp;dn=Mulatu+Astatqee+-+Ethiopiques+Vol+4%3A+Ethio+Jazz+%281998%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Jooge","files":16,"time":1457209111,"description":"http://i.imgur.com/jXZeWMb.jpg\r\n\r\n\r\n1. Yèkèrmo Sèw\r\n2. Mètché Dershé\r\n3. Kasalèfkut Hulu\r\n4. Tezeta\r\n5. Yègellé Tezeta\r\n6. Munayé\r\n7. Gubèlyé\r\n8. Asmarina\r\n9. Yèkatit\r\n10. Nètsanèt\r\n11. Tezetayé Antchi Lidj\r\n12. Sabyé\r\n13. Ené Alantchi Alnorem\r\n14. Dèwèl\r\n\r\n\r\nWhew! Even when the record stops, these mood-inspiring sounds linger on like a drug. Get your head on right, light a candle, sit back, and you too will understand...Tropical in its roots, funky and intoxicating in its impact, Mulatu Astatke's distinct brand of Ethiopian music features some of the most soulful hip-grinding instrumentals ever recorded in Mother Africa.\r\n\r\nAn album of instrumentals, Ethiopiques Volume 4 is a case study in the inventive blending of influences that comprised the Ethiopian groove. Strains of funk and reggae timings permeate the thick and chunky bass lines, which are pushed prominently forward in the mix. Multiple saxophones swirl with the hypnotic, snake-charming sounds of the East, while at the same time resonating with jazzy tones reminiscent of John Coltrane and Lester Young. Guitar is a main ingredient here, growling with funky distorted wah-pedaled fuzz riffs that sound like they were lifted straight out of an early '70s black-exploitation flick. Drums and percussion combine the punchy funk of James Brown and the Meters with the heavy Latin rhythms of Mongo Santamaria and Willie Bobo. Fusing all of these elements together, Mulatu unleashes a potent brew of afro-jazz grooves that pull you in and leave you in a mystical trance-like state.\r\n\r\nLargely the work of formidable musician-arranger Mulatu Astatqe, the 14 instrumentals here were originally issued on two LPs in 1972 and 1974 in Ethiopia, and represent a curious blend of soul-jazz and R&amp;B with just a smattering of Ethiopian roots breaking up the stabbing horn lines, wah-wah guitars, and simmering electric piano. Curious, because at the time jazz was not very popular in Ethiopia, but that is no reflection on the quality of these primitively recorded sides of idiosyncratic Afro-funk. The grooves are long and laconic, the sound reminiscent of Miles Davis's &quot;In a Silent Way&quot; paired with Cannonball Adderly and Roy Ayers. But, as with all things Ethiopian, the music retains its own unique and unmistakable identity, one somewhere between a late-night jazz hole-in-the-wall group and a supper club belly-dancing combo. There are some very inventive arrangements and vigorous soloing, rendering a highly articulate and listenable music that was, at the time, doomed to go nowhere. Such is the retrospective value of reissues. --Derek Rath","torrent":{"xt":"urn:btih:7e09080ae99aad3545e0558a49adb478cefe9636","amp;dn":"Mulatu+Astatqee+-+Ethiopiques+Vol+4%3A+Ethio+Jazz+%281998%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e09080ae99aad3545e0558a49adb478cefe9636","infoHashBuffer":{"type":"Buffer","data":[126,9,8,10,233,154,173,53,69,224,85,138,73,173,180,120,206,254,150,54]},"announce":[],"urlList":[]}}