{"title":"Dragon Ball Z - Dbz - old mugen beta game - extreme fun","uid":4304708,"size":30002555,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7e666ff67bb78b4b1cee26800a9b66f88061071f&amp;dn=Dragon+Ball+Z+-+Dbz+-+old+mugen+beta+game+-+extreme+fun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Florentin91","files":1,"time":1216484827,"description":"Downloadeado de\nhttp://www.genesishouse.cjb.net\nhttp://www.emuplanet2k.tsx.org\nsÃƒÂ£o as hp's que dÃƒÂ£o esse link.\n\t  Obrigado ElecByte pelo fabuloso M. U. G. E. N.\n\n\n              DRAGON BALL Z - M. U. G. E. N EDITION 2\n\n                  beta release version 2000.07.31\n                           2000 Elecbyte\n\t\t\t    2k MugeNow \n                             ---------\n\n      Please read this whole document before proceeding.\n\n      This is a public beta test version. You may use it to create\n      your own game, but please take note: we may change\n      specifications at any time during the beta phase, so anything\n      you make now may not necessarily work with later versions of\n      M.U.G.E.N.\n\n      Not all docs are complete yet. Unless you are an official\n      beta tester, please hold off all bug reports until a public\n      release is available. Please check mugenfaq.txt for answers to\n      common problems and questions.\n\n \nContents\n--------\n0.      License Agreement\nI.      MUGEN Info\nII.     Key Configuration\nIII.    Running the Game\nIV.     Game HotKeys\nV.      Speed Issues\nVI.     Memory Issues\nA.      Thanks\nB.      Disclaimer\n\n\n=====================================================================\nO. License Agreement\n=====================================================================\n\nBy using MUGEN beta 2000.06.27, you agree to the following terms and\nconditions of use:\n\n1. MUGEN version 2000.06.27 is beta software. You agree to indemnify\nElecbyte from liability for any damage incurred to any computer\nhardware, software, or other property, as well as from any injury\nincurred to your person or others, through use of this software.\nElecbyte shall not be held responsible for any failure of MUGEN\n2000.06.27 to operate properly, whether through deficiencies of the\nsoftware or through user error. Elecbyte disclaims all express and \nimplied warranties, including but not limited to warranties of\nmerchantability and fitness for a particular purpose.\n\n2. The MUGEN environment, defined as any or all of the 2000.06.27\nexecutable, sample character and stage files, configuration files, and\nother associated data files provided by Elecbyte and necessary for\nproper operation of the executable, is copyrighted by Elecbyte and may\nnot be redistributed in whole or in part, altered or unaltered, without\nElecbyte's express written permission.\n\n3. The documentation provided with MUGEN 2000.06.27 is copyrighted by\nElecbyte. Redistribution of the documentation on a non-profit basis is \npermitted, provided that:\n  *) All Elecbyte's copyright notices are retained intact;\n  *) All licensing restrictions pertain to the redistributed documents;\n  *) In the case of altered documents, the altering party must indicate\n     the nature and extent of the alterations made to the documents.\n     Furthermore, the altered documents may not be represented as the\n     official documentation released by Elecbyte.\n     For example, if translating exp.doc to Language X, the altered\n     document must have a header like the following:\n\n       Exp.doc unofficial translation to Language X made by John Doe.\n       Original copyright header follows:\n   \n       &gt; Expressions\n       &gt; ===========\n       &gt; M.U.G.E.N, (c) Elecbyte 2000\n       &gt; Documentation for version 2000.06.27\n\n       (body of document)\n\n4. Elecbyte places no restrictions on distribution of character files,\nstage files, add-on packs, or similar items which operate under the\nMUGEN 2000.06.27 environment, as long as said distribution is pursuant\nto the conditions of paragraph 2. All applicable laws governing such\ndistribution remain in force.  You agree to indemnify Elecbyte from any\nlegal liability for your use, or distribution, of such files.\n\n5. Agreement to this license grants you the right to use the MUGEN\nenvironment, version 2000.06.27, until and not beyond 12:01 AM\n(Greenwich Mean Time) on September 6, 2000. After this time, Elecbyte may,\nat its sole discretion, choose to offer, or not to offer, a new public\nlicense. If a new license is offered, its terms shall govern any\ncontinued use of the MUGEN 2000.06.27 beta. If no new license is\noffered, all use of the 2000.06.27 beta must cease.\n\n6. Failure by Elecbyte to enforce any of the terms of this agreement\nshall not constitute forfeiture of Elecbyte's right to enforce said\nterms.\n\n7. In the event of an inconsistency between this license agreement and\nother Elecbyte documents, the terms of this license agreement shall\nprevail, subject only to possible supersession by subsequent license\nagreements. If any of the terms of this license agreement conflict with\nthe laws in your locale, the conflicting terms will be rendered null and\nvoid. The remainder of this agreement shall still obtain.\n\n\n=====================================================================\nI. MUGEN Info\n=====================================================================\n\nIf you have any questions, please refer to mugenfaq.txt.\n\n\nSystem requirements\n-------------------\nMinimum: 486 DX2-66\nRecommended: Pentium 166\n\nM.U.G.E.N is not set up for maximum performance by default. See\n&quot;Speed Issues&quot; (section IV) for information on how to optimize\nthis program for a slower computer.\nNote: We are not sure of the minimum requirements. What is listed\n      above is only our guess.\nIt is hard to calculate memory requirements. 16 MB should suffice,\nalthough 32 MB is probably much safer. Simultaneous team battle\nmodes will require more memory, as it needs to load up more than\ntwo characters. For larger characters, more memory may be required.\n\n\nWhat MUGEN?\n-----------\nMUGEN is a 2D fighting game engine, but you probably knew that already.\nMUGEN is also an acroymn for something, but we forgot what it is. :)\nWe created MUGEN not only to make a fighting game, but also to let \nothers create their own fighting games.  You can control almost every\naspect of the engine to suit your tastes.  That's the primary goal of\nMUGEN.  Since this is a work in progress, there are many things that\nit can and cannot do, but here's a short list of some of the things you \ncan do...\n\n- Customizable title screen, character select screen, life and power\n  bars, game sound effects, and fonts.\n- Characters can have any number of sprites of any size limited by your\n  computer's memory\n- Up to 12 different color schemes for each character\n- Background music can be mp3, mod or midi files\n- Supports keyboard, joystick and Playstation joypads (through the use\n  of a converter).\n\nGame Engine\n- Use up to 6 buttons for a character (7 if you count the Start button)\n- Regular moves/Special moves/Supers\n- Projectiles\n- Multiple air jumps\n- Move cancel/2-in-1 or whatever you want to call it\n- Multi-part moves/throws\n- What your character can do is defined by how you build his\n  state machine\n\n\nHow MUGEN?\n----------\nMUGEN is being developed in C with DJGPP and Allegro.  It is being\ncompiled with gcc 2.95.2 and linked with Allegro 3.9.31 WIP.\n\n\nWhere MUGEN?\n------------\nwww.elecbyte.com/games\n\n\nWhy MUGEN?\n----------\nTo tell you the truth, we were making a shooting game and all of a sudden\nit turned into this.  Although we were making a shooting game in the \nbeginning, we noticed that there weren't any good commercial fighting \ngames on the PC.\n\n\nWho MUGEN?\n----------\nIf you want to contact us about something, send an email to\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7a1d1b171f093a1f161f1918030e1f5419151754&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\nWhen MUGEN?\n-----------\nI don't quite remember when we started this project.\nOur first public release version was 9X.06.27.\n\n\n\n=====================================================================\nII. Key Configuration\n=====================================================================\n\nThis is the default key configuration. You can change it from the\noptions menu when you run the game.\n\nButton      Player 1      Player 2\n------      --------      --------\n  Up        Up arrow      Numpad Up\n Down       Down arrow    Numpad Down\n Left       Left arrow    Numpad Left\nRight       Right arrow   Numpad Right\n  X         L             Numlock \n  Y         semicolon     Numpad slash\n  Z         double-quote  Numpad asterisk\n  A         comma         Numpad -\n  B         period        Numpad +\n  C         slash         Numpad Enter\nStart       Enter         Numpad PgDn\n\nNo joystick configured by default.\nTo enable, edit data/mugen.cfg and change corresponding joystick\ntypes to 2,4 or 6 buttons. Most popular joysticks work in 6 button\nmode.\nPSX joypad support (through a converter) is under testing.\nWe support the DirectPad Pro PSX converter. You can find it at\nwww.ziplabel.com\nYou may want to know that the given schematics operate the PSX pad\nat a higher voltage than is recommended. Neither us nor the\nDirectPad Pro people will be liable for any damage that may result.\nSupport for the pads through the converter is native; you do not\nneed the DirectPad Pro software drivers to run. Refer to the\nmugenfaq.txt for more information on PSX joypad converters,\nincluding how to enable it in M.U.G.E.N.\n\n\n\n=====================================================================\nIII. Running the Game\n=====================================================================\n\nAt the prompt, type MUGEN to begin (if in Windows, double-click\nMUGEN.EXE)\n\nM.U.G.E.N supports most Sound Blaster-compatible soundcards.\nTo run this beta release, you will need a VESA 1 or VESA 2 compatible\nvideo card. VGA is NOT supported.\n\nMain menu:\n----------\nArcade       - Go 1 on 1 against the computer\nVersus       - Go 1 on 1 against your friend\nTeam Battle  - Play various team-up modes\nTraining     - Try out moves and combos\nWatch        - Watch two AI-controller characters fight\nOptions      - Set up basic game options\nExit         - Returns you to the DOS prompt\n\nCommand-line arguments\n----------------------\n\nM.U.G.E.N accepts optional command-line parameters for Quick-VS mode.\n\nThe format is (optional parameters are enclosed in square brackets):\n  MUGEN [player1 player2 [-s stage]]\n\nFor example, to start quick versus between players named KFM and\nSuave, you can type:\n  MUGEN kfm suave\nTo play the same two characters in a stage named TEMPLE, type:\n  MUGEN kfm suave temple\n\nHere are other useful command-line options:\n -h            Displays help\n -r &lt;sysfile&gt;  Loads a motif (more information below)\n -p3 &lt;pname&gt;   Loads a character named pname as player3\n -p4 &lt;pname&gt;   Loads a character named pname as player4\n -s &lt;sname&gt;    Loads a stage named sname.def in stages/\n\n\nMotifs:\n-------\n\nA motif is a custom configuration of the graphics and sounds\nused in the game's interface, as well as other things such\nas the character roster. The default motif is found in the\ndata/ directory. Custom motifs are placed as subdirectories\nunder data/. For example, the &quot;example1&quot; motif can is in\ndata/example1/, and to use it you would type:\n  MUGEN -r example1\n\nHere's what a motif covers (and which files each is in):\n- character roster and stage list (select.def)\n- title screen graphics, sounds and music (system.def)\n- character screen graphics, sounds and music (system.def)\n- versus screen graphics and music (system.def)\n- option screen graphics, sound and music (system.def)\n- fight screen graphics and sounds (fight.def)\n  The fight screen includes the life and power bars,\n  &quot;round X&quot; images and sounds, common hit sparks and\n  sound effects, etc.\n\nTo set the default motif, edit data/mugen.cfg with\na text editor, and change &quot;motif&quot; under [Options].\n\nTo make your own motif, create a subdirectory under\ndata/ with the name of your motif, and copy system.def\ninto the new directory. If you'd like to edit any other\nfiles besides system.def, make copies of them in your\nmotif directory and change them there. Any data file\nthat doesn't exist in your motif directory will default\nto the one in the data/ directory, so if you did not\ncopy select.def over, data/select.def will be used\nwhen you run with your motif selected.\n\n\nTraining Menu:\n--------------\n\nA training menu has been added to Training mode. You can choose menu\nitems with your directional keys and exit Pause Mode by pressing\nany attack key or Pause. The following options are available:\n\nDummy control: Cooperative, AI, or Manual\n  When in cooperative mode, the dummy will perform the actions you \n  specify elsewhere in the training menu. When in AI mode, the dummy\n  will act like a normal computer opponent. When in manual mode, the\n  dummy can be controlled with the opponent's keys.\n \nGuard mode: None, Auto\n  If guard mode is set to Auto, the dummy will attempt to block most\n  attacks. If guard mode is set to None, the dummy will not block any\n  attacks.\n\nDummy mode: Stand, Crouch, Jump, W Jump\n  Depending on your selection, the dummy will stand, crouch, or \n  repeatedly jump. If you choose W Jump, the dummy will keep air \n  jumping as long as it can.\n\nDistance: Any, Close, Medium, Far\n  If you choose Close, Medium, or Far, the dummy will try to keep the \n  appropriate distance from you by walking forward/backward as \n  necessary. If you choose Any, the dummy will not move forward or \n  backward.\n\nButton jam: None, A, B, C, X, Y, Z, Start\n  The dummy will repeatedly mash the selected button. Good for testing\n  a character's blocking.\n\nYou can minimize the training menu by pressing M while it is active.\nPress M again to reenable it.\n\n\n\n=====================================================================\nIV. Game HotKeys\n=====================================================================\n\nThese are the hotkeys recognized at the fight screen:\n\nKey       Function\n---       --------\nF1        Sets Player 2's life to zero\nCtrl-F1   Sets Player 1's life to zero\nF2        Sets both players' life to 1\nCtrl-F2   Sets Player 1's life to 1\nShift-F2  Sets Player 2's life to 1\nF3        Gives both players full power\nF4        Reset the round\nF5        Time Over\nF12       Take a screenshot (saved to mugen?.pcx)\nCtrl-C    Toggles display of collision boxes, target data (including\n          remaining juggle points) and NotHitBy attributes\nCtrl-D    Toggles debug information display\nCtrl-I    Forces both players into stand state\nCtrl-L    Toggles display of the life and power bars\nCtrl-S    Run the game as fast as possible\nCtrl-V    Enable V-sync (stops &quot;shearing&quot;)\nCtrl-#    (where # is from 1-4) Toggles AI for the #th player\nCtrl-Alt-# (where # is from 1-4) Enables/Disables the player\nSpace     Restores full life and power to all players\nPause     Toggle pause\nScrollLck Frame-step within pause\nEsc       Quit\n\n\n\n=====================================================================\nV. Speed Issues\n=====================================================================\n\nIf you find this runs slowly on your machine, there are several\nthings you can do to improve its performance:\n\ni. Select the most efficient video mode\n   Open up data/mugen.cfg. Under the [Video] section, experiment\n   with the &quot;Vesamode&quot; option. Try &quot;Linear&quot;, &quot;Banked&quot; and &quot;1&quot; to\n   see which gives you a better framerate. Using programs such as\n   Scitech Display Doctor can sometimes help with the speed too.\n\nii. Select the correct resolution\n   M.U.G.E.N is meant to run under 320x240 in 16-bit colour.\n   Anything larger or in a different bit depth may decrease the\n   speed.\n\niii. Turn off stretching\n   If you find you cannot run in 320x240, you can choose 640x480\n   and keep the &quot;stretch&quot; option off.\n\niv. Turn off shadows\n   You can turn shadows off to speed up drawing. Look in \n   data/mugen.cfg and set the &quot;DrawShadows&quot; option under [Config]\n   to 0.\n\nv. Turn off sound or music\n   Playing music during the game takes up CPU power. This is true\n   especially for MP3s. To turn off the background music, open\n   data/mugen.cfg and set &quot;PlayMIDI&quot; and &quot;PlayMP3&quot; to 0.\n   To turn off all sounds and music, set &quot;Sound&quot; to 0. You can\n   also use the -nosound command line option to disable sounds.\n\nvi. Use frameskip\n   Auto-frameskip is enabled by default. The game will not draw\n   some frames in case the computer is not fast enough, and this\n   helps maintain a constant game speed.\n   If you'd like to run at a constant framerate, you can hit Ctrl-F\n   repeatedly to adjust the frameskip. It will switch from &quot;auto&quot;\n   to &quot;skip none&quot; to &quot;skip 1&quot; to &quot;skip 2&quot; and then back to &quot;auto&quot;.\n   This works only when you are in the fight screen.\n\nvii. Free up memory\n   Memory may be swapped to the hard disk when you run low, and\n   this will severely impact performance. See the next section\n   on how to reduce memory usage.\n\n\n\n=====================================================================\nVI. Memory Issues\n=====================================================================\n\nIf you find the program exiting or running slowly because you don't\nhave enough memory, here are some solutions:\n\ni. Run in DOS\n   If you are running Windows, select &quot;Restart in MS-DOS Mode&quot; in\n   the &quot;Shut Down&quot; menu. This will free up a good deal of memory.\n\nii. Reduce the player cache\n   M.U.G.E.N will try to keep players in memory in order to reduce\n   loading times. You might want to reduce the number of players\n   that are kept in memory at any one time.\n   Open up data/mugen.cfg and look under the [Misc] section.\n   Change PlayerCache to a smaller number. 0 will save you the\n   most memory.\n\niii. Turn off sound or music\n   You can save some memory by disabling sound and music. See part\n   v. under &quot;Speed Issues&quot;.\n\niv. Disable buffered read\n   You can save memory while loading characters by turning this\n   option off. It is found under the [Misc] section, and called\n   &quot;BufferedRead&quot;. Loading times will increase as a result.\n\nv. Disable helper frame effects\n   Set the HelperFrameEffects option under [Config] to 0 to slightly\n   reduce memory usage (by about 1 MB).\n\n\n\n=====================================================================\nA. Thanks\n=====================================================================\n\nDJ Delorie - For DJGPP\nShawn Hargreaves and many others - For Allegro\nTomislav Uzelac and Ove Kaaven - For LibAmp, and its Allegro port\nGuan Foo Wah - JGMOD\nEarle F. Philhower, III - For DirectPad Pro converter schematics\nAll our beta testers\nEveryone who gave feedback to us\n\n\n\n=====================================================================\nB. Disclaimer\n=====================================================================\n\nElecbyte will not be held liable for any damages to either the user\nor the system it is run on, that may occur as a direct or indirect\nresult of the use of MUGEN and its associated tools. Elecbyte holds\nno responsibility for the actions of the user, including but not\nlimited to the user's infringement on the intellectual rights of\nothers.\n\n\nMugeNow - The Great Original DBZ Mugen Creators! :)","torrent":{"xt":"urn:btih:7e666ff67bb78b4b1cee26800a9b66f88061071f","amp;dn":"Dragon+Ball+Z+-+Dbz+-+old+mugen+beta+game+-+extreme+fun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e666ff67bb78b4b1cee26800a9b66f88061071f","infoHashBuffer":{"type":"Buffer","data":[126,102,111,246,123,183,139,75,28,238,38,128,10,155,102,248,128,97,7,31]},"announce":[],"urlList":[]}}