{"title":"Who Stole the American Dream by Hedrick Smith (ePUB/Mobi)","uid":7811655,"size":1734550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f3fe36a2227e2a46a417855bc1a28b303931701&amp;dn=Who+Stole+the+American+Dream+by+Hedrick+Smith+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"azizex666","files":-1,"time":1352507959,"description":"               Who Stole the American Dream? Can We Get It Back? \n\nFrom Pulitzer Prize winner, &quot;New York Times&quot; bestselling author, and PBS &quot;Frontline&quot; reporter Hedrick Smith comes the remarkable, step-by-step story of how the American Dream was dismantled over the past forty years by forces left unchecked in Washington and on Wall Street, and by a series of landmark legislative, electoral, and corporate decisions. Through stories of everyday people, Smith also shows how Americans are faring today--and explores what we can do, together, to re-create the American Dream.\nFitting the pieces of a big puzzle together in the way only a veteran reporter can, Smith shows how events reported in many recent news stories--from the mortgage mess to 401(k) disasters, and including problems in housing, banks, pensions, legislation, jobs, and more--are the outcomes of the evolution of a political and economic dismantling that began in 1971 with Lewis Powell's provocative memo, and continued through the eras of Nixon, Carter, Reagan, Clinton, and Bush, up to today. With a deep and sophisticated understanding of recent American history, Smith interweaves into the decades-long story of our country's reconfiguration powerful, vivid portraits, both of some of the people who caused this change, and some of those affected by it. This book tells a story about modern America that has never been told this way before. It is essential reading for anyone who wants to understand America now, and why he or she can't get ahead. &quot;Who Stole the American Dream?&quot; explores how we can recapture lost hope--it is a masterful work about America today by one of our leading print and television journalists.\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                       Published -  September 11th 2012\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:7f3fe36a2227e2a46a417855bc1a28b303931701","amp;dn":"Who+Stole+the+American+Dream+by+Hedrick+Smith+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f3fe36a2227e2a46a417855bc1a28b303931701","infoHashBuffer":{"type":"Buffer","data":[127,63,227,106,34,39,226,164,106,65,120,85,188,26,40,179,3,147,23,1]},"announce":[],"urlList":[]}}