{"title":"Alemania en OtoÃƒÂ±o _Deutschland im Herbst 1978 VOSE.avi","uid":6374178,"size":1467889664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7f972f347269c0bd51e51852349f5f43a7c6c210&amp;dn=Alemania+en+Oto%C3%83%C2%B1o+_Deutschland+im+Herbst+1978+VOSE.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"palomas","files":1,"time":1304793140,"description":"Germany in Autumn does not have a plot per se; it mixes documentary footage, along with standard movie scenes, to give the audience the mood of Germany during the late 1970s. The movie covers the two month time period during 1977 when a businessman was kidnapped, and later murdered, by the left-wing terrorists known as the RAF-Rote Armee Fraktion (Red Army Faction). The businessman had been kidnapped in an effort to secure the release of the orginal leaders of the RAF, also known as the Baader-Meinhof gang. When the kidnapping effort and a plane hijacking effort failed, the three most prominent leaders of the RAF, Andreas Baader, Gudrun Enslin, and Jean-Carl Raspe, all committed suicide in prison. It has become an article of faith within the left-wing community that these three were actually murdered by the state. The movie has several vignettes, including an extended set of scenes with the famous director Rainer Werner Fassbinder discussing his feelings about Germany's political situation at the time. Fassbinder's scenes almost seem to be candid documentary footage, but aren't. Other scenes include documentary footage of the joint funeral of Baader, Enslin, and Raspe.\n\nDirectors:\nAlf Brustellin, Rainer Werner Fassbinder, and 9 more credits Ã‚Â»\nWriters:\nRainer Werner Fassbinder, Alf Brustellin, and 11 more credits Ã‚Â»\nStars:\nWolfgang BÃƒÂ¤chler, Heinz Bennent and Wolf Biermann ","torrent":{"xt":"urn:btih:7f972f347269c0bd51e51852349f5f43a7c6c210","amp;dn":"Alemania+en+Oto%C3%83%C2%B1o+_Deutschland+im+Herbst+1978+VOSE.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f972f347269c0bd51e51852349f5f43a7c6c210","infoHashBuffer":{"type":"Buffer","data":[127,151,47,52,114,105,192,189,81,229,24,82,52,159,95,67,167,198,194,16]},"announce":[],"urlList":[]}}