{"title":"Human Language and Our Reptilian Brain - Leiberman [Non-Fiction]","uid":8868906,"size":2980047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fb9c0cf9cb9df9a6f93799005ccc3320346cf30&amp;dn=Human+Language+and+Our+Reptilian+Brain+-+Leiberman+%5BNon-Fiction%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"K-Slender","files":5,"time":1378001461,"description":"(Exam Copy Stamped)\n\n\nThis book is an entry into the fierce current debate among psycholinguists, neuroscientists, and evolutionary theorists about the nature and origins of human language. A prominent neuroscientist here takes up the Darwinian case, using data seldom considered by psycholinguists and neurolinguists to argue that human language--though more sophisticated than all other forms of animal communication--is not a qualitatively different ability from all forms of animal communication, does not require a quantum evolutionary leap to explain it, and is not unified in a single &quot;language instinct.&quot;\n\nUsing clinical evidence from speech-impaired patients, functional neuroimaging, and evolutionary biology to make his case, Philip Lieberman contends that human language is not a single separate module but a functional neurological system made up of many separate abilities. Language remains as it began, Lieberman argues: a device for coping with the world. But in a blow to human narcissism, he makes the case that this most remarkable human ability is a by-product of our remote reptilian ancestors' abilities to dodge hazards, seize opportunities, and live to see another day.","torrent":{"xt":"urn:btih:7fb9c0cf9cb9df9a6f93799005ccc3320346cf30","amp;dn":"Human+Language+and+Our+Reptilian+Brain+-+Leiberman+%5BNon-Fiction%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fb9c0cf9cb9df9a6f93799005ccc3320346cf30","infoHashBuffer":{"type":"Buffer","data":[127,185,192,207,156,185,223,154,111,147,121,144,5,204,195,50,3,70,207,48]},"announce":[],"urlList":[]}}