{"title":"ExploitedCollegeGirls: Winter Marie (22 Years Old) [XXX] ","uid":12429077,"size":991549833,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:7fe47c4002d82b62964f3ffb16899d00bb8f2a18&amp;dn=+ExploitedCollegeGirls%3A+Winter+Marie+%2822+Years+Old%29+%5BXXX%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Chinu685","files":2,"time":1442428701,"description":"Category: Casting,Amateur,Talking,Legal Teen,College Girl,Blonde,Natural Tits,Small Tits,Shaved Pussy,Piersing,Tatu,All Sex,Oral,Vibrator,Mastrubation,Cum In Mouth,Facial\n\nCast: Winter Marie\n\n\n.:Description:.\nWinter is athletic, bisexual, innocent and loves to suck cock; so technically she's the perfect girl. This fine 22 year old blonde is from some flyover state where they don't teach a lot of geography because when asked she can't seem to keep her fake home state straight. But whatever part of the midwestern Winter is from, she's got the wholesome good looks of that place. In fact, at the right angle she might remind you of Kirsten Dunst - so if you ever wanted to see Kirsten get drilled like a west Texas oil field, this is your lucky week.\nDuring the interview we learn a lot about Winter. She claims to be innocent and inexperienced, but it might just be a ploy for attention like her absurd full color tattoo. She tells Jay that she's never seen porn or used a toy, she's never had sex with a guy on camera and yet she does love to suck cock. Which she proves by allowing Jay to probe the depths of her throat using his boner as a tongue depressor.\nAfter the interview Jay gives Winter her very first toy orgasms, at least 2 of them in quick succession (enjoy the replays.) And then after an extended and very sexy BJ, he bends her over doggy style and fucks her to a third orgasm. After a few more positions and a few more orgasms, Winter has to tap out. Her high vagina diet has her unsteady after getting fucked so hard and so long.\nA little more fucking, a few more O's and then this update finishes with what may be the single best pop shot in ECG history. After begging Jay to cum in her mouth, he grants her wish and the look on her pretty face is simply priceless. You get to see every second of it from multiple angles and in several gag-tastic slow mo replays. Winter Marie finishes like a champ, however, and shows a lot of potential for on screen sex, so don't be surprised if you see her elsewhere soon.\nTake a look at screenshots! Enjoy!\n &lt;a href=&quot;\nhttp://milfimage.org/img-55f99bca3613a.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://milfimage.org/img-55f99bca3613a.html&lt;/a&gt;\n\n\nâ—†â—†â—†..:For more awesome stuff please click below:..â—†â—†â—†\n       &lt;a href=&quot;\nhttps://thepiratebay.la/user/Chinu685&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.la/user/Chinu685&lt;/a&gt;","torrent":{"xt":"urn:btih:7fe47c4002d82b62964f3ffb16899d00bb8f2a18","amp;dn":"+ExploitedCollegeGirls%3A+Winter+Marie+%2822+Years+Old%29+%5BXXX%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fe47c4002d82b62964f3ffb16899d00bb8f2a18","infoHashBuffer":{"type":"Buffer","data":[127,228,124,64,2,216,43,98,150,79,63,251,22,137,157,0,187,143,42,24]},"announce":[],"urlList":[]}}