{"title":"Sister Hazel - Release (2009) (MP3-V0)","uid":5188403,"size":94926518,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:804c929bdb693c6f911faaf0e752c3b28e909ac7&amp;dn=Sister+Hazel+-+Release+%282009%29+%28MP3-V0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cenkota","files":12,"time":1259573469,"description":"Email me if you are looking for an album in Lossless/FLAC (even obscure ones). I'd be willing to send you a link to it if you would share the album on publicbt/thepiratebay after you finish downloading it. My email: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ea898f849e9885838e99dbaa8d878b8386c4898587&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9bb6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6b6&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;-------\n\n# Release Date: August 18, 2009\n# Label: Rock Ridge Music\nTotal Length: 46:06\n\nThe five members of Sister Hazel -- Jett Beres, Ken Block, Andrew Copeland, Ryan Newell, and Mark Trojanowski -- who founded the group in Gainesville, FL, in 1993, appear in a line on the cover of Release, their seventh studio album of new, non-holiday material, no one person ahead of or behind another. It's a statement of equality that is pursued in the album's contents. When a band is founded, the young musicians often don't realize that whoever is credited with writing the songs is going to make more money than the others. That starts to become apparent later on, however, and it can lead to strange consequences. After years of recording hits written by singer/guitarist John Fogerty, Creedence Clearwater Revival abruptly released Mardi Gras, an album on which the bass player and drummer got equal songwriting credits. It was a bust, and the band broke up. Former members of the Band Robbie Robertson and Levon Helm became estranged because Helm believes Robertson's sole songwriting credit on most of their music is unfair. Other groups deal with the issue head on: all U2 songs are credited equally to the band's four members. In the case of Sister Hazel, early songs tended to be credited to Block/Sister Hazel, suggesting that the singer wrote the lyrics and the band came up with the music, which may have resulted in his getting 50-percent of the music publishing and the others splitting the other 50-percent. (After the first couple of albums, the group credit was abandoned, and Block wrote most of the songs, sometimes with Beres, Copeland, and/or Newell joining in.) This time, the band has employed a new strategy. A decade-and-a-half into their career together, the members of Sister Hazel opted for songwriting democracy on Release, assigning each member at least two songs (Newell and Copeland each get three). While that might seem like a formula for disaster ÃƒÂ  la Creedence, it works out just fine. For one thing, Block never dominated the band the way Fogerty did Creedence; Sister Hazel's music has always sounded like a group effort, and it still does here. For another, some of the bandmembers have brought in help, with Newell turning to another journeyman rocker, Pat McGee, among others, and Copeland bringing on former Tom Petty &amp; the Heartbreakers' drummer and Don Henley songwriting partner Stan Lynch. But even when they go it alone, as Beres does on &quot;Vacation Rain&quot; and &quot;Ghost in the Crowd,&quot; they come up with acceptable material. Each member seems to have brought in his most accessible, catchy efforts, resulting in an album that, if anything, is even more tuneful than other Sister Hazel albums. As usual, there isn't much in the way of lyrical substance (love goes right, love goes wrong, clichÃƒÂ©s abound), but the choruses (not to mention bridges and &quot;pre-choruses&quot; come frequently in craftsmanlike songs that are played by a group that has been playing together for more than a decade-and-a-half. Maybe the best thing that can be said about the songwriting experiment is that the listener doesn't really notice the difference. No new ground is broken on Release, but Sister Hazel hasn't lost ground with its democratic approach, either.","torrent":{"xt":"urn:btih:804c929bdb693c6f911faaf0e752c3b28e909ac7","amp;dn":"Sister+Hazel+-+Release+%282009%29+%28MP3-V0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"804c929bdb693c6f911faaf0e752c3b28e909ac7","infoHashBuffer":{"type":"Buffer","data":[128,76,146,155,219,105,60,111,145,31,170,240,231,82,195,178,142,144,154,199]},"announce":[],"urlList":[]}}