{"title":"Graphene Chemistry - Theoretical Perspectives","uid":15520298,"size":88429341,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80cd1630f9f1dda3f0318a56071f285741d264c3&amp;dn=Graphene+Chemistry+-+Theoretical+Perspectives&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1470741353,"description":"Graphene Chemistry - Theoretical Perspectives - De-en Jiang, Zhongfang Chen (Wiley, 2013).pdf\r\n\r\nWhat are the chemical aspects of graphene as a novel 2D material and how do they relate to the molecular structure? This book addresses these important questions from a theoretical and computational standpoint.\r\n\r\nGraphene Chemistry: Theoretical Perspectives presents recent exciting developments to correlate graphene’s properties and functions to its structure through state-of-the-art computational studies. This book focuses on the chemistry aspect of the structure-property relationship for many fascinating derivatives of graphene; various properties such as electronic structure, magnetism, and chemical reactivity, as well as potential applications in energy storage, catalysis, and nanoelectronics are covered. The book also includes two chapters with significant experimental portions, demonstrating how deep insights can be obtained by joint experimental and theoretical efforts.\r\n\r\nTopics covered include:\r\n\r\nGraphene ribbons: Edges, magnetism, preparation from unzipping, and electronic transport\r\nNanographenes: Properties, reactivity, and synthesis\r\nClar sextet rule in nanographene and graphene nanoribbons\r\nPorous graphene, nanomeshes, and graphene-based architecture and assemblies\r\nDoped graphene: Theory, synthesis, characterization and applications\r\nMechanisms of graphene growth in chemical vapor deposition\r\nSurface adsorption and functionalization of graphene\r\nConversion between graphene and graphene oxide\r\nApplications in gas separation, hydrogen storage, and catalysis\r\nGraphene Chemistry: Theoretical Perspectives provides a useful overview for computational and theoretical chemists who are active in this field and those who have not studied graphene before. It is also a valuable resource for experimentalist scientists working on graphene and related materials, who will benefit from many concepts and properties discussed here","torrent":{"xt":"urn:btih:80cd1630f9f1dda3f0318a56071f285741d264c3","amp;dn":"Graphene+Chemistry+-+Theoretical+Perspectives","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80cd1630f9f1dda3f0318a56071f285741d264c3","infoHashBuffer":{"type":"Buffer","data":[128,205,22,48,249,241,221,163,240,49,138,86,7,31,40,87,65,210,100,195]},"announce":[],"urlList":[]}}