{"title":"Mistic River DVDRip Spanish","uid":4660027,"size":736004257,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:811fa721722f906c6c8c1db71ef26b78995fcdb1&amp;dn=Mistic+River+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mois20","files":4,"time":1232350310,"description":"Cuando Jimmy Markum (Sean Penn), Dave Boyle (Tim Robbins) y Sean Devine (Kevin Ba-con) eran niÃƒÂ±os que crecÃƒÂ­an juntos en un peli-groso distrito de Boston, pasaban los dÃƒÂ­as ju-gando al bÃƒÂ©isbol en la calle al igual que lo ha-cÃƒÂ­an muchos otros niÃƒÂ±os en el barrio obrero de East Buckingham donde vivÃƒÂ­an. No sucedÃƒÂ­a nada importante en su barrio. Hasta que Dave se vio obligado a tomar un rumbo que cambiarÃƒÂ­a las vidas de todos ellos para siempre. Veinticinco aÃƒÂ±os mÃƒÂ¡s tarde, los tres se vuelven a encontrar por otro acontecimiento de gran trascendencia: el asesinato de la hija de 19 aÃƒÂ±os de Jimmy. A Sean, que se ha hecho policÃƒÂ­a, le asignan el caso y junto a su compaÃƒÂ±ero (Laurence Fishburne) recibe el encargo de desenredar este crimen aparente-mente sin sentido. TambiÃƒÂ©n tienen que estar muy pendientes de Jimmy, ansioso por encontrar al asesino de su hija. Dave, relacio-nado con el crimen por una serie de circunstancias, se ve obligado a enfrentarse a los demonios de su propio pasado; demonios que amenazan con destruir su matrimonio y cualquier esperanza que pueda tener para el futuro. A medida que la investigaciÃƒÂ³n se estre-cha alrededor de estos tres amigos, se desarrolla un inquietante re-lato que trata de la amistad, la familia y la inocencia perdida dema-siado prematuramente.","torrent":{"xt":"urn:btih:811fa721722f906c6c8c1db71ef26b78995fcdb1","amp;dn":"Mistic+River+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"811fa721722f906c6c8c1db71ef26b78995fcdb1","infoHashBuffer":{"type":"Buffer","data":[129,31,167,33,114,47,144,108,108,140,29,183,30,242,107,120,153,95,205,177]},"announce":[],"urlList":[]}}