{"title":"ADHD,Asperger","uid":4345366,"size":4297966996,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8160ed645767cc64a962fd240f74d3b2f7f91faf&amp;dn=ADHD%2CAsperger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"adhdbrigaden","files":16,"time":1218837207,"description":"PBS Independent Lens - Asperger Syndrome, Today's Man (2008.TVRip.SoS)\nTourette BBC - Horizon - 2007 - Mad But Glad\nBBC - Horizon - 2006 - The Woman Who Thinks like a Cow\nADHD dyslexia PBS Special - Headstrong, Inside the Hidden World of Dyslexia and ADHD (2007.HDTV.SoS)\nAsperger Planet.Parent.SE06.23.Asperger Syndrome.DivX-NewWorld\nDocumentary.Asperger.School.make.me.normal\nAsperger Grampa - BBC4 - The Autism Puzzle\nBBC Horizon 2005 Living With Adhd\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\nEBOOKS \nThe history of ADHD:\nhttp://www.flickr.com/groups/historyofadhd/\n\n-Asperger's Syndrome and High Achievement\n-American Normal THE HIDDEN WORLD OF ASPERGER SYNDROME\n-Attention Deficit Hyperactivity Disorder - Concepts, Controversies, New Directions\n-Multicoloured Mayhem - Parenting the Many Shades of Adolescents and Children With Autism, Asperger Syndrome, and AD HD\n-Tourette Syndrome\n-CRC - Fish, Omega-3 and Human Health\n-The Ultimate Omega-3 Diet\n-Dyslexia stundents in need\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\nPBS Independent Lens - Asperger Syndrome: Today's Man (2008.TVRip.SoS)\n&quot;TODAY'S MAN tells the story of Nicky Gottlieb, a former child genius who, at age 21, is diagnosed with Asperger Syndrome. People with Asperger's, which is a form of autism, tend to be highly intelligent-often geniuses in certain subjects-but are unable to pick up on social cues. The subtleties of body language, facial expression, tones or gestures are lost to Nicky, and his own behavior can be considered by others to be bizarre and inappropriate.\n\nOne in 160 children today are born with some form of autism. Although Asperger Syndrome is considered to be on the high-functioning end of the autistic spectrum, it was only recognized in the U.S. in 1994. While there are an increasing number of resources for Asperger's children, there are surprisingly few organizations and programs for adults with the syndrome, resulting in a &quot;lost generation&quot; of people like Nicky who must find their own ways to navigate life with this perplexing disorder.\n\nTODAY'S MAN follows Nicky as he struggles to leave the safety of his family's home and the comfort of his favorite TV shows in order to find a job and an apartment. Made by Nicky's sister Lizzie Gottlieb, the film is a sister's search to understand her brother's mysterious inner life and a larger effort to comprehend Asberger Syndrome and the people who struggle with it.&quot;\n\nBBC - Horizon - 2007 - Mad But Glad\nIs there really such a thing as the mad genius? Can an illness be both a blessing and a curse? \nAt seven years old, Nick van Bloss started shaking his head, grinding his teeth and making wild whooping noises. Nick had Tourette's syndrome. No medical intervention helped him. But one activity stopped it all... \nThe moment Nick placed his hands on the piano keys his symptoms vanished. By the age of 20, he was an award winning international pianist. He felt sure that his illness had made him the success he was. \nBut there is a catch. The brain state necessary for his genius can also be dangerously close to mental chaos. Nick's personal journey reveals how close he came to the edge and how determined he is to triumph.\nBBC - Horizon - 2006 - The Woman Who Thinks like a Cow\nDr Temple Grandin has a unique ability to understand the animal mind - and she's convinced her skill is down to her autistic brain.\nTemple believes she experiences life like an animal. Her emotions are much simpler than most people's and she feels constantly anxious. It's this struggle with overwhelming anxiety that led her to discover just how much she has in common with animals and, in particular, cows.\nUsing her ability to observe the world through an animal's eye, she has been able to make an enormous impact on animal welfare. Her greatest achievement has been in the area of slaughterhouses - she has fundamentally changed the way animals are held and slaughtered.\nToday she's an associate professor of animal science, a best-selling author and the most famous autistic woman on the planet.\nPBS Special - Headstrong, Inside the Hidden World of Dyslexia and ADHD (2007.HDTV.SoS)\n&quot; Headstrong: Inside the Hidden World of Dyslexia and Attention Deficit Hyperactivity Disorder explores the lives of people who beat the odds everyday. There are over 20 million Americans who are Dyslexic of have Attention Deficit Hyperactivity Disorder (ADHD), making this the single largest disability population in the country. Through personal accounts and professional input, Headstrong explores ideas and techniques that help these indivduals succeed. This beautifully produced and carefully researched documentary is an opportunity to cheer for the underdog and enjoy remarkable and diverse stories of people standing up for themselves.&quot;\n\nPlanet.Parent.SE06.23.Asperger Syndrome.DivX-NewWorld\nPlanet Parent Special: Aspergers Syndrome Every school has a few: the kids on the fringes. They have obsessive interests and play alone. These kids just don't fit it, and it's painful for them and their families who often aren't sure how to help. We are now learning that this kind of behavior could be a sign of Asperger syndrome. Asperger is a high-functioning kind of autism that results in kids who are sometimes called &quot;little professors.&quot; It's tough to diagnose and wasn't even identified until the mid 1990s. Thousands of adults may have grown up with Asperger without knowing it. This special program demystifies Asperger and examines its impact on several families. The program also offers a platform of researchers and other experts to discuss the origin of this mysterious disorder and the hunt for a cure. (52:23)\n\n(AUTISM) Documentary.Asperger.School.make.me.normal. tanks to ibbe-addforum and rakel at http://adhd-npf.com/\nAsperger Grampa - BBC4 - The Autism Puzzle\n \n\tTHE AUTISM PUZZLE\nWednesday 14 December 2005 3.05am-4.05am (Tuesday night)\t   \n \t   \n \tForty years ago autism was a highly obscure disorder which was thought to affect only four to five children in every 10,000, but now some British teachers are claiming to see it in one in every 86 children. What's happened? Is there an epidemic of autism, and what's causing it? Is there any connection to MMR? Or is it that awareness has grown and the definition of autism changed over the 60 years since the term was first coined?\nFilmmaker Saskia Baron has unique insights into autism. Her older brother, Timothy, is profoundly autistic. When he was diagnosed in 1961, his parents found that there was no education available for children with autism their fate was mental handicap hospitals and sedation. \nUnwilling to accept such a prospect, Timothy's parents got together with other families with autistic children and started the National Autistic Society in 1962. Together, the parents established the first school in the world for autistic children in 1965. Using a recently rediscovered film of that school, the documentary explores how life turned out for the first generation of children to be diagnosed with autism in Britain. What hope do their life stories give the parents of autistic children today?\nThe documentary looks at the history of the condition, and current research into cause, treatment and prevalence. It includes interviews with some of the world's leading experts on autism, including Dr Lorna Wing, Professor Christopher Gillberg, Professor Fred Volkmar and Professor Anthony Bailey.\nThe film also explores the latest experimental research into the autistic brain in Finland, England and America which give new hope for greater understanding of this mysterious disability using cutting-edge technology .\t\t \n\n\n&quot;Horizon: 'Living with ADHD'\n\nADHD (Attention Deficit Hyperactivity Disorder) is one of the most feared and misunderstood of all medical conditions. Despite over 200 scientific papers published on it every year, it remains stigmatized and controversial. Some doctors don't even believe it exists. Yet it is estimated that as many as 3-5% of the childhood population, and over one million adults in the UK are affected. \n\nFor this edition of Horizon the programme makers spent 6 months with two families to find out what this neurological condition is really like. The result is a touching and revealing portrait which explores how ADHD is diagnosed and treated, and the medical reasons why it exists.\n\nProducers: Milla Harrison-Hansley and Alicky Sussman&quot;\n\n&quot;Living with ADHD\nDocumentary about ADHD (Attention Deficit Hyperactivity Disorder), a misunderstood disability that many still think of as 'just being naughty' when suffered by children. The programme follows two families, the Hills and the Fischers, over six months as they go through diagnosis and therapy.&quot;\n&quot;Examining the often misdiagnosed disability attention deficit hyperactivity disorder&quot;\n\n&quot;science documentary series - Tonight an investigation into two families whose children are diagnosed with ADHD - attention deficit hyperactivity disorder - highlighting the impact that the condition has had on their lives&quot;\n\nHorizon - Thu 3 Feb, 9:00 pm - 9:50 pm 50mins\n\nLiving with ADHD \n\nAttention Deficit Hyperactivity Disorder is one of the most misunderstood of all conditions.\n\nSome people accuse children with ADHD of just being naughty. They blame the parents and namby-pamby liberals who just won't accept that some people are just badly brought up and disruptive.\n\nFor this edition of Horizon, the programme-makers spent six months with two families learning to live with ADHD. The result is a moving and intimate observational film that reveals: \n\n1. What it is really like to have the condition.\n2. The medical reasons why it exists. \n3. How it is diagnosed.\n4. How to tell it apart from normal behaviour.\n5. How it often exists with other problems such as dyslexia or dyspraxia.\n6. How to deal with it and the range of treatments that are available from drugs to parenting advice.\n7. Its lows, but also its highs. Many people with ADHD believe that it gives them real advantages. \n\nTo get to the truth, Horizon follows two families, the Hills and the Fischers, as they go through diagnosis and therapy.\n\nADHD,Asperger's,Tourette,Autism,Dyslexia \n\n","torrent":{"xt":"urn:btih:8160ed645767cc64a962fd240f74d3b2f7f91faf","amp;dn":"ADHD%2CAsperger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8160ed645767cc64a962fd240f74d3b2f7f91faf","infoHashBuffer":{"type":"Buffer","data":[129,96,237,100,87,103,204,100,169,98,253,36,15,116,211,178,247,249,31,175]},"announce":[],"urlList":[]}}