{"title":"Reign of Kindo - Discography (Mp3 / Mp4)","uid":10982173,"size":462988153,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:81b831c281038d8e21718e640621f1cee685619a&amp;dn=Reign+of+Kindo+-+Discography+%28Mp3+%2F+Mp4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":46,"time":1409876379,"description":" &lt;a href=&quot;http://www.thereignofkindo.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.thereignofkindo.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.candyrat.com/artists/ReignofKindo/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.candyrat.com/artists/ReignofKindo/&lt;/a&gt;\n\nLink to their record label's Youtube:\n\nThe Reign of Kindo takes inspiration from all over the place, so their music is heavily dynamic and unique. They will cross over many styles over the course of an album, and especially the full discography. When forced to describe it I'd say progressive Jazz fusion, but that is in no way a complete description!\n\nFrom the about section of Candyrat records:\n&quot;Rare is it to find modern music that pinpoints the middle ground between a respect for past greats and a boldness to pave tomorrow. This is, quite modestly, the definition of The Reign of Kindo. Citing influences from Dave Brubeck to Ben Folds to Japanese composer Ryuichi Sakamoto to John Mayer, there's not a degree of pomposity in this sound, just an honesty in the group's craft to blend such diverse influences into an identity so refreshing, unique, and universally personable.&quot;\n\nPlease support the official releases, these guys work really hard and deserve your money, I promise! I'm sharing this here so that you can experience it and explore them without investing your money so you can make that decision for yourself. They tour the North East US frequently, and going to see them live is a real treat, please do so!\n\nPlease comment if there are any issues with the torrent, this is my first one. I will upload their new single &quot;October Sky&quot; shortly. In the meantime check it out on youtube!\n\nMost of the files are Mp3, &quot;Rhythm, Chord, &amp; Melody&quot; is Mp4 though. Hope you don't mind, I'm not a quality nut. It's all good enough for sure.","torrent":{"xt":"urn:btih:81b831c281038d8e21718e640621f1cee685619a","amp;dn":"Reign+of+Kindo+-+Discography+%28Mp3+%2F+Mp4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81b831c281038d8e21718e640621f1cee685619a","infoHashBuffer":{"type":"Buffer","data":[129,184,49,194,129,3,141,142,33,113,142,100,6,33,241,206,230,133,97,154]},"announce":[],"urlList":[]}}