{"title":"Liberty and Tyranny: A Conservative Manifesto by Mark R. Levin","uid":4814400,"size":147610088,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:81efe818f371171c9abeced57eecb19610e7d90a&amp;dn=Liberty+and+Tyranny%3A+A+Conservative+Manifesto+by+Mark+R.+Levin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pbp69","files":-1,"time":1238495223,"description":"Conservative talk radio's fastest-growing superstar is also a New York Times bestselling phenomenon: the author of the groundbreaking critique of the Supreme Court, Men in Black, and the deeply personal dog lover's memoir Rescuing Sprite, Mark R. Levin now delivers the book that characterizes both his devotion to his more than 5 million listeners and his love of our country and the legacy of our Founding Fathers: Liberty and Tyranny is Mark R. Levin's clarion call to conservative America, a new manifesto for the conservative movement for the 21st century.\n\nIn the face of the modern liberal assault on Constitution-based values, an attack that has steadily snowballed since President Roosevelt's New Deal of the 1930s and resulted in a federal government that is a massive, unaccountable conglomerate, the time for re-enforcing the intellectual and practical case for conservatism is now. Conservative beliefs in individual freedoms do in the end stand for liberty for all Americans, while liberal dictates lead to the breakdown of civilized society -- in short, tyranny. Looking back to look to the future, Levin writes &quot;conservatism is the antidote to tyranny precisely because its principles are our founding principles.&quot; And in a series of powerful essays, Levin lays out how conservatives can counter the liberal corrosion that has filtered into every timely issue affecting our daily lives, from the economy to health care, global warming, immigration, and more -- and illustrates how change, as seen through the conservative lens, is always prudent, and always an enhancement to individual freedom.\n\nAs provocative, well-reasoned, robust, and informed as his on-air commentary, Levin's narrative will galvanize readers to begin a new era in conservative thinking and action. Liberty and Tyranny provides a philosophical, historical, and practical framework for revitalizing the conservative vision and ensuring the preservation of American society.  - Amazon.com\n\n\nRunning Time:\n6 h 50 min \n\n\n","torrent":{"xt":"urn:btih:81efe818f371171c9abeced57eecb19610e7d90a","amp;dn":"Liberty+and+Tyranny%3A+A+Conservative+Manifesto+by+Mark+R.+Levin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81efe818f371171c9abeced57eecb19610e7d90a","infoHashBuffer":{"type":"Buffer","data":[129,239,232,24,243,113,23,28,154,190,206,213,126,236,177,150,16,231,217,10]},"announce":[],"urlList":[]}}