{"title":"Religions and Extraterrestrial Life: How Will We Deal with It 20","uid":11442496,"size":1895058,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82beae22588aa06a8e6d775ddc8bb25771242a7b&amp;dn=Religions+and+Extraterrestrial+Life%3A+How+Will+We+Deal+with+It+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1415824974,"description":"Religions and Extraterrestrial Life: How Will We Deal with It? 2014 pdf\n\nIn the twenty-first century, the debate about life on other worlds is quickly changing from the realm of speculation to the domain of hard science. Within a few years, as a consequence of the rapid discovery by astronomers of planets around other stars, astronomers very likely will have discovered clear evidence of life beyond the Earth. Such a discovery of extraterrestrial life will change everything. \n\n Knowing the answer as to whether humanity has company in the universe will trigger one of the greatest intellectual revolutions in history, not the least of which will be a challenge for at least some terrestrial religions. Which religions will handle the discovery of extraterrestrial life with ease and which will struggle to assimilate this new knowledge about our place in the universe? Some religions as currently practiced appear to only be viable on Earth. Other religions could be practiced on distant worlds but nevertheless identify both Earth as a place and humankind as a species of singular spiritual religious importance, while some religions could be practiced equally well anywhere in the universe by any sentient beings. \n\n\n Weintraub guides readers on an invigorating tour of the world's most widely practiced religions. It reveals what, if anything, each religion has to say about the possibility that extraterrestrial life exists and how, or if, a particular religion would work on other planets in distant parts of the universe","torrent":{"xt":"urn:btih:82beae22588aa06a8e6d775ddc8bb25771242a7b","amp;dn":"Religions+and+Extraterrestrial+Life%3A+How+Will+We+Deal+with+It+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82beae22588aa06a8e6d775ddc8bb25771242a7b","infoHashBuffer":{"type":"Buffer","data":[130,190,174,34,88,138,160,106,142,109,119,93,220,139,178,87,113,36,42,123]},"announce":[],"urlList":[]}}