{"title":"The Last Girl - Michael Adams.epub","uid":9482028,"size":1039580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82cee96e7d23f1a4dea13396675209812c213da1&amp;dn=The+Last+Girl+-+Michael+Adams.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1389813933,"description":"The end of the world happened quickly. The sun still shone, there was no explosion - just a tsunami-sized wave of human thought drowning the world in telepathic noise as everyone's inner-most secrets became audible. Everyone's thoughts, that is, except sixteen-year-old Danby.\n\nEveryone looked like bad actors in a poorly dubbed movie. Their expressions didn't match their emotions and their lips didn't sync with what they were saying. But they were all so loud.\n\nGod-he-looks-hot-Can't-she's-my-best-friend-How'd-she-lose-that-weight-No-don't-you-dare-Oh-no-please-\n\nThe end of the world happens in the blink of an eye.\n\nWhen The Snap sweeps the globe, everyone can instantly hear everything that everyone else is thinking. As secrets and lies are laid bare, suburbs and cities explode into insanity and violence. What might have been an evolutionary leap instead initiates the apocalypse.\n\nSixteen-year-old Danby Armstrong's telepathy works very differently. She can tune into other people but they can't tune into her. With only this slender defence, Danby must protect her little brother and reach the safety of her mother's mountain retreat. But it's 100 kilometres away and the highways are blocked by thousands of cars and surrounded by millions of people coming apart at the psychic seams.\n\nDanby's escape is made even more dangerous by another cataclysm that threatens humanity's extinction. And her ability to survive this new world will be tested by a charismatic young man whose power to save lives may be worse than death itself.","torrent":{"xt":"urn:btih:82cee96e7d23f1a4dea13396675209812c213da1","amp;dn":"The+Last+Girl+-+Michael+Adams.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82cee96e7d23f1a4dea13396675209812c213da1","infoHashBuffer":{"type":"Buffer","data":[130,206,233,110,125,35,241,164,222,161,51,150,103,82,9,129,44,33,61,161]},"announce":[],"urlList":[]}}