{"title":"Shadowrun Returns v1.0.8 Android","uid":9117753,"size":357686200,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:831bf203d6e2835d89710161f5d75463e8b1e1dc&amp;dn=Shadowrun+Returns+v1.0.8+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":".BONE.","files":-1,"time":1383059664,"description":"MAN MEETS MAGIC &amp; MACHINE. The year is 2054. Magic has returned to the world, awakening powerful creatures of myth and legend. Technology merges with flesh and consciousness. Elves, trolls, orks and dwarves walk among us, while ruthless corporations bleed the world dry. You are a shadowrunner - a mercenary living on the fringes of society, in the shadows of massive corporate arcologies, surviving day-by-day on skill and instinct alone. When the powerful or the desperate need a job done, you get it done... by any means necessary.\n\nThe unique cyberpunk-meets-fantasy world of Shadowrun has gained a huge cult following since its creation nearly 25 years ago. Now, creator Jordan Weisman returns to the world of Shadowrun, modernizing this classic game setting as a single player, turn-based tactical RPG.\n\nFeatures:\nThe complete Shadowrun Returns campaign (12+ hours of gameplay!) optimized for touchscreen input\nExplore a grim cyberpunk future where magic and technology rule the streets\nMake every action count in gripping, turn-based tactical combat\nCreate and customize your character from one of six unique archetypes\nOver 350 different weapons, spells and abilities: sling fireballs, kneecap enemies with your shotgun, or roundhouse kick them in the face!\nNOTE:\nShadowrun Returns requires a tablet device with at least 1GB of RAM and Android Version 4.0 (ICS) or better. A WiFi connection is required for download. Please ensure you have approximately 1.7 GB of storage space. To OPTIMIZE your playing experience, you may also want to close other apps before playing.\n\nWhat's in this version : (Updated : 11 Oct, 2013)\n\n* Fixing crash on start with certain devices including the Samsung Tab.\n* Fixing issue where drones would not spawn on some riggers.\n\nRequired Android O/S : 4.0+","torrent":{"xt":"urn:btih:831bf203d6e2835d89710161f5d75463e8b1e1dc","amp;dn":"Shadowrun+Returns+v1.0.8+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"831bf203d6e2835d89710161f5d75463e8b1e1dc","infoHashBuffer":{"type":"Buffer","data":[131,27,242,3,214,226,131,93,137,113,1,97,245,215,84,99,232,177,225,220]},"announce":[],"urlList":[]}}