{"title":"Skyshine's Bedlam Redux! (GOG)","uid":14536279,"size":2793937854,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:837daca29184ba5b70709401b96a67ee32eea494&amp;dn=Skyshine%27s+Bedlam+Redux%21+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mercs215","files":4,"time":1462494810,"description":"Install instructions:\r\n- Run &quot;setup_skyshines_bedlam_redux_2.0.0.2.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: SKYSHINE'S BEDLAM REDUX!\r\nGenre: Strategy - Turn-based - Sci-fi\r\nWorks on: Windows (XP, Vista, 7, 8, 10) and Mac OS X (10.9+)\r\nLanguages: Text only: English\r\nFeatures: single-player\r\nReleased: September 16, 2015\r\nSize: 2.6 GB\r\nCompany: Skyshine Games / Versus Evil\r\nStore page: https://www.gog.com/game/skyshines_bedlam\r\n\r\nAbout:\r\nRedux! is the definitive version of Skyshine’s BEDLAM, a strategic turn-based strategy game set in a post-apocalyptic wasteland. This version includes a new, award-winning battle strategy system, tons of new content, the ability to play as any of the 5 factions, and new arcade and campaign modes.\r\nYou are the Mechanic, the last known member of a once-thriving guild of brilliant operators of the rolling fortresses called Dozers. You are in charge of commanding your crew in battles, managing your resources, improving your Dozer, interacting with various characters, and protecting your passengers while navigating through the post-apocalyptic wasteland.\r\nBEDLAM Redux! Features:\r\nAward-Winning battle system: Redux! features revamped squad-based tactics with each unit having action points per turn. Combat features over-the-top animations, environments and battles that gradually affect your team, crew-buffing Dozer upgrades, and tide-changing Dozer weapons!\r\nFive unique playable factions: Human, Marauders, Mutants, Cyborgs and Rouge A.I. - all with their own appearances, traits, and Dozer with a &quot;leader&quot; Elite!\r\nAction packed turn based combat with RPG features: Randomly generated encounters and discoveries, meaningful permadeath, three different supplies to manage, crew veteran rankings and incredible replay value. Redux! includes many additional events and a new outcome system so that no play through is ever the same.\r\nNew Campaign Mode: No more is the goal just to get to Aztec City... now you have to collect four lost relics to help ensure victory over the self-proclaimed overlord of Bedlam. See if you can liberate Bedlam of all the ruthless factions and restore order in the wasteland!\r\nNew Arcade Mode: For the ultimate challenge, try to get to Aztec City on a set course, with no side missions, no Dozer management and tons of obstacles! If you do, you can claim one of the four new Dozers for your own.\r\n\r\nMinimum system requirements - Windows: XP (SP3) / Vista / 7 / 8 / 10\r\nMemory: 4 GB RAM \r\nStorage: 3 GB available space \r\nMouse, Keyboard\r\n\r\nRecommended system requirements - Windows: 7 (SP1) / 8 / 10\r\nMemory: 8 GB RAM\r\nStorage: 4 GB available space\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:837daca29184ba5b70709401b96a67ee32eea494","amp;dn":"Skyshine%27s+Bedlam+Redux%21+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837daca29184ba5b70709401b96a67ee32eea494","infoHashBuffer":{"type":"Buffer","data":[131,125,172,162,145,132,186,91,112,112,148,1,185,106,103,238,50,238,164,148]},"announce":[],"urlList":[]}}