{"title":"RiffTrax - Batman Takes Over","uid":8700505,"size":1168074756,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8389c1a4fc4ccefb8991608e52691b850ac63a55&amp;dn=RiffTrax+-+Batman+Takes+Over&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"saybis","files":1,"time":1374056870,"description":"We're excited to present Batman Takes Over, the first installment in one of the earliest screen depictions of Batman ever made, the 1949 serial Batman and Robin! This is where we'd joke that we finally found a version of Batman and Robin worse than the Joel Schumacher Batman &amp; Robin, but that is physically impossible according to Newton's Law of Schumacherian Bat-Nipplage.\n\nIn this thrilling opening episode, Batman Takes Over...an hour to arrive at the crime scene, because he drives an ordinary car instead of a Batmobile. And, standing in for stately Wayne Manor, a slightly-less-stately suburban home. Batman and thirty-something boy wonder Robin are hot on the trail of The Wizard, so named for his lack of magic powers or costume resembling a wizard's in any way. Speaking of costumes, Batman &amp; Robin store theirs in a drawer in a FILING CABINET. And, and, and...well there's too much great Bat-wrongness to tell here, you really just need to see this.\n\nSo squeeze into an ill-fitting costume, buckle your utility belt (ordinary belt), and join Mike, Kevin, and Bill for Batman Takes Over!","torrent":{"xt":"urn:btih:8389c1a4fc4ccefb8991608e52691b850ac63a55","amp;dn":"RiffTrax+-+Batman+Takes+Over","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8389c1a4fc4ccefb8991608e52691b850ac63a55","infoHashBuffer":{"type":"Buffer","data":[131,137,193,164,252,76,206,251,137,145,96,142,82,105,27,133,10,198,58,85]},"announce":[],"urlList":[]}}