{"title":"SocietySM Redux - SSR - Mar 08, 2015 - Dylan Ryan","uid":11884333,"size":419298461,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:84cbb71bd6425740672ddacd15a47dc500112658&amp;dn=SocietySM+Redux+-+SSR+-+Mar+08%2C+2015+-+Dylan+Ryan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"merzedes","files":394,"time":1430771084,"description":"&quot;Fit to be Tied&quot; \n SocietySM : Redux\n\n Dylan Ryan\n\n Dylan Ryan is fit to be tied... As she stands in the spreader bar with her hands tied overhead, we see her struggle in her restraints upon the arrival of The Pope. As The Pope's cold hands greet Ms. Ryan's flesh with rude slaps and smacks, her struggling continues. After her initial warmup, Dylan feels the wrath of The Pope's flogger as he masterfully works it across her naked body. Then, the clothes pins are applied in a massive dose across her tits and tummy before the magic wand brings her to a massive, grunting orgasm... Now, Dylan is restrained inside a metal cube, a dildo shoved in her mouth. The Pope wastes no time as he takes his flogger to Dylan's raw pussy. Then, the lights are turned out for Dylan as she is blindfolded and flogged again. Deprived of sight, Dylan is tantalized by the sounds of the violet wand before it crackles and hisses across her naked white flesh. Dylan's shocking good time continues as The Pope attaches electric clamps to her nipples and pussy lips and jacks up the heat. With the electrical surge pulsing away at her pussy, the G5 is now applied to her cunt until it evokes an ear shattering orgasm. Next, Dylan is tied and bent over a steel bench. With her head harnessed and gagged, her moans are muffled... The Pope then gets to work on Dylan's bare ass with dual floggers as he deftly tenderizes her naked flesh. A pussy hook is inserted into her pussy and tied off to her head just before the magic wand appears and once again forces Dylan to cum and twitch. After a good round of orgams, Dylan is now tied crouching to a steel pole. Once again, The Pope weaves his mastery of his flogger against Ms. Ryan's naked skin. After he applies clothes pins to her ribs and arms, he considerately removes them with the whip just before bringing her to another forced orgasm... As her exhausting ordeal comes closer to it's end, Dylan is tied to the Y bench. The Pope has a few more tricks up his sleeve however as he dildo fucks her into oblivion until she spouts off an amazing squirting orgasm. Then, just when you think Dylan can give no more, The Pope brings her to yet another fountainous explosion. As she lay there tied and exhausted, The Pope brings out his propane torch and coats her writhing body in hot, melting wax. Then he applies the magic wand and brings her to one final convulsive orgasm before he whips off the wax and walks away\n\n\n Wmv 480p + Pics \n\n\n\n Screens &lt;a href=&quot;\nhttp://www.dungeoncorp.com/u...s15/RED/DYL_111507/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dungeoncorp.com/u...s15/RED/DYL_111507/index.php&lt;/a&gt;\n\n \nUploaded by Merzedes and Shallow2 \n\n 17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\n Just keep on leaving us the nice comments below and we are happy :)\n\n Any Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\n\nCheers :-)","torrent":{"xt":"urn:btih:84cbb71bd6425740672ddacd15a47dc500112658","amp;dn":"SocietySM+Redux+-+SSR+-+Mar+08%2C+2015+-+Dylan+Ryan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84cbb71bd6425740672ddacd15a47dc500112658","infoHashBuffer":{"type":"Buffer","data":[132,203,183,27,214,66,87,64,103,45,218,205,21,164,125,197,0,17,38,88]},"announce":[],"urlList":[]}}