{"title":"Tiempo Libre - Bach In Havana [FLAC] TQMP","uid":5623597,"size":296121704,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85463082866189a2c2d504443138fb2843b06013&amp;dn=Tiempo+Libre+-+Bach+In+Havana+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pastafari","files":-1,"time":1276377919,"description":"Tiempo Libre - Bach In Havana\n2009\n\nTimba (a.k.a. salsa on crack) to the rhythm of Bach? Absofuckinglutely!\n\nBrought to you by TQMP\nThe Quality Music Project\n\nThis title provides a pun on the enclosed concept, through which Tiempo Libre, led by pianist and co-producer Jorge Gomez, connects the rhythms and melodies of Afro-Cuban and Latin jazz with the venerated melodies and harmonies of Johann Sebastian Bach. &quot;What's interesting to me is that we revere Bach for his musical genius,&quot; explains Gomez. &quot;But the fact that he was composing works for his contemporaries as a &quot;popular&quot; artist while also creating deeply religious compositions, and that he was fascinated by dance rhythms, makes him an even more powerful inspiration for me.&quot;\n\nBach in Havana celebrates genius, melodic or rhythmic, in every corner you look. The opening &quot;Tu Conga Bach&quot; cooks up a hot polyrhythmic conga from its first percussion flash fire. The horns and Gomez's piano create a rhythmic undertow by tossing the melody of &quot;Fuga&quot; (based on Sonata in D Minor, BVW.964) back and forth, like cresting ocean waves.\n\nIt's hard to convey how &quot;Minuet in G,&quot; this Latin adornment of one of Bach's most famous and honored melodies, sounds both profoundly respectful and yet so different. Laying out piano notes like spreading a plush carpet before the ensemble, Gomez transforms the 3/4 minuet standard time into a feverish, compelling 4/4 guanganco that leaps and bounds through a musical kaleidoscope of vocals, congas, trumpet and saxophone.\n\nPercussion and piano merge into a single voice in &quot;Clave in C Minor&quot; (Prelude No. 2 in C Minor), an intensely dynamic whirl of melody made indistinguishable from rhythm that grows even more powerful when the horns jump shotgun on this same groove.\n\nIt culminates with the genuinely sacred music of &quot;Kyrie&quot; (Mass in B Minor), which opens with a vocal choir and strings in a reverential mood unbroken when the percussion, piano, and other instruments join the procession. Gomez's piano part is breathtakingly gorgeous, distilling Cuban passion and romantic classicism into one single essence.\n\nBach in Havana is so good, so expertly conceived and executed, that it's almost ridiculous.\n-- All About Jazz\n\n-------\nThis project has an antecedent. In 1978, Chucho Valdes and Irakere (surprise surprise, I know) played a concert mixing Afrocuban music with classical compositions. The concert featured Cuban composer and guitarist Leo Brouwer playing a piece by Joaquin Rodrigo (Concierto de Aranjuez) and the band played from Mozart to Chucho's Misa Negra (Black Mass). It was released as an LP (Irakere con Leo Brouwer en vivo - Teatro Karl Marx) and later as a CD (Irakere - Coleccion Vol 2).\n-------\n\nTracks\n01- Tu conga Bach\n02- Fuga\n03- Air on G String\n04- Clave in C Minor\n05- Gavotte\n06- Mi Orisha\n07- Minuet in G\n08- Olas de YemayaÃ‚Â \n09- Baqueteo con bajo\n10- Timbach\n11- Kyrie\n\nEAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:85463082866189a2c2d504443138fb2843b06013","amp;dn":"Tiempo+Libre+-+Bach+In+Havana+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85463082866189a2c2d504443138fb2843b06013","infoHashBuffer":{"type":"Buffer","data":[133,70,48,130,134,97,137,162,194,213,4,68,49,56,251,40,67,176,96,19]},"announce":[],"urlList":[]}}