{"title":"Fashion A Very Short Introduction","uid":6239011,"size":2132356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8603c21be69174a7f7fca165ca4928b4ee247c65&amp;dn=Fashion+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lkk100","files":-1,"time":1299988252,"description":"    * Publisher: Oxford University Press, USA; 1 edition (November 23, 2009)\n    * Language: English\n    * ISBN-10: 9780199547906\n    * ISBN-13: 978-0199547906\n\n\nFashion is a gigantic global industry, generating some three hundred billion dollars in revenue every year, and playing a significant role in the economic, political, cultural and social lives of a vast international audience. Despite this, and perhaps in part because of its prevalence in the media, it is often denigrated as trivial and superficial, as a sign of vanity and narcissism. Written by a highly regarded authority on twentieth-century fashion, this Very Short Introduction offer a wide-ranging and revealing look at fashion that discusses everything from production and design, to couture and retailing, to the wider role of fashion in society. This lively book illuminates the structure of the fashion industry and the range of professionals involved in its creation, and it provides cogent insight into its historical, social and cultural contexts. It also sheds light on how fashion has developed, while raising questions about its ethical and controversial aspects, such as the use of fur, exploitative trading, and poor working conditions for laborers.\n","torrent":{"xt":"urn:btih:8603c21be69174a7f7fca165ca4928b4ee247c65","amp;dn":"Fashion+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8603c21be69174a7f7fca165ca4928b4ee247c65","infoHashBuffer":{"type":"Buffer","data":[134,3,194,27,230,145,116,167,247,252,161,101,202,73,40,180,238,36,124,101]},"announce":[],"urlList":[]}}