{"title":"Combat-Ready Kitchen (2015) (Epub and Mobi) Gooner","uid":14128406,"size":1612346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8633decf0bbd6676c06b5c9897144c70def81628&amp;dn=Combat-Ready+Kitchen+%282015%29+%28Epub+and+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1459523389,"description":"Combat-Ready Kitchen - How the U.S. Military Shapes the Way You Eat (2015) (Epub &amp; Mobi) Gooner\r\n\r\nPublisher: Current (August 4, 2015)\r\nLanguage: English\r\nISBN-10: 1591845971\r\nISBN-13: 978-1591845973\r\n\r\nAmericans eat more processed foods than anyone else in the world. We also spend more on military research. These two seemingly unrelated facts are inextricably linked. If you ever wondered how ready-to-eat foods infiltrated your kitchen, you’ll love this entertaining romp through the secret military history of practically everything you buy at the supermarket.\r\n\r\nIn a nondescript Boston suburb, in a handful of low buildings buffered by trees and a lake, a group of men and women spend their days researching, testing, tasting, and producing the foods that form the bedrock of the American diet. If you stumbled into the facility, you might think the technicians dressed in lab coats and the shiny kitchen equipment belonged to one of the giant food conglomerates responsible for your favorite brand of frozen pizza or microwavable breakfast burritos. So you’d be surprised to learn that you’ve just entered the U.S. Army Natick Soldier Systems Center, ground zero for the processed food industry.\r\n\r\nEver since Napoleon, armies have sought better ways to preserve, store, and transport food for battle. As part of this quest, although most people don’t realize it, the U.S. military spearheaded the invention of energy bars, restructured meat, extended-life bread, instant coffee, and much more. But there’s been an insidious mission creep: because the military enlisted industry—huge corporations such as ADM, ConAgra, General Mills, Hershey, Hormel, Mars, Nabisco, Reynolds, Smithfield, Swift, Tyson, and Unilever—to help develop and manufacture food for soldiers on the front line, over the years combat rations, or the key technologies used in engineering them, have ended up dominating grocery store shelves and refrigerator cases. TV dinners, the cheese powder in snack foods, cling wrap . . . The list is almost endless.\r\n\r\nNow food writer Anastacia Marx de Salcedo scrutinizes the world of processed food and its long relationship with the military—unveiling the twists, turns, successes, failures, and products that have found their way from the armed forces’ and contractors’ laboratories into our kitchens. In developing these rations, the army was looking for some of the very same qualities as we do in our hectic, fast-paced twenty-first-century lives: portability, ease of preparation, extended shelf life at room temperature, affordability, and appeal to even the least adventurous eaters. In other words, the military has us chowing down like special ops.\r\n\r\nWhat is the effect of such a diet, eaten—as it is by soldiers and most consumers—day in and day out, year after year? We don’t really know. We’re the guinea pigs in a giant public health experiment, one in which science and technology, at the beck and call of the military, have taken over our kitchens","torrent":{"xt":"urn:btih:8633decf0bbd6676c06b5c9897144c70def81628","amp;dn":"Combat-Ready+Kitchen+%282015%29+%28Epub+and+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8633decf0bbd6676c06b5c9897144c70def81628","infoHashBuffer":{"type":"Buffer","data":[134,51,222,207,11,189,102,118,192,107,92,152,151,20,76,112,222,248,22,40]},"announce":[],"urlList":[]}}