{"title":"1999 - A Touch of Frost - Series 6 - 4 (720x544) Episodes","uid":11701327,"size":3736631159,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:86376a2f4171e94a111f9853560189dced76b938&amp;dn=1999+-+A+Touch+of+Frost+-+Series+6+-+4+%28720x544%29+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"bnaron","files":6,"time":1423930700,"description":"A Touch of Frost - (1999) Series 06 - 4 (720x544) Episodes\n\n\nSeries Description Courtesy Of:\n\nFrom Wikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/A_Touch_of_Frost&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/A_Touch_of_Frost&lt;/a&gt;\n\n\nA Touch of Frost is a television detective series produced by Yorkshire Television (later ITV Studios) for ITV from 1992 until 2010, initially based on the Frost novels by R. D. Wingfield. Writing credit for the three episodes in the first 1992 series went to Richard Harris, with screenplays credited to Wingfield.\n\nThe series stars David Jason as Detective Inspector William Edward &quot;Jack&quot; Frost, an experienced and dedicated detective who frequently clashes with his superiors. In his cases, Frost is assisted by a variety of different detective sergeants, with each bringing a different slant to the particular case. Comic relief is provided by Frost's interactions with the bureaucratically minded Superintendent Norman Mullett, played by Bruce Alexander.\n\nA number of young actors had their major debut as supporting cast in the show, including Matt Bardock, Ben Daniels, Neil Stuke, Mark Letheren, Colin Buchanan, Jason Maza, Damian Lewis and Marc Warren.\n\n\nEpisode Descriptions Courtesy Of:\n\nThe On-Line Television Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com/?tab=season&amp;seriesid=76247&amp;seasonid=10007&amp;lid=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com/?tab=season&amp;seriesid=76247&amp;seasonid=10007&amp;lid=7&lt;/a&gt;\n\n\n1999-03-07 - Appendix Man\n\nHazel Wallace returns from her training, as the new Detective Sergeant, and is put to work by Supt Mullett sorting out the mess left behind by DI Frost, while he is on extended compassionate leave. Before long she is called upon, when a man is found hanged in his home, and she suspects it was not suicide. Routine investigations show that a fresh set of fingerprints at the scene belong to an unidentified man who had been found drowned a year previously. Frost is summoned back by Supt Mullett to sort things out, and he connects a painting that appears to have been stolen from the hanged man with an art robbery &amp; murder some years before.\n\n\n1999-03-14 - One Man's Meat\n\nFrost investigates two deaths: a homeless teenage girl, found beaten up and drowned in Denton's river; and that of an environmental health officer, after a dismembered arm is washed up on the shoreline. This leads to the investigation of a local meat processing factory.\n\n\n1999-03-21 - Private Lives\n\nA woman is found in a critical condition in a quiet village on the outskirts of Denton, a victim of an apparent hit-and-run incident. Her husband and daughter are distraught. Frost's investigation exposes the secret life of a corner of rural England.\n\n\n1999-03-28 - Keys To The Car\n\nFrost is called upon by Supt Mullett to investigate the theft of his friend's car from their golf club by a confidence trickster, who leaves behind a trail of satisfied golfing widows, unpaid bar bills and stolen cars. It gets complicated when the car is recovered with the body of a local drugs dealer in the boot. What are the connections between the car owner, the con-man and the dead drug dealer?","torrent":{"xt":"urn:btih:86376a2f4171e94a111f9853560189dced76b938","amp;dn":"1999+-+A+Touch+of+Frost+-+Series+6+-+4+%28720x544%29+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86376a2f4171e94a111f9853560189dced76b938","infoHashBuffer":{"type":"Buffer","data":[134,55,106,47,65,113,233,74,17,31,152,83,86,1,137,220,237,118,185,56]},"announce":[],"urlList":[]}}