{"title":"The Monkey's Voyage: How... (2014) Alan de Queiroz (multi)","uid":9540388,"size":39742801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86c9f219ea12b6b94fe3fc6bd9418002b0724b11&amp;dn=The+Monkey%27s+Voyage%3A+How...+%282014%29+Alan+de+Queiroz+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"7","files":-1,"time":1391031786,"description":"\nThe Monkey's Voyage: How Improbable Journeys Shaped the History of Life by Alan de Queiroz\n\n\nFormat: mobi/epub/azw3\nLength: 370 pages\nGenre: Non-Fiction/Science/Evolution\nDate: 7 January 2014\n\nA story full of intriguing discoveries that de Queiroz, a fluent and spellbinding popular-science writer, agglomerates into the narrative spine of a book brimming with fascination.\n\nHow did species wind up where they are today? Scientists have long conjectured that plants and animals dispersed throughout the world by drifting on large landmasses as they broke up, but in The Monkey's Voyage, biologist Alan de Queiroz offers a radical new theory that displaces this passive view. He describes how species as diverse as monkeys, baobab trees, and burrowing lizards made incredible long-distance ocean crossings: pregnant animals and wind-blown plants rode rafts and icebergs and even stowed away on the legs of sea-going birds to create the map of life we see today.\n\nIn the tradition of John McPhee's Basin and Range and David Quammen's The Song of the Dodo, The Monkey's Voyage is a beautifully told narrative of a profound investigation into the importance of contingency in history and the nature of scientific discovery.\n\nAuthor:\n\nAlan de Queiroz is an evolutionary biologist and adjunct faculty at the University of Nevada, Reno. He has written widely-cited research articles on topics ranging from biogeography to the evolution of behavior to the origins of parasites. He lives in Reno, Nevada. ","torrent":{"xt":"urn:btih:86c9f219ea12b6b94fe3fc6bd9418002b0724b11","amp;dn":"The+Monkey%27s+Voyage%3A+How...+%282014%29+Alan+de+Queiroz+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86c9f219ea12b6b94fe3fc6bd9418002b0724b11","infoHashBuffer":{"type":"Buffer","data":[134,201,242,25,234,18,182,185,79,227,252,107,217,65,128,2,176,114,75,17]},"announce":[],"urlList":[]}}