{"title":"City of Thorns (2016).epub Gooner","uid":13853249,"size":2492239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8744d5a7fbdba7c5d3cef6ab0c4c192250d30c4a&amp;dn=City+of+Thorns+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1457997357,"description":"City of Thorns - Nine Lives in the World's Largest Refugee Camp (2016).epub Gooner\r\n\r\nPublisher: Picador (January 5, 2016)\r\nLanguage: English\r\nISBN-10: 1250067634\r\nISBN-13: 978-1250067630\r\n\r\nTo the charity workers, Dadaab refugee camp is a humanitarian crisis; to the Kenyan government, it is a 'nursery for terrorists'; to the western media, it is a dangerous no-go area; but to its half a million residents, it is their last resort.\r\n\r\nSituated hundreds of miles from any other settlement, deep within the inhospitable desert of northern Kenya where only thorn bushes grow, Dadaab is a city like no other. Its buildings are made from mud, sticks or plastic, its entire economy is grey, and its citizens survive on rations and luck. Over the course of four years, Ben Rawlence became a first-hand witness to a strange and desperate limbo-land, getting to know many of those who have come there seeking sanctuary. Among them are Guled, a former child soldier who lives for football; Nisho, who scrapes an existence by pushing a wheelbarrow and dreaming of riches; Tawane, the indomitable youth leader; and schoolgirl Kheyro, whose future hangs upon her education.\r\n\r\nIn City of Thorns, Rawlence interweaves the stories of nine individuals to show what life is like in the camp and to sketch the wider political forces that keep the refugees trapped there. Rawlence combines intimate storytelling with broad socio-political investigative journalism, doing for Dadaab what Katherinee Boo's Behind the Beautiful Forevers did for the Mumbai slums. Lucid, vivid and illuminating, City of Thorns is an urgent human story with deep international repercussions, brought to life through the people who call Dadaab home","torrent":{"xt":"urn:btih:8744d5a7fbdba7c5d3cef6ab0c4c192250d30c4a","amp;dn":"City+of+Thorns+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8744d5a7fbdba7c5d3cef6ab0c4c192250d30c4a","infoHashBuffer":{"type":"Buffer","data":[135,68,213,167,251,219,167,197,211,206,246,171,12,76,25,34,80,211,12,74]},"announce":[],"urlList":[]}}