{"title":"David Wilcock - The Source Field Investigations","uid":7115039,"size":1409702567,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:875fd2a900342416378303f6f920f05255281402&amp;dn=David+Wilcock+-+The+Source+Field+Investigations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"geogaddi000","files":-1,"time":1332191690,"description":"Based on a hugely popular Internet documentary, this exploration of historic signs and symbolism determines what the future holds for humanity come 2012.\n\n&quot;If you believe there is no special significance to the year 2012, then prepare yourself for a guided tour through the most incredible scientific mysteries in the modern world, which may be the rediscovery of an ancient system of physics and spirituality that was once widely used and understood, but has since crumbled almost completely into ruin.&quot; -The Source Field Investigations\n\nIn his documentary The 2012 Enigma-viewed more than two million times- David Wilcock exposed many great secrets: DNA, consciousness science, wormholes, stargate travel, sacred geometry, three-dimensional time, the Mayan calendar, and much more. And in this book, his seminal work, he'll expose even more.\n\nCalling upon fascinating areas of alternative science, Wilcock's unique philosophy connects the human species and the rest of the cosmos, proposing that it is in our power to usher in the Golden Age prophesied in so many ancient cultures and spiritual traditions. Unlike the doom- and-gloom viewpoints depicted in big-budget disaster films, Wilcock believes that 2012 may be a watermark for when a widespread acceptance of a greater reality will begin to occur-and in his book, he lays out many of the blueprints for such a Golden Age.\n\n- Video Presentation\n\nIn this talk David Wilcock describes the basic theories underpinning his book, The Source Field Investigations with accompanying slides.\n\n1 hr. 52 min.\n\n- .PDF eBook\n\nThis is the Kindle version, image-captured, converted to PDF with OCR.\n\n- .M4A Audiobook\n\nThe Source Field Investigations by David Wilcock (Audiobook)\npublished August 23, 2011","torrent":{"xt":"urn:btih:875fd2a900342416378303f6f920f05255281402","amp;dn":"David+Wilcock+-+The+Source+Field+Investigations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"875fd2a900342416378303f6f920f05255281402","infoHashBuffer":{"type":"Buffer","data":[135,95,210,169,0,52,36,22,55,131,3,246,249,32,240,82,85,40,20,2]},"announce":[],"urlList":[]}}