{"title":"The Sands of Sakkara by Glenn Meade","uid":9740340,"size":776662,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8869b25c3e7a9e348fdc1e6562ab7ede4a1665a4&amp;dn=The+Sands+of+Sakkara+by+Glenn+Meade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1394503371,"description":"\nTo save the Western Allies, he must kill the woman he loves...\n\nNovember 1943: Adolf Hitler sanctioned his most audacious mission ever--to kill US President Franklin D. Roosevelt and Prime Minister Winston Churchill as they visit Cairo for a secret conference to plan the Allied invasion of Europe, an invasion which threatens imminent defeat for Germany. Only one man is capable of leading the defiant Nazi mission--Major Johann Halder, one of the Abwehr's most brilliant, daring agents, a man with a tortured soul and a talent for the impossible.\n\nAccompanied by an expert undercover team, and a young and beautiful Egyptologist, Rachael Stern, Halder must race against time across a hostile desert, to reach Cairo and successfully carry out the assignment, or forfeit his own life and that of his young son. \n\nWhen US military intelligence learns of the plan, they assign one of their best officers, Lieutenant-Colonel Harry Weaver, to hunt down and eliminate Halder and his team. But for Weaver, as for Johann Halder and Rachael Stern, there's more than just the balance of war and the lives of the Allied leaders at stake--a pact of love and friendship is about to be tested in a frantic, high-stakes chase to the death.\n\nGenre: Mystery | Thriller","torrent":{"xt":"urn:btih:8869b25c3e7a9e348fdc1e6562ab7ede4a1665a4","amp;dn":"The+Sands+of+Sakkara+by+Glenn+Meade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8869b25c3e7a9e348fdc1e6562ab7ede4a1665a4","infoHashBuffer":{"type":"Buffer","data":[136,105,178,92,62,122,158,52,143,220,30,101,98,171,126,222,74,22,101,164]},"announce":[],"urlList":[]}}