{"title":"Bulletproof: The Cookbook: Lose Up to a Pound a Day, Increase Yo","uid":12961054,"size":9458429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:897b2a62715f2a196de7ed7d2436c99935571117&amp;dn=Bulletproof%3A+The+Cookbook%3A+Lose+Up+to+a+Pound+a+Day%2C+Increase+Yo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1449848716,"description":"Bulletproof: The Cookbook: Lose Up to a Pound a Day, Increase Your Energy, and End Food Cravings for Good\r\n\r\nIn The Bulletproof Diet, Dave Asprey turned conventional diet wisdom on its head, outlining the plan responsible for his 100-pound weight loss, which he came to by &quot;biohacking&quot; his body and optimizing every aspect of his health.\r\nThe unconventional plan urges you to skip breakfast, stop counting calories, eat high levels of healthy saturated fat, work out less, sleep better, and add smart supplements. In doing so, Dave says you'll gain energy, build lean muscle, and watch the pounds melt off―just as he and so many others have.\r\nBulletproof: The Cookbook picks up where the diet plan leaves off, arming you with 125 recipes to stay Bulletproof for life and never get bored. Famous for his butter-laden Bulletproof Coffee, Dave packs the book with the delicious, filling meals he uses to maintain his weight loss and sustain his boundless energy.\r\nOnce you get your hands on these mouthwatering recipes, you’ll be hungry for more―and this book is just what you’ll reach for. The Bulletproof lifestyle is your blueprint to a supercharged life.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:897b2a62715f2a196de7ed7d2436c99935571117","amp;dn":"Bulletproof%3A+The+Cookbook%3A+Lose+Up+to+a+Pound+a+Day%2C+Increase+Yo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"897b2a62715f2a196de7ed7d2436c99935571117","infoHashBuffer":{"type":"Buffer","data":[137,123,42,98,113,95,42,25,109,231,237,125,36,54,201,153,53,87,17,23]},"announce":[],"urlList":[]}}