{"title":"Between The Buried And Me - The Silent Circus (2003) WMA320","uid":6272037,"size":132579842,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:898575ec437ca54178e9c3a611729c27905638b0&amp;dn=Between+The+Buried+And+Me+-+The+Silent+Circus+%282003%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301136026,"description":"Describing Between The Buried &amp; Me as &quot;metalcore&quot; would be a grave falsehood. Metalcore influences? Sure. But it would be impossible to overlook the various other influences the band incorporates into this album. The sounds of Radiohead, Death, metal Ulver, Dillinger Escape Plan, Pink Floyd, Pantera, Cryptopsy, and even some Emperor are evident. Does that mean that _The Silent Circus_ is a hackneyed attempt to create something &quot;progressive&quot;? No. In fact, that type of response couldn't be farther from the truth.\nThe album begins with &quot;Lost Perfection,&quot; fading into guitar feedback for 30 seconds or so before unleashing a fury of technical metal for another 40 seconds or so, and then erupting into a wonderful guitar melody. The song also features a &quot;hand clapping breakdown&quot; around the 3-minute mark, and then transitions perfectly into a thick southern metal groove that would make Pantera blush from envy.\n\nThat sort of song structure could loosely typify BTBAM's overall sound - grinding, pulsing technical metal, thick grooves, then suddenly bursting into odd breakdowns, gorgeous melodies, or haunting soundscapes. In this respect, BTBAM bring about comparisons to the mighty Opeth. That comparison is probably just, due to the &quot;night and day&quot; aspect of the bands' respective music. But that's where the similarities end, really. BTBAM crafts darker, heavier, more intense &quot;heavy&quot; parts than Opeth could ever imagine, with some of the best vocals around, complements of Tommy Rogers (who also adds texture on keyboard); the band also creates some of the most ethereal musical moments I can imagine, featuring layers of keyboards, soft drum beats, soulful bass, and lightly strummed guitars, whereas Opeth relies mostly on beautiful acoustic arrangements to contrast their form of black/death metal.\n\nIn comparison to the band's self-titled debut, this album is darker and heavier. The drumming is still absolutely OUTRAGEOUS, despite the fact that former drummer Will Goodyear has been replaced. New drummer (and sadly, now ex-drummer) Mark Castillo is a freaking monster. His talent is frightening. His drumming here is some of the most amazing I've heard. The guitar and bass playing here is still mind-blowing. Bassist Jason King lays down some of the coolest grooves ever, plays a solo or two, and plays PERFECTLY with the two guitarists, Nick Fletcher and Paul Waggoner. The trio is one of the most original and exciting I've heard. In addition to the chilling death vox, vocalist Tommy Rogers is also capable of some of the most breathtaking clean vocals this side of Mikael Akerfeldt.\n\n_The Silent Circus_ is definitely one of the most &quot;progressive&quot; albums I've heard, as well as a new all-time favorite album of mine. There is no band I know of right now that makes music as engaging, fresh, and exciting as BTBAM. Buy this or perish, sweater monkeys.\n\nby Strobe Lights And Blown Speakers\n\n01 - Lost Perfection Coulrophobia.wma                       \n02 - Lost Perfection Anablephobia.wma                       \n03 - Camilla Rhodes.wma                                     \n04 - Mordecai.wma                                           \n05 - Reaction.wma                                           \n06 - (Shevanel Take 2).wma                                  \n07 - Ad A Dglgmut.wma                                       \n08 - Destructo Spin.wma                                     \n09 - Aesthetic.wma                                          \n10 - The Need For Repitition.wma\n\nWMA 320Kbps 44100Hz STEREO\n\nFollow me On Facebook Pages: MarcelodrgzTPB\n","torrent":{"xt":"urn:btih:898575ec437ca54178e9c3a611729c27905638b0","amp;dn":"Between+The+Buried+And+Me+-+The+Silent+Circus+%282003%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898575ec437ca54178e9c3a611729c27905638b0","infoHashBuffer":{"type":"Buffer","data":[137,133,117,236,67,124,165,65,120,233,195,166,17,114,156,39,144,86,56,176]},"announce":[],"urlList":[]}}