{"title":"London Under","uid":6886219,"size":17041163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89e46e7f95de8d8d846897f805a7a50fa8fa019e&amp;dn=London+Under&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jakcreed2","files":2,"time":1323839901,"description":"One of the most popular books on London (it has reprinted six times since it was first published in 1984) London under London has now been updated to take into account the latest subterranean developments. A new section covers: the pioneering deep level water main 80 kilometres in length, much longer even than the Channel Tunnel; new power tunnels and the enormous substation beneath Leicester Square; new underground railways; glass fibre communication; and much more. Clearly, metropolitan man is burrowing as actively as ever. The London we know and see is only the tip of the iceberg. Beneath the familiar surface lies an unknown city, a Hades of buried and forgotten rivers, sunken sewers, underground railways, pipes and passages, tubes and tunnels, crypts and cellars. These lifelines of the metropolis twist and turn hidden beneath the pavements of the city - fifteen hundred miles of Neo-Gothic sewers, a hundred miles of Neolithic rivers, eighty-two miles of tube tunnels, twelve miles of government tunnels and hundreds of thousands of miles of cables and pipes. Layer upon layer, they run their urgent errands, carrying people, delivering water, removing sewage, passing currents, sending messages, conveying parcels. Drawing extensively from the literature and visual archives of the underworld, London under London traces the history of the tunnellers and borers who have pierced the ground beneath the city for close on two thousand years. The authors trace the routes taken by man and nature, and enable us to follow them from the comfort of our armchairs. They can also tell us, gazetteer-style, exactly where we can get below and see the strange world which they depict, whom to ask for permission, and which of the public service authorities organizes trips underground.\n\nEnjoy and seed","torrent":{"xt":"urn:btih:89e46e7f95de8d8d846897f805a7a50fa8fa019e","amp;dn":"London+Under","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89e46e7f95de8d8d846897f805a7a50fa8fa019e","infoHashBuffer":{"type":"Buffer","data":[137,228,110,127,149,222,141,141,132,104,151,248,5,167,165,15,168,250,1,158]},"announce":[],"urlList":[]}}