{"title":"Lisa Renee Jones - The Werewolf Society Box Set","uid":8806695,"size":834399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a69df0028276bdded71707480fef52f4f072eea&amp;dn=Lisa+Renee+Jones+-+The+Werewolf+Society+Box+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":2,"time":1376350349,"description":"Wicked Werewolf Night: Nico's Story\n\nA witch after his secret. A wolf after her pleasure.\n\nNico Moore is the leader of of The Werewolf Society's elite Royal Guard. Aylia Richardson is the witch who calls to the beast in Nico, but destiny has also made her the keeper of a gift that threatens the very existence of his race. To destroy this gift will destroy this woman...the only one he has ever dared to call 'mate'.\n\nWicked Werewolf Secret: Kole's Story\n\nKole Smith will soon become the leader of his pack, and not just any pack. He will lead the Royal Guard of the Werewolf Society. Before he accepts his role, he has unfinished business and her name is Sarah.\n\nSarah's family ran the Casino Operation used as a front for The Werewolf Society, until the greed of the rebels trying to overthrow their government led to her families murder. Kole saved her life, gave her the opportunity to live, and to deliver the vengeance she craves against the rebels.\n\nWicked Werewolf Passion: Shi's story \n\nShi is a wolf whose been shunned by the Royal Guard he once fought for, the head of a mercenary team that does the jobs too dirty for everyone else. His newest job is to find, and kidnap, the gorgeous daughter of a high ranking member of the council, and make him confess he's working for the enemy.Dirty work, but someone has to do it. Only this gorgeous wolf isn't about to believe her father is on the bad side of the fence, nor does she have plans to be anyone's captive. In fact...she might just make Shi her captive.","torrent":{"xt":"urn:btih:8a69df0028276bdded71707480fef52f4f072eea","amp;dn":"Lisa+Renee+Jones+-+The+Werewolf+Society+Box+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a69df0028276bdded71707480fef52f4f072eea","infoHashBuffer":{"type":"Buffer","data":[138,105,223,0,40,39,107,221,237,113,112,116,128,254,245,47,79,7,46,234]},"announce":[],"urlList":[]}}