{"title":"Frasier - Complete Series - DVDRip","uid":4039493,"size":52302706020,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8a908d8c6fce8ce040908eaee09f5ebc0c2d590c&amp;dn=Frasier+-+Complete+Series+-+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"Robin86","files":288,"time":1203607111,"description":"Complete series of my favorite sitcom, &quot;Frasier&quot;, all ripped from retail DVDs. \n\nIf you haven&amp;#039;t already seen this, do yourself a favor and download and watch the first few episodes. If you have a sense of humor, I can almost guarantee you&amp;#039;ll be coming back for more after you&amp;#039;ve seen a few episodes. \nOr if you&amp;#039;ve already seen it you can download and watch it again because IMO this show is just as funny when rewatching it as it was the first time.\n\n\nDescription:\n&quot;Frasier&quot; provides a weekly dose of the neuroses and tribulations suffered by an insecure and pompous psychiatrist, Dr. Frasier Crane, host of a Seattle radio advice show at KACL. The twice-divorced doctor&amp;#039;s peaceful home life of fine cigars and haute cuisine was shattered when his gruff, ex-cop father, Martin, was injured in the line of duty and forced to move in with Frasier. Martin brought with him a semi-psychic, live-in home-care provider, Daphne Moon, his pesky Jack Russell terrier, Eddie, and a duct-taped recliner that clashes with Frasier&amp;#039;s more aesthetically pleasing Eames and Wassily chairs. Their home is frequently visited by Frasier&amp;#039;s snobbish and competitive brother, Niles, a fellow psychiatrist whose longtime romantic interest in Daphne was finally happily realized at the conclusion of Season 7. At work, his slightly jaded producer and man-hungry single parent Roz Doyle, supports Frasier. Some of the people who voice the callers to Frasier&amp;#039;s radio program are often bigtime celebrities.\n\n\n\nPlease upload at least as much as you download, that way more people get to enjoy this and I won&amp;#039;t have to seed it forever.\n\nEnjoy!\t\t\t","torrent":{"xt":"urn:btih:8a908d8c6fce8ce040908eaee09f5ebc0c2d590c","amp;dn":"Frasier+-+Complete+Series+-+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a908d8c6fce8ce040908eaee09f5ebc0c2d590c","infoHashBuffer":{"type":"Buffer","data":[138,144,141,140,111,206,140,224,64,144,142,174,224,159,94,188,12,45,89,12]},"announce":[],"urlList":[]}}