{"title":"Fionn Regan - The End of History [2006] [EAC,log,cue.FLAC] ","uid":9122081,"size":289659380,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b33bbc3ea0803554274ba1fd4ba9c567e02ec16&amp;dn=Fionn+Regan+-+The+End+of+History+%5B2006%5D+%5BEAC%2Clog%2Ccue.FLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":15,"time":1383155161,"description":"Artist: Fionn Regan\nRelease: The End of History \nReleased:  2006\nLabel:  Bella Union\nCatalog#: BELLACD119\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: UK\nStyle: Folk,Folk pop\n\n\n\n\n1. Be Good Or Be Gone 3:19\n2. The Underwood Typewriter 3:02\n3. Hunters Map 3:09\n4. Hey Rabbit 3:32\n5. Black Water Child 3:00\n6. Put A Penny In The Slot 4:02\n7. The Cowshed 3:31\n8. Snowy Atlas Mountains 4:14\n9. Noah (Ghost In A Sheet) 3:40\n10. The End Of History 4:39\n11. Abacus 2:35\n12. Bunker Or Basement 10:52\n\n\n\nThe debut album by Irish-born, British-based singer/songwriter Fionn Regan was first released in the U.K. by ex-Cocteau Twins bassist Simon Raymonde's dream pop imprint Bella Union, before being picked up for U.S. distribution by the rootsy alt-country label Lost Highway. Impressively, it's a good fit for both labels. Regan keeps one foot in the singer/songwriter tradition -- comparisons to Damien Rice and Nick Drake are ubiquitous in his reviews, and for good reason -- but Regan's interest in specific soundscapes for their emotional resonances is a subtle but important philosophical link to the Cocteau Twins' sound for sounds' sake aesthetic. Regan recorded the majority of The End of History in a disused stone barn, live to a portable recorder. The natural reverb adds warmth to these often skeletal songs, most with little more accompaniment than Regan's acoustic guitar and practically whispered vocals. The sense of intimacy thus engendered adds weight to songs that might have otherwise seemed ethereally light, but at his best, Regan proves himself an immensely skilled songwriter. &quot;I have become an aerial view of a coastal town that you once knew&quot; is a startlingly apt image in the lovely lost-love lament &quot;Be Good or Be Gone,&quot; and Regan's debut single &quot;Put a Penny in the Slot&quot; is an instant classic ranking with such wry slices of U.K. folk-rock as Lloyd Cole and the Commotions' &quot;Perfect Skin&quot; (right down to Regan's echoing of Cole's trademark habit of dropping authors' names in his lyrics, Paul Auster and Saul Bellow in this case) and any number of Richard Thompson's romantic character studies. The End of History suggests that a major talent may be brewing here.","torrent":{"xt":"urn:btih:8b33bbc3ea0803554274ba1fd4ba9c567e02ec16","amp;dn":"Fionn+Regan+-+The+End+of+History+%5B2006%5D+%5BEAC%2Clog%2Ccue.FLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b33bbc3ea0803554274ba1fd4ba9c567e02ec16","infoHashBuffer":{"type":"Buffer","data":[139,51,187,195,234,8,3,85,66,116,186,31,212,186,156,86,126,2,236,22]},"announce":[],"urlList":[]}}