{"title":"Brigitte Gabriel - They Must Be Stopped (fixed) (mobi, epub)","uid":6942009,"size":730467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b4079207e4aaf86998460cc476a202a8ce60510&amp;dn=Brigitte+Gabriel+-+They+Must+Be+Stopped+%28fixed%29+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bondoed","files":2,"time":1326080896,"description":"They Must Be Stopped: Why We Must Defeat Radical Islam and How We Can Do It\n\nThey Must Be Stopped is New York Times bestselling author Brigitte Gabriel's warning to the world: We can no longer ignore the growth of radical Islam--we must act soon, and powerfully. Gabriel challenges our western and politically-correct notions about Islam, demonstrating why radical Islam is so deadly and how we can halt its progress.\n\nBrigitte Gabriel speaks her mind:\n\n* Fundamentalist Islam is a religion rooted in 7th century teachings that are fundamentally opposed to democracy and equality.\n\n* Radical Islamists are utterly contemptuous of all &quot;infidels&quot; (non-Muslims) and regard them as enemies worthy of death.\n\n* Madrassas in America are increasing in number, and they are just one part of a growing radical Islamic army on US soil.\n\n* Radical Islam exploits the US legal system and America's protection of religion to spread its hatred for western values.\n\n* America must organize a unified voice that says &quot;enough&quot; to political correctness, and demands that government officials and elected representatives do whatever is necessary to protect us.\n\nBrigitte Gabriel has fearlessly faced down critics, death threats, and political correctness, and is one of the most sought after terrorism experts in the world. They Must Be Stopped is her clarion call to action. Gabriel thoroughly addresses the historical and religious basis of radical Islam, its frightening encroachment into societies around the world, and its abuses of democracy in the name of religion.\n\nAuthor: Brigitte Gabriel\nPublisher: St. Martin's Press\nPublication Date: September 2, 2008\n\nFormats:\n.epub (compatable with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n.mobi (compatable with Amazon Kindle, etc.)\n\nFree Calibre eBook reader: http://calibre-ebook.com/download\n\n(fixes bad previous file)\n","torrent":{"xt":"urn:btih:8b4079207e4aaf86998460cc476a202a8ce60510","amp;dn":"Brigitte+Gabriel+-+They+Must+Be+Stopped+%28fixed%29+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b4079207e4aaf86998460cc476a202a8ce60510","infoHashBuffer":{"type":"Buffer","data":[139,64,121,32,126,74,175,134,153,132,96,204,71,106,32,42,140,230,5,16]},"announce":[],"urlList":[]}}