{"title":"The Greatest Hoax On Earth - Jonathan Sarfati","uid":11773245,"size":1359172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b52870a60f8aa06c34d9e74337b3b498bce3062&amp;dn=The+Greatest+Hoax+On+Earth+-+Jonathan+Sarfati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1427159895,"description":"\nRichard Dawkins is the world's best-known champion of both atheism and its intellectual underpinning, particles-to-people evolution. His latest book, The Greatest Show on Earth: the evidence for evolution is touted as an unanswerable challenge to those who believe in divine creation. In the past, he says, he has assumed evolution; this time he lays out in one major book the evidence for evolution (and its corollary, vast geological ages). Now scientist, chess master and logician Jonathan Sarfati Ph.D. FM goes head to head with Dawkins in this full-on rebuttal, The Greatest Hoax on Earth? Refuting Dawkins on Evolution. Sarfati is no lightweight opponent; his Refuting Evolution at over 500,000 in print is the biggest-selling creationist book ever. In his crisp, highly readable trademark style, Sarfati's sheer competence relentlessly erodes each of Dawkins' claims and in the process, exposes the logical fallacies and even some of the dubious tactics employed. It's precisely those who feel smug in the belief that all the intellectual firepower is on the side of evolution who most need to read Sarfati's book if only to understand better why it is that there are thousands of scientists and intellectuals today who are convinced that biblical creation outguns evolution in a fair science showdown, stripped bare of rhetoric and ideological 'noise'.\n\n\nAbout the author:\nJonathan D. Sarfati, Ph.D, F.M., was born in Ararat, Australia, in 1964. He moved to New Zealand as a child, where he later studied mathematics, geology, physics, and chemistry at Victoria University in Wellington. He obtained honors level in physical and inorganic chemistry, as well as in condensed matter physics and nuclear physics. He received his Ph.D. in physical chemistry from the same institution in 1995 on the topic of pectroscopy, especially vibrational. He has co-authored various technical papers on such things as high temperature superconductors and sulfur and seleniumcontaining ring and cage molecules.\nAs well as being very interested in formal logic and philosophy, Dr Sarfati is a keen chess player. He represented New Zealand in three Chess Olympiads and is a former New Zealand national chess champion. In 1988, F.I.D.E., the International Chess Federation, awarded him the title of F.I.D.E. Master (F.M.). A Christian since 1984, he was for some years on the editorial committee of Apologia, the journal of the Wellington Christian Apologetics Society, of which he was a co-founder.\nDr Sarfati currently works full-time for Answers in Genesis in Brisbane, Australia, a non-profit ministry, as a research scientist and editorial consultant for Creation Ex Nihilo family magazine and the associated Technical Journal, and has written many articles for both. He also contributes specialist information to the Answers in Genesis Internet website","torrent":{"xt":"urn:btih:8b52870a60f8aa06c34d9e74337b3b498bce3062","amp;dn":"The+Greatest+Hoax+On+Earth+-+Jonathan+Sarfati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b52870a60f8aa06c34d9e74337b3b498bce3062","infoHashBuffer":{"type":"Buffer","data":[139,82,135,10,96,248,170,6,195,77,158,116,51,123,59,73,139,206,48,98]},"announce":[],"urlList":[]}}