{"title":"[Dan_Olsen,_Jr.]User Interface Management Systems Models and Alg","uid":11053644,"size":2585554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b5b66b0249b7b632ca59fce0eda24b6cdb2e89a&amp;dn=%5BDan_Olsen%2C_Jr.%5DUser+Interface+Management+Systems+Models+and+Alg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"zombie_rox","files":2,"time":1411060532,"description":"This book brings together for the first time all major approaches to User Interface Management Systems (UIMS) development from a programmer's algorithmic perspective. The various models for describing dialogs and generating user interfaces are discussed within the framework of a general UIMS architecture. Extensive examples are included to reinforce the concepts presented and applications for each approach are described. This guide will provide professional programmers with a understanding of the algorithms necessary to implement UIMSs. Readers without a programming background can use this book without prior user interface experience.\n\nPublisher: Morgan Kaufmann Pub (November 1991)\nLanguage: English\nISBN-10: 1558602208\nISBN-13: 978-1558602205\n\nEditorial Reviews\nReview\nThis book brings together for the first time all major approaches to User Interface Management Systems (UIMS) development from a programmer's algorithmic perspective. The various models for describing dialogs and generating user interfaces are discussed within the framework of a general UIMS architecture. Extensive examples are included to reinforce the concepts presented and applications for each approach are described. This guide will provide professional programmers with a understanding of the algorithms necessary to implement UIMSs. Readers without a programming background can use this book without prior user interface experience. -- Book Description\n\n","torrent":{"xt":"urn:btih:8b5b66b0249b7b632ca59fce0eda24b6cdb2e89a","amp;dn":"%5BDan_Olsen%2C_Jr.%5DUser+Interface+Management+Systems+Models+and+Alg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b5b66b0249b7b632ca59fce0eda24b6cdb2e89a","infoHashBuffer":{"type":"Buffer","data":[139,91,102,176,36,155,123,99,44,165,159,206,14,218,36,182,205,178,232,154]},"announce":[],"urlList":[]}}