{"title":"William Burroughs - Naked Lunch: The Restored Text (pdf)","uid":8594214,"size":3545171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d9e624cbfd6a9dce233bd1b29b91dd82e3d1f8c&amp;dn=William+Burroughs+-+Naked+Lunch%3A+The+Restored+Text+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371715575,"description":"William Burroughs (James Grauerholz, Barry Miles, editors; J.G. Ballard, introduction) - Naked Lunch: The Restored Text (HarperPerennial UK, 2005). 289 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nThere are many editions of this book on the internet; many claim to be &quot;the restored text.&quot; But I haven't been able to find a single one that actually contains what the print edition has. The book in this torrent is a scan of the print edition of the book, so it contains everything.\n\n\ndescription:\n\nA literary landmark and the most shocking novel in the English language, William Burroughs' 'Naked Lunch' is an exhilarating ride into the darkest recesses of the human psyche. Meet Bradley the Buyer, the best narcotics agent in the business. Say hello to Dr 'Fingers' Schafer, the Lobotomy Kid, and the sadistic, manipulative Dr Benway. And then there's our narrator, Bill Lee, an Ivy League-educated narcotics addict. This is the story of Bill's flight south from New York to a drug-and-sex-soaked retreat in Tangiers, where ambiguous Good and enticing Evil vie for the human soul. Welcome to Interzone ... 'Naked Lunch' is a masterpiece of modern literature by the godfather of the Beat writers: as provocative and mordantly funny today as it was in 1959.","torrent":{"xt":"urn:btih:8d9e624cbfd6a9dce233bd1b29b91dd82e3d1f8c","amp;dn":"William+Burroughs+-+Naked+Lunch%3A+The+Restored+Text+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d9e624cbfd6a9dce233bd1b29b91dd82e3d1f8c","infoHashBuffer":{"type":"Buffer","data":[141,158,98,76,191,214,169,220,226,51,189,27,41,185,29,216,46,61,31,140]},"announce":[],"urlList":[]}}