{"title":"Story Genius - Lisa Cron.epub","uid":14736669,"size":239842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dc6c2fea8740e5ee9fcd5a5eb1c2110256a5e3a&amp;dn=Story+Genius+-+Lisa+Cron.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":1,"time":1464640927,"description":"Story Genius: How to Use Brain Science to Go Beyond Outlining and Write a Riveting Novel - Lisa Cron.epub\r\n\r\nFollowing on the heels of Lisa Cron's breakout first book, Wired for Story, this writing guide reveals how to use cognitive storytelling strategies to build a scene-by-scene blueprint for a riveting story. \r\n\r\n\r\nIt’s every writer’s greatest fear--pouring blood, sweat, and tears into writing hundreds of pages only to realize the story has no sense of urgency and no internal logic, so it’s a complete do-over. \r\n\r\nThe prevailing wisdom in the writing community is that there are just two ways around this problem: pantsing (winging it) and plotting (focusing on the external plot). Story coach Lisa Cron has spent decades discovering why these methods rarely work and coming up with a powerful alternative, based on the science of what our brains are wired to crave in every story we read (and it’s not what you think). \r\n\r\nIn this revolutionary guide, Cron helps you crack the story code and create a novel, screenplay, or memoir that will keep readers riveted. Using one novelist’s evolving story as an example throughout, Story Genius takes you step-by-step from the first glimmer of an idea to an expansive, multilayered cause-and-effect blueprint--including fully realized scenes. By plumbing the nitty-gritty details of your raw idea to organically generate your story’s internal logic, meaning, and urgency, you’ll end up with a first draft that has the authority, richness, and command of a sixth or seventh","torrent":{"xt":"urn:btih:8dc6c2fea8740e5ee9fcd5a5eb1c2110256a5e3a","amp;dn":"Story+Genius+-+Lisa+Cron.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc6c2fea8740e5ee9fcd5a5eb1c2110256a5e3a","infoHashBuffer":{"type":"Buffer","data":[141,198,194,254,168,116,14,94,233,252,213,165,235,28,33,16,37,106,94,58]},"announce":[],"urlList":[]}}