{"title":"Bartels Media ShareMouse Enterprise v3.0.48","uid":15450393,"size":3751142,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8e819a87ac4cb69e8aabc6924e9c50fe90df364e&amp;dn=Bartels+Media+ShareMouse+Enterprise+v3.0.48&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LxByte","files":1,"time":1469936446,"description":"Bartels Media ShareMouse Enterprise v3.0.48\r\n\r\nShare your Mouse and Keyboard\r\nShareMouse lets you share your mouse and keyboard with multiple networked computers.\r\nJust move the mouse pointer to the computer you wish to control:\r\nIf the mouse reaches the border of any monitor, it magically jumps to the other computer and you can control that remote Mac or Windows PC.\r\nUnlike an KVM switch, there is no need to press any button or turn a switch.\r\nSimilar to a keyboard switch, you can seamlessly operate multiple computers on your desk from any mouse and keyboard.\r\n\r\nDrag &amp; Drop Files between Mac &amp; Windows\r\nShareMouse enables you to drag &amp; drop files between multiple computers:\r\nJust pick one or more files with the mouse and drag them to the monitor of the desired target computer.\r\nTransferring files between two computers never has been easier.\r\nClipboard Sharing\r\n\r\nShareMouse shares the clipboard between multiple computers:\r\nWhatever you copy into the clipboard of one computer can be sent to any other computer with a single key press.\r\n\r\nMac OSX and Windows cross-platform Solution\r\nShareMouse allows you to control a Mac from a PC:\r\nIt also works the other way round and you can control a PC from a Mac.\r\n\r\nSoftware KVM\r\nShareMouse is a KVM software which can save you from buying expensive hardware. A software KVM solution also has many benefits compared to a hardware PC switch.\r\nThere is no extra hardware required. ShareMouse uses your existing network connection.\r\n\r\nShare your keyboard with multiple computers\r\nShareMouse offers you keyboard sharing with multiple computers. The software works like a Network KVM, just without the monitor sharing.\r\n\r\nTwo Computers and one Keyboard\r\nShareMouse allows you to operate two computers with one keyboard and saves you from buying a USB switch. You can seamlessly control multiple computers with the input device of any other computer.\r\n\r\nTwo Computers and one Mouse\r\nShareMouse also includes mouse sharing, allowing you to operate two computers with one mouse. Unlike a physical mouse switch, ShareMouse doesn't require you to press any button. Instead, just move the mouse to the computer you wish to operate.\r\n\r\nOfficial Website: http://www.keyboard-and-mouse-sharing.com/","torrent":{"xt":"urn:btih:8e819a87ac4cb69e8aabc6924e9c50fe90df364e","amp;dn":"Bartels+Media+ShareMouse+Enterprise+v3.0.48","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e819a87ac4cb69e8aabc6924e9c50fe90df364e","infoHashBuffer":{"type":"Buffer","data":[142,129,154,135,172,76,182,158,138,171,198,146,78,156,80,254,144,223,54,78]},"announce":[],"urlList":[]}}