{"title":"Jewish Fundamentalism In Israel (2004) by Israel Shahak","uid":10167635,"size":831181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e8c49923882084275d83fb3d44552fe077b8913&amp;dn=Jewish+Fundamentalism+In+Israel+%282004%29+by+Israel+Shahak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1400365764,"description":"Jewish Fundamentalism In Israel [New Edition] (2004) by Israel Shahak &amp; Norton Mezvinsky.pdf\n\n\n'Illuminative, insightful and accessible, this is an important book that deserves as wide a readership as possible.' Ethnic Conflict Research Digest 'A first-class overview of the different fundamentalist movements . . . A fascinating and thought-provoking book.' Neue Zurcher Zeitung (Switzerland) 'Shahak and Mezvinsky's explicit objective is to rouse the reader, particularly the North American reader, into an acknowledgement that Jewish fundamentalism is as 'pernicious' as other fundamentalisms. This requires us to approach the Jewish past not as folk-tale, but as history.' Outlook 'Unlike all other English-language accounts [this] is frank and fiercely critical . . . A must-read for anyone interested in exploring the dark corners of an ideology that has an impact on international events.' Race and Class This is a new edition of a classic and highly controversial book that examines the history and consequences of Jewish Fundamentalism in Israel. Fully updated, with new chapters and a new introduction by Norton Mezvinsky, it is essential reading for anyone who wants a full understanding of the way religious extremism has affected the political development of the modern Israeli state. Acclaimed writer and human rights campaigner Israel Shahak was, up util his death in 2001, one of the most respected of Israel's peace activists - he was, in the words of Gore Vidal, 'the latest - if not the last - of the great prophets.' Written by Shahak together with American scholar Norton Mezvinsky, this books shows how Jewish fundamentalism in Israel, as shown in the activities of religious settlers, is of great political importance. The authors trace the history and development of Jewish fundamentalism. They place the assassination of Prime Minister Rabin in the context of what they see as a tradition of punishments and killings of those Jews perceived to be heretics.\n\n208 pages\nSeries: Pluto Middle Eastern Studies S\nPublisher: Pluto Press (July 20, 2004)\nLanguage: English\nISBN-10: 0745320902\nISBN-13: 978-0745320908","torrent":{"xt":"urn:btih:8e8c49923882084275d83fb3d44552fe077b8913","amp;dn":"Jewish+Fundamentalism+In+Israel+%282004%29+by+Israel+Shahak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e8c49923882084275d83fb3d44552fe077b8913","infoHashBuffer":{"type":"Buffer","data":[142,140,73,146,56,130,8,66,117,216,63,179,212,69,82,254,7,123,137,19]},"announce":[],"urlList":[]}}