{"title":"Lines in the Water - Nature and Culture at Lake Titicaca (Essay ","uid":9969448,"size":2420197,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8eefca5adeace1f6b9e7309750fa98d02b5b7c14&amp;dn=Lines+in+the+Water+-+Nature+and+Culture+at+Lake+Titicaca+%28Essay+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1397604612,"description":"2002 / English / 314 / 2 MB / pdf\n\n36 b/w photographs, 5 maps This beautifully written book weaves reflections on anthropological fieldwork together with evocative meditations on a spectacular landscape as it takes us to the remote indigenous villages on the shore of Lake Titicaca, high in the Peruvian Andes. Ben Orlove brings alive the fishermen, reed cutters, boat builders, and families of this isolated region, and describes the role that Lake Titicaca has played in their culture. He describes the landscapes and rhythms of life in the Andean highlands as he considers the intrusions of modern technology and economic demands in the region. Lines in the Water tells a local version of events that are taking place around the world, but with an unusual outcome: people here have found ways to maintain their cultural autonomy and to protect their fragile mountain environment. The Peruvian highlanders have confronted the pressures of modern culture with remarkable vitality. They use improved boats and gear and sell fish to new markets but have fiercely opposed efforts to strip them of their indigenous traditions. They have retained their customary practice of limiting the amount of fishing and have continued to pass cultural knowledge from one generation to the next--practices that have prevented the ecological crises that have followed commercialization of small-scale fisheries around the world. This book--at once a memoir and an ethnography--is a personal and compelling account of a research experience as well as an elegantly written treatise on themes of global importance. Above all, Orlove reminds us that human relations with the environment, though constantly changing, can be sustainable.\t","torrent":{"xt":"urn:btih:8eefca5adeace1f6b9e7309750fa98d02b5b7c14","amp;dn":"Lines+in+the+Water+-+Nature+and+Culture+at+Lake+Titicaca+%28Essay+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eefca5adeace1f6b9e7309750fa98d02b5b7c14","infoHashBuffer":{"type":"Buffer","data":[142,239,202,90,222,172,225,246,185,231,48,151,80,250,152,208,43,91,124,20]},"announce":[],"urlList":[]}}