{"title":"Baaba Maal - On The Road (Live Acoustic) [FLAC] TQMP","uid":5433899,"size":336756205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8ef77b795118c5452b544a05ab23a86302e133b4&amp;dn=Baaba+Maal+-+On+The+Road+%28Live+Acoustic%29+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pastafari","files":-1,"time":1268521765,"description":"Baaba Maal - 2008 - On The Road (Edition Bootleg Live Acoustic)\n2008\n\nA selection of Baaba Maal acoustic live. Expect no less than a gem.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nThere is a whole array of simply wonderful African singers out there on the world music scene today, but if I had to put one on the top of my list it would be Senegal's Baaba Maal. Maal's ability to take a phrase of music, turning it over until it's bright and shiny and then to deliver it in such a way to as to personify either unadulterated joy or sorrow is astonishing. Having gone several years without recording a new album, Baaba Maal's On the Road, a series of acoustic live versions of Maal favorites, is a welcomed offer for fans after the long silence.\n\nPooling eight sumptuous tracks from Maal's years in front of audiences, On the Road showcases the singer's signature sounds in a delightfully intimate fashion. Eschewing Maal's forays into the electric or the 70-piece orchestras, On the Road surrounds the listener with the refreshingly spare sound of acoustic simplicity, putting Maal's voice center stage. \n\nOpening with the easy charm of &quot;Baayo&quot; and making his way through such expertly intoxicating tracks like &quot;Fanta,&quot; with its sparkling shower of kora playing by the late Kaouding Cissoko, to the built up rolling rhythm of &quot;Farba&quot; to Maal's gentle wooing on &quot;Cherie,&quot; On the Road luxuriates in the bask of enthralled audiences who remain almost quietly spellbound but for the beginning and end of each track. \n\nThe real treats on this album include the never recorded &quot;Iyango&quot; and a rare version of &quot;Bamba.&quot; Fans who've worn out the cassette version of &quot;Farba&quot; now have a reason to rejoice as this gem was also included on the CD. Jamaican powerhouse guitarist Ernest Ranglin adds some of his hot licks to Maal's version of &quot;Koni,&quot; that simply thrums with Maal's vocals against Ranglin's expertise. On the Road is more than enough to tide over fans waiting Baaba Maal's next offering. \n\nOh, if only road music were always this good. \n-- WorldMusicCentral.org\n\nTracks\n01- Baayo\n02- Fanta\n03- Farba\n04- Iyango\n05- Koni (Featuring Ernest Ranglin)\n06- Africans Unite (Yolela)\n07- Cherie\n08- Bamba\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:8ef77b795118c5452b544a05ab23a86302e133b4","amp;dn":"Baaba+Maal+-+On+The+Road+%28Live+Acoustic%29+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ef77b795118c5452b544a05ab23a86302e133b4","infoHashBuffer":{"type":"Buffer","data":[142,247,123,121,81,24,197,69,43,84,74,5,171,35,168,99,2,225,51,180]},"announce":[],"urlList":[]}}