{"title":"Gerald Durrell- The Authorised Biography by Douglas Botting (ret","uid":11183914,"size":6098255,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f22b06353ab6dfa2f4f494d30b3f4acc8b68b36&amp;dn=Gerald+Durrell-+The+Authorised+Biography+by+Douglas+Botting+%28ret&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1412897691,"description":"Written with complete access to the Durrell family archives and Gerald Durrell's private papers, this affecting biography follows its subject from an eccentric boyhood in Imperial India to the international prominence he gained in print and on television as one of the world's foremost animal conservationists. The younger brother of the famous novelist Lawrence Durrell, Gerald always viewed his own writing - which includes thirty-seven bestsellers, among them enduringly popular classics like My Family and Other Animals and A Zoo in My Luggage - as the means of financing his greatest passion: breeding animals in danger of extinction and returning them to the wild. In the 1980s, with the production of a dozen different television documentary series on zoology, most notably the widely acclaimed Catch Me a Colobus and Ark on the Move, Durrell's conservationist vision reached audiences around the globe, while the zoo he founded on the island of Jersey realized his pioneering mission to breed endangered species in captivity. It stands as a living legacy of the much-admired Gerald Durrell, who died in 1995 at the age of seventy. &quot;Captivating and deeply moving but surprisingly candid biography.&quot; - Publishers Weekly (starred review); &quot;Ambitious.... Rich material for a biography.&quot; - New York Times Book Review; &quot;Affectionate yet clear-eyed portrait.... Botting does an excellent job of giving us Durrell the man, not merely the legend.&quot; - Toronto Globe &amp; Mail; &quot;Few current biographies read as well.&quot; - Denver Post.","torrent":{"xt":"urn:btih:8f22b06353ab6dfa2f4f494d30b3f4acc8b68b36","amp;dn":"Gerald+Durrell-+The+Authorised+Biography+by+Douglas+Botting+%28ret","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f22b06353ab6dfa2f4f494d30b3f4acc8b68b36","infoHashBuffer":{"type":"Buffer","data":[143,34,176,99,83,171,109,250,47,79,73,77,48,179,244,172,200,182,139,54]},"announce":[],"urlList":[]}}