{"title":"WHAT THE --?! 001-026 (1988-1993) (Marvel Comics) COMPLETE","uid":8612164,"size":366713308,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8f23ed06a17c406e67964477607c788006326f9a&amp;dn=WHAT+THE+--%3F%21+001-026+%281988-1993%29+%28Marvel+Comics%29+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1372166287,"description":"From Wikipedia, with lots of edits by STF:\n\nWhat The--?! was a Marvel Comics comic book series self-parodying the Marvel Universe, similar in vein to the 1960's series Not Brand Echh. It was billed as &quot;The Marvel mag of mirth and mayhem!&quot; The series was published irregularly for 26 issues from August 1988 through Winter 1993. It typically contained a series of short stories with comedic takes on Marvel heroes and villains, such as having Spider-Ham substitute for Spider-Man.\n\nWhat The--?! sometimes spotlighted a top artist or writer at the time, sometimes contributing works that spoof some of their all-time greatest successes. For example, in issue #2, John Byrne creates a tale pitting his work on the Fantastic Four franchise against his work with Superman. The issue has a Lex Luthor character complain about the changes Byrne made to the Superman legend after DC Comics' Crisis on Infinite Earths.\n\nThough it carried the Marvel Comics label on the front left corner, What The--?! touted itself as being published by &quot;Marble Comics&quot;. What The--?! parodied Marvel institutions such as the legendary Marvel Comics fan mail page, with staged articles called &quot;The Marble Mailbag&quot; and the &quot;What The... Mail&quot;. The title also did not contain any &quot;true&quot; advertisements. Instead, What The--?! hosted a number of fake advertisements that made fun of classic comic book advertisements such as Charles Atlas, novelty by-mail companies, and the Hostess snack food ads of the 1970s and 1980s.\n\nWhat The--?! was originally published as a four-issue limited series. The last issue closed with an appeal from Fred Hembeck for readers to write to Marvel if they wanted to see more of the comic. The next year, What The--?! returned for a one-shot special, resuming its numbering at issue #5. It was then published 4 times in 1990, 6 times in 1991, 9 times in 1992, and as 2 specials in 1993 before cancellation. The final issue introduced a futuristic spinoff of Peter Porker, Spider-Ham entitled &quot;Spider-Ham 1588 (Marked Down from 2099)&quot;.","torrent":{"xt":"urn:btih:8f23ed06a17c406e67964477607c788006326f9a","amp;dn":"WHAT+THE+--%3F%21+001-026+%281988-1993%29+%28Marvel+Comics%29+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f23ed06a17c406e67964477607c788006326f9a","infoHashBuffer":{"type":"Buffer","data":[143,35,237,6,161,124,64,110,103,150,68,119,96,124,120,128,6,50,111,154]},"announce":[],"urlList":[]}}