{"title":"Mormon Tabernacle Choir - Songs of the Civil War (1992) [V0 MP3]","uid":6993944,"size":124001614,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8f35dce7b56be259ac03c0bdebbb028acf2a2483&amp;dn=Mormon+Tabernacle+Choir+-+Songs+of+the+Civil+War+%281992%29+%5BV0+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rambam1776","files":-1,"time":1327799499,"description":"Songs of the Civil War &amp; Stephen Foster Favorites \n \nby Mormon Tabernacle Choir, album published in Jul 1992\n\n &lt;a href=&quot;\nhttp://bayimg.com/lAMpoaadD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/lAMpoaadD&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/songs-of-the-civil-war-stephen-foster-favorites-w142805&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/songs-of-the-civil-war-stephen-foster-favorites-w142805&lt;/a&gt;\n\n\n1\tTramp, Tramp, Tramp\t\t 3:23\n2\tAura Lee\t\t         3:37\n3\tThe Bonnie Blue Flag\t\t 1:56\n4\tHe\\'s Gone Away\t\t         3:29\n5\tThe Battle Cry of Freedom        3:54\n6\tLorena\t\t                 4:02\n7\tThe Battle Hymn of the Republic  4:51\n8\tTenting On the Old Campground\t 5:13\n9\tSweet Evelina\t\t         3:04\n10\tDixie\t                  \t 1:47 \n11\tKathleen Mavourneen\t\t 5:14\n12\tI Feel Like a Motherless Child   3:42\n13\tWhen Johnny Comes Marching Home\t 2:53\n14\tRing de Banjo\t\t         2:15\n15\tOh! Susanna\t                 1:52\n16\tOld Folks at Home\t\t 4:32\n17\tThe Glendy Burk\t\t         2:20\n18\tBeautiful Dreamer                4:03\n19\tJeanie with the Light Brown Hair 2:37\n20\tCamptown Races\t\t         2:17\n21\tMy Old Kentucky Home\t\t 4:59\n22\tNelly Bly\t\t         2:30\n\n\nPerhaps America\\'s best-known and longest-established large choral group, the Mormon Tabernacle Choir is known for its full sound and fervent expression in its stirring renditions of classical standards and evergreen Americana. \n\nUnder the leadership of Brigham Young, 148 members of the Mormon Church (The Church of Jesus Christ of Latter-day Saints, or LDS Church), seeking a place to pursue their unique religious beliefs without interference, found the Salt Lake basin and chose it as their site. One of the expressions of faith that had sustained them on their trip was their singing, and almost immediately after settling, they formed a choral group. The choir gave its debut performance on August 22, 1847, only 29 days after the Mormons\\' arrival in Utah. \n\nWithin two years John Parry had been named the choir\\'s first conductor, and the group has had an uninterrupted existence since then. It currently numbers around 330 members, all unpaid. The choir sings in and takes its name from the Mormon Tabernacle in Temple Square, Salt Lake City. The Tabernacle is the second building of that name, which designates a public meeting hall for the church. Thus it is distinct from the Temple, which is a place sacred to Mormons and open only to those who live by the precepts of the LDS church. The Tabernacle is a large, oval-shaped building with a unique domed roof. This unique roof is made of plaster and steamed, curved wooden planks lashed together with rawhide and wooden pegs. It was designed with clear acoustics in mind, so that a 6,500-member audience could hear speaking and music without difficulty in the days before electronic amplification. The building\\'s tour staff proudly shows off its acoustics by means of such demonstrations as dropping pins and tearing newspapers. \n\nWhen the present building opened on October 6, 1867, the Mormon Tabernacle Choir, by then at 150 voices the largest in the United States, gave a performance. It was accompanied by a fine 700-pipe organ, since rebuilt and enlarged and now boasting 11,623 pipes. The choir made its first official recording on September 1, 1910, for the Columbia label; of more than 130 recordings it has made since then, among the most celebrated is a 1959 recording of \\&quot;The Battle Hymn of the Republic\\&quot; with the Philadelphia Orchestra, which earned a Grammy Award. \n\nToday the choir performs weekly at 9:30 a.m. on Sundays, and these performances are broadcast on a radio program entitled \\&quot;Music and the Spoken Word.\\&quot; Broadcast continually since July 15, 1929, the program is the longest uninterrupted network run in American radio history. Both the choir\\'s Sunday morning concerts and its Thursday evening rehearsals are open to the public, as are regular organ recitals. \n\nThe Tabernacle has historically been the site of LDS church conferences, but has yielded that function to a facility north of Temple Square. The Tabernacle remains as a concert hall and place for special church meetings.","torrent":{"xt":"urn:btih:8f35dce7b56be259ac03c0bdebbb028acf2a2483","amp;dn":"Mormon+Tabernacle+Choir+-+Songs+of+the+Civil+War+%281992%29+%5BV0+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f35dce7b56be259ac03c0bdebbb028acf2a2483","infoHashBuffer":{"type":"Buffer","data":[143,53,220,231,181,107,226,89,172,3,192,189,235,187,2,138,207,42,36,131]},"announce":[],"urlList":[]}}