{"title":"Mistresses.US.S02E07.720p.HDTV.X264-DIMENSION","uid":10557019,"size":893786369,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8f79181e663197e4ca0c74a7284359c40f686653&amp;dn=Mistresses.US.S02E07.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Thhaque","files":1,"time":1405409125,"description":"[b]Mistresses\n\n[IMG]http://i.imgur.com/GiUNJLw.jpg[/IMG]\n\nCreators: K.J. Steinberg\nCast: Rochelle Aytes, Jes Macallan, Erik Stocklin, Alyssa Milano, Yunjin Kim, Brett Tucker, Jason George\nGenre: Drama, Thriller\nYear: 2013\nCountry: USA\nRuntime: 42 min\n\n.: Plot :.\nWelcome to a provocative and thrilling drama about the scandalous lives of a sexy and sassy group of four girlfriends, each on her own path to self-discovery, as they brave the turbulent journey together.\n\nMeet Savi (Alyssa Milano), a successful career woman working toward the next phase in her life -- both professional and personal -- simultaneously bucking for partner at her law firm while she and her husband, Harry (Brett Tucker), try to start a family of their own. Savi's free-spirited and capricious baby sister, Josselyn (Jes Macallan), couldn't be more different - living single, serial dating and partying, and regularly leaning on her big sister along the way. Their common best friend, April (Rochelle Aytes), a recent widow and mother of two, is rebuilding her life after tragedy and learning to move forward, with the support and guidance of her closest girlfriends. And friend Karen (Yunjin Kim), a successful therapist with her own practice, reconnects with the girls after her involvement in a complicated relationship with a patient goes far too deep.\n\n&quot;Mistresses&quot; is a salacious new drama about a group of friends caught in storms of excitement and self-discovery, secrecy and betrayal, and bound by the complex relationships they've created.[/b]\n\n[IMG]http://i.imgur.com/GQbVAJt.jpg[/IMG]","torrent":{"xt":"urn:btih:8f79181e663197e4ca0c74a7284359c40f686653","amp;dn":"Mistresses.US.S02E07.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f79181e663197e4ca0c74a7284359c40f686653","infoHashBuffer":{"type":"Buffer","data":[143,121,24,30,102,49,151,228,202,12,116,167,40,67,89,196,15,104,102,83]},"announce":[],"urlList":[]}}