{"title":"BBC Getting Our Way 1of3 PDTV x264 AC3 MVGroup","uid":5407536,"size":800867967,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:90584eb57c4b1acb454b61559db663a291502c7f&amp;dn=BBC+Getting+Our+Way+1of3+PDTV+x264+AC3+MVGroup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BasilBrush","files":1,"time":1267647115,"description":"BBC Getting Our Way 1of3 PDTV x264 AC3 MVGroup\n\nSir Christopher Meyer, former British Ambassador to the USA, presents a series telling the behind-the-scenes story of British diplomacy over 500 years of intrigue and adventure.\n\nPart 1: Security\nIn the opening episode, he puts himself in the shoes of diplomats battling to protect British national security at three very different stages of our history. From the Machiavellian days of Elizabethan espionage, he shows how the Virgin Queen's diplomat, Sir Henry Killigrew, foiled the Catholic terror on England's doorstep - as her ambassador to Scotland.\n\nAt the Congress of Vienna, arguably the most important summit in history, Foreign Secretary Lord Castlereagh survived the endless balls and bed-hopping to mastermind the redrawing of the map of Europe following Napoleon's defeat in a way that kept Britain safe and supreme for close to a century.\n\nAs British power waned in the 20th Century, there's a look at the crucial role played by one of Sir Christopher's predecessors in Washington, David Ormsby-Gore, in artfully manoeuvring to acquire nuclear weapons from a reluctant United States. This coup not only guaranteed Britain's security in the Cold War, but also its continuing place at the top table of nations.\n\nMeyer uses these examples to tease out the timeless essentials of diplomacy - the need for tact, patience, charm, cunning and a focus on helping Britain Get Her Way at all costs.\n\nInterviewees include Henry Kissinger, Douglas Hurd, Chris Patten, Alex Salmond, William Hague, JFK's speechwriter Ted Sorensen, Mrs Thatcher's foreign policy aide Charles Powell, former head of the FO Patrick Wright and 'the mandarins' mandarin', the late Sir Percy Cradock.\n\nMeyer concludes by arguing that a nation which loses sight of its interests and neglects its diplomacy is a nation lost.\n\nVideo Codec: x264 CABAC\nVideo Bitrate: 1600Kbps\nVideo Resolution: 704 x 400\nVideo Aspect Ratio: 1.760\nFrames per Second: 25\nAudio Codec: AC3\nAudio Bitrate: 192Kbps 48KHz\nAudio Languages: English\nRunTime Per Part: 59mins\nPart Size: 760MB\nNumber of Parts: 3\nSubtitles: Merged\nripped by: JungleBoy\nSource: DVB-T\n\nforums[dot]mvgroup[dot]org","torrent":{"xt":"urn:btih:90584eb57c4b1acb454b61559db663a291502c7f","amp;dn":"BBC+Getting+Our+Way+1of3+PDTV+x264+AC3+MVGroup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90584eb57c4b1acb454b61559db663a291502c7f","infoHashBuffer":{"type":"Buffer","data":[144,88,78,181,124,75,26,203,69,75,97,85,157,182,99,162,145,80,44,127]},"announce":[],"urlList":[]}}