{"title":"Jean Sibelius - Complete Symphonies (Simon Rattle)","uid":5140307,"size":1703679180,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:911e2f3c9ac7d00c95e3567f31523b0faa8b0e29&amp;dn=Jean+Sibelius+-+Complete+Symphonies+%28Simon+Rattle%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"eddie1969","files":-1,"time":1256855985,"description":"These recordings came out of a performed symphony cycle at a time when Sibelius had been a little bit in the background in British concert halls. The CBSO were beginning to be the rich and responsive instrument that they later became under Rattle's directorship and there was an excitement about any project that they undertook. I went to the series of Sibelius concerts they geve over a Bank Holiday weekend at Warwick Arts Centre (all this was pre Birmingham's Symphony Hall) and it was a bracing experience.\n\nBroadly speaking the interpretations from Symphony 3 onward are all very fine indeed, but the first two symphonies are a little spoiled by too much intervention from the conductor. Another reviewer has mentioned the special quality of Symphony 3 and I concur with this. I would also add that the even lesser played Symphony 6 receives a very noble performance in this set. Symphonies 5 and 7 are noble and Symphony 4 is very well judged - indeed slightly warmer in concept than many rivals of the period.\n\nI am sure that Rattle would do things differently now, and with the Berlin Philharmonic. This does not necessarily mean &quot;better&quot;, of course, for even in the first two symphonies there is much cogent thought behind the music making and, as I have said, symphonies 3 - 7 are amongst the best available.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:911e2f3c9ac7d00c95e3567f31523b0faa8b0e29","amp;dn":"Jean+Sibelius+-+Complete+Symphonies+%28Simon+Rattle%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"911e2f3c9ac7d00c95e3567f31523b0faa8b0e29","infoHashBuffer":{"type":"Buffer","data":[145,30,47,60,154,199,208,12,149,227,86,127,49,82,59,15,170,139,14,41]},"announce":[],"urlList":[]}}