{"title":"Webb Wilder - Town &amp; Country  [1995]  [Robbie60] [FLAC]","uid":6172481,"size":356768967,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9155ef3edb5a8e20e6c5f87c0f3f79a852cd0e0f&amp;dn=Webb+Wilder+-+Town+%26+Country++%5B1995%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297637621,"description":"Webb Wilder\nTown &amp; Country\n\nLabel: Watermelon Records\nReleased: 1995\nSource: Original CD \nSize Torrent: 340 MB\nFormat: FLAC\n\n\n\n\n\n\n&quot;...Kinda like we made a car tape to listen to as we drove across America, except we sang and played all the songs.&quot; \n\n~ Webb Wilder\n\n\n\n&quot;This album has two points... rock and roll and country. From a marketing point of view it was seven seconds ahead of its time!&quot; \n\n~ Webb Wilder\n\n\n\nWebb Wilder... The Man\n\nWho is Webb Wilder? A legendary &quot;A&quot; list musician, a B-movie film star, cool enough to have a Credo, a DJ formerly on XM Satellite radio, and an Electrifying Artist seen on MTV, CMT, and NPR. There is no beginning or end, just an eternal Webb.\n\nThere are roots rockers, and then there's Webb Wilder.\n\n   For over 20 years, Wilder has mined rock 'n' roll's most hallowed ground, but unlike so many others, he has approached it all with a rare irreverence and wit. His self-effacing persona-a tongue-in-cheek 1950's noir character, equal parts high school principal, tent preacher, and private detective-gives Wilder's music a sense of fun and imagination often lacking among his peers.\n\n   Judging from Wilder's most recent release, the DVD &quot;Tough it Out!&quot; and live CD &quot;Born to Be Wilder&quot;, a rocking time will be had by all (who attend their live shows). Captured live in 2005 by Jack Clarke and R.S. Field, these efforts captures Webb and Co. in fine form, thanks in no small part to Webb's crack band, featuring bassist Tom Comet, former Los Straitjackets drummer Jimmy Lester, and guitarists Tony Bowles and George &quot;The Tone Chaperone&quot; Bradfute.\n\n   A native of Hattiesburg, Mississippi, Wilder formed the Beatnecks in Nashville in 1985, with school chum Field. As Nashville moved toward unapologetically commercial fare, Wilder and Field were busy crafting their signature brand of rock 'n' roll, founded on the classic sounds of '50s hillbilly rhythm and blues. London may have had Rockpile, and L.A. may have had the Blasters, but Nashville had Webb.\n\n   And while many other proponents of American roots music simply stopped at Elvis and Chuck Berry, Wilder's music incorporated a British Invasion influence that further separated it from the pack. Years before the Raconteurs chose Music City as a base of operations for their Nuggets-inspired juggernaut, the Beatnecks were incorporating some of the same fuzztone-and-Farfisa inspiration into their music.\n\n   Wilder's debut, It Came From Nashville, seems even more unlikely now than it must have seemed then. A brazenly rocking bar-band rave-up (released on an indie before people used the word), the cover said it all: retro flying saucers zapping the Nashville skyline with laser beams, while the bespectacled Webb looked on under the brim of his trademark fedora. But this was not simply an exercise in camp; the record featured some first-class songwriting, like the R.S. Field tune &quot;How Long Can She Last (Goin' That Fast),&quot; and a seminal version of Steve Earle's &quot;Devil's Right Hand&quot;.   It Came From Nashville served as a statement of purpose, and became a touchstone for fans of real, unadulterated rock 'n' roll. Wilder's deadpan credo (&quot;Work hard, rock hard, eat hard, sleep hard, grow big, wear glasses if you need 'em&quot;) is still a rallying cry for the fans he made in those early years.\n\n   Through the years, Wilder's albums have continually maintained the high standard set by the first. Time after time, producer, writer, and all-around conspirator Field has stepped up to the plate with songs like &quot;Human Cannonball&quot; and &quot;The Rest (Will Take Care of Itself),&quot; while the Beatnecks have tackled the material with an energy and expertise that make Wilder's six albums textbooks for aspiring roots rockers. And throughout it all, Webb has been ringleader, spokesperson, front man, and proselytizer - an evangelist for real rock 'n' roll.\n\n   Proving he's far too mischievous to be contained by any one medium, Wilder has applied his touch to the independent film world as well. His short '50s noir parodies, Horror Hayride, Aunt Hallie, and Private Eye (compiled on 1992's Corn Flicks), are the cinematic extension of Webb's music-hilarious and affectionate send-ups of B-movie Americana. Part sci-fi and part P.I., the movies have become cult classics. The latest in this series, Scattergun, is due for public release in 2008, and finds Wilder returning to his role of private detective in a small Southern town.\n\n   Singer, guitarist, bandleader, filmmaker, humorist-Webb Wilder may be roots-rock's only true Renaissance man, and not to be missed.\n\n&quot;Work hard, rock hard, eat hard, sleep hard,\ngrow big, wear glasses if you need 'em.&quot;\n\n\n\nPersonnel\n\n\nWebb Wilder: vox, guitar \nLes James Lester: drums, percussion, vox \nGeorge Bradfute: guitars, organ, vox \nKelly v.i.c. Looney: bass guitar, vox \n\n\n\nAdditional Personnel\n\nThe Bagman: organ and electric piano \nThe Ionizer: guitar, percussion, keys \n\n\n\n\nTrack Listing\n\n1 Stay Out Of Automobiles \n2 Nashville Bum \n3 Slow Death \n4 (I'm A) Lover Not A Fighter \n5 To The Loving Public (spoken) \n6 Honky Tonk Hell \n7 My Mind's Eye \n8 Too Many Rivers \n9 Goldfinger \n10 Hissy-Fit (spoken) \n11 Talk-Talk \n12 Streets of Laredo\n(The Cowboy's Lament) \n13 Short On Love \n14 I Ain't Living Long Like This \n15 Original Mixed-up Kid \n16 Rockin' Little Angel \n","torrent":{"xt":"urn:btih:9155ef3edb5a8e20e6c5f87c0f3f79a852cd0e0f","amp;dn":"Webb+Wilder+-+Town+%26+Country++%5B1995%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9155ef3edb5a8e20e6c5f87c0f3f79a852cd0e0f","infoHashBuffer":{"type":"Buffer","data":[145,85,239,62,219,90,142,32,230,197,248,124,15,63,121,168,82,205,14,15]},"announce":[],"urlList":[]}}