{"title":"Amadeus Mozart (US) (1995)","uid":14483771,"size":329148478,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:91a337f39843708f9bc5d0b016b9cb87e6ec39ce&amp;dn=Amadeus+Mozart+%28US%29+%281995%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"distinc","files":1,"time":1462047847,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=9443119820\r\n \nhttp://imagedisco.net/?g=4581838390\r\n\r\n\r\nPlot:\r\n\r\nYou've undoubtedly heard of the famous classical composer Mozart, but you may not be fully aware as to why he was so damn good on the harpsichord. you see, more important than Mozart's love for music was his lust for the opposite sex, and making music was simply his way of getting beautiful babes to make love-- to him. but he wasn't without his rivals, other oversexed prodigies who also knew how to use their talents to seduce the most beautiful women in Europe- including the queen! Who'd have thought that those guys in their powdered wigs and dandy costumes were getting so much ass.\r\n\r\n\r\nMozart (Backey Jackic) creates harmonies that cause hot flashes. He's never less than a randy rondeau away from driving women insane! He'll bang anything in a velvet skirt, from Queen Kelly Trump (&quot;Play more, maestro - I wet myself with pleasure!&quot;) to her chambermaid, Deborah Wells. The blissed-out ladies gladly suck his cock in 4/4 time and dance the anal minuet. If you thought F. Murray Abraham was a card, wait 'til you see the histrionics of this Mozart's Salieri, essayed by Valentino. His Vienna sausage works overtime in order to one-up the boy genius. Valentino's a sturdy guy who performs a standing fuck with ease. D'Amato's got the costumes 'n' castle thing down pat; perhaps a little too pat. Breathtaking as all that lace and mortar may be, it's just trimmings. The sexual performances, while certainly explicit and nasty (plenty of d.p.'s and loads to the lips) rarely reek of unbridled passion","torrent":{"xt":"urn:btih:91a337f39843708f9bc5d0b016b9cb87e6ec39ce","amp;dn":"Amadeus+Mozart+%28US%29+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91a337f39843708f9bc5d0b016b9cb87e6ec39ce","infoHashBuffer":{"type":"Buffer","data":[145,163,55,243,152,67,112,143,155,197,208,176,22,185,203,135,230,236,57,206]},"announce":[],"urlList":[]}}