{"title":"The Pulse of Mixed Media (gnv64)","uid":8598043,"size":23789959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91a93fd2c9f6cb253e37087e7d03211c25cc6787&amp;dn=The+Pulse+of+Mixed+Media+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"gnv65","files":-1,"time":1371808106,"description":"The Pulse of Mixed Media: Secrets and Passions of 100 Artists Revealed \nby Seth Apter\nNorth Light Books | March 2012|  ISBN-10: 144031070X | ePUB/PDF | 5.93 /16.7 mb &lt;a href=&quot;\nhttp://www.amazon.com/The-Pulse-Mixed-Media-Passions/dp/B00ANYSXV6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Pulse-Mixed-Media-Passions/dp/B00ANYSXV6&lt;/a&gt;\n\nListen closely...can you hear it?\nCan you hear the voices? Thoughts, insights, confessions from the creative community sharing ideas, trading secrets, venting frustrations; asking and answering questions such as, &quot;What color rarely shows up in your work?&quot; or &quot;How do you express vulnerability in your art?&quot; Or &quot;What is one current trend that you wish would go away?&quot; As artists, we are curious by nature and there is a longing to see inside the hearts and minds of artistic souls of our own kind. That is the beat of our lives - The Pulse of Mixed Media!\n\nIn this book - a complex survey of artists around the globe - there is much for you to discover:\n- Visual Insights: Many questions are answered not only in words, but often through visual art, and include self-portraits from 31 spotlight artists such as Pam Carriker, Danny Gregory and Judy Wise.\n- A diverse sampling of provocative questions: Over 100 artists share their thoughts on everything from color, media and tools, to emotions, secrets and self-revelations.\n- Insightful sidebar statistics: Data from thousands of participants collected through polls on the author's blog reveal a remarkable analysis of the creative community at large.\n\nIndulge your inner voyeur and soak up some inspiration with The Pulse of Mixed Media today!\n\nAbout the Author &lt;a href=&quot;\nhttp://imageshack.us/a/img163/2512/iaeq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageshack.us/a/img163/2512/iaeq.jpg&lt;/a&gt;\nSeth Apter is a mixed-media artist, author and instructor in New York City. His artwork has been exhibited widely in the United States and Canada and published in numerous websites, independent zines, books and magazines such as Cloth Paper Scissors, Artful Blogging, Somerset Studio, and CPS Studios. He is very active in the creative community, and the voice behind The Altered Page, a visual journal of his own artwork, photography and collaborative projects, as well as a showcase for artists he admires and his creative experiences in NYC. His first book, The Pulse of Mixed Media: Secrets and Passions of 100 Artists Revealed, was released by North Light Books in March 2012. He can also be found on two mixed media workshop DVDs, released in June 2012 by North Light Media and is currently working on his second book, due to be released in December 2013.","torrent":{"xt":"urn:btih:91a93fd2c9f6cb253e37087e7d03211c25cc6787","amp;dn":"The+Pulse+of+Mixed+Media+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91a93fd2c9f6cb253e37087e7d03211c25cc6787","infoHashBuffer":{"type":"Buffer","data":[145,169,63,210,201,246,203,37,62,55,8,126,125,3,33,28,37,204,103,135]},"announce":[],"urlList":[]}}