{"title":"Satellite Reign Build 0.83","uid":12150074,"size":860623986,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:91dda66894578c884ecc48410640a56a40c45b2f&amp;dn=Satellite+Reign+Build+0.83&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dauphong","files":1,"time":1437599906,"description":"About This Game\nSatellite Reign is a real-time, class-based strategy game, set in an open-world cyberpunk city. You command a group of 4 agents through rain-soaked, neon-lit streets, where the law is the will of mega-corporations. Use your agents to sneak, shoot, steal, and sabotage your way up the corporate ladder, and take control of the most powerful monopoly of all time.\n\nEach of your agents can be tailored toward your favoured play-style, while still maintaining their own unique specialisations. Shape your team into an offensive war machine, or an elite covert spec-ops outfit, and take the open-world city as your own.\nOpen World\nThe city of Satellite Reign is one big, open playground. No individual levels to pick between, the whole world can be explored seamlessly. Uncover new missions while you explore, and pick and choose which objectives you want to tackle.\nCustomise your Team\nEach of your four agents can be tailored to suit your play style. Choose their skills, weapons, gear, augmentations, and even their genetic base by cloning exceptional individuals from the general population.\nMultiple Strategies\nThere's no 'right-way' to complete your objectives. The world has been designed to facilitate emergent gameplay, allowing you to choose from and combine a wide range of strategic options. Sneak in through ventilation shafts, hack doors, take out power generators, hijack the minds of guards, or just blow the front door down. Countless opportunities await","torrent":{"xt":"urn:btih:91dda66894578c884ecc48410640a56a40c45b2f","amp;dn":"Satellite+Reign+Build+0.83","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91dda66894578c884ecc48410640a56a40c45b2f","infoHashBuffer":{"type":"Buffer","data":[145,221,166,104,148,87,140,136,78,204,72,65,6,64,165,106,64,196,91,47]},"announce":[],"urlList":[]}}