{"title":"[SoM]Mio cugino Vincenzo[DvdRip-Divx5-Ita-Mp3]","uid":4392229,"size":727687968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9228ba80cb818207a720cb0db4edfc00e83b2a33&amp;dn=%5BSoM%5DMio+cugino+Vincenzo%5BDvdRip-Divx5-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mitimex","files":1,"time":1221240663,"description":"Mentre viaggiano attraverso l&amp;#039;Alabama, Billy Gambini e Stan Rothenstein dimenticano di pagare una scatoletta di tonno in un negozio. I due risalgono sulla loro auto e ripartono, ma poco dopo il proprietario del negozio viene ucciso da due uomini molto somiglianti a loro, cosÃƒÂ¬ i due ragazzi vengono arrestati. In carcere, credendo di essere accusati del furto della scatoletta, vengono interrogati da una guardia che fa loro domande ambigue e non parla loro dell&amp;#039;omicidio, cosÃƒÂ¬ si dichiarano colpevoli. Quando si rendono conto della loro posizione (rischiano la pena di morte) i due ragazzi capiscono di non potersi permettere un legale, ma quando Billy telefona a casa, viene a sapere che suo cugino Vincenzo ÃƒÂ¨ avvocato e puÃƒÂ² difendere lui e Stan gratuitamente. Il problema ÃƒÂ¨ che Vincenzo non ha esperienza di processi perchÃƒÂ© ha superato solo da poco, al sesto tentativo, l&amp;#039;esame di iscrizione all&amp;#039;albo.\nIl modo di fare di Vincenzo gli attira una forte antipatia dal giudice Haller, per via della sua ignoranza delle procedure; per questo per ben due volte durante le udienze preliminari viene condannato per vilipendio alla corte, ÃƒÂ¨ incarcerato e liberato solo dietro al pagamento della cauzione. Gradualmente, Vincenzo capisce il meccanismo dei processi, e grazie all&amp;#039; aiuto della sua fidanzata, Mona Lisa Vito, esperta di meccanica, riesce a guadagnarsi la fiducia dell&amp;#039;aula e del giudice, e a scagionare i ragazzi. Il film si conclude con Vincenzo che ritorna a New York, quasi scappando, poichÃƒÂ© aveva fornito al giudice Haller come referenza sulla sua carriera il nome di un celebre avvocato newyorchese morto.\n","torrent":{"xt":"urn:btih:9228ba80cb818207a720cb0db4edfc00e83b2a33","amp;dn":"%5BSoM%5DMio+cugino+Vincenzo%5BDvdRip-Divx5-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9228ba80cb818207a720cb0db4edfc00e83b2a33","infoHashBuffer":{"type":"Buffer","data":[146,40,186,128,203,129,130,7,167,32,203,13,180,237,252,0,232,59,42,51]},"announce":[],"urlList":[]}}