{"title":"Logic_Works.rar","uid":3669292,"size":7105373,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:92b201c9eb57caa26434b268e3d54975aee7ec92&amp;dn=Logic_Works.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"aentrop","files":1,"time":1177121243,"description":"Logic Works 4 \n\nWhat is LogicWorks?\n\nLogicWorks is an interactive circuit design tool intended for teaching and learning digitial logic. No other software tool makes digital design easier, faster or more interactive than LogicWorks. The package gives you the power, speed and flexibility to create and test an unlimited number of circuit elements on-screen.  This means that you can study advanced concepts much more quickly and clearly using on-screen simulation than you can by spending time wiring up expensive and damage-prone parts in a lab.   LogicWorks is so easy to use that students will be creating and testing circuits in a matter of minutes, instead of spending precious lab time just getting started.\n\nLogicWorks includes a full schematic editor with bussing, multi-level Undo/Redo, interactive connection tracing, and many other powerful features.  This is coupled with the unique, interactive digital simulator.  Changes made to signal connections or device paramters on the screen are immediately reflected in the timing waveforms and probes placed right on the diagram.\n\nLogicWorks is upwardly compatible with Capilano&amp;#039;s professional package, DesignWorks. This means that students can use their own copy of LogicWorks on their Windows-based or Macintosh home computer and then bring designs in to the more powerful DesignWorks package in the lab for integration, analysis and testing.\nFEATURES\nSchematic Editing\n\tFull Cut, Copy and Paste of any group of circuit elements.\n\tAutomatically detects signal line connections.\n\tPlace your own text notations on the diagram.\n\tAutomatically reroutes lines at right angles when you move symbols.\n\tBussing feature allows you to group any collection of signals into a single bus line.\n\tVery simple diagram editing: most symbol placement and wire editing operations do not even require a menu selection.\n\tCreate your own device symbols and customize their simulation function by defining an internal circuit using any existing components.\n\tSpecial power and ground symbols automatically create connections and generate the correct simulation values.\n\tPop-up menus give you direct access to common commands from anywhere on the diagram.\nSimulation\n\tDisplay any number of signals simulataneously in the timing diagram.\n\tGroup any collection of signals into a single timing trace with value displayed in hex.\n\tThorough library of built-in primitive simulation elements for all common digital elements.\n\tAll primitive logic elements are scalable, allowing, for example, 56-input gates or 17-bit counters to be constructed as a single element.\n\tSet arbitrary delay values on any device or pin.\n\tBuilt-in support for RAMs, ROMs and PLAs.\n\tSophisticated multi-state simulation supports high and low drive levels, &quot;don&amp;#039;t know&quot; values, three-state and wired-AND logic.\nSupport\n\tFree updates and supplements via Internet.\n\tThorough 400+ page printed manual.\n\n","torrent":{"xt":"urn:btih:92b201c9eb57caa26434b268e3d54975aee7ec92","amp;dn":"Logic_Works.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b201c9eb57caa26434b268e3d54975aee7ec92","infoHashBuffer":{"type":"Buffer","data":[146,178,1,201,235,87,202,162,100,52,178,104,227,213,73,117,174,231,236,146]},"announce":[],"urlList":[]}}