{"title":"Scientific Basis for Ayurvedic Therapies (7Summits)","uid":5670199,"size":9157280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92b725673dd3d2617a97c8b49772d25dac1f9f20&amp;dn=Scientific+Basis+for+Ayurvedic+Therapies+%287Summits%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"7_summits","files":-1,"time":1278312903,"description":"Publisher: CRC Press, 2003 | ISBN: 084931366X | 602pages | PDF | 8.7MB\n\n\nArguably the oldest form of health care, Ayurveda is often referred to as the &quot;Mother of All Healing.&quot; Although there has been considerable scientific research done in this area during the last 50 years, the results of that research have not been adequately disseminated. Meeting the need for an authoritative, evidence-based reference, Scientific Basis for Ayurvedic Therapies is the first book to analyze and synthesize current research supporting Ayurvedic medicine.This book reviews the latest scientific information, evaluates the research data, and presents it in an easy to use format. The editor has carefully selected topics based on the availability of scientific studies and the prevalence of a disease. With contributions from experts in their respective fields, topics include Ayurvedic disease management, panchkarma, Ayurvedic bhasmas, the current status of Ayurveda in India, clinical research design, and evaluation of typical clinical trials of certain diseases, to name just a few.While there are many books devoted to Ayurveda, very few have any in-depth basis in scientific studies. This book provides a critical evaluation of literature, clinical trials, and biochemical and pharmacological studies on major Ayurvedic therapies that demonstrates how they are supported by scientific data. Providing a natural bridge from Ayurveda to Western medicine, Scientific Basis for Ayurvedic Therapies facilitates the integration of these therapies by health care providers.","torrent":{"xt":"urn:btih:92b725673dd3d2617a97c8b49772d25dac1f9f20","amp;dn":"Scientific+Basis+for+Ayurvedic+Therapies+%287Summits%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b725673dd3d2617a97c8b49772d25dac1f9f20","infoHashBuffer":{"type":"Buffer","data":[146,183,37,103,61,211,210,97,122,151,200,180,151,114,210,93,172,31,159,32]},"announce":[],"urlList":[]}}