{"title":"Janice H. Laurence - The Oxford Handbook of Military Psychology ","uid":10091609,"size":2773343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:932faf907fb10b3519cb1bc23ce259ba5e26fefa&amp;dn=Janice+H.+Laurence+-+The+Oxford+Handbook+of+Military+Psychology+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1399209730,"description":"Description\nProduct Details\nBook Title: The Oxford Handbook of Military Psychology (Oxford Library of Psychology)\t\nBook Author: Janice H. Laurence, Michael D. Matthews\nSeries: Oxford Library of Psychology\nHardcover: 432 pages\nPublisher: Oxford University Press; 1 edition (February 24, 2012)\nLanguage: English\nISBN-10: 0195399323\nISBN-13: 978-0195399325\n\n===================================================================================\nBook Description\nPublication Date: February 24, 2012 | ISBN-10: 0195399323 | ISBN-13: 978-0195399325 | Edition: 1\nThe critical link between psychology and the military is important to recruiting, training, socializing, assigning, employing, deploying, motivating, rewarding, maintaining, managing, integrating, retaining, transitioning, supporting, counseling, and healing military members. These areas are hardly distinct, and the chapters in The Oxford Handbook of Military Psychology have contents that cross these boundaries.\nCollectively, the topics covered in this volume describe the myriad ways in which modern psychology influences warfare and vice versa. The extensive topics included come from within the areas of clinical, industrial/organizational, experimental, engineering, and social psychology. The contributors are top international experts in military psychology -- some uniformed soldiers, others academics and clinicians, and others civilian employees of the military or other government agencies. They address important areas in which the science and practice of psychology supports military personnel in their varied and complex missions.\nAmong the topics addressed here are suitability for service, leadership, decision making, training, terrorism, socio-cultural competencies, diversity and cohesion, morale, quality-of-life, ethical challenges, and mental health and fitness. The focus is the ways in which psychology promotes the decisive human dimension of military effectiveness. Collectively, the 25 topical chapters of this handbook provide an overview of modern military psychology and its tremendous influence on the military and society as a whole.\n\n===================================================================================\nAbout the Authors\nJanice H. Laurence, Ph.D., is Associate Professor of Adult &amp; Organizational Development, Temple University, and editor of the journal Military Psychology. Dr. Laurence recently retired as Director, Research and Analysis, Office of the Under Secretary of Defense, Personnel &amp; Readiness, Pentagon.\nMichael D. Matthews, Ph.D., is Professor of Psychology, Behavioral Sciences and Leadership, U.S. Military Academy.\n===================================================================================","torrent":{"xt":"urn:btih:932faf907fb10b3519cb1bc23ce259ba5e26fefa","amp;dn":"Janice+H.+Laurence+-+The+Oxford+Handbook+of+Military+Psychology+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"932faf907fb10b3519cb1bc23ce259ba5e26fefa","infoHashBuffer":{"type":"Buffer","data":[147,47,175,144,127,177,11,53,25,203,27,194,60,226,89,186,94,38,254,250]},"announce":[],"urlList":[]}}