{"title":"Framing a Legend: Thomas Jefferson &amp; Sally Hemings (2013)","uid":10160717,"size":1217135,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:944aec8d85450ecc3fc7c9646e7ba680d7c7235b&amp;dn=Framing+a+Legend%3A+Thomas+Jefferson+%26amp%3B+Sally+Hemings+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tonguefu","files":-1,"time":1400198607,"description":"Framing a Legend - Exposing the Distorted History of Thomas Jefferson and Sally Hemings (2013) by M. Andrew Holowchak.epub\n\nA penetrating critical perspective on the question of Thomas Jefferson's paternity that will make you rethink recent conventional wisdom.\n\nIt is accepted by most scholars that Jefferson had a lengthy affair with his slave Sally Hemings and fathered at least one of her children, a conclusion based on a 1998 DNA study published in Nature and on the work of historian Annette Gordon-Reed. Framing a Legend argues compellingly that the DNA evidence is inconclusive and that there are remarkable flaws in the leading historical scholarship purporting to show such a liaison.\n\nAuthor M. Andrew Holowchak critically examines well-known books by Fawn Brodie, Annette Gordon-Reed, and Andrew Burstein, labeling their views as &quot;three prominent spins.&quot; He then delves into what we know about Thomas Jefferson's character, showing that the historical facts do not suggest any romantic interest on Jefferson's part in his female slaves. Turning to the genetic evidence, Holowchak points out that, though DNA analysis indicates the presence of a Y-chromosome from some Jefferson male in the Hemings family line, it is unwarranted to conclude that this must have come from Thomas Jefferson.\n\nFinally, he discusses Jefferson's racial attitudes and says that they argue against any liaison with Sally Hemings.\n\n275 pages\nPublisher: Prometheus Books (April 16, 2013)\nLanguage: English\nISBN-10: 1616147296\nISBN-13: 978-1616147297","torrent":{"xt":"urn:btih:944aec8d85450ecc3fc7c9646e7ba680d7c7235b","amp;dn":"Framing+a+Legend%3A+Thomas+Jefferson+%26amp%3B+Sally+Hemings+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"944aec8d85450ecc3fc7c9646e7ba680d7c7235b","infoHashBuffer":{"type":"Buffer","data":[148,74,236,141,133,69,14,204,63,199,201,100,110,123,166,128,215,199,35,91]},"announce":[],"urlList":[]}}