{"title":"Felicia inainte de toate 2009","uid":6155821,"size":1373115644,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9453fa2760c79d29e8fbedf116792102eac9cb3f&amp;dn=Felicia+inainte+de+toate+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"huvudverk","files":-1,"time":1297031938,"description":"\nFelicia inainte de toate (2009)\n(First of All, Felicia)\n\nTvRip\n &lt;a href=&quot;\nhttp://www.feliciafilmul.ro/First_of_All_Felicia/-.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.feliciafilmul.ro/First_of_All_Felicia/-.html&lt;/a&gt;\n\ngen: drama\n\nCand a fugit la 18 ani din Romania, urmand sfatul mamei ei, cu putin inainte de Revolutie, Felicia Mateescu (casatorita ulterior Reinhart in Olanda) si-a imaginat viitorul putin diferit.\n \nDupa 17 ani, cu un copil in urma mariajului, divortata si singura, Felicia continua sa vina in fiecare an in Romania sa-si viziteze familia. Parintii, la randul lor, nu mai sunt tineri.\n \nTatal este destul de bolnav si are impresia ca fiecare revedere cu Felicia este si ultima, mama si-a canalizat vina de a isi fi sfatuit fata sa plece si afectiunea pentru ea in cumparatul mancarii si pregatitul meselor, iar Iulia, sora Feliciei, are o viata absolut normala in tara, viata pe care Felicia o invidiaza.\n \nIn dimineata plecarii, dupa un mic dejun trist de despartire, in care Felicia are sentimentul clar ca isi vede tatal pentru ultima oara, Felicia trebuie sa ia taxiul spre aeroport. Orasul este aglomerat si Felicia pierde avionul.\n \nIsi petrece ziua in aeroport, incercind sa-si rezerve un nou zbor, ingrijorata ca nu o sa ajunga la timp inapoi in Olanda sa-si ia copilul din tabara, suparata ca fostul ei sot nu poate sa o sprijine (pentru ca are acum o alta familie) si iritata de prezenta mamei care, plina de bune intentii, incearca sa o sustina moral, cicalind-o.\n \nLa capatul unei dupa-amiezi epuizante, Felicia alege sa zboare a doua zi si sa lase in grija fostului sot responsabilitatea luarii lui Marc din tabara. Familia se bucura ca Felicia urmeaza sa mai petreaca o seara acasa, tatal vede in asta un cadou neasteptat, dar Felicia decide sa scoata la suprafata toate problemele familiei, acumulate in ultimii 17 ani.\n\nvideo:    Xvid, 720x400, 25 fps\naudio:    AC3, stereo, 192 kbps\nduration: 01:56:06.880\n\nlanguage: romanian\n\npls seed!","torrent":{"xt":"urn:btih:9453fa2760c79d29e8fbedf116792102eac9cb3f","amp;dn":"Felicia+inainte+de+toate+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9453fa2760c79d29e8fbedf116792102eac9cb3f","infoHashBuffer":{"type":"Buffer","data":[148,83,250,39,96,199,157,41,232,251,237,241,22,121,33,2,234,201,203,63]},"announce":[],"urlList":[]}}