{"title":"Influx By Daniel Suarez","uid":9680661,"size":1624132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94777a773f72122ec08e0425a57925f800a36485&amp;dn=Influx+By+Daniel+Suarez&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"maxdesolate","files":4,"time":1393664462,"description":"The New York Times bestselling author of Daemon --&quot;the cyberthriller against which all others will be measured&quot; -Publishers Weekly) --imagines a world in which decades of technological advances have been suppressed in an effort to prevent disruptive change.\n\nAre smart phones really humanity's most significant innovation since the moon landings? Or can something else explain why the bold visions of the 20th century--fusion power, genetic enhancements, artificial intelligence, cures for common disease, extended human life, and a host of other world-changing advances--have remained beyond our grasp? Why has the high-tech future that seemed imminent in the 1960's failed to arrive?\n\nPerhaps it did arrive...but only for a select few.\n\nParticle physicist Jon Grady is ecstatic when his team achieves what they've been working toward for years: a device that can reflect gravity. Their research will revolutionize the field of physics--the crowning achievement of a career. Grady expects widespread acclaim for his entire team. The Nobel. Instead, his lab is locked down by a shadowy organization whose mission is to prevent at all costs the social upheaval sudden technological advances bring. This Bureau of Technology Control uses the advanced technologies they have harvested over the decades to fulfill their mission.\n\nThey are living in our future.\n\nPresented with the opportunity to join the BTC and improve his own technology in secret, Grady balks, and is instead thrown into a nightmarish high-tech prison built to hold rebellious geniuses like himself. With so many great intellects confined together, can Grady and his fellow prisoners conceive of a way to usher humanity out of its artificial dark age?\n\nAnd when they do, is it possible to defeat an enemy that wields a technological advantage half a century in the making?\n\nepub and mobi. ","torrent":{"xt":"urn:btih:94777a773f72122ec08e0425a57925f800a36485","amp;dn":"Influx+By+Daniel+Suarez","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94777a773f72122ec08e0425a57925f800a36485","infoHashBuffer":{"type":"Buffer","data":[148,119,122,119,63,114,18,46,192,142,4,37,165,121,37,248,0,163,100,133]},"announce":[],"urlList":[]}}