{"title":"Pageant (2008) Miss Gay America Documentary","uid":8517701,"size":624989205,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:94d861d2b1ae14523aab34fc280653e192f9aee3&amp;dn=Pageant+%282008%29+Miss+Gay+America+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1369802487,"description":"Available in .FLV.\n\nPageant was a 2008 documentary film directed and produced together by Ron Davis and Stewart Halpern. The film explored the behind-the-scenes dramas and realities of the 34th Miss Gay America Contest. The film's central theme was the universal desire to be beautiful, noticed and chosen. The film garnered 10 film festival awards before airing on the Sundance Channel in 2010.\n\n\nWhile some reviewers, such as Martin Tsai from The Village Voice felt that the film only skimmed along the surface insanity saying that &quot;filmmakers Ron Davis and Stewart Halpern-Fingerhut's treatment is only skin-deep, eschewing any exploration of gender politics or psychological effects induced by the ubiquitous ugly-duckling-turned-swan narrative.&quot; Other reviewers such as Nathan Lee in the New York Times felt that it was &quot;not without its charm, and it's touching, in a goofy sort of way, to see how seriously everyone takes it.&quot; George Williamson in An Eye for Film described it as &quot;... an entertaining portrait of some wonderfully larger than life characters, a mind blowing amount of effort and an incredible desire to win.&quot; Audience reviews were generally positive. Michael Klemm from Cinemaqueer recommended it saying &quot;If you just want a good time, you can't go wrong with Pageant. Anyone who likes to indulge their inner divas should be enthralled.&quot; Rotten Tomatoes posted an 85% approval rating.\n\n\nWinner, Audience Award, Best Documentary Frameline 32\nWinner, Audience Award, Best Documentary, Florida Film Festival\nOfficial Selection, Slamdance Festival\nWinner, Best Documentary, Fresno Reel Pride\nWinner, Best Documentary, Outflix Film Festival\nWinner, Best Documentary, Chicago Image Out festival\nWinner, Best Documentary, Honolulu Rainbow Festival\nWinner, Audience Award, Best Feature, Fire Island Film and Video\nWinner, Jury Award, Best Documentary, Reelings 2008\nWinner, Audience Award, Best Documentary Rochester ImageOut Festival\n\nFor those who are interested in this because of RuPaul's Drag Race, Alyssa Edwards is featured after 56-57 minutes of the documentary, while Victoria Porkchop Parker is shown all throughout the entire documentary.\n\nALWAYS AND FOREVER ALYSSA EDWARDS","torrent":{"xt":"urn:btih:94d861d2b1ae14523aab34fc280653e192f9aee3","amp;dn":"Pageant+%282008%29+Miss+Gay+America+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d861d2b1ae14523aab34fc280653e192f9aee3","infoHashBuffer":{"type":"Buffer","data":[148,216,97,210,177,174,20,82,58,171,52,252,40,6,83,225,146,249,174,227]},"announce":[],"urlList":[]}}