{"title":"Hells Angels (1930) - Howard Hughes","uid":9427492,"size":2829242068,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9513633ef0786c9a716055495f8e123e89bbc848&amp;dn=Hells+Angels+%281930%29+-+Howard+Hughes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"classic_films","files":-1,"time":1388736187,"description":"Brothers Monte and Ray leave Oxford to join the Royal Flying Corps. Ray loves Helen; Helen enjoys an affair with Monte; before they leave on their mission over Germany they find her in still another man's arms.\n\n-------\n\nHell's Angels is a 1930 American war film, directed by Howard Hughes and starring Jean Harlow, Ben Lyon, and James Hall. The film, which was produced by Hughes and written by Harry Behn and Howard Estabrook, centers on the combat pilots of World War I. It was released by United Artists and, despite its initial poor performance at the box office, eventually earned its production costs twice over.\n\nOriginally shot as a silent film, Hughes retooled the film over a lengthy gestation period. Most of the film is in black and white, but there is one color sequence - the only color footage of Harlow's career. Hell's Angels is now hailed as one of the first sound blockbuster action films.\n\n-------\n\nThis copy of the film was restored by the UCLA Film Department.  The quality is in general good - very good for a film of this age.   Some scenes are dark, especially those which are taking place at night.    It is very watchable and a nice window into a forgotten era of film.","torrent":{"xt":"urn:btih:9513633ef0786c9a716055495f8e123e89bbc848","amp;dn":"Hells+Angels+%281930%29+-+Howard+Hughes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9513633ef0786c9a716055495f8e123e89bbc848","infoHashBuffer":{"type":"Buffer","data":[149,19,99,62,240,120,108,154,113,96,85,73,95,142,18,62,137,187,200,72]},"announce":[],"urlList":[]}}