{"title":"Mister Mosquito [Ntsc - Working], Ps2","uid":5270050,"size":362147328,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:952cb5638e14e5f3f333b1075aa4fe63ce94d1af&amp;dn=Mister+Mosquito+%5BNtsc+-+Working%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Big_dude","files":-1,"time":1263027042,"description":"Mister Mosquito for the Ps2                                        Rel. 03/14/2002\n\n\nFormat:        CD-R NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/MDF\nGenre.:        Action\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n(Burn tested on a Chipped ModBo 4.0 PS2)\n\n\nImportant - This is a CD Type or Compact Disc Ps2 game. So you'll have to use CD-R\n            Media only to Burn with.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nRelease Notes - This game couldn't be rebuilt to DVD so it was left in its \n                original CD format. Unlike other releases for this game they were\n                in Mode 1 which needed to be in Mode 2 2352 and is why it didn't \n                work. That has been fixed for this game.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nMister Mosquito is one of the first games from Eidos' FreshGames group, which brings Japanese games to the North American market. In Mister Mosquito, you play a mosquito, in the Yamada family house. You must suck the blood of the three family members (wife, husband, daughter), without getting swatted or spotted.\n\nYou will only be able to suck blood for a limited amount of time, for sucking too long will irritate the person, causing them to swat you. If you are spotted attempting to suck someone, you will then enter a battle mode, where you must hit various &quot;Relax&quot; and &quot;Faint&quot; spots, without getting squished.\n\n\nFeatures:\n\n* Fly through and explore 12 levels of the Yamada household, searching for victims.\n\n* Use Stealth or prepare for air combat as you do battle with human inhabitants.\n\n* Watch the family's relationship disintegrate as they take their irritation out\n  on each other.\n \n\nGame Pics Included.\n\n\nBurn with Alcohol 120%, (Included in download).  \n\nSet Datatype to Playstation 2 (Write Method Raw/Dao) and Burn at 8x speed.\n\nUse Verbatim or Taiyo Yuden CD-R Media for best quality, or if other media isn't \nworking.\n\n(No CD-RW will not work).\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:952cb5638e14e5f3f333b1075aa4fe63ce94d1af","amp;dn":"Mister+Mosquito+%5BNtsc+-+Working%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952cb5638e14e5f3f333b1075aa4fe63ce94d1af","infoHashBuffer":{"type":"Buffer","data":[149,44,181,99,142,20,229,243,243,51,177,7,90,164,254,99,206,148,209,175]},"announce":[],"urlList":[]}}