{"title":"Soldier of Finance Take Charge of Your Money and Invest in Your ","uid":9383730,"size":954720,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:955c1ea8e01950654292047eb2cb89415e16323a&amp;dn=Soldier+of+Finance+Take+Charge+of+Your+Money+and+Invest+in+Your+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"420weedman","files":5,"time":1387760527,"description":"oo much debt? Not enough savings? Stop your whining and get to work. It's time to become a battle-ready financial warrior, prepared to tackle any money challenge. Modeled on the Soldier's Handbook, which is issued to all new U.S. Army recruits, Soldier of Finance is a no-nonsense, military-style training manual to overcoming financial obstacles and building lasting wealth. \nWritten by Jeff Rose, a Certified Financial Planner(t) and army veteran with extensive combat experience, the book is divided into 14 modules, each section covering an essential element of financial success. You will learn how to: \nEvaluate your position and commit to change \nTarget and methodically eliminate debt \nClean up your credit report \nCreate tactical budgets \nBuild emergency savings \nInvest for the short and long term \nDetermine an affordable mortgage size, insurance needs, and more. \nComplete with tales from the trenches and useful tools including quizzes, debriefings, and more-Soldier of Finance is the survival guide you need to face down your finances and bring order and prosperity to your life. \nJEFF ROSE, CFP, (Carbondale, IL) is a Certified Financial Planner(t) and an Iraq combat veteran. A regular contributor to U.S. News &amp; World Report, MarketWatch, and Equifax.com, he is the author of two popular personal finance blogs, SoldierofFinance.com and the nation ally recognized GoodFinancialCents.com, which has been featured in Forbes, The Huffington Post, Kiplinger, and The Wall Street Journal.","torrent":{"xt":"urn:btih:955c1ea8e01950654292047eb2cb89415e16323a","amp;dn":"Soldier+of+Finance+Take+Charge+of+Your+Money+and+Invest+in+Your+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"955c1ea8e01950654292047eb2cb89415e16323a","infoHashBuffer":{"type":"Buffer","data":[149,92,30,168,224,25,80,101,66,146,4,126,178,203,137,65,94,22,50,58]},"announce":[],"urlList":[]}}