{"title":"Anna McLuckie Mixtape (2014)","uid":10021965,"size":37615574,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:956828915ab08cd76aa1f394ebdb164cf9b0c44c&amp;dn=Anna+McLuckie+Mixtape+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"pBtu6RHs","files":-1,"time":1398215855,"description":"Anna McLuckie is seventeen year old singer songwriter/harpist from Edinburgh. Influenced by alternative folk and indie rock music, Anna's sound has been described as &quot;hauntingly beautiful&quot; and &quot;utterly captivating&quot;. \n \nAnna has been writing her own music for the past six years and has recently been working on recording and mixing these tracks with Kevin Craig in Edinburgh and at Universal Studios in London. Recordings such as &quot;Hands&quot; and &quot;Little Man On the Moon&quot; can be heard via Soundcloud and Reverb nation.\n \nAs well as writing her own music Anna has been seen to arrange alternate covers of current hits such as MGMT's &quot;Electric Feel&quot; and Daft Punks &quot;Get Lucky&quot;, the latter of which gained three million youtube hits in under a month. \n\nAnna has started to gain attention through local gigs on the Scottish circuit at venues such as King Tuts, The Queens Hall, Liquid Rooms and Studio 24. She started to significantly progress as an artist and through her TV appearance on BBC 1 has gained valuable industry advice and experience that she wishes to expand on.\n \nAnna is currently working on her own material which she aims to release in early July of 2014.","torrent":{"xt":"urn:btih:956828915ab08cd76aa1f394ebdb164cf9b0c44c","amp;dn":"Anna+McLuckie+Mixtape+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"956828915ab08cd76aa1f394ebdb164cf9b0c44c","infoHashBuffer":{"type":"Buffer","data":[149,104,40,145,90,176,140,215,106,161,243,148,235,219,22,76,249,176,196,76]},"announce":[],"urlList":[]}}