{"title":"Hallmark-Rock The House [2010]","uid":7123277,"size":744000862,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9570722a5fdb9f9a7766c01a73601e2f8a990152&amp;dn=Hallmark-Rock+The+House+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"trekkietr","files":3,"time":1332438768,"description":"Rock The House (2010)\n\nJack Coleman (&quot;Heroes&quot;) has been cast to star in &quot;Rock the House,&quot; a Hallmark Channel Original Movie about a strained father-daughter relationship that is improved dramatically through the magic of rock n' roll when the dad begins to realize that making a living doesn't have to mean missing out on what really matters.\n\nDave Peterson (Coleman) is a successful and handsome career-driven attorney who barely spends time with his teenage daughter, Karen (Cassi Thomson, &quot;Big Love&quot;). Their routine regularly consists of Dave choosing work over spending time with her, and Karen retreating into her journal or iPod.\n\nWhen Dave opens up his 25th high school reunion invitation to see photos of himself -- a person he no longer resembles -- he begins reconnecting with old friends, including members of his old high school band, The Groaners. Suddenly Dave begins to find ways to spend more time with Karen, and, for the first time, he puts his career on hold. But just days before Karen's prom, when the prom organizing committee finds out that they are without a band for the big night, Karen decides to ask her father to get The Groaners on stage. It may cost him his big promotion so Dave has to decide once and for all how he should be prioritizing his time.\n\n\n","torrent":{"xt":"urn:btih:9570722a5fdb9f9a7766c01a73601e2f8a990152","amp;dn":"Hallmark-Rock+The+House+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9570722a5fdb9f9a7766c01a73601e2f8a990152","infoHashBuffer":{"type":"Buffer","data":[149,112,114,42,95,219,159,154,119,102,192,26,115,96,30,47,138,153,1,82]},"announce":[],"urlList":[]}}