{"title":"Dave_Gingery-Working_Sheetmetal-eBook","uid":7875394,"size":2440006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:957128aebbed0f5f9db7252524e314da634bb867&amp;dn=Dave_Gingery-Working_Sheetmetal-eBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"das_wookie","files":-1,"time":1354324247,"description":"This is the Companion book to the other Dave Gingery - Sheet Metal Technology book. This is the 1993 publication from Uncle Dave and covers basics of sheet metal working, minimum tooling, and a few how to projects in typical Uncle Dave fashion where he gives you lots of information to start, and gradually reduces the amount provided to allow you to use what you've learned and figure out how to do it yourself using just his drawings.\n\n-------------------------------\n\nDescription from Lindsay Publications:\n\nLet Dave Gingery get you started in working sheet metal with a hammer, a tree stump and a simple bar clamp you can attach to the front edge of your workbench. He'll show you all the basic joints and edges, and how to make them without fancy machines. He'll even show you how to make a gas tank. This is not the ultimate sheet metal book, just the straight scoop on how to get great results with simple tools from someone who has done it. Consider this carefully! 90 pages \n\n-------------------------------\n\nDave Gingery Explains His Book...\n\nThis book was inspired when someone gave a friend of mine a furnace. Local sheet-metal people all wanted $1000 or more to install it. My friend is almost as stingy and tight-fisted as you and I so he didn't go that route. Instead, I picked up a couple of sheets of galvanized metal, a couple of joints of prefab duct and fist full of &quot;S&quot; slips and drives and we did the job in a half day for less than $75.00. ...We didn't have any of the fancy equipment for the job but we did it any way. That's what this book is about.\n\nNo photos of exotic equipment in these pages. And no instruction in using press-brakes, leaf brakes, slip-rolls, bar-folders, turning machines, edgers, crimpers, lock-formers or any of the commercially built equipment found in commercial shops... Instead, this book shows you how to do the work without machines.\n\nSheet metal work was my second trade and I worked it for years... So here I am showing how to produce what you need without the machines, and there is hardly a limit to what can be made.\n\nThe chapter on layout is brief but it covers all the basics. It would be no trouble at all to write 500 pages on pattern problems and examples alone. But that has been done very well by many [others] in the past. My message is that the principles are few and simple.","torrent":{"xt":"urn:btih:957128aebbed0f5f9db7252524e314da634bb867","amp;dn":"Dave_Gingery-Working_Sheetmetal-eBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"957128aebbed0f5f9db7252524e314da634bb867","infoHashBuffer":{"type":"Buffer","data":[149,113,40,174,187,237,15,95,157,183,37,37,36,227,20,218,99,75,184,103]},"announce":[],"urlList":[]}}