{"title":"Ruth Franklin - A Thousand Darknesses. Lies and Truth in Holocau","uid":10427949,"size":1841003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95a799b4461d3f582ae197e1fa3aa755ac235fa0&amp;dn=Ruth+Franklin+-+A+Thousand+Darknesses.+Lies+and+Truth+in+Holocau&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1403727675,"description":"Description\nProduct Details\nBook Title: A Thousand Darknesses: Lies and Truth in Holocaust Fiction\t\nBook Author: Ruth Franklin (Author)\nHardcover: 272 pages\nPublisher: Oxford University Press (November 12, 2010)\nLanguage: English\nISBN-10: 0195313968\nISBN-13: 978-0195313963\n\n===================================================================================\nBook Description\nPublication Date: November 12, 2010 | ISBN-10: 0195313968 | ISBN-13: 978-0195313963\nWhat is the difference between writing a novel about the Holocaust and fabricating a memoir? Do narratives about the Holocaust have a special obligation to be 'truthful'--that is, faithful to the facts of history?\nOr is it okay to lie in such works?\nIn her provocative study A Thousand Darknesses, Ruth Franklin investigates these questions as they arise in the most significant works of Holocaust fiction, from Tadeusz Borowski's Auschwitz stories to Jonathan Safran Foer's postmodernist family history. Franklin argues that the memory-obsessed culture of the last few decades has led us to mistakenly focus on testimony as the only valid form of Holocaust writing. As even the most canonical texts have come under scrutiny for their fidelity to the facts, we have lost sight of the essential role that imagination plays in the creation of any literary work, including the memoir.\nTaking a fresh look at memoirs by Elie Wiesel and Primo Levi, and examining novels by writers such as Piotr Rawicz, Jerzy Kosinski, W.G. Sebald, and Wolfgang Koeppen, Franklin makes a persuasive case for literature as an equally vital vehicle for understanding the Holocaust (and for memoir as an equally ambiguous form). The result is a study of immense depth and range that offers a lucid view of an often cloudy field.\n\n===================================================================================\nReviews\n&quot;Ruth Franklin's new book, A Thousand Darknesses: Lies and Truth in Holocaust Fiction, is more than a towering work of criticism and insight -- it's an invaluable corrective.&quot;--The Atlantic\n\n&quot;By scrupulously defending the integrity of literature, Ms. Franklin has offered her own eloquent testimony.&quot;--Wall Street Journal\n\n&quot;Franklin explicates her central ideas with a piercing, graceful lucidity... a beautiful book that addresses the ugliest of subjects, proving, once more, that it can be done.&quot;--Washington Post\n\n&quot;This text is superbly written and offers insightful analysis.&quot;--Library Journal\n\n&quot;Ruth Franklin's keen analysis makes a major contribution to the literary criticism of Shoah writers, and her humane perspective renders the nuances of a fraught subject newly comprehensible.&quot;--Jewish Book Council\n\n&quot;...an honest effort to inject a little good sense and judgment into an understandably emotional subject.&quot;--Jewish Literary Review\n\n&quot;...a brilliant, challenging and surprising work.&quot;--Jewish Journal\n\n&quot;What A Thousand Darknesses does do, and does very well, is challenge us on every level of virtually every aspect of Holocaust literature. That the Holocaust is 'unknowable' doesn't mean that a lot of it can't be known. Literature lays bare the path to know what is knowable, and Franklin neatly shows us the way.&quot;--The Jewish Daily Forward\n\n&quot;A Thousand Darknesses succeeds in forming a coherent whole that makes a powerful argument for the propriety of treating the Holocaust as a wellspring of literary art.&quot;--Commentary\n\n&quot;Franlin is particularly astute in evaluating why the grayness of truth is important in a Holocaust work... Not merely about the Holocaust, but about why we study history, why we read, and why we tell stories.&quot;--The Literary Review\n\n&quot;[An] important work...Lucid, persuasive...Highly recommended.&quot;--CHOICE\n\n&quot;Franklin's work of Holocaust literary criticism is excellent in its interpretations and a valuable read.&quot;--Cynthia Crane, H-Net Reviews\n\n===================================================================================\nAbout the Author\nRuth Franklin is a senior editor at The New Republic.\n===================================================================================","torrent":{"xt":"urn:btih:95a799b4461d3f582ae197e1fa3aa755ac235fa0","amp;dn":"Ruth+Franklin+-+A+Thousand+Darknesses.+Lies+and+Truth+in+Holocau","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95a799b4461d3f582ae197e1fa3aa755ac235fa0","infoHashBuffer":{"type":"Buffer","data":[149,167,153,180,70,29,63,88,42,225,151,225,250,58,167,85,172,35,95,160]},"announce":[],"urlList":[]}}