{"title":"Dokken Live from the Sun-1999","uid":7617301,"size":4504257594,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9829795e45d7a4569e482e2b31ace4526869f29b&amp;dn=Dokken+Live+from+the+Sun-1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Billman3","files":-1,"time":1347236989,"description":"Dokken is an American heavy metal band formed in 1976. They split up in 1989 but reformed four years later. The group accumulated numerous charting singles and has sold more than 10 million albums worldwide. The band was nominated for a Grammy in 1989.\n\nDokken was composed of founder Don Dokken on vocals, George Lynch on lead guitar, Juan Croucier on bass and &quot;Wild&quot; Mick Brown on drums. In 1983 Croucier left Dokken in order to join Ratt and was replaced by Jeff Pilson. Currently only Dokken and Brown remain from the original line-up. After several personnel changes on guitar Dokken's attorney Jon Levin stepped in to fill the role in 2004. In 2001 Barry Sparks replaced Jeff Pilson on bass. In 2009 Sean McNabb replaced Barry Sparks on bass guitar.\n\n This 60 minute DVD features Dokken, Live from the Sun Theatre in Anaheim, California on November 4, 1999. Dokken Live from the Sun DVD Songs include &quot;Alone Again,&quot; &quot;Breaking the Chains,&quot; &quot;In My Dreams&quot; and more. Dokken Live from the Sun movie The DVD features 5.1 surround sound, split screen edited effects, exclusive unplugged acoustic tracks, in depth interviews, backstage footage, Spanish Bilingual menu options, rare historic footage &amp; home clips of the band members ans well as paintings &amp; illustrations by Don Dokken.\n\nThere is a great moment in Jeff Krulik's video documentary HEAVY METAL PARKING LOT -- which records an arena parking lot before a 1980's Judas Priest concert -- when a mullet-sporting fan throws up his arms and screams &quot;Dokken!!!&quot; This is a perfect visual representation of the kind of loud dedication that the immensely popular heavy metal band brought out in their fans. Dokken Live from the Sun film Led by Don Dokken, the band broke up in 1988 but has since reunited, continuing to release albums and play concerts. Dokken Live from the Sun review LIVE FROM THE SUN was filmed at a November 1999 performance at the Sun Theatre, and proves that Dokken is still Rokken!\n\nStudio\tBMG Video\nOrig Year\t1999\nDVD Encoding\tAll Regions\nRelease Date\tNov 21, 2000\nNot Rated\nRunning Time\t96 Minutes\nAdditional Info\tStandard Screen; Soundtrack English; Dolby Digital 5.1 Re\nfile size=4.19gb\nformat=vob files\n\nMovie Details\tColor; Dolby Surround AC-3 Sound; Surround Sound; Digital Sound; Stereo Sound; Standard Screen; Soundtrack English; Dolby Digital 5.1 Re\n\nDokken - Live from the Sun DVD Features\n\nDVD Features: Region 0 Note: Paintings and illustrations by Don Dokken Note: Split Screen Edited Effects Keep Case Full Frame - 1.33 Audio: Dolby Digital 5.1 - English Additional Release Material: Production Interviews: Dokken Shorts: 1. Backstage footage 2. Two never before released Unplugged acoustic tracks Tracks: 1. Alone Again 2. Breaking The Chains 3. Tooth And Nail 4. Too High To Fly 5. Kiss Of Death 6. Erase The Slate 7. Maddest Hatter 8. Into The Fire 9. Paris Is Burning 10. In My Dreams\n","torrent":{"xt":"urn:btih:9829795e45d7a4569e482e2b31ace4526869f29b","amp;dn":"Dokken+Live+from+the+Sun-1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9829795e45d7a4569e482e2b31ace4526869f29b","infoHashBuffer":{"type":"Buffer","data":[152,41,121,94,69,215,164,86,158,72,46,43,49,172,228,82,104,105,242,155]},"announce":[],"urlList":[]}}