{"title":"Tartini - Four Concetos for Violin and Orchesta (Paulik)","uid":4788263,"size":371201030,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:98aba2a3db58dfc1e119f38c92c2e629593dd041&amp;dn=Tartini+-+Four+Concetos+for+Violin+and+Orchesta+%28Paulik%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Stevest","files":26,"time":1237630395,"description":"GIUSEPPE TARTINI (1692-1770)\n\nConcerto for Violin in E major D. 47\n\n01 I Allegro 06:52\n02 II Adagio 04:20\n03 III Allegro assai 06:00\n\nConcerto for Violin in F major D. 69\n\n04 I Allegro 06:35\n05 II Andante 05:34\n06 III Allegro 05:47\n\nConcerto for Violin in A major D. 101\n\n07 I Allegro 07:36\n08 II Allegro ma non troppo (Ossia. Andante) 04:55\n09 III Allegro 06:50\n\nConcerto for Violin in D major D. 34\n\n10 I Allegro 05:54\n11 II Grave (Ossia. Adagio) 04:29\n12 III Allegro assai (Ossia. Allegro) 06:05\n\nLaszlo Paulik (violin)\nOrfeo Orchestra\nconducted by Gyorgy Vashegyi\n\nPlaying Time: 01:10:57\nRecorded in 2001, released in 2002 by Hungaroton\n\n\nReview:\n\nAt last, a disc of Tartini violin music that doesn't include the Devil's Trill sonata! (For some reason, that G minor work has been turning up a lot lately.) No, this is a group of concertos, and before the first has concluded you're wondering why (with all due respect) Vivaldi gets so much attention when music of this quality and inventiveness is around. One reason may be a question of quantity and historical misfortune: until recently dozens of Tartini's 200 known violin concertos were believed lost, but the four performed here were recently discovered &quot;at the Bibliotheque Nationale in Paris.&quot; And since during his lifetime (1692-1770) Tartini was primarily known as a violinist (he led his own orchestra at Padova Cathedral) and author of both a theoretical work, Trattato di musica (treatise of music), and an important summary of violin pedagogy and technique (Regole per arrivare a saper ben suonar il violino), his compositions were not widely appreciated and disseminated as they should have been. In fact, because of Tartini's unsystematic manner of composing and publishing (or simply not publishing), it's now impossible to produce a reliable chronology of his compositions. Nevertheless, the music doesn't lie--and this is wonderful music, by any standard.\n\nAnd what better advocate could this underrated and relatively neglected composer have than the brilliant virtuoso violinist LÃƒÂ¡szlÃƒÂ³ Paulik (the Andrew Manze of Hungary), who performs these often dazzling, technically fearsome, melodically beautiful pieces as if born to them? He spins ornaments--often just a lightning-quick little run or almost imperceptible turn or trill--as effortlessly as breathing. And they're never gratuitous--they always fit perfectly into the context of the line. The slow movement of the E major concerto is as lovely as any by Handel or Bach, and the most virtuosic passages are as demanding--and in Paulik's hands as satisfying--as any written by the period's more illustrious composers. Tartini knew nothing if not how to get the maximum out of a theme--and his thematic ideas were sufficiently fertile to produce a body of works that don't have that recurring ring of familiarity for which Vivaldi is somewhat justifiably maligned. Tartini had a habit of suspending the action with an extended violin cadenza (as at the end of the Andante of the F major concerto), and he'd lighten the orchestral texture to emphasize the melody (the beginning of the Allegro of the same work) and just as quickly follow with a tutti dance-style section--and then jump back to a double-stop-filled cadenza. And speaking of cadenzas, Paulik provides his own here, and each is a captivating bit of soloistic drama that demands repeated listening. Paulik's partners are fully in tune--in every respect--with the soloist and with Tartini's ingratiating scores. The sound is ideal--especially complementary to Paulik's soaring, singing tone and to the careful balances and clean articulation of the orchestra.\n\nDavid Vernier, Classics Today\n\nMy own EAC secure rip, cue and log files, covers included.","torrent":{"xt":"urn:btih:98aba2a3db58dfc1e119f38c92c2e629593dd041","amp;dn":"Tartini+-+Four+Concetos+for+Violin+and+Orchesta+%28Paulik%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98aba2a3db58dfc1e119f38c92c2e629593dd041","infoHashBuffer":{"type":"Buffer","data":[152,171,162,163,219,88,223,193,225,25,243,140,146,194,230,41,89,61,208,65]},"announce":[],"urlList":[]}}