{"title":"[Wayne F. Reed , Alina M. Alb]Monitoring Polymerization Reaction","uid":11199800,"size":16677351,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:994a09ee373848a086a909894a107d26b434ca1a&amp;dn=%5BWayne+F.+Reed+%2C+Alina+M.+Alb%5DMonitoring+Polymerization+Reaction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413154493,"description":"Product Description\n\nOffers new strategies to optimize polymer reactions\n\nWith contributions from leading macromolecular scientists and engineers, this book provides a practical guide to polymerization monitoring. It enables laboratory researchers to optimize polymer reactions by providing them with a better understanding of the underlying reaction kinetics and mechanisms. Moreover, it opens the door to improved industrial-scale reactions, including enhanced product quality and reduced harmful emissions.\n\nMonitoring Polymerization Reactions begins with a review of the basic elements of polymer reactions and their kinetics, including an overview of stimuli-responsive polymers. Next, it explains why certain polymer and reaction characteristics need to be monitored. The book then explores a variety of practical topics, including:\n\n    Principles and applications of important polymer characterization tools, such as light scattering, gel permeation chromatography, calorimetry, rheology, and spectroscopy\n    Automatic continuous online monitoring of polymerization (ACOMP) reactions, a flexible platform that enables characterization tools to be employed simultaneously during reactions in order to obtain a complete record of multiple reaction features\n    Modeling of polymerization reactions and numerical approaches\n    Applications that optimize the manufacture of industrially important polymers\n\nThroughout the book, the authors provide step-by-step strategies for implementation. In addition, ample use of case studies helps readers understand the benefits of various monitoring strategies and approaches, enabling them to choose the best one to match their needs.\n\nAs new stimuli-responsive and &quot;intelligent&quot; polymers continue to be developed, the ability to monitor reactions will become increasingly important. With this book as their guide, polymer scientists and engineers can take full advantage of the latest monitoring strategies to optimize reactions in both the lab and the manufacturing plant.\nFrom the Back Cover\nOffers new strategies to optimize polymer reactions With contributions from leading macromolecular scientists and engineers, this book provides a practical guide to polymerization monitoring. It enables laboratory researchers to optimize polymer reactions by providing them with a better understanding of the underlying reaction kinetics and mechanisms. Moreover, it opens the door to improved industrial-scale reactions, including enhanced product quality and reduced harmful emissions. Monitoring Polymerization Reactions begins with a review of the basic elements of polymer reactions and their kinetics, including an overview of stimuli-responsive polymers. Next, it explains why certain polymer and reaction characteristics need to be monitored. The book then explores a variety of practical topics, including: Principles and applications of important polymer characterization tools, such as light scattering, gel permeation chromatography, calorimetry, rheology, and spectroscopy Automatic continuous online monitoring of polymerization (ACOMP) reactions, a flexible platform that enables characterization tools to be employed simultaneously during reactions in order to obtain a complete record of multiple reaction features Modeling of polymerization reactions and numerical approaches Applications that optimize the manufacture of industrially important polymers Throughout the book, the authors provide step-by-step strategies for implementation. In addition, ample use of case studies helps readers understand the benefits of various monitoring strategies and approaches, enabling them to choose the best one to match their needs. As new stimuli-responsive and &quot;intelligent&quot; polymers continue to be developed, the ability to monitor reactions will become increasingly important. With this book as their guide, polymer scientists and engineers can take full advantage of the latest monitoring strategies to optimize reactions in both the lab and the manufacturing plant. \n\nPublisher: Wiley; 1 edition (2 December 2013)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00H3FKSMA","torrent":{"xt":"urn:btih:994a09ee373848a086a909894a107d26b434ca1a","amp;dn":"%5BWayne+F.+Reed+%2C+Alina+M.+Alb%5DMonitoring+Polymerization+Reaction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"994a09ee373848a086a909894a107d26b434ca1a","infoHashBuffer":{"type":"Buffer","data":[153,74,9,238,55,56,72,160,134,169,9,137,74,16,125,38,180,52,202,26]},"announce":[],"urlList":[]}}