{"title":"The Prodigal Son (Animated Christian Movie)","uid":5184345,"size":250903923,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99f27d6ed2164417f3a3c70a538f6d8640700d16&amp;dn=The+Prodigal+Son+%28Animated+Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"IndianChristian","files":3,"time":1259402718,"description":"The Prodigal Son (Animated Christian Movie)\n\n\nThe Prodigal Son, Jacob, leaves his father's farm to seek his fortune in the city. Encountering many temptations, Jacob squanders his inheritance. Reduced to living with animals, he decides to return to his father's home regardless of the consequences. His father welcomes Jacob home, celebrating his return and forgiving him of his sins. With a group of followers gathered about him, Jesus tells the parable of the Prodigal Son, Jacob, the younger son of a successful farmer, begs his father for his inheritance so he can go to the city and become a rich money lender. Jacob's brother insists that Jacob stay and do his part of the hard work on the farm. But Jacob's father finally relents and bids a sad good-bye to his younger son. In the city Jacob sees temptations on every corner, and he wastes his money at every opportunity. When Jacob is chased through the streets by a group of beggars, he is rescued by the lovely Anna and her brother Fashid. Anna wants to help Jacob invest his money wisely, but Fashid merely wants to take advantage of Jacob. Within a short time, Fashid and Jacob Have spent all of Jacob's money. Jacob declares to Anna that he will return to Her when he is rich, but Anna can see only that he is foolish and wasteful. And now that Jacob is poor, Fashid turns his back on him. Jacob is reduced to begging in the streets. He leaves the city, wandering the countryside, where a farmer allows him to take care of his animals. Reaching a new low, Jacob eats with the hogs in order to survive. In total despair he decides to return home and beg his father to hire him as a servant. In front of his father's house, Jacob falls to the ground, begging forgiveness. His father, delighted to see him, throws a celebration in his honor. Jacob's brother, who has done all the work since Jacob left, is angry and feels that he has been slighted. But his father explains that he would have done the same for him. Jacob had to go through much to gain wisdom, but now, &quot;He that was lost is found.&quot; Then the older son and his father go together to celebrate Jacob's return.\n \nRuntime: 27 mins\nLanguage: English (No-Subtitles)\nYear: 1988\nMy Rating: 10/10\nQuality: 9/10 \n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\nPS: If you need any specific christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;b1d8dfd5d8d0dfd2d9c3d8c2c5d8d0df83818188f1c8d0d9dede9fd2de9fd8df&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t\n","torrent":{"xt":"urn:btih:99f27d6ed2164417f3a3c70a538f6d8640700d16","amp;dn":"The+Prodigal+Son+%28Animated+Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f27d6ed2164417f3a3c70a538f6d8640700d16","infoHashBuffer":{"type":"Buffer","data":[153,242,125,110,210,22,68,23,243,163,199,10,83,143,109,134,64,112,13,22]},"announce":[],"urlList":[]}}