{"title":"Goodbye to All That?: A History of Europe Since 1945 (2014) pdf","uid":10100032,"size":3786933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b097fe33519f85c0a8ffe70d687b7450ceebd06&amp;dn=Goodbye+to+All+That%3F%3A+A+History+of+Europe+Since+1945+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1399336335,"description":"In the decade after 1945, as the Cold War freeze set in, a new Europe slowly began to emerge from the ruins of the Second World War, based on a broad rejection of the fascist past that had so scarred the continent's recent history. \n\n In the East, this new consensus was enforced by Soviet-imposed Communist regimes. In the West, the process was less coercive, amounting more to a consensus of silence. On both sides, much was deliberately forgotten or obscured.\n\n The years which followed were in many ways golden years for western Europe. Democracy became embedded in Germany, and eventually triumphed over dictatorship in Spain, Portugal, and Greece. Britain and France faced up to the necessity of decolonization. The European Economic Community was founded and went from strength to strength, as the economies of western Europe bounced back from the devastation of the war. The countries of the East lagged far behind and seemed caught in a perpetual game of catch-up, but even there conditions had improved since the end of the war, albeit at a much slower rate. Above all, throughout this period the European world continued to be sustained by the broad anti-fascist consensus that had emerged in the years after 1945.\n\n However, as Dan Stone shows in this new history of the continent since the war, this fundamental consensus began to break down in the wake of the oil shocks of the 1970s, a process which has rapidly accelerated since the end of the Cold War. Globalization, deregulation, and the erosion of social-democratic welfare capitalism in the West, and the collapse of the purported Communist alternative in the East, have all fatally undermined the post-war anti-fascist value system that predominated across Europe in the first four decades after the end of the Second World War.\n\n Ominously, this has been accompanied by a rise in right-wing populism and a widespread revision of the anti-fascist narrative on which this value system was based. The danger of this shift is now evident: financial and social crisis, an increasing inability on the part of European populations to resist historical myth-making, and the re-emergence of fascist ideas. The result, as Dan Stone warns, is socially divisive, politically dangerous, and a genuine threat to the future of a civilized Europe.","torrent":{"xt":"urn:btih:9b097fe33519f85c0a8ffe70d687b7450ceebd06","amp;dn":"Goodbye+to+All+That%3F%3A+A+History+of+Europe+Since+1945+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b097fe33519f85c0a8ffe70d687b7450ceebd06","infoHashBuffer":{"type":"Buffer","data":[155,9,127,227,53,25,248,92,10,143,254,112,214,135,183,69,12,238,189,6]},"announce":[],"urlList":[]}}