{"title":"Yoshitaka Amano (1952) (Art Paintings)","uid":11817044,"size":233440354,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:9bbfa4819880cc94a906e0964508c4d642a8ac02&amp;dn=Yoshitaka+Amano+%281952%29+%28Art+Paintings%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":579,"time":1429134234,"description":"579 jpg / 222 MB\n\nYoshitaka Amano, born March 26, 1952 is a Japanese artist, character designer, illustrator and a theatre and film scenic designer and costume designer. He first came into prominence in the late 1960s working on the anime adaptation of Speed Racer. Amano later became the creator of iconic and influential characters such as Gatchaman, Tekkaman: The Space Knight, Hutch the Honeybee and Casshan. In 1982 he went independent and became a freelance artist, finding success as an illustrator for numerous authors, and worked on many best selling novels such as The Guin Saga and Vampire Hunter D. He is also known for his commissioned illustrations for the popular video-game franchise Final Fantasy.\n\nSince the 1990s Amano has been creating and exhibiting paintings featuring his iconic retro pop icons in galleries around the world, primarily painting on aluminium box panels with acrylic and automotive paint. He is a 5 time winner of the Seiun Award, and also won the 1999 Bram Stoker Award for his collaboration with Neil Gaiman, Sandman: The Dream Hunters.\n\nAmano's influences include early Western comic books, art nouveau, and Japanese woodblock prints. In early 2010, he established Studio Devaloka, a film production company","torrent":{"xt":"urn:btih:9bbfa4819880cc94a906e0964508c4d642a8ac02","amp;dn":"Yoshitaka+Amano+%281952%29+%28Art+Paintings%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bbfa4819880cc94a906e0964508c4d642a8ac02","infoHashBuffer":{"type":"Buffer","data":[155,191,164,129,152,128,204,148,169,6,224,150,69,8,196,214,66,168,172,2]},"announce":[],"urlList":[]}}