{"title":"Quests And Legends mod Version 1.6","uid":11524387,"size":1026759445,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9c4a126749794f1463e5a1a4415cf7c76d803939&amp;dn=Quests+And+Legends+mod+Version+1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DarkAuthor","files":1,"time":1416514612,"description":"This is version 1.6 of the awesome Quests and Legends mod for Dragon Age Origins.  It is the latest version.  \n\nThis mod adds a new companion NPC, MANY new quests and items, the ability to multiclass your character, plus various other things.  It also has complete voice acting.  Fair warning, I heard there might be an issue in 1.6 with someones voice not working.  There is a patch for that on the Dragon Age Nexus if you have this problem.\n\nA couple of years ago, the mod author pulled this mod vrom the internet completely.  It is possible to find version 1.5 floating around on file sharing sites, but 1.6 is near impossible to find.  I only found it because I found a torrent on linetorrents that included the mod in a huge modpack.  This was the ONLY place I found it.  So, I separated it out and decided to upload it here for anyone else who wants this incredible mod.\n\nOriginal description from version 1.1 of the mod as it appears on my DAModder tool:\n\nAdds a romancable, fully voiced npc, Valeria, upgradeable thief and warrior guilds, New classic classes (Multiclassing), 178 new areas to explore, new items, spells, talents, a blacksmith to make items for you, storage bags, unique new quests (97), 44 repeatable with variations, Casino, Puzzles, storage bags to organize your inventory, new spellbooks requiring reagents with an unlimited number of spells you can create on the fly, treasure hunting, and much much more. See (dead link) the topic on Version Information for details as well as the other important topics like Compatibility.\n\nAuthor: Idomeneas\n\nI hope everyone enjoys!","torrent":{"xt":"urn:btih:9c4a126749794f1463e5a1a4415cf7c76d803939","amp;dn":"Quests+And+Legends+mod+Version+1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c4a126749794f1463e5a1a4415cf7c76d803939","infoHashBuffer":{"type":"Buffer","data":[156,74,18,103,73,121,79,20,99,229,161,164,65,92,247,199,109,128,57,57]},"announce":[],"urlList":[]}}