{"title":"Dog Whisperer - Season 6 E01-09","uid":5417790,"size":3340371563,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9ce7749cfe17fa5f410967b743c3120428490cd8&amp;dn=Dog+Whisperer+-+Season+6+E01-09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"snakeboy69","files":-1,"time":1267985399,"description":"If you're a follower of The Dog Whisperer series you will probably have noticed that the numbering of the episodes is very confusing to say\nthe least. There seems to be no consistency as to where season 5 ends and season 6 begins. There are discrepancy's between the information\nat tv.com that conflicts with the listed order of the shows as per epguides.com and both of these conflict with information on Cesar's own site!\nFortunately, Cesar's site has been updated recently and it now a lot more accurate than previously (although still not 100% flawless).\n\nWe can now state for a fact that the first episode of Season 6 is &quot;How to Raise the Perfect Dog&quot;. The proof that this is the case can be found\nin the included folder &quot;Season 6 - Proof&quot; which contains avideo (.flv format) where Cesar talks about the season premier of season 6 and\nexplains in no uncertain terms that this is indeed the first episode of season 6.\n\nSo, now that the debate is over about where to break season5/6, I decided to put all the Season 6 episodes released thus far (thanks to user\nnamed &quot;badbeef1&quot; who has been the only one providing us Dog Whisperer lovers with the latest episodes) into one torrent for convenience.\n\nALL credit and ALL thanks should go to badbeef1 without which we would not have these! Let us all hope he continues to bring us more episodes\ninto the future.\n\nCONTENTS:\n\n- The Dog Whisperer - S06E01 - How to Raise the Perfect Dog.avi\n- The Dog Whisperer - S06E02 - Cujo and Molly .avi\n- The Dog Whisperer - S06E03 - Pekaso and Yogi &amp; Smokey .avi\n- The Dog Whisperer - S06E04 - Hardy - Attacked with Love.avi\n- The Dog Whisperer - S06E05 - Seven, Sara, and Madeliene.avi\n- The Dog Whisperer - S06E06 - Bear &amp; Angel and Lorelei.avi\n- The Dog Whisperer - S06E07 - Cesar Down Under (Pt.1) .avi\n- The Dog Whisperer - S06E08 - Cesar Down Under (Pt.2) .avi\n- The Dog Whisperer - S06E09 - Peanut &amp; Chico, Leroy Brown, and Tucker.avi\n+\n-- Cesar Millan Talks Dogs Season 6.flv - Proof that numbering is now correct.","torrent":{"xt":"urn:btih:9ce7749cfe17fa5f410967b743c3120428490cd8","amp;dn":"Dog+Whisperer+-+Season+6+E01-09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ce7749cfe17fa5f410967b743c3120428490cd8","infoHashBuffer":{"type":"Buffer","data":[156,231,116,156,254,23,250,95,65,9,103,183,67,195,18,4,40,73,12,216]},"announce":[],"urlList":[]}}