{"title":"Herman's Hermits - Mrs. Brown You've Got A Lovely Daughter [Mono","uid":8624711,"size":216061565,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d014b556b95b74d8a7d981bd3102a2bbefd361f&amp;dn=Herman%27s+Hermits+-+Mrs.+Brown+You%27ve+Got+A+Lovely+Daughter+%5BMono&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":42,"time":1372468140,"description":"This is the same torrent that was uploaded to Demonoid in September 2008.\n\n\nHerman's Hermits - Mrs. Brown You've Got A Lovely Daughter [Mono] (1994)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51SfHgiz9AL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51SfHgiz9AL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 12 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nHerman's Hermits were one of those odd 1960's groups that accumulated millions of fans, but precious little respect. Indeed, their status is remarkably similar to that of the Monkees and it's not a coincidence that both groups' music was intended to appeal to younger teenagers. The difference is that as early as 1976, the Monkees began to be considered cool by people who really knew music; it has taken 35 years for Herman's Hermits to begin receiving higher regard for their work. Of course, that lack of respect had no relevance to their success: 20 singles lofted into the Top 40 in England and America between 1964 and 1970, 16 of them in the Top 20, and most of those Top Ten as well. Artistically, they were rated far lower than the Hollies, the Searchers, or Gerry &amp; the Pacemakers, but commercially, the Hermits were only a couple of rungs below the Beatles and the Rolling Stones. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifuxqe5ld0e~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifuxqe5ld0e~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nRepertoire records has sort of confused the issue of Herman's Hermits CDs by releasing this 25-song compilation in 1994 and then, in 2000, re-releasing the soundtrack Mrs. Brown You've Got a Lovely Daughter on CD. To clarify, this is not the soundtrack to the 1968 movie, but a collection of the group's 1964-1965 sides from various singles and EPs. Some of it will surprise listeners who think of Herman's Hermits as the poppiest component of the British Invasion and barely a rock &amp; roll group at all -- regardless of who is actually playing on &quot;Walking With My Baby&quot; or &quot;Dream On,&quot; those are as solid as any early album track by the Hollies, and they don't do a bad version of &quot;For Your Love&quot; either; they even make an attempt at a slightly bluesier sound on &quot;I Wonder,&quot; though this was clearly not Peter Noone's vocal forte. Keith Hopwood's &quot;Don't Try to Hurt Me&quot; and &quot;Tell Me Baby&quot; are off-the-shelf, generic British Invasion rockers of no particular distinction, pleasant but otherwise undistinguished except perhaps by the unusually ambitious playing on the latter number's guitar break. &quot;I'm Henry VIII I Am,&quot; &quot;The End of the World,&quot; and the title track are the most familiar songs here, and then come the A- and B-sides of the group's first five singles (&quot;I'm Into Something Good,&quot; &quot;Show Me,&quot; &quot;Silhouettes,&quot; &quot;Wonderful World,&quot; etc.) and their debut EP, which includes their version of &quot;Sea Cruise,&quot; all perfectly listenable British Invasion rock &amp; roll. The notes give a decent brief history of the group, and a discography is included as well -- the sound is very good, though more recent releases may have the edge for audio quality, if anyone cares about that in this instance.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfrxqu0ld0e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfrxqu0ld0e&lt;/a&gt;\n\nProduct Description from Amazon.com:\n\nReissued 1964-65 albums. The first European album release now has 13 bonus tracks including the hits 'I'm Into Something Good', 'Show Me Girl', 'Silhouettes', 'Wonderful World' and of course the title track. Some rare non LP B sides are also featured alongside an informative 12-page booklet that includes a full discography of this highly successful 60's band.\n\nReviews and for sale here: &lt;a href=&quot;\nhttp://www.amazon.com/Mrs-Brown-Youve-Lovely-Daughter/dp/B000024TEU&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mrs-Brown-Youve-Lovely-Daughter/dp/B000024TEU&lt;/a&gt;\n\nTrack List:\n\n01. Heartbeat\n02. Travelling Light\n03. I'll Never Dance Again\n04. Walking With My Angel\n05. Dream On\n06. I Wonder\n07. For Your Love\n08. Don't Try To Hurt Me\n09. Tell Me Baby\n10. I'm Henry The VIII I Am\n11. The End Of The World\n12. Mrs. Brown You've Have A Lovely Daughter\n13. I'm Into Something Good\n14. Your Hand In Mine\n15. Show Me Girl\n16. I Know Why\n17. Silhouettes\n18. Can't You Hear My Heartbeat\n19. Wonderful World\n20. Just A Little Bit Better\n21. Take Love, Give Love\n22. Sea Cruise\n23. Mother In Law\n24. I Understand\n25. Thinking Of You\n","torrent":{"xt":"urn:btih:9d014b556b95b74d8a7d981bd3102a2bbefd361f","amp;dn":"Herman%27s+Hermits+-+Mrs.+Brown+You%27ve+Got+A+Lovely+Daughter+%5BMono","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d014b556b95b74d8a7d981bd3102a2bbefd361f","infoHashBuffer":{"type":"Buffer","data":[157,1,75,85,107,149,183,77,138,125,152,27,211,16,42,43,190,253,54,31]},"announce":[],"urlList":[]}}