{"title":"White Mischief (2GB) Greta Scacchi (moviesbyrizzo)","uid":6105626,"size":1986246707,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9dcf59dd1c3dd56384ab9373b5b2a46808c7984a&amp;dn=White+Mischief+%282GB%29+Greta+Scacchi+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1295146752,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0094317/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0094317/&lt;/a&gt;\n\n720 X 576 from DVD, high bitrate of over 2000k video\n192k main audio track Dual audio - choose from English or German\n\nUntil such time as when there might be a decision to release this greatest \nof British genre movies onto bluray for at least a 720p offering to bring you\nhere, We hope you will find this offering here will tithe you over as it were.\n\nIt is sad that Greta scacch - perhaps the greatest actress who has ever filled\nthe big screen has missed out on so much of what was her due in respect of fame\nand fortune - as it appears she has too many that are envious of her greatest\nhuman spirit of the most magnificent beauty known to man. She is in fact equally\nGermanic and Italian on her beauty. Lets make more of this genre shall we! \nNo sense hiding her movies away by refusing to make them available as the\nAmerican studio bureaucrats have done for decades now. No justification for such\ninane arrogance from the Bill Gates mindset and its time they didn't have a say\nin such grave matters of human concern I say! Not if they are this stupid, huh!\n\nThis movie tells a great tale, has some sexy scenes (real steamy I'd say!)\nnice courtroom drama, and supreme British culture in the charms of Diana\nCalswell (Lady Broughton) as played by Ms. Greta Scacchi.\n\nDirected by Mr. Michael Radford, also starring Mr. Charles Dance\nSarah Miles, Joss Ackland, Ray McAnally, Hugh Grant and John Hurt\n\nIts my most favorite movie offering of all that is British I have to say\nwithout a doubt!\n\n\nMichael Rizzo Chessman\n\n\n\n\n\n ","torrent":{"xt":"urn:btih:9dcf59dd1c3dd56384ab9373b5b2a46808c7984a","amp;dn":"White+Mischief+%282GB%29+Greta+Scacchi+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dcf59dd1c3dd56384ab9373b5b2a46808c7984a","infoHashBuffer":{"type":"Buffer","data":[157,207,89,221,28,61,213,99,132,171,147,115,181,178,164,104,8,199,152,74]},"announce":[],"urlList":[]}}