{"title":"Babyface (1977) - Classic Porn XXX","uid":9627983,"size":1648490746,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9e5753e29636fb7f1a5f5fe94734b6376379e970&amp;dn=Babyface+%281977%29+-+Classic+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"KidAtomic","files":-1,"time":1392624425,"description":"Baby Face (TVX): Alex de Renzy (Femmes De Sade, Pretty Peaches) was one of the greatest directors of adult films ever, his career starting in the late 60`s and proceeding well into the 90`s. So saying that Baby Face stands as his crowning achievement is no small praise. This ranks as one skinflick that truly has it all - a complete storyline, fine production, and a couple of decent acting performances and some of the hottest sex scenes ever assembled in a single movie.\n\nCOVERS AND SCREENS FOUND HERE: &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&lt;/a&gt;\n\n\n    Scene 1. Angela Haze, Dan Roberts\n    Scene 2. Lyn Malone, Dan Roberts\n    Scene 3. Angela Haze, Dan Roberts\n    Scene 4. Amber Hunt, Linda Wong, Dan Roberts\n    Scene 5. Desiree West, Paul Thomas\n    Scene 6. Amber Hunt, Desiree West, Paul Thomas\n    Scene 7. Sandy Pinney, Dan Roberts\n    Scene 8. Charla Miss '42', Joey Silvera\n    Scene 9. Kristine Heller, Dan Roberts, Joey Silvera\n    Scene 10. Angela Haze, Kristine Heller, Blair Harris, Dan Roberts, Joey Silvera, John Leslie, Ken Scudder, Paul Thomas, Turk Lyon, Unknown Male 323-A, Unknown Male 323-B\n    Scene 11. Marion Eaton, Dan Roberts\n    Scene 12. Lyn Malone, Joey Silvera, Paul Thomas\n\n\nActresses:\n    Amber Hunt [IR]\n    Angela Haze\n    Charla Miss '42' [Facial]\n    Desiree West [IR]\n    Kristine Heller [Anal Facial IR]\n    Linda Wong\n    Lyn Malone [Facial Bald]\n    Marion Eaton [Facial]\n    Sandy Pinney\n    NonSex Performers\n    Amber Rae\n    Kathryn Reed\n    Unknown Female 323-C\n\nActors:\n    Blair Harris\n    Dan Roberts\n    Joey Silvera\n    John Leslie\n    Ken Scudder\n    Paul Thomas\n    Turk Lyon\n    Unknown Male 323-A\n    Unknown Male 323-B\n    NonSex Performers\n    Otis Sistrunk\n    Rudy Graham\n    Unknown Male 323-C\n    Unknown Male 323-E\n    Unknown Male 323-F\n    Unknown Male 323-G\n\n Babyface\n1977\n\nBabyface is [Alex] DeRenzy's masterpiece film and ranks as one of the all time erotic efforts. The film has everything needed in a classic -- humor, plot, production, pace and sensational sex scenes. Despite the comedy, there are scenes that some people may feel uncomfortable about, but it's only a movie, folks, and the kind that porn fans rave about.\n\nDan Roberts plays the protagonist, and the plot centers on the bizarre events that happen to him. He is a big, lumbering workman who meets teenager Lyn Malone. The girl is a willing participant, but her mother and a policeman, played by Oakland Raider football star Otis Sistrunk, think it is rape. Following a narrow escape, he is pulled unconscious from the water by Amber Hunt. With no prospects and needing a place to hide, Amber finds a most unusual solution. He becomes a stud at an oddball cathouse that caters to rich women.\n\nThe film actually opens at the cathouse with Dan servicing Desiree West. His flashback to what brought him there includes a three-way with Linda Wong and Amber. Studs like Paul Thomas, the main man at the house, Dan, Joey Silvera, Turk Lyon, John Leslie, Ken Scudder and Blair Harris service the female customers that include Sandi Pinney and Kristine Heller.\n\nThe girl's mother is a classic example of hypocrisy and not as puritanical as she lets on, since she is a regular visitor to the house. During her scene with Dan, she recognizes him and plots her revenge. He is sapped by sex and wound in saran wrap, then threatened not with castration, but dismemberment.\n\nBabyface offers some of the best scenes ever placed together in one film. The young Lyn Malone, with perfect breasts and shaved vagina, is fantastic in her scene with Dan and their size difference offers contrast. It was to be her only porno appearance. The highlight of the film is with one of the unsung heroines of adult films, Kristine Heller. She can be found under dozens of aliases in many films, usually under the name of Kathy something. Kathy is her real first name, but her last name is always a pseudonym. She plays rock singer Marina Rondoff, and her request at the house is for more men, culminating with a ten man gang-bang. It is an all time scene. Babyface is virtual perfection for true porn buffs. \n\nCOVERS AND SCREENS FOUND HERE: &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&lt;/a&gt;","torrent":{"xt":"urn:btih:9e5753e29636fb7f1a5f5fe94734b6376379e970","amp;dn":"Babyface+%281977%29+-+Classic+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e5753e29636fb7f1a5f5fe94734b6376379e970","infoHashBuffer":{"type":"Buffer","data":[158,87,83,226,150,54,251,127,26,95,95,233,71,52,182,55,99,121,233,112]},"announce":[],"urlList":[]}}