{"title":"Heterogeneous Computing with OpenCL","uid":8500313,"size":19911377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f93254025129fac7cd262b320186043167c5acb&amp;dn=Heterogeneous+Computing+with+OpenCL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1369278465,"description":"Heterogeneous Computing with OpenCL, Second Edition: Revised OpenCL 1.2 Edition \n\nBook Details:\n\nPages: 308 \nPublisher: Morgan Kaufmann; 2nd Edition (November 2012)\nLanguage: English\nISBN-10: 0124058949\nISBN-13: 978-0124058941\nFormat: PDF, EPUB\n\n\nBook Description:\n\nHeterogeneous Computing with OpenCL teaches OpenCL and parallel programming for complex systems that may include a variety of device architectures: multi-core CPUs, GPUs, and fully-integrated Accelerated Processing Units (APUs) such as AMD Fusion technology. Designed to work on multiple platforms and with wide industry support, OpenCL will help you more effectively program for a heterogeneous future.\n\nWritten by leaders in the parallel computing and OpenCL communities, this book will give you hands-on OpenCL experience to address a range of fundamental parallel algorithms. The authors explore memory spaces, optimization techniques, graphics interoperability, extensions, and debugging and profiling. Intended to support a parallel programming course, Heterogeneous Computing with OpenCL includes detailed examples throughout, plus additional online exercises and other supporting materials.\n\nExplains principles and strategies to learn parallel programming with OpenCL, from understanding the four abstraction models to thoroughly testing and debugging complete applications.\nCovers image processing, web plugins, particle simulations, video editing, performance optimization, and more.\nShows how OpenCL maps to an example target architecture and explains some of the tradeoffs associated with mapping to various architectures\nAddresses a range of fundamental programming techniques, with multiple examples and case studies that demonstrate OpenCL extensions for a variety of hardware platforms\n\nTable of Contents:\n\nChapter 1. Introduction to Parallel Programming\nChapter 2. Introduction to OpenCL\nChapter 3. OpenCL Device Architectures\nChapter 4. Basic OpenCL Examples\nChapter 5. Understanding OpenCLs Concurrency and Execution Model\nChapter 6. Dissecting a CPU/GPU OpenCL Implementation\nChapter 7. Data Management\nChapter 8. OpenCL Case Study: Convolution\nChapter 9. OpenCL Case Study: Histogram\nChapter 10. OpenCL Case Study: Mixed Particle Simulation\nChapter 11. OpenCL Extensions\nChapter 12. Foreign Lands: Plugging OpenCL In\nChapter 13. OpenCL Profiling and Debugging\nChapter 14. Performance Optimization of an Image Analysis Application\n","torrent":{"xt":"urn:btih:9f93254025129fac7cd262b320186043167c5acb","amp;dn":"Heterogeneous+Computing+with+OpenCL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f93254025129fac7cd262b320186043167c5acb","infoHashBuffer":{"type":"Buffer","data":[159,147,37,64,37,18,159,172,124,210,98,179,32,24,96,67,22,124,90,203]},"announce":[],"urlList":[]}}