{"title":"Barbie And The Three Musketeer (2009)(ENG FR NL) 2Lions-Team","uid":5088591,"size":4583282226,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a0daa8667a3ecb8f834465917bc37c1d8f2cb450&amp;dn=Barbie+And+The+Three+Musketeer+%282009%29%28ENG+FR+NL%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rocco64","files":-1,"time":1252939200,"description":"Barbie And The Three Musketeer \n\nBarbie en de Drie Musketiers (2009) PAL \n\n\n\nHet is &quot;EÃƒÆ’Ã‚Â©n voor Allen En Allen voor EÃƒÆ’Ã‚Â©n!&quot; in Barbie en de Drie Musketiers, een nieuw, meeslepend verhaal met Barbie en haar vriendinnen in de hoofdrollen! \n\nGa mee op avontuur met Barbie als Corinne, een meisje van het platteland dat in Parijs haar grote droom wil waarmaken: Musketier worden! In de grote stad maakt ze kennis met drie meisjes die in het geheim dezelfde droom delen. Kunnen de meiden het gemaskerde bal bijwonen en op tijd hun musketiersplunje aanschieten om de prins te redden? Zonder daarbij een hak te verliezen? Zet je schrap voor een opwindend avontuur dat bewijst dat dromen ÃƒÆ’Ã‚Â©cht kunnen uitkomen! \n\n\n\nEnglish \n\nBarbie And The Three Musketeer \n\nA girl can be anything she wants to be if she works hard, but in the days of the musketeers, certain professions were simply off-limits. Corinne (Barbie) is the daughter of a Musketeer and grew up wanting to become a musketeer and training hard to become an excellent swordsperson. When she sets off for Paris to join the musketeers, even her letter of introduction earns nothing but laughs from Captain Treville and the all-male musketeers. Forced to take a job as a castle housekeeper, Corinne soon discovers that her three fellow housekeepers have also dreamed and trained to become musketeers. Even more amazing is that the senior housekeeper had similar dreams as a child. This elder housekeeper provides further training for the three girls, encouraging them to strive to achieve what was an absolute impossibility for her generation. Just as the prince is about to become king, strange accidents begin to occur around the castle--accidents that the men musketeers seem unable to prevent. Could these unfortunate events provide an opportunity for Corinne and her friends to showcase their extraordinary swordsmanship? While the concept of Barbie as a sword-wielding musketeer may initially seem rather odd, the film is just as believable as other Barbie productions and it is refreshing to see Barbie in a somewhat less overtly-feminine role. Barbie's final quotation sums it all up nicely: &quot;True courage is pursuing your dream, even when everyone else says it's impossible.&quot; (Ages 3 to 7) \n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail \nOndertitels : Geen \n\nGenre : Animatie \nFamiliefilm \n\n\n\nDvD Inf0: \n\nSOURCE........: DvD9 \nAUDIO.........: Engels 2.0, Nederlands 2.0 &amp; Frans 2.0 \nEXTRA,S.......: Afwezig (Verwijderd!) \nMENU..........: Aanwezig (Aangepast waar nodig!) \nSUBTITLES.....: Geen (Niet aanwezig op source!) \n\n\n\n\n\nImdB Inf0: \n\nUrL: imdb.com/title/tt1484922/ \nWeblink : http://www.bol.com/nl/p/dvd/barbie-3-musketiers/1002004006887862/index.html \n\n\n\n","torrent":{"xt":"urn:btih:a0daa8667a3ecb8f834465917bc37c1d8f2cb450","amp;dn":"Barbie+And+The+Three+Musketeer+%282009%29%28ENG+FR+NL%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0daa8667a3ecb8f834465917bc37c1d8f2cb450","infoHashBuffer":{"type":"Buffer","data":[160,218,168,102,122,62,203,143,131,68,101,145,123,195,124,29,143,44,180,80]},"announce":[],"urlList":[]}}