{"title":"China Crisis - Flaunt the Imperfection","uid":3297317,"size":51889708,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a0dd4fd062ee82d903c2bcf7fe4cb3629c6821ec&amp;dn=China+Crisis+-+Flaunt+the+Imperfection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"KingStar","files":12,"time":1109805900,"description":"China Crisis underwent a complete change in sound for their third album, completely ditching the heavy dub rhythms and challenging arrangements of 1982's Difficult Shapes &amp; Passive Rhythms, Some People Think It's Fun to Entertain and 1983's Working With Fire and Steel (Possible Pop Songs Volume Two) with an altogether smoother and less aggressive sound. That doesn't equal a commercial capitulation, however; if anything, the choice of Walter Becker (of the then-unfashionable Steely Dan) as producer was a more commercially daring maneuver than anything the group had previously attempted. The overall sound is considerably prettier than before -- the placid Eno-like &quot;Black Man Ray? is downright beautiful -- and the arrangements mix synthesizers with traditional instruments in what was for 1985 an unusually graceful way, with neither predominating. Another difference from the earlier albums is that the group's songwriting is much improved, the failed instrumental experiments and tiresome dance workouts that occasionally marred their earlier albums replaced with a newfound melodic sophistication and lyrical acuity. By the time of 1987's What Price Paradise, this sophistication will be unfortunately replaced by callow slickness, but Flaunt the Imperfection is the one album where China Crisis got the balance right.","torrent":{"xt":"urn:btih:a0dd4fd062ee82d903c2bcf7fe4cb3629c6821ec","amp;dn":"China+Crisis+-+Flaunt+the+Imperfection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0dd4fd062ee82d903c2bcf7fe4cb3629c6821ec","infoHashBuffer":{"type":"Buffer","data":[160,221,79,208,98,238,130,217,3,194,188,247,254,76,179,98,156,104,33,236]},"announce":[],"urlList":[]}}