{"title":"Catwoman v3 (001 - 083) (2002 - 2008) (Digital) (Empire+DeadmanW","uid":11333413,"size":1093327771,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a0e1bb18264b821956fb4c93f844d7e61f7c64e8&amp;dn=Catwoman+v3+%28001+-+083%29+%282002+-+2008%29+%28Digital%29+%28Empire%2BDeadmanW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"nemesis43","files":83,"time":1414710396,"description":"Catwoman v3 (001 - 083) (2002 - 2008) (Digital) (Empire+DeadmanWade-DCP)\n\n\nOne of DC's longest running characters got a makeover courtesy of writer Ed Brubaker and artist Darwyn Cooke as Catwoman was relaunched. Catwoman had already gone through several changes since her first appearance in Batman# 1 (Spring 1940), but Brubaker's was one of the more dramatic. Her first solo series had ended after 94 issues in July 2001 with Catwoman's apparent death at the hands of Deathstroke, the Terminator. Since then, Selina Kyle had been keeping a low profile, with many believing her to be dead. &quot;The trial of the Catwoman&quot; a back up series in Detective #759 - 762, had private investigator Slam Bradley searching for proof that Catwoman was alive. Kyle visited Bradley to explain her actions and urge him not to reveal the fact that she had faked her own death.\n\nThe new series started a short time after and had Selina going through some major changes. She hadn't used her Catwoman costume for over 6 months and was seeing Leslie Thompkins, a therapist recommended by Batman, to talk through her problems. With her hair cut short, Selina ditched her old outfit for a slinky and (according to an approving Batman) more sensible black leather one. The opening story arc, &quot;Anodyne&quot; dealt with Catwoman's return to her old neighborhood of Gotham's East End and her worries that she might revert to her old ways. The main villain was a shape-changing serial killer who had been bringing terror to the East End's prostitutes. With Brubaker's tight, noir-like scripting and Darwyn Cooke's stylish artwork, Catwoman's new direction made the character more popular than ever.\n\nThis series lasted for 82 issues until it was canceled, only a little over a year later it was resurrected for a single issue, #83, as a tie-in to the Blackest Night event","torrent":{"xt":"urn:btih:a0e1bb18264b821956fb4c93f844d7e61f7c64e8","amp;dn":"Catwoman+v3+%28001+-+083%29+%282002+-+2008%29+%28Digital%29+%28Empire%2BDeadmanW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0e1bb18264b821956fb4c93f844d7e61f7c64e8","infoHashBuffer":{"type":"Buffer","data":[160,225,187,24,38,75,130,25,86,251,76,147,248,68,215,230,31,124,100,232]},"announce":[],"urlList":[]}}