{"title":"Stuck Up!: 100 Objects Inserted and Ingested in Places... (epub)","uid":13867065,"size":2232423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a15984956161f1d8657ebf78dd2f3d7c1f4c0814&amp;dn=Stuck+Up%21%3A+100+Objects+Inserted+and+Ingested+in+Places...+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Skyeater","files":3,"time":1458078798,"description":"Stuck Up!: 100 Objects Inserted and Ingested in Places They Shouldn’t Be\r\nby Rich E. Dreben, Murdoc Knight, Marty A. Sindhian\r\n\r\n----------\r\n\r\nA very funny collection of 100 X-ray images showing foreign objects ingested or inserted into human bodies, accidentally or on purpose.\r\nThe human imagination truly knows no limits. Without it, there would be no great art, no advances in science and technology, and no extreme sports. Without it, we'd also be deprived of the many insights into human nature that we get out of witnessing other people do shockingly imprudent things and then try to rationalize them. Stuck Up! capitalizes on this human capability of coming up with creative applications for everyday (and not-so everyday) items way beyond their designated uses, and features 100 X-ray images of foreign objects inserted into human bodies, accidentally or on purpose.\r\n\r\n&quot;It was a million-to-one shot, Doc.&quot;\r\n\r\n&quot;My hands were full.&quot;\r\n\r\n&quot;I fell.&quot;\r\n\r\nThese and many other ludicrous excuses are what emergency room doctors hear every day from patients who check in with various items inserted where the sun don't shine, stuck in various orifices, or ingested in other ways.\r\n\r\nHow exactly did that cell phone end up there? Was it on vibrate? And is the rectum truly the best place to store your bronzed baby shoes? It is at least somewhat understandable to find a rectal thermometer in its intended place, but how about your six-year-old daughter's Barbie doll?\r\n\r\nStart browsing this hilarious collection of images – you'll be surprised at the patients' creativity and the medical information provided. And: Don't try this at home.…","torrent":{"xt":"urn:btih:a15984956161f1d8657ebf78dd2f3d7c1f4c0814","amp;dn":"Stuck+Up%21%3A+100+Objects+Inserted+and+Ingested+in+Places...+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a15984956161f1d8657ebf78dd2f3d7c1f4c0814","infoHashBuffer":{"type":"Buffer","data":[161,89,132,149,97,97,241,216,101,126,191,120,221,47,61,124,31,76,8,20]},"announce":[],"urlList":[]}}