{"title":"Tachyon: The Fringe (2000) Classic","uid":4634158,"size":436245086,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a17528ff02f5c45e1993881d8c2bb9e838234869&amp;dn=Tachyon%3A+The+Fringe+%282000%29+Classic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bananrepublikken","files":7,"time":1231498376,"description":"I just spent a few hours of looking on the internet for this. Now i found it, to upload it here..\n\nTachyon: The Fringe\n\nClassic game, from 2000.\n\nJake Logan was an ace pilot, living in Sol and holding a steady job flying for Advanced Ganymede Technologies. However somewhere in the middle of a mission it all went wrong and explosions ended up killing several civilian lives. Jake has now been fired from his comfortable job, arrested by Star Patrol and exiled from Sol space. What's left is The Fringe, which consists of unexplored and contested sectors, linked together by gates run by the Tachyon Corporation. Out here, the rule of law is thin... and corporate rivalries take one a whole new deadly meaning. Take for instance a dispute between the Galspan corporation and Bora Mining, a conflict which threatens to overwhelm all allegiances within the Fringe.\n\nTachyon: The Fringe is a 1st-person space combat game. Players will sign up for missions, which vary from starbase to starbase. The objectives include escort missions, combat, recon, search and destroy, cargo scanning and sector defense. Completion of these missions will increase Jake's credit balance and unlock new equipment and ship types from different corporations. Typical equipment includes laser guns, projectile guns, missiles, scanners, ECM, mines and targeting equipment. Jake can also hire wingmen to help him out for a small initial fee, as well as a percentage of each completed mission in which they participate. There are over 60 different missions, each of which is scripted. There is no free flight ability while not on a mission, though it's usually possible to move between space stations and sectors.\n\nTachyon: The Finge also features two different multiplayer modes (Arena or BaseWar), which can be played over the Internet at NovaWorld.\n\nFrom:\nhttp://www.mobygames.com/game/tachyon-the-fringe\n\nCrack and serial should be included.\n\n\nNOTE:\nI did not make this torrent myself, so even I do not know yet if everything works.\n\nEDIT:\nEverything works, crack and all. Enjoy!\n\n- Banan","torrent":{"xt":"urn:btih:a17528ff02f5c45e1993881d8c2bb9e838234869","amp;dn":"Tachyon%3A+The+Fringe+%282000%29+Classic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a17528ff02f5c45e1993881d8c2bb9e838234869","infoHashBuffer":{"type":"Buffer","data":[161,117,40,255,2,245,196,94,25,147,136,29,140,43,185,232,56,35,72,105]},"announce":[],"urlList":[]}}