{"title":"Handbook of Optical Constants of Solids, Vol 1-4","uid":7340567,"size":21859140,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a19d78f4b0ab516efbf12dc5bfc675be8694adc5&amp;dn=Handbook+of+Optical+Constants+of+Solids%2C+Vol+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PlanetT","files":1,"time":1339229568,"description":"While bits and pieces of the index of refraction n and extinction coefficient k for a given material can be found in several handbooks, the Handbook of Optical Constants of Solids gives for the first time a single set of n and k values over the broadest spectral range (ideally from x-ray to mm-wave region). The critiquers have chosen the numbers for you, based on their own broad experience in the study of optical properties. Whether you need one number at one wavelength or many numbers at many wavelengths, what is available in the literature is condensed down into a single set of numbers. \n\n\n* Contributors have decided the best values for n and k\n* References in each critique allow the reader to go back to the original data to examine and understand where the values have come from\n* Allows the reader to determine if any data in a spectral region needs to be filled in\n* Gives a wide and detailed view of experimental techniques for measuring the optical constants n and k\n* Incorporates and describes crystal structure, space-group symmetry, unit-cell dimensions, number of optic and acoustic modes, frequencies of optic modes, the irreducible representation, band gap, plasma frequency, and static dielectric constant\n\n1998 edition","torrent":{"xt":"urn:btih:a19d78f4b0ab516efbf12dc5bfc675be8694adc5","amp;dn":"Handbook+of+Optical+Constants+of+Solids%2C+Vol+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a19d78f4b0ab516efbf12dc5bfc675be8694adc5","infoHashBuffer":{"type":"Buffer","data":[161,157,120,244,176,171,81,110,251,241,45,197,191,198,117,190,134,148,173,197]},"announce":[],"urlList":[]}}