{"title":"Bell Biv Devoe (of New Edition) - Poison 1990 [FLAC] - Kitlope","uid":6775072,"size":329277183,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a1d076c9959b7dd384e08e8f795488ec312690fb&amp;dn=Bell+Biv+Devoe+%28of+New+Edition%29+-+Poison+1990+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Kitlope","files":14,"time":1319713672,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: A1D076C9959B7DD384E08E8F795488EC312690FB\nFile Size: 314.02 MB\nYear: 1990\nLabel: MCA\nCatalog #: MCAD-6387\n\n\nPlease help seed these FLACs! \n\n\nBell Biv DeVoe is an American R&amp;B musical group which branched off from New Edition. It consists of three of New Edition's previous members, Ricky Bell, Michael Bivins, and Ronnie DeVoe. Although the group peaked in popularity in 1991, with their debut album, Poison, they still continue to perform as a group today.\n\nAfter closing the doors for 1980's R&amp;B act, New Edition, Bell, Bivins, and DeVoe went on to form Bell Biv Devoe, at the suggestion of producers Jimmy Jam &amp; Terry Lewis. Upon accepting the idea, MCA records wrote down the name &quot;Bell Bivins Devoe&quot;, but Bivins suggested they remove the &quot;ins&quot; from his name and just call the band &quot;Bell Biv Devoe.&quot;[1] With help from Public Enemy producers Eric Sadler, Hank and Keith Shocklee, and several others, Bell Biv Devoe released their debut album Poison in 1990, on MCA Records. The album has been credited as pioneering the &quot;New Jack Swing&quot; sound of the early 1990s, combining hip-hop, funk, soul, and pop music.[2] This fusion of styles helped to expose them to a fan base who prefer a harder edge sound, while at the same time helped pave the way for future R&amp;B acts.[1] Poison reached number 1 on Billboard's R&amp;B/Hip-Hop chart, and its title track, along with its second single, &quot;Do Me!&quot;, both reached number 3 on Billboard's Hot 100 chart. Poison also spawned other significant hits which include &quot;B.B.D. (I Thought It Was Me)?&quot;, &quot;When Will I See You Smile Again?&quot;, and &quot;She's Dope!&quot;.[3] Poison sold over three million copies, and was followed up by a remix album titled WBBD-Bootcity.[4][5]\nBell Biv Devoe went on to release Hootie Mack in 1993, on MCA Records, and the more hardcore rap/R&amp;B influenced BBD in 2001, on Biv 10 Records. Neither album was as successful as Poison. Despite the fact that their last album was released in 2001, the members of Bell Biv Devoe continue to perform together as a group.[6] They also participated in several New Edition reunions, and continue to perform with them on occasion.\n\nThe timing of Bell Biv DeVoe's accolades corresponds directly with the release of their first album Poison. In 1991, they were recognized at the Soul Train Music Awards for Best R&amp;B/Urban Contemporary Album of the Year, Group, Band or Duo. \n\n\n\n\n\n\nPoison 1990\n\n\nPoison is the debut studio album from American R&amp;B/hip hop group Bell Biv DeVoe, released February 28, 1990 on MCA Records.\n\nThe album peaked at number five on the Billboard 200 chart. By April of 1995, it was certified quadruple-platinum in sales by the RIAA, after sales exceeding 4,000,000 copies in the United States.\n\nTracks: \n\n1.\t&quot;Dope!&quot;  \n2.\t&quot;B.B.D. (I Thought It Was Me)?&quot;  \n3.\t&quot;Let Me Know Something?!&quot;  \n4.\t&quot;Do Me!&quot;  \n5.\t&quot;Ronnie, Bobby, Ricky, Mike, Ralph and Johnny (Word to the Mutha)!&quot;  \n6.\t&quot;Poison&quot;  \n7.\t&quot;Ain't Nut'in' Changed&quot;  \n8.\t&quot;When Will I See You Smile Again?&quot;  \n9.\t&quot;I Do Need You&quot;  \n10.\t&quot;Poison [Extended Club Version]&quot;  \n\n\n\nEnjoy :)\n\n","torrent":{"xt":"urn:btih:a1d076c9959b7dd384e08e8f795488ec312690fb","amp;dn":"Bell+Biv+Devoe+%28of+New+Edition%29+-+Poison+1990+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1d076c9959b7dd384e08e8f795488ec312690fb","infoHashBuffer":{"type":"Buffer","data":[161,208,118,201,149,155,125,211,132,224,142,143,121,84,136,236,49,38,144,251]},"announce":[],"urlList":[]}}