{"title":"The Possibility of an Absolute Architecture (Art Ebook).pdf","uid":10086959,"size":8027542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2925d6fe554f8075d385e4fd7dce922fac214b0&amp;dn=The+Possibility+of+an+Absolute+Architecture+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1399077608,"description":"P.V. Aureli, &quot;The Possibility of an Absolute Architecture (Writing Architecture)&quot;\nMIT Press | ISBN 10: 0262515792 | 2011 | PDF | 272 pages | 7.7 MB\n\nIn The Possibility of an Absolute Architecture. Pier Vittorio Aureli proposes that a sharpened formal consciousness in architecture is a precondition for political, cultural, and social engagement with the city. Aureli uses the term absolute not in the conventional sense of &quot;pure,&quot; but to denote something that is resolutely itself after being separated from its other. In the pursuit of the possibility of an absolute architecture, the other is the space of the city, its extensive organization, and its government. Politics is agonism through separation and confrontation; the very condition of architectural form is to separate and be separated. Through its act of separation and being separated, architecture reveals at once the essence of the city and the essence of itself as political form: the city as decomposition of (separate) parts.\n\nAureli revisits the work of four architects whose projects were advanced through the making of architectural form but whose concern was the city at large: Andrea Palladio. Giovanni Battista Piranesi. Etienne-Louis Boullee, and Oswald Mathias Ungers. The work of these architects, Aureli argues, addressed the transformations of the modern city and its urban implications through the elaboration of specific and strategic architectural forms. Their projects for the city do not take the form of an overall plan but are expressed as an &quot;archipelago&quot; of site specific interventions.\n\n&quot;What at first glance appears to be a book of architectural history is in fact a radical attack on theory, sweeping away the foundations of current thought in its wake. Aureli's work stands against the forces of an unlimited urbanization, proposing an idea of absolute architecture as a confrontation with the forces of global capital. A must read for those passionate about architecture and its future.&quot; Peter Eisenman\n\n&quot;Challenging the discursive boundaries and interpretive habits of countless late modern and contemporary architectural histories and theories, and with penetrating analysis directed at a compelling band of co-conspirators, from Palladio to Ungers, who share with Aureli a deep suspicion of modern urbanization, this book is a forensic tour de force. A generational call for retrieving the concept of the city as well as the reality of its histories as the basis for thinking architecture's possibilities anew.&quot; Brett Steele, Director, Architectural Association School of Architecture","torrent":{"xt":"urn:btih:a2925d6fe554f8075d385e4fd7dce922fac214b0","amp;dn":"The+Possibility+of+an+Absolute+Architecture+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2925d6fe554f8075d385e4fd7dce922fac214b0","infoHashBuffer":{"type":"Buffer","data":[162,146,93,111,229,84,248,7,93,56,94,79,215,220,233,34,250,194,20,176]},"announce":[],"urlList":[]}}