{"title":"Azra Best Of","uid":7087163,"size":288607876,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a3280082b5bb87717cf103398dc15efd29cb8139&amp;dn=Azra+Best+Of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"yezuit666","files":61,"time":1331231800,"description":"Azra was a rock band from Zagreb (Croatia) that was popular across Yugoslavia in the 1980s. Azra was formed in 1977 by its frontman Branimir &quot;Johnny&quot; Å tuliÄ‡. The other two members of the original line-up were MiÅ¡o Hrnjak (bass) and Boris Leiner (drums). The band is named after a verse [2] from &quot;Der Asra&quot; by Heinrich Heine. They are considered to be one of the most influential bands from the former Yugoslav New Wave rock era and the Yugoslav Rock scene in general.\n\nThey released their first single in 1979 with songs &quot;Balkan&quot; and &quot;A Å¡ta da radim&quot;. The first album named Azra was published in 1980 and achieved commercial success and popularized Azra in former Yugoslavia. Azra recorded its last studio album IzmeÄ‘u krajnosti (Between the extremes) in 1987. In 1988 the band recorded 4LP live album under the name ZadovoljÅ¡tina (Satisfaction), after which Å tuliÄ‡ disbanded the band. Å tuliÄ‡ recorded three more solo albums since moving to Houten, Netherlands, where he currently lives in seclusion. A 2003 rock documentary, Sretno dijete depicts Azra as the locus of the rock scene in the former Yugoslavia during the 1980s, along with Bijelo dugme. Even today, Azra remains very popular among youth in the countries of former Yugoslavia.","torrent":{"xt":"urn:btih:a3280082b5bb87717cf103398dc15efd29cb8139","amp;dn":"Azra+Best+Of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3280082b5bb87717cf103398dc15efd29cb8139","infoHashBuffer":{"type":"Buffer","data":[163,40,0,130,181,187,135,113,124,241,3,57,141,193,94,253,41,203,129,57]},"announce":[],"urlList":[]}}