{"title":"Experiencing Racism: Exploring Discrimination through the Eyes o","uid":8788542,"size":851002,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a39ca43e934e695d361ff724d2d5e7cb233c9f0e&amp;dn=Experiencing+Racism%3A+Exploring+Discrimination+through+the+Eyes+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1375885031,"description":"Experiencing Racism: Exploring Discrimination through the Eyes of College Students | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\n\nExperiencing Racism provides a thought-provoking and thorough analysis of how race is lived in America. Collecting essays on personal experiences of race and racism from a wide spectrum of college students, the authors employ existing social science literature and textual analysis to illustrate common themes and departures. The essays and associated analyses capture the impact of racism on its perpetrators and victims, highlighting how individuals choose to cope with racist experiences in their lives. Relevant empirical literature is interwoven throughout the chapters to demonstrate the intersection between existing empirical research and real-life experiences. This book is a depiction of race in America that goes beyond black and white to show how the changing racial contours of America are impacting the ways we view and experience racism.\n\n\n[b] Review [/b]\nMany of the fairly readable essays are poignant and revealing about contemporary multiracial experiences.... overall, the essays are quite interesting and insightful.... Recommended. (CHOICE, May 2010 )\n\nAs America becomes more multiracial and ethnically diverse, observers of all varieties will have to rely on the corpus of illuminating testimonies contained in this volume to understand how those coming into society mobilize their identity and specifically to what extent their perception and experiences with racism continues to exist as a negative ingredient in that process and thus, as barrier to social progress. These authors have given us a creative path to move in that direction. (Ronald Walters, professor emeritus, University of Maryland College Park )\n\n[b] About the Author [/b]\nRichard Seltzer is professor of political science at Howard University. Nicole E. Johnson is an independent researcher in urban and minority education.\n\n\n\nPaperback: 390 pages\nPublisher: Lexington Books (July 16, 2009)\nLanguage: English\nISBN-10: 0739134329\nISBN-13: 978-0739134320\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Experiencing-Racism-Exploring-Discrimination-Students/dp/0739134329/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Experiencing-Racism-Exploring-Discrimination-Students/dp/0739134329/&lt;/a&gt;\n\n\n\n\nTags: eyes, college, higher education, student, university, uni, experience, slight, poc, latin, latino, hispanic, asian, indian, mestizo, mullato, mixed, Tags: blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious, history, sociology, psychology, \n\n","torrent":{"xt":"urn:btih:a39ca43e934e695d361ff724d2d5e7cb233c9f0e","amp;dn":"Experiencing+Racism%3A+Exploring+Discrimination+through+the+Eyes+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a39ca43e934e695d361ff724d2d5e7cb233c9f0e","infoHashBuffer":{"type":"Buffer","data":[163,156,164,62,147,78,105,93,54,31,247,36,210,213,231,203,35,60,159,14]},"announce":[],"urlList":[]}}