{"title":"The Intelligence Paradox: Why the Intelligent Choice (2012) epub","uid":9592872,"size":1381023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a43a858273919132ce86d213aa713e5bc727f007&amp;dn=The+Intelligence+Paradox%3A+Why+the+Intelligent+Choice+%282012%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1391905576,"description":"The Intelligence Paradox: Why the Intelligent Choice Isn't Always the Smart One\n\n\nA book that challenges common misconceptions about the nature of intelligence\n\n Satoshi Kanazawa's Why Beautiful People Have More Daughters (written with Alan S. Miller) was hailed by the Los Angeles Times as &quot;a rollicking bit of pop science that turns the lens of evolutionary psychology on issues of the day.&quot; That book answered such burning questions as why women tend to lust after males who already have mates and why newborns look more like Dad than Mom. Now Kanazawa tackles the nature of intelligence: what it is, what it does, what it is good for (if anything). Highly entertaining, smart (dare we say intelligent?), and daringly contrarian, The Intelligence Paradox will provide a deeper understanding of what intelligence is, and what it means for us in our lives.\n\n Asks why more intelligent individuals are not better (and are, in fact, often worse) than less intelligent individuals in solving some of the most important problems in life--such as finding a mate, raising children, and making friends.\n\n Discusses why liberals are more intelligent than conservatives, why atheists are more intelligent than the religious, why more intelligent men value monogamy, why night owls are more intelligent than morning larks, and why homosexuals are more intelligent than heterosexuals.\n\n Explores how the purpose for which general intelligence evolved--solving evolutionarily novel problems--allows us to explain why intelligent people have the particular values and preferences they have.\n\n Challenging common misconceptions about the nature of intelligence, this book offers surprising insights into the cutting-edge of science at the intersection of evolutionary psychology and intelligence research.\n","torrent":{"xt":"urn:btih:a43a858273919132ce86d213aa713e5bc727f007","amp;dn":"The+Intelligence+Paradox%3A+Why+the+Intelligent+Choice+%282012%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43a858273919132ce86d213aa713e5bc727f007","infoHashBuffer":{"type":"Buffer","data":[164,58,133,130,115,145,145,50,206,134,210,19,170,113,62,91,199,39,240,7]},"announce":[],"urlList":[]}}