{"title":"[BangBus] Paola (College Girls are Easy)","uid":8778041,"size":669215967,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a4a4db6d6ee2661cf4957dc46eb5e2272b38e064&amp;dn=%5BBangBus%5D+Paola+%28College+Girls+are+Easy%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"chkm8te","files":1,"time":1375610369,"description":"[BangBus] Paola (College Girls are Easy)\n\nHey talk about shooting for the stars. This week we thought that we'd be hitting up the local campuses over at downtown Miami. School started this week and I thought it would be fun to see what kind of young meat we could hook up with, maybe get a fine roast beef sandwich or a maybe a filet mignon. Well it didn't quite work that way at all. We got there and all the girls were just blowing us off (and not in the sucking my cock way either!). So I decided that maybe if we cruised D.T just a little bit and check out the locals over there, maybe when we came back we could find a nice young thing fresh from her studies. After a hard day of hitting the books she could hit the cock. Well we did find a few interesting Columbian babes along the way but nobody wanted to get in the bus. I had a feeling it was the whole camera in your face kind of thing, but between you and me the guy riding along with us Charles was emitting an aura of ducheiness that was just pungent. So I decided that that enough was enough I went back to the college and did some more looking around when I found another Columbian walking to the bus stop. Her name was Paola and she was smoking hot! It didn't take me long to coerce her into getting into the van, but what was surprisingly better than that was that she was really really horny. Because her mouth was full of cock 10 minutes after we picked her up. I couldn't believe how easy that was and guess what if you think that watching a girl fuck in a moving car is hot, then you haven't seen Paola do anal. Enjoy!\n\nScreens: &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=o18s2jufyc674i0uusay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=o18s2jufyc674i0uusay.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=8wxppu0j5zkgtgizzhuq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=8wxppu0j5zkgtgizzhuq.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a4a4db6d6ee2661cf4957dc46eb5e2272b38e064","amp;dn":"%5BBangBus%5D+Paola+%28College+Girls+are+Easy%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a4db6d6ee2661cf4957dc46eb5e2272b38e064","infoHashBuffer":{"type":"Buffer","data":[164,164,219,109,110,226,102,28,244,149,125,196,110,181,226,39,43,56,224,100]},"announce":[],"urlList":[]}}