{"title":"Asterix.En.Los.Juegos.Olimpicos[DVDRip][Spanish]","uid":4383787,"size":838897688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a4b5a3b1c8f7906f213ef3e5cd41589ec3397912&amp;dn=Asterix.En.Los.Juegos.Olimpicos%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Mois20","files":2,"time":1220807266,"description":"Una alegre noticia llega a los romanos y los galos deciden investigar. Se enteran de que un legionario de las guarniciones cercanas a su pueblecito ha sido elegido para competir en las olimpiadas, celebradas en Grecia. Al saber esto, los galos deciden competir, asÃƒÂ­ que se embarcan en un viaje a Grecia para intentar ganar la competiciÃƒÂ³n. Si bien sÃƒÂ³lo participan griegos, y se permite a los Romanos de forma excepcional (otros pueblos no participan), Asterix argumentÃƒÂ³ que ellos &quot;eran&quot; romanos, ya que desde la conquista de las galias las mismas pertenecen a Roma. Los concursantes elegidos son Asterix y Obelix, y Panoramix como &quot;entrenador&quot;. Dicha noticia desmoraliza al Romano (y a su CenturiÃƒÂ³n, que esperaba un ascenso por su victoria), ya que gracias a la pociÃƒÂ³n mÃƒÂ¡gica la victoria de los galos serÃƒÂ­a inevitable. Una vez en Grecia los galos pasan todo el tiempo de fiesta o descansando mientras los demÃƒÂ¡s entrenan. Cuando se corren las noticias toda la delegaciÃƒÂ³n romana completa deja de entrenar y empieza a festejar tambiÃƒÂ©n, y eventualmente incluso los propios atletas griegos comienzan a flaquear.","torrent":{"xt":"urn:btih:a4b5a3b1c8f7906f213ef3e5cd41589ec3397912","amp;dn":"Asterix.En.Los.Juegos.Olimpicos%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4b5a3b1c8f7906f213ef3e5cd41589ec3397912","infoHashBuffer":{"type":"Buffer","data":[164,181,163,177,200,247,144,111,33,62,243,229,205,65,88,158,195,57,121,18]},"announce":[],"urlList":[]}}