{"title":"Euro Truck Simulator 2 v1.9.14s (2-click run)","uid":9804083,"size":774850246,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a4f1dba193d1931d34bd20088d6c62fb886bcc44&amp;dn=Euro+Truck+Simulator+2+v1.9.14s+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1395427725,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nTravel across Europe as king of the road, a trucker who delivers important cargo across impressive distances! With dozens of cities to explore from the UK, Belgium, Italy, the Netherlands, Poland, and many more, your endurance, skill and speed will all be pushed to their limits. If youÎ“Ã‡Ã–ve got what it takes to be part of an elite trucking force, get behind the wheel and prove it!\n\nFeatures\n*Transport a vast variety of cargo across more than 60 European cities.\n*Run your own business which continues to grow even as you complete your freight deliveries.\n*Build your own fleet of trucks, buy garages, hire drivers, manage your company for maximum profits.\n*A varied amount of truck tuning that range from performance to cosmetic changes.\n*Customize your vehicles with optional lights, bars, horns, beacons, smoke exhausts, and more.\n*Thousands of miles of real road networks with hundreds of famous landmarks and structures.\n\nTo recap the highlights of the 1.9 patch: \n\nCode: \nBrand new traffic car AI system; \nImproved maneuverability, touches to suspension and collision physics (more work planned still); \nEarly support for Oculus Rift and gamepad-controlled mouse cursor; \nImproved handling of automatic gearbox (more gears, interaction with cruise control); \nImproved compatibility with semi-broken prefabs used in mods; \nImproved error handling in radio playback.\n\nModels: \nScania Streamline improvements (model, textures, paint jobs, new parts and accessories) - you may need visit truck dealer and re-purchase some parts; \nVolvo FH16 improvements (interior, wipers, shadows); \nIveco Hi-way improvements (dashboard computer, shadows); \nPaintjobs are properly applied on add-ons in interior views; \nMap improvements.\n\nSound: \nV8 engine sounds for Scania R and Scania Streamline.\n\nIncluded DLC:\n* DLC Going East\n\nInstallation instructions:\n1. Execute the Euro Truck Simulator 2 v1.9.14s (2-click run).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:a4f1dba193d1931d34bd20088d6c62fb886bcc44","amp;dn":"Euro+Truck+Simulator+2+v1.9.14s+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f1dba193d1931d34bd20088d6c62fb886bcc44","infoHashBuffer":{"type":"Buffer","data":[164,241,219,161,147,209,147,29,52,189,32,8,141,108,98,251,136,107,204,68]},"announce":[],"urlList":[]}}