{"title":"Building a Home Security System with BeagleBone","uid":10204489,"size":17967785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5399fdb6ef510a80e2c311f983c94e967620eef&amp;dn=Building+a+Home+Security+System+with+BeagleBone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"wildturkey00","files":4,"time":1400825677,"description":"Overview\nBuild your own state-of-the-art security system\nMonitor your system from anywhere you can receive e-mail\nAdd control of other systems such as sprinklers and gates\nSave thousands on monitoring and rental fees\n\nIn Detail\nOne of the best kept secrets of the security industry is just how simple the monitoring hardware actually is - BeagleBone has all the computing power you need to build yourself an extremely sophisticated access control, alarm panel, and home automation and network intrusion-detection system. Security companies make a fortune each year by charging exorbitant fees to their customers. You will learn how easy it is to make an alarm system with Beaglebone.\nA company-maintained-and-monitored alarm system has its place - your dear old mum is probably not going to be creating her own system any time soon. But if you are reading this book, you are probably a builder or a hobbyist with all the skills required to do it yourself. With Building a Home Security System with BeagleBone, you will learn everything you need to know to develop your own state-of-the-art security system, all for less than a year's worth of monitoring charges from your local alarm company!\nYou will start by building and testing your hardware and open source software on an experimenter's prototype board before progressing to more complex systems. You will then learn how to test your new creations in a modular fashion and begin to utilize BeagleBone. Once your system is built and tested, you will install some of the professional-grade sensors used in modern alarm systems and learn how to use them. You will also discover how to extend your alarm system in a variety of different ways. The only limit will be your imagination.\n\nWhat you will learn from this book\nUnderstand the components of an alarm system\nBuild a basic zone 1 alarm system\nModify your alarm system to perform complex tasks\nBuild the actual hardware onto BeagleBone\nIntegrate home automation into your security system\nProtect your network from intruders\nKeep an eye on your system from anywhere in the world\nInstall and use a range of sensor equipment\n\nApproach\nBuilding a Home Security System with BeagleBone is a practical, hands-on guide for practical, hands-on people. The book includes step-by-step instructions for assembling your own hardware on professionally manufactured PCB's and setting up the software on your system.\n\nWho this book is written for\nThis book is for anyone who is interested in alarm systems and how they work; for hobbyists and basement tinkerers who love to build things. If you want to build the hardware described in this book, you will need some basic soldering skills, but all the parts are of the thru-hole variety and are very easy to put together. When it comes to software, you can just run it as-is, but if you want to modify the code, you will need knowledge of Java and IDEs.","torrent":{"xt":"urn:btih:a5399fdb6ef510a80e2c311f983c94e967620eef","amp;dn":"Building+a+Home+Security+System+with+BeagleBone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5399fdb6ef510a80e2c311f983c94e967620eef","infoHashBuffer":{"type":"Buffer","data":[165,57,159,219,110,245,16,168,14,44,49,31,152,60,148,233,103,98,14,239]},"announce":[],"urlList":[]}}