{"title":"Greenwich Village (1944) Xvid 1cd - Carmen Miranda, Don Ameche M","uid":9997856,"size":734576640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a56d1da514fd93ea64a245c629996c6ead7716a3&amp;dn=Greenwich+Village+%281944%29+Xvid+1cd+-+Carmen+Miranda%2C+Don+Ameche+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SaM","files":-1,"time":1397942308,"description":"Greenwich Village (1944) Xvid 1cd - Carmen Miranda, Don Ameche Musical [DDR]\n\nGreenwich Village is a 1944 film from Twentieth Century Fox directed by Walter Lang. It stars Carmen Miranda and Don Ameche.\n\n    CAST:-\n    Carmen Miranda as Princess Quereda O'Toole\n    Don Ameche as Kenneth Harvey\n    William Bendix as Danny O'Mara\n    Vivian Blaine as Bonnie Watson\n    Felix Bressart as Hofer\n\nDirected by Walter Lang\nRunning time 82 minutes\n\nSYNOPSIS:- Greenwich Village (1944)\nIn 1922, aspiring composer Kenneth Harvey (Don Ameche) travels from the Midwest to Greenwich Village, New York, where he hopes to interest famed composer Kavosky in his concerto. Kenneth wanders into a speakeasy owned by the brash Danny O'Hare (William Bendix), who wants to put on a musical extravaganza showcasing his singing sweetheart, Bonnie Watson (Vivian Blaine). Danny hopes that the show will make Bonnie a star and make up for the fact that he cost her an opportunity of playing a leading role for Ziegfeld. Danny's other main entertainer, Princess Querida (Carmen Miranda), mistakenly assumes that Kenneth is rich, although the few hundred-dollar bills he innocently flashes are the extent of his traveling money. \nDanny immediately targets Kenneth as a chump and begins to get friendly with him, but Bonnie disapproves and allows Kenneth to escort her home. At her apartment, Bonnie confesses that when she came to Greenwich Village, she had aspirations to become a poet, and advises Kenneth to be more careful about displaying his money. Danny, jealous of Kenneth and Bonnie's obvious attraction to each other, brings the gang up to Bonnie's apartment for a party, and Kenneth plays some of his concerto for them. The next morning, Danny arranges for Kenneth to move to the top floor apartment and begin writing songs for their show, although Bonnie stipulates that music from Kenneth's concerto must be withdrawn from the show if Kavosky likes it. Meanwhile, Hofer, a former violinist with Kavosky's orchestra, persuades the maestro to hear Kenneth play, which Kavosky reluctantly does to get rid of Hofer. Hofer then lies to Kenneth, telling him that Kavosky wants to perform his concerto at Carnegie Hall, and that they should begin the orchestrations immediately. Kenneth works hard on his music, which he withdraws from Danny's show, even though Bonnie has already written the lyrics. Danny is infuriated, especially when he sees Bonnie and Kenneth kiss, but Bonnie is thrilled by Kenneth's seeming good fortune. \n\nUnknown to Bonnie, Danny, who continues to rehearse the numbers using Kenneth's music, is aware of the situation when Hofer swindles Danny out of his life savings, which Hofer (Felix Bressart) says is the down payment on the musicians' wages for the Carnegie Hall performance. Hofer disappears with the money, and Kenneth discovers his treachery after speaking to the surprised Kavosky. The heartbroken Kenneth is on his way home when he sees Hofer returning the money to Danny, who has realized that Bonnie is truly in love with Kenneth. The young composer misunderstands the situation and assumes that Danny and Bonnie were in on the swindle. While Kenneth is angrily packing, Querida questions him and learns of his misapprehension. She then gets him arrested by giving him some bootleg liquor to carry, and while Kenneth languishes in jail, Danny, Bonnie and the others step up their rehearsals and prepare to open the show. On opening night, Danny's right-hand man, Brophy, bails Kenneth out of jail, and the irate composer rushes over to the theater to confront Danny. As he watches from the audience, Kenneth is amazed to see Kavosky conduct his concerto, which has been turned into an elaborate number featuring Querida and Bonnie. Kenneth rushes backstage, where Danny reveals that Kavosky volunteered his services after learning of the swindle perpetrated by Hofer. Danny also advises Kenneth to make up with Bonnie, and after her final number, Kenneth embraces her in the wings.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nAudio Languages: English\nRunTime 83 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 83 mins","torrent":{"xt":"urn:btih:a56d1da514fd93ea64a245c629996c6ead7716a3","amp;dn":"Greenwich+Village+%281944%29+Xvid+1cd+-+Carmen+Miranda%2C+Don+Ameche+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56d1da514fd93ea64a245c629996c6ead7716a3","infoHashBuffer":{"type":"Buffer","data":[165,109,29,165,20,253,147,234,100,162,69,198,41,153,108,110,173,119,22,163]},"announce":[],"urlList":[]}}