{"title":"Emily St. John Mandel-The LOLA QUARTET","uid":15383329,"size":183951201,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a5bd961b07c6ad1bf672cc47e681888295d57321&amp;dn=Emily+St.+John+Mandel-The+LOLA+QUARTET&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"twocows","files":32,"time":1469255630,"description":"\n   \r\n\r\nGavin Sasaki is a promising young journalist in New York City, until he' s fired in disgrace following a series of unforgivable lapses in his work. It' s early 2009, and the world has gone dark very quickly; the economic collapse has turned an era that magazine headlines once heralded as the second gilded age into something that more closely resembles the Great Depression. The last thing Gavin wants to do is return to his hometown of Sebastian, Florida, but he' s drifting toward bankruptcy and is in no position to refuse when he' s offered a job by his sister, Eilo, a real estate broker who deals in foreclosed homes. Eilo recently paid a visit to a home that had a ten-year-old child in it, a child who looks very much like Gavin and who has the same last name as Gavin' s high school girlfriend Anna, whom Gavin last saw a decade ago. Gavin-- a former jazz musician, a reluctant broker of foreclosed properties, obsessed with film noir and private detectives-- begins his own private investigation in an effort to track down Anna and their apparent daughter who have been on the run all these years from a drug dealer from whom Anna stole $121,000. In her most ambitious novel yet, Emily Mandel combines her most fully realized characters with perhaps her most fully developed story that examines the difficulty of being the person you'd like to be, loss, the way a small and innocent action (e.g., taking a picture of a girl in a foreclosed house) can have disastrous consequences. The Lola Quartet is a work that pays homage to literary noir, is concerned with jazz, Django Reinhardt, economic collapse, love, Florida' s exotic wildlife problem, crushing tropical heat, the leavening of the contemporary world, compulsive gambling, and the unreliability of memory. This is literary fiction with a strong detective story element","torrent":{"xt":"urn:btih:a5bd961b07c6ad1bf672cc47e681888295d57321","amp;dn":"Emily+St.+John+Mandel-The+LOLA+QUARTET","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5bd961b07c6ad1bf672cc47e681888295d57321","infoHashBuffer":{"type":"Buffer","data":[165,189,150,27,7,198,173,27,246,114,204,71,230,129,136,130,149,213,115,33]},"announce":[],"urlList":[]}}