{"title":"Carbon Nanotube and Related Field Emitters","uid":15418177,"size":22437520,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a61be20252be9bd9a3f7bbfffb77fcb1f4faddf2&amp;dn=Carbon+Nanotube+and+Related+Field+Emitters&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1469608245,"description":"Carbon Nanotube and Related Field Emitters - Fundamentals and Applications - Yahachi Saito (Wiley-VCH, 2010).pdf\r\n\r\nCarbon nanotubes (CNTs) have novel properties that make them potentially useful in many applications in nanotechnology, electronics, optics and other fields of materials science. These characteristics include extraordinary strength, unique electrical properties, and the fact that they are efficient heat conductors. Field emission is the emission of electrons from the surface of a condensed phase into another phase due to the presence of high electric fields. CNT field emitters are expected to make a breakthrough in the development of field emission display technology and enable miniature X-ray sources that will find a wide variety of applications in electronic devices, industry, and medical and security examinations.\r\nThis first monograph on the topic covers all aspects in a concise yet comprehensive manner - from the fundamentals to applications. Divided into four sections, the first part discusses the preparation and characterization of carbon nanotubes, while part two is devoted to the field emission properties of carbon nanotubes, including the electron emission mechanism, characteristics of CNT electron sources, and dynamic behavior of CNTs during operation. Part three highlights field emission from other nanomaterials, such as carbon nanowalls, diamond, and silicon and zinc oxide nanowires, before concluding with frontier R&amp;D applications of CNT emitters, from vacuum electronic devices such as field emission displays, to electron sources in electron microscopes, X-ray sources, and microwave amplifiers. Edited by a pioneer in the field, each chapter is written by recognized experts in the respective fields","torrent":{"xt":"urn:btih:a61be20252be9bd9a3f7bbfffb77fcb1f4faddf2","amp;dn":"Carbon+Nanotube+and+Related+Field+Emitters","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a61be20252be9bd9a3f7bbfffb77fcb1f4faddf2","infoHashBuffer":{"type":"Buffer","data":[166,27,226,2,82,190,155,217,163,247,187,255,251,119,252,177,244,250,221,242]},"announce":[],"urlList":[]}}