{"title":"OO DiskRecovery Professional v9.0.223 x86.x64.Incl.Keymaker-ZWT","uid":9518382,"size":24752972,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a707dd69690d7462a32befbafa87a92386025262&amp;dn=OO+DiskRecovery+Professional+v9.0.223+x86.x64.Incl.Keymaker-ZWT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"oftiscroft","files":-1,"time":1390575641,"description":"O&amp;O DiskRecovery 9 searches for and reconstructs data that was deleted or lost through software error. It scans the entire hard disk, partition or USB Stick for lost files. Usage is very intuitive, with a step-by-step wizard enabling users with little or no experience to easily recovery data they feared was lost. The free trial version lets users see before they buy just what lost data is in fact recoverable.\nNew and improved functions\n\nO&amp;O DiskRecovery 9 can recognize even more file types, for instance Microsoft Office 2013 documents. The recovery of picture and video files from digital cameras has been enhanced, and the search for compressed files, in particular ZIP and 7zip files, has been further advanced. The new version is fully compatible with, and optimized for, the new Windows 8 releases from Microsoft.\nO&amp;O Disk Recovery in an emergency:\n\nA data recovery with the O&amp;O DiskRecovery 9 Instant Installation can be carried out without overwriting important data. Installation is done over a second computer, and the program files are made available on a portable disk or in the network.\nIntegrate Data Images:\n\nData backups created by O&amp;O DiskImage can be integrated into O&amp;O DiskRecovery. To avoid data loss due to a hardware defect, a forensic image can be created using the separately available O&amp;O DiskImage product. Such a comprehensive image also backs-up supposed free disk space so that a data recovery can be performed at a later date without having to use the original hardware.\n\nOperating systems: Windows XP, Vista, 7, 8, 8.1\n\nDoes NOT work on: Windows 2000 Server, 2003, 2008, 2008 R2\n\nContained within the compressed file are both versions 32/64 bit.\n\nKeymaker has been tested at virustotal with 8/50 detections, the majority of which identify it as a keygen, oddly enough. If you're paranoid then run it in your favourite sandboxing software for that warm fuzzy feeling of security.\n\nThat's it, have fun!","torrent":{"xt":"urn:btih:a707dd69690d7462a32befbafa87a92386025262","amp;dn":"OO+DiskRecovery+Professional+v9.0.223+x86.x64.Incl.Keymaker-ZWT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a707dd69690d7462a32befbafa87a92386025262","infoHashBuffer":{"type":"Buffer","data":[167,7,221,105,105,13,116,98,163,43,239,186,250,135,169,35,134,2,82,98]},"announce":[],"urlList":[]}}