{"title":"Super Size Me VO FR ST 720p WEB-DL","uid":11681821,"size":3039316121,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a74467e17f6f5f31954641d5e2795fd1bb4f5da6&amp;dn=Super+Size+Me+VO+FR+ST+720p+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":4,"time":1423143716,"description":"Super Size Me is a 2004 American documentary film directed by and starring Morgan Spurlock, an American independent filmmaker. Spurlock's film follows a 30-day period from February 1 to March 2, 2003 during which he ate only McDonald's food. The film documents this lifestyle's drastic effect on Spurlock's physical and psychological well-being, and explores the fast food industry's corporate influence, including how it encourages poor nutrition for its own profit.\n\nAs the film begins, Spurlock is in physically above average shape according to his personal trainer. He is seen by three physicians (a cardiologist, a gastroenterologist, and a general practitioner), as well as a nutritionist and a personal trainer. All of the health professionals predict the &quot;McDiet&quot; will have unwelcome effects on his body, but none expected anything too drastic, one citing the human body as being &quot;extremely adaptable&quot;. Prior to the experiment, Spurlock ate a varied diet but always had vegan evening meals to appease his then-girlfriend, Alexandra, a vegan chef. At the beginning of the experiment, Spurlock, who stood 6 feet 2 inches (188 cm) tall, had a body weight of 185.5 lbs (84 kg)","torrent":{"xt":"urn:btih:a74467e17f6f5f31954641d5e2795fd1bb4f5da6","amp;dn":"Super+Size+Me+VO+FR+ST+720p+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a74467e17f6f5f31954641d5e2795fd1bb4f5da6","infoHashBuffer":{"type":"Buffer","data":[167,68,103,225,127,111,95,49,149,70,65,213,226,121,95,209,187,79,93,166]},"announce":[],"urlList":[]}}