{"title":"Simone Felice - Strangers (2014) [FLAC]","uid":9831230,"size":241954541,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a749ed3a0bbc1e36d973c0af40bb153c0997d149&amp;dn=Simone+Felice+-+Strangers+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1395844423,"description":"\n  Simone Felice - Strangers (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Indie Folk\n  Source: Scene CD (outerspace)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Molly-O \n  02 If You Go to LA\n  03 Running Through My Head\n  04 Our Lady of the Gun \n  05 Bye Bye Palenville\n  06 Gettysburg\n  07 The Best That Money Can Buy \n  08 Heartland \n  09 Bastille Day \n  10 The Gallows\n\n  When a band breaks up, you usually don't count on the drummer to be the one with the remarkable solo career (don't mention Dave Grohl; he's the exception that proves the rule), but with the Felice Brothers presumably a thing of the past, the group's former timekeeper Simone Felice is the one who has been stepping forward with an impressive body of work. Felice's self-titled effort of 2012 was a strong, well-crafted debut, but 2014's Strangers is the real step forward, a set of songs that updates the singer/songwriter templates of the '70s to the present day in terms of both musical approach and lyrical intelligence (though given the fact Simone wrote many of the Felice Brothers' most memorable songs and is a published novelist, that should come as no surprise). \n\n  Felice's voice is a memorable instrument with a mild emotional vibrato that adds to the drama of tunes like &quot;If You Go to LA&quot; and &quot;The Best That Money Can Buy,&quot; while still sounding strong and generous on poppy numbers like &quot;Molly-O!&quot; and more polished turns such as &quot;Heartland.&quot; David Baron co-produced Strangers with Felice, and they've given the material a sound that is smooth and meticulously crafted without sounding slick or stiff. Just as songwriters like Judee Sill and David Ackles could create something genuine and distinctive with a handful of studio musicians, Felice shows that craft and soul can coexist on these sessions, as &quot;The Gallows,&quot; &quot;Bastille Day,&quot; and &quot;Bye Bye Palenville&quot; tell stories that border on tragedy with honesty, compassion, and genuine beauty. Strangers wavers between the sad and joyous sides of life, but Felice finds something out of the ordinary wherever he looks, and this record confirms this drummer just so happens to be a songwriter and frontman of the first order.","torrent":{"xt":"urn:btih:a749ed3a0bbc1e36d973c0af40bb153c0997d149","amp;dn":"Simone+Felice+-+Strangers+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a749ed3a0bbc1e36d973c0af40bb153c0997d149","infoHashBuffer":{"type":"Buffer","data":[167,73,237,58,11,188,30,54,217,115,192,175,64,187,21,60,9,151,209,73]},"announce":[],"urlList":[]}}