{"title":"Hou Hsaio-hsien - A Time To Live, A Time To Die (1985)","uid":4118814,"size":1991124201,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a7e5e2411d65ee94299f82f82bf479c7b59fdd62&amp;dn=Hou+Hsaio-hsien+-+A+Time+To+Live%2C+A+Time+To+Die+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"clownmonkey","files":3,"time":1207440995,"description":"AKA &quot;Tong nien wang shi&quot;\n\nChinese with English hardsubs (my apologies, they're in my source)\n\nFor screenshots, please check Freakyflicks NEW RELEASES\n\nAn IMdB user review:\n\nSeeking a better life, a teacher brings his family from Mei County in the Kwangtung Province of mainland China to Fengshan in the south of Taiwan in 1947. As a result of the Communist takeover on the mainland, the family is forced to remain in Taiwan, estranged from their traditional home and culture. The Time to Live and The Time to Die, a semi-autobiographical film by Taiwanese director Hou Hsiao-Hsien, is a compassionate story of a family's struggle to adapt to living in a new society. Loosely based on the childhood memories of Taiwanese director Hou Hsiao-Hsien who came to Taiwan in 1948, the film chronicles the passing of the older generation and the emergence of the new. The director narrates the film from the point of view of the youngest son, Ah-Hsiao (You Anshun), called Ah-ha by his grandmother (Tang Yu-Yuen).\n\nThe Time to Live is shot in a reflective style that allows an intimacy with the material. In the first half, the family learns to adjust to their new environment: the children play outside, the family eats dinner together and engage in small family rituals. Hou is observant of the political and technological changes taking place in the background, noting, for example, the increasing number of cars and motorcycles on the streets, the installation of electricity in their home, the improving medical treatment that the parents receive, and a letter from an aunt revealing the Great Leap Forward in China. What doesn't change, however, is the continued second class status of women, depicted in a scene where the mother lectures the daughters about their responsibilities for housework and how it must come before an education.\n\nAs the family gets older, the longing for their homeland increases. On several occasions, the old grandmother becomes disoriented and asks shopkeepers for directions to the Mekong Bridge (in China). When she gets lost, she has to be returned home via taxicab. The second half of the film painfully shows the loss of parental guidance and the disintegration of the family. As illness sets in, the parent's pain and slow disintegration takes place directly in front of the camera, not in the background. Ah Hsiao and his siblings stoically endure the loss of both parents, but their growing involvement in delinquency and petty crime underscores the loss of structure in their lives.\n\nThis is Hou's most personal film and one that is filled with images of extraordinary power. I was moved to see Ah Hsiao face when he sees death for the first time while walking into the room containing his father's body, and when the family shares loving recollections of the father soon after his death. Backed by a lyrical soundtrack, the street scenes and images of family life convey a rare authenticity and visual poetry. As in the film &quot;Pather Panchali&quot; by Satyajit Ray, the tiny village in Taiwan becomes a microcosm of the outside world. Like Ray's masterpiece, it is a sad film, yet, in its celebration of the wonder of life and the strength of the human spirit, it is also triumphant. The Time to Live and the Time to Die is not only a loving tribute of one son to his family but a testament to the strength of all families. -- Howard Schumann, IMdB user\n\n===\n\n--- File Information ---                                                        \nFile Size (in bytes):                           1,991,120,896                     \n                                                                                \n--- Container Information ---                                                   \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)                 \nSubtype (e.g &quot;OpenDML&quot;):                        OpenDML (AVI v2.0),                   \nInterleave (in ms):                             42          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned         \nTotal System Bitrate (kbps):                    0            \nBytes Missing (if any):                         0            \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  xvid              \nVideo Codec Name(e.g. &quot;DivX 3, Low-Motion&quot;):    XviD              \nVideo Codec Status(e.g. &quot;Codec Is Installed&quot;):  Codec(s) are Installed            \nDuration (hh:mm:ss):                            02:06:34                \nFrame Count:                                    182064             \nFrame Width (pixels):                           704                  \nFrame Height (pixels):                          416                     \nDisplay Aspect Ratio (&quot;DAR&quot;):                   1.692                     \nFrames Per Second:                             23.96                 \nVideo Bitrate (kbps):                           2025                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP         \n                                                                                \n--- Audio Information ---              \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055(MP3, ISO) MPEG-1 Layer 3          \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            106                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR            \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2           \n\n===\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:a7e5e2411d65ee94299f82f82bf479c7b59fdd62","amp;dn":"Hou+Hsaio-hsien+-+A+Time+To+Live%2C+A+Time+To+Die+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7e5e2411d65ee94299f82f82bf479c7b59fdd62","infoHashBuffer":{"type":"Buffer","data":[167,229,226,65,29,101,238,148,41,159,130,248,43,244,121,199,181,159,221,98]},"announce":[],"urlList":[]}}