{"title":"Darwin Deez - Songs for Imaginative People (2013) [FLAC]","uid":8210510,"size":281680604,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7efbed253f13b6994264c6cf51089ed9fa79536&amp;dn=Darwin+Deez+-+Songs+for+Imaginative+People+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1362229853,"description":"\n  Darwin Deez - Songs for Imaginative People (2013) [FLAC]\n\n  Released: 2013\n  Duration: 40:30\n  Genre: Pop/Rock\n  Style: Alternative, Singer/Songwriter\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n \n  01 (800) HUMAN \n  02 You Can't Be My Girl \n  03 Moonlit \n  04 No Love \n  05 Good to Lose \n  06 Alice \n  07 Redshift \n  08 Free (The Editorial Me) \n  09 All in the Wrist \n  10 Chelsea's Hotel \n\n  Eager to prove that his abilities were more impressive than his image, Brooklyn hipster Darwin Deez upped the ante with a showy, unconventional songwriting style on his follow-up to 2009's self-titled debut. The stringy curls and mustache pictured on the album cover of Songs for Imaginative People may recall Dirty Mind-era Prince, but, in fact, he takes a page from the purple one musically, as an extremely talented guitar player who is more concerned with clever song structure, introspective lyrics, and intricate production than with showing off his licks (which, like Prince's, tend to be clean and very funky). \n\n  Deez has tricks on his six-string for sure, but he inserts them sparingly, concentrating instead on forcing musical ideas together in a cut-and-paste fashion. The singer's harsh pitchy voice and abstract conversational lyrics have given critics good reason to describe Deez as quirky, but looking deeper, he is a tremendous producer. In the studio he expands his palette with a clever array of '80s pop instrumentation, alongside trilling synthesizers and electronic drum loops. Collage artists like Beck and Cornelius play an inspirational part in his recording style, which is filled with complex, jagged bridges and breakdowns that wedge apart any typical pop inclinations. Again, the depth of the production is impressive, but Deez seems stranded between art and pop, caught in the slacker trap of trying to make a standout single yet never sounding particularly concerned about it. Drawn-in listeners are sure to be rewarded with increased payoffs after multiple listens, but even they may long for the simpler days of &quot;Radar Detector.&quot;","torrent":{"xt":"urn:btih:a7efbed253f13b6994264c6cf51089ed9fa79536","amp;dn":"Darwin+Deez+-+Songs+for+Imaginative+People+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7efbed253f13b6994264c6cf51089ed9fa79536","infoHashBuffer":{"type":"Buffer","data":[167,239,190,210,83,241,59,105,148,38,76,108,245,16,137,237,159,167,149,54]},"announce":[],"urlList":[]}}