{"title":"Alvin and the Chipmunks - Christmas with the Chipmunks, Vol. 1","uid":6850092,"size":166109300,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a838aeaa846b141864b5a6d7fa86eedc4da9ffd5&amp;dn=Alvin+and+the+Chipmunks+-+Christmas+with+the+Chipmunks%2C+Vol.+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1322441329,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61kh5qZ8tiL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61kh5qZ8tiL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Christmas with the Chipmunks, Vol. 1\nArtist: Alvin &amp; the Chipmunks\nAudio CD (September 1, 1995)\nOriginal Release Date: 1962\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n1. Chipmunk Song, The (Christmas Don't Be Late)\n2. (All I Want for Christmas Is) My Two Front Teeth\n3. Jingle Bells\n4. Frosty the Snowman\n5. Santa Claus Is Comin' to Town\n6. Rudolph, the Red-Nosed Reindeer\n7. The Night Before Christmas\n8. Silver Bells\n9. White Christmas\n10. We Wish You a Merry Christmas\n\n\nAmazon Review:\nAlvin, Simon, and Theodore, the singing rodents, are that rare sort of novelty that has outlived its novelty aspect to become an American institution. The Chipmunks are here to stay, whether it's from children of years past remembering them fondly now as adults, or just an inherent power in the simplicity of the idea--the sheer ingenuity of speeding up human voices to the point of hilarity. This classic 1962 album features the 'Munks in all their holiday glee. They're as fresh and guileless as the Beach Boys, and their harmonies are crisp and tight, while the material is exactly the type of spirited fun kids of all ages can relate to. Be forewarned that though the album has 12 tracks, the duration is only 24 minutes.\n\nAllmusic Review:\nIf you ignore, with the benefit of &quot;grown-up&quot; hindsight, the fact that the voices of Alvin, Simon, and Theodore were somewhat shrill, occasionally tuneless, and arguably annoying to obnoxious levels, the first volume of Christmas With the Chipmunks is a classic holiday record, and it certainly is that. The minor failings of those three cartoon voices are easy to ignore, and ultimately dismiss, especially if you were a child or were raising one in the 1960s and 1970s. For kids the world already pulsates with a sort of cartoonish, surreal vitality, and never more powerfully than at Christmastime, so the impossible-to-corral Alvin, Simon, and Theodore are the perfect spokesmen (or spokes-chipmunks, as it were) to capture that exhilarating sense of anticipation, the dreamily translucent run from the day after Thanksgiving until the morning when Santa Claus finally drops off the season's gifts. You really do have to withhold &quot;critical&quot; judgment when approaching this record, suspend any degree of cultivated jadedness, and place yourself back in those size five Keds you or your children used to wear. When that task has been accomplished, Christmas With the Chipmunks reveals itself for what it is: an album that is not only amusingly charming, but packed beginning to end with a wide-eyed sense of innocence and bountiful levels of seasonal exuberance, possibly enough to crack the stolid gazes of even the harshest Scrooges. An inspired novelty from the mind of actor and songwriter Ross Bagdasarian (who puts in a performance as the scatterbrained but affectionate taskmaster David Seville), the album is outstanding on a musical level, too -- a point that is often lost amid the chattering voices of the trio of lovable rodents. Some of the songs have a jazzy lilt, most immaculately on &quot;Here Comes Santa Claus&quot; and the wonderful &quot;Over the River and Through the Woods,&quot; each of which is buoyed by goofy touches of orchestral percussion, ensuring that the music retains its good-natured wink and plays to the album's hokeyness. &quot;Rudolph the Red-Nosed Reindeer,&quot; on the other hand, is knee-deep in early rock &amp; roll production and rhythms, while Bagdasarian's original tune &quot;The Chipmunk Song,&quot; an instant holiday classic, has the allure of an old Italian love song. The songs, of course, cannot be disparaged in the least, all of them Christmas standards. Despite the small quibble here or there, the same can be said about the album as whole. And if you heard these versions for the first time between the ages of three to ten years, they probably will remain the standards against which you will hold all others for the rest of your life.","torrent":{"xt":"urn:btih:a838aeaa846b141864b5a6d7fa86eedc4da9ffd5","amp;dn":"Alvin+and+the+Chipmunks+-+Christmas+with+the+Chipmunks%2C+Vol.+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a838aeaa846b141864b5a6d7fa86eedc4da9ffd5","infoHashBuffer":{"type":"Buffer","data":[168,56,174,170,132,107,20,24,100,181,166,215,250,134,238,220,77,169,255,213]},"announce":[],"urlList":[]}}