{"title":"The Horror Movie Collection","uid":6778435,"size":19261673672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a98b73e806a43830c5f79df372f73ac89076f4a2&amp;dn=The+Horror+Movie+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"neil1966hardy","files":17,"time":1319807320,"description":"Movies : Horror : DVD Rip : English\n16 Horror Films of old and newish horror some rare.All Dvd rips but quality not the best on some of the older ones.take what u want if u dont like the look then walk on by.\n\nCampsite Massacre\nA group of forest rangers go camping in the woods, and trespass into an area where a\n\nbackwoods mama likes to kill people who come onto her turf.\n\n\n\nStarring John Friedrich, Adrian Zmed, Ernest Harden Jr., Lewis Smith, Rachel Ward, Daryl\n\nHannah, Akosua Busia, Joe Pantoliano, Mark Metcalf\nDirector Andrew Davis\nStudio VIDEO INTERNATIONAL\nRun time : 1 hr 21 mins\nCertificate 18\nGenres Horror\nLanguage : English\nProduction year: 1983\n\n\nSkinned Deep\nAn horrific, disfigured killer is on the loose. The Surgeon General is an abominable figure,\n\nwhose stretched skin is framed by his bear trap mouth. Wielding a formidable blade,\n\nabsolutely no one is safe\n\n\n\nStarring Karoline Brandt, Jay Dugre, Aaron Sims, Kurt Carley, Peter Iasillo\nDirector Gabe Bartalos\nStudio THIRD MILLENNIUM\nRun time : 1 hr 37 mins\nCertificate 18\nGenres Horror\nLanguage : English\n\nDon't Look In The Basement\nWhen Nurse Charlotte Beal arrives for work at a sanatorium, one of the doctors has been\n\nmurdered. The asylum has been overrun, and not even the doctors can be trusted.\n\n\n\nStarring Bill McGhee, Jessie Lee Fulton, Robert Dracup, Harryette Warren\nDirector S.F. Brownrigg\nStudio ELSTREE HILL ENTERTAINMENT\nRun time : 1 hr 29 mins\nCertificate 15\nGenres Horror\nLanguage : English\nProduction year: 1973\n\nDon't Ring The Doorbell\nEllen is left to care for her mentally impaired younger sister Cissy following the death of\n\nher father. When Ellen's boyfriend visits, however, it is not long before he discovers\n\nCissy's murderous tendencies... Based on the play by Eric Wesphal.\n\n\n\nStarring Lee Grant, Carol Kane, Will Geer, James Olson\nDirector Karen Arthur\nStudio AVENUE ENTERTAINMENT\nRun time : 1 hr 35 mins\nCertificate 15\nGenres Horror\nLanguage : English\nProduction year: 1981\n\nEat And Run\nAn alien from outer space named Murray Creature lands on Earth and develops an appetite for\n\nItalian...not the food...the people. It's up to a wily detective to put a stop to his\n\nmonstrous appetite in this inventive comedy.\n\n\n\nStarring Ron Silver, Sharon Schlarth, R.L. Ryan\nDirector Christopher Hart\nStudio AVENUE ENTERTAINMENT\nRun time : 1 hr 20 mins\nCertificate 15\nGenres Comedy Horror\nLanguage : English\n\nHell Penitentiary\nA famous physician goes undercover as an inmate, and infiltrates a female prison in an\n\nattempt to expose the truth behind her sister's suspicious death. She soon falls victim to\n\nthe prison's sadistic wardens, however...\n\n\n\nStarring Ajita Wilson, Rita Silva, Linda Jones, Alex Freyberger\nDirector Gianni Siragusa\nStudio AVENUE ENTERTAINMENT\nRun time : 1 hr 28 mins\nCertificate 18\nGenres Thriller,Horror\nLanguage : English\n\nGhoulies 4\nJonathan is now a policeman and has a new girlfriend. But his past is about to catch up with\n\nhim in the form of Alexandra and Faust...\n\n\nStarring Bobby Di Cicco, Stacie Randall, Peter Liapis, Barbara Alyn Woods, Raquel Krelle\nDirector Jim Wynorski\nStudio AVENUE ENTERTAINMENT\nRun time : 1 hr 20 mins\nCertificate 15\nGenres Comedy,Horror\nLanguage : English\n\nFlesh For The Beast [Uncut]\nAlmost one hundred years after the death of Alfred Fischer, an occultist who conjured up\n\nevil demons that hunted human prey, a group of para-psychologists enter his manor and they\n\ndon't have to wait long for evil to re-emerge...\n\n\n\nStarring Jane Scarlett, Sergio Jones, Clark Beasley Jr., Jim Coope, David Runco\nDirector Terry West\nStudio STAX ENTERTAINMENT LTD\nRun time : 1 hr 30 mins\nCertificate 18\nGenres Horror\nLanguage : English\n\nThe Dead One\nA voodoo priestess brings her brother back to life so he can kill her cousin's bride. The\n\nconfused zombie kills the wrong woman and is bought back to life a second time to try and\n\nfinish the deed.\n\n\n\nStarring John Mackay, Monica Davis\nDirector Barry Mahon\nStudio PINNACLE VISION\nRun time : 1 hr 27 mins\nCertificate 15\nGenres Horror\nLanguage : English\nProduction year: 1961\n\nSilent Night, Bloody Night\nA new mansion owner discovers that his home was once a mental institution. He sets about\n\ninvestigating the crimes that took place in the mansion, whilst scaring the surrounding\n\npopulace.\n\nStarring Donelda Dunne, Jay Garner, Patrick O'Neal, Fran Stevens, Walter Abel, Mary Woronov,\n\n\n\nDebbie Parness, Astrid Heeren, James Patterson, John Carradine\nDirector Thomas Gershuny\nStudio ELSTREE HILL ENTERTAINMENT\nRun time DVD: 1 hr 21 mins\nGenres Horror\nLanguage : English\n\nDemon Under Glass\nThe pursuit of a serial killer leads to a deeper evil\n\n\n\nStarring Jason Carter, Garett Maggart, Jack Donner\nDirector Jon Cunningham\nStudio STAX ENTERTAINMENT LTD\nRun time: 1 hr 51 mins\nCertificate 15\nGenres Horror, Thriller\nLanguage : English\nProduction year: 2002\n\n\nMindflesh\nMindFlesh is a psycho-sexual horror thriller. MindFlesh is about obsession. Specifically,\n\nthe obsession of taxi driver Chris Jackson who believes a goddess from a parallel dimension\n\nis walking the streets of London. This obsession is destroying the natural order of the\n\nuniverse and Guardian extraterrestrials threaten to kill Jackson's friends if he doesn't\n\nrelinquish his fantasy.\n\nJackson, played by Peter Bramhill (Human Traffic) enlists the help of parapsychologist Frank\n\nVerdain played by Chris Fairbank (Batman, Alien3, 5th Element) to unravel the secrets of the\n\nmind and the universe. Only his Buddhist ex-girlfriend played by Lucy Liemann (Bourne\n\nUltimatum) understands the power of the mind.\n\n\n\nStarring Peter Bramhill, Carole Derrien, Christopher Fairbank, Roy Borrett, Steven Burrell,\n\nCordelia Bugeja, Isabella Jade Fane, Lucy Liemann, Steve O'Halloran, Charlotte Milchard,\n\nClare Routh, Peter Bramhill\nDirector Robert Pratten\nStudio METRODOME DISTRIBUTION\nRun time : 1 hr 15 mins\nCertificate 18\nGenres Horror\nLanguage: English\nReleased Production year: 2008\n\nThe Scar Crow\nAfter being sent to the countryside for an all-expenses-paid team-building trip, four\n\nfriends decide to pack in the assault courses and management training for a weekend of beer\n\nand football at the local pub. Thinking that their fortunes are looking even better when\n\nthey come across three young, beautiful and very friendly sisters, everything seems set for\n\na perfect vacation. But as night falls and shadows spread through the village, it quickly\n\nbecomes apparent that all isn't quite as it seems...\n\nUndead victims of a 300 year-old curse, the three sisters have turned to witchcraft to lift\n\nthem from their plight. Steeped in sorcery and imbued with the seductive powers of darkness,\n\nthey will stop at nothing to channel the dark arts to suit their aims.\n\nViolent, erotic and disturbing, The Scar Crow is a terrifying tale of malevolence, desire,\n\ntorture and seduction that will leave your hair standing on end.\n\n\n\nStarring Anna Tolputt, Kevyn Connett, Darren McIlroy, Tim Major\nDirector Andy Thompson, Pete Benson\nStudio METRODOME VIDEO\nRun time : 1 hr 24 mins\nCertificate 18\nGenres Horror\nLanguage : English\nReleased Production year: 2009\n\nLast Cannibal World\nThe crew and passengers of a plane find themselves stranded deep in a jungle. Soon one of\n\nthem finds himself face to face with cannibals.\n\n\n\nStarring Massimo Foschi, Me Me Lai, Ivan Rassimov\nDirector Ruggero Deodato\nStudio SCREEN ENTERTAINMENT\nCertificate 18\nGenres Horror\nLanguage : English\n\nTwelve\nA young waitress along with eleven other citizens listen to the evidence against Leonard\n\nKarlsson ( a man accused of a crime against a minor) and find him guility. In prison the\n\n&quot;unspoken rule&quot; regading such crimes was enforced - Karlsson was beaten by the other\n\nprisoners to within an inch of his life, his face severely disfigured as a result. Now, he's\n\nout of prison and he returns to the town where he was sentenced. In one horrifying night, he\n\nonce again faces the twelve jurors who decided his fate. This time however, he decides\n\ntheirs...\n\n\n\nStarring Jeremy Fitzgeral, Emily Hardy, Mercedes McNab, Steven Brand, Nick Searcy, Joseph\n\nNunez\nDirector Michael A. Nickles\nStudio FUSION MEDIA SALES\nOriginal title XII\nRun time : 1 hr 21 mins\nCertificate 18\nGenres Horror\nLanguage : English\nReleased Production year: 2010\n\nSO TAKE WHAT U WANT.UP TO U\nENJOY","torrent":{"xt":"urn:btih:a98b73e806a43830c5f79df372f73ac89076f4a2","amp;dn":"The+Horror+Movie+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a98b73e806a43830c5f79df372f73ac89076f4a2","infoHashBuffer":{"type":"Buffer","data":[169,139,115,232,6,164,56,48,197,247,157,243,114,247,58,200,144,118,244,162]},"announce":[],"urlList":[]}}