{"title":"The Founding Fish - John McPhee (retail) (epub)","uid":10019380,"size":350010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9aed567533e19a105cd73f861d9835e191c534f&amp;dn=The+Founding+Fish+-+John+McPhee+%28retail%29+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"098765432","files":-1,"time":1398188587,"description":"John McPhee's twenty-sixth book is a braid of personal history, natural history, and American history, in descending order of volume. Each spring, American shad-Alosa sapidissima-leave the ocean in hundreds of thousands and run heroic distances upriver to spawn.\n\nMcPhee--a shad fisherman himself--recounts the shad's cameo role in the lives of George Washington and Henry David Thoreau. He fishes with and visits the laboratories of famous ichthyologists; he takes instruction in the making of shad darts from a master of the art; and he cooks shad in a variety of ways, delectably explained at the end of the book. Mostly, though, he goes fishing for shad in various North American rivers, and he &quot;fishes the same way he writes books, avidly and intensely. He wants to know everything about the fish he's after--its history, its habits, its place in the cosmos&quot; (Bill Pride, The Denver Post). His adventures in pursuit of shad occasion the kind of writing--expert and ardent--at which he has no equal.","torrent":{"xt":"urn:btih:a9aed567533e19a105cd73f861d9835e191c534f","amp;dn":"The+Founding+Fish+-+John+McPhee+%28retail%29+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9aed567533e19a105cd73f861d9835e191c534f","infoHashBuffer":{"type":"Buffer","data":[169,174,213,103,83,62,25,161,5,205,115,248,97,217,131,94,25,28,83,79]},"announce":[],"urlList":[]}}