{"title":"Piping and Pipeline Engineering - Design, Construction, Maintena","uid":12617280,"size":4206971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9d7da65c61fb86e49ee2186b78ec5a435c6d2f0&amp;dn=Piping+and+Pipeline+Engineering+-+Design%2C+Construction%2C+Maintena&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1445537007,"description":"Piping and Pipeline Engineering - Design, Construction, Maintenance, Integrity, and Repair - George A. Antaki (Marcel Dekker, 2003).pdf\r\n\r\nISBN 0824709640\r\n\r\nTaking a big-picture approach, Piping and Pipeline Engineering: Design, Construction, Maintenance, Integrity, and Repair elucidates the fundamental steps to any successful piping and pipeline engineering project, whether it is routine maintenance or a new multi-million dollar project. The author explores the qualitative details, calculations, and techniques that are essential in supporting competent decisions. He pairs coverage of real world practice with the underlying technical principles in materials, design, construction, inspection, testing, and maintenance. \r\n\r\nDiscover the seven essential principles that will help establish a balance between production, cost, safety, and integrity of piping systems and pipelines\r\n\r\nThe book includes coverage of codes and standards, design analysis, welding and inspection, corrosion mechanisms, fitness-for-service and failure analysis, and an overview of valve selection and application. It features the technical basis of piping and pipeline code design rules for normal operating conditions and occasional loads and addresses the fundamental principles of materials, design, fabrication, testing and corrosion, and their effect on system integrity","torrent":{"xt":"urn:btih:a9d7da65c61fb86e49ee2186b78ec5a435c6d2f0","amp;dn":"Piping+and+Pipeline+Engineering+-+Design%2C+Construction%2C+Maintena","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d7da65c61fb86e49ee2186b78ec5a435c6d2f0","infoHashBuffer":{"type":"Buffer","data":[169,215,218,101,198,31,184,110,73,238,33,134,183,142,197,164,53,198,210,240]},"announce":[],"urlList":[]}}