{"title":"Grateful Dead - Blues For Allah (1975) 2013 HDTracks 24-96-FLAC","uid":11153700,"size":956991360,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:aac12ade9c689ffcb9cf3a71491362852d13818f&amp;dn=Grateful+Dead+-+Blues+For+Allah+%281975%29+2013+HDTracks+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"hal4000","files":-1,"time":1412380329,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nThe Grateful Dead went into a state of latent activity in the fall of 1974 that lasted until the spring of the following year when the band reconvened at guitarist/vocalist Bob Weir's Ace Studios to record Blues for Allah. The disc was likewise the third to be issued on their own Grateful Dead Records label. When the LP hit shelves in September of 1975, the Dead were still not back on the road -- although they had played a few gigs throughout San Francisco. Obviously, the time off had done the band worlds of good, as Blues for Allah -- more than any past or future studio album -- captures the Dead at their most natural and inspired. The opening combo of &quot;Help on the Way,&quot; &quot;Slipknot!,&quot; and &quot;Franklin's Tower&quot; is a multifaceted suite, owing as much to Miles Davis circa the E.S.P. album as to anything The Grateful Dead had been associated with. &quot;Slipknot!&quot; contains chord changes, progressions, and time signatures which become musical riddles for the band to solve -- which they do in the form of &quot;Franklin's Tower.&quot; Another highly evolved piece is the rarely performed &quot;King Solomon's Marbles,&quot; an instrumental that spotlights, among other things, Keith Godchaux's tastefully unrestrained Fender Rhodes finger work displaying more than just a tinge of Herbie Hancock inspiration. These more aggressive works contrast the delicate musical and lyrical haiku on &quot;Crazy Fingers&quot; containing some of lyricist Robert Hunter's finest and most beautifully arranged verbal images for the band. Weir's guitar solo in &quot;Sage &amp; Spirit&quot; is based on one of his warm-up fingering exercises. Without a doubt, this is one of Weir's finest moments. The light acoustic melody is tinged with an equally beautiful arrangement. While there is definite merit in Blues for Allah's title suite, the subdued chant-like vocals and meandering melody seems incongruous when compared to the remainder of this thoroughly solid effort.\n\nHDTracks PCM-24Bit-96Khz-FLAC.","torrent":{"xt":"urn:btih:aac12ade9c689ffcb9cf3a71491362852d13818f","amp;dn":"Grateful+Dead+-+Blues+For+Allah+%281975%29+2013+HDTracks+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac12ade9c689ffcb9cf3a71491362852d13818f","infoHashBuffer":{"type":"Buffer","data":[170,193,42,222,156,104,159,252,185,207,58,113,73,19,98,133,45,19,129,143]},"announce":[],"urlList":[]}}