{"title":"Deana Carter - Strawberry Wine  (2nafish)","uid":5180465,"size":140476420,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ab79c8a7d89040f9b305a2ffcaabeb6106b58aaf&amp;dn=Deana+Carter+-+Strawberry+Wine++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"2nafish","files":-1,"time":1259214370,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Strawberry Wine&quot; is the title of a song written by Matraca Berg and Gary Harrison, and recorded by American country artist Deana Carter. It was released in August 1996 as Carter's debut single and served as the lead-off to her debut album, Did I Shave My Legs for This?. The song went on to peak at No. 1 on the Billboard Hot Country Singles &amp; Tracks chart, and the Canadian RPM Country Tracks.\n\n&quot;Strawberry Wine&quot; is Carter's most successful single in her career overall, and is considered a signature song for both songwriter Matraca Berg and Deana Carter.\n\nA music video was released for &quot;Strawberry Wine&quot;, directed by Roger Pistole. Carter sings the song while standing in the entry way to a house, on a living room couch, and behind a screen door. Accompanying these scenes are a young couple in love. The couple are seen on an old dirt road in the countryside, in front of a house, and in a car driving down a road. Scenes of other people are included as well, including an elderly man by a rocking chair and a woman standing in what was once farmland.\n\n&quot;Strawberry Wine&quot; debuted at #70 on the U.S. Billboard Hot Country Singles &amp; Tracks for the chart week of August 17, 1996. The song reached Number One on the chart in November 1996, holding the position for two weeks.\n\n&quot;Strawberry Wine&quot; won Song of the Year at the Country Music Association Awards in 1997 and was voted Song of the Year by the Nashville Songwriters Association International and the Nashville Music Awards. That year, the song was also nominated for three additional awards; Grammy Award for Best Country Song, Academy of Country Music Awards Best Country Song nominee, and Country Music Radio Awards for Song of The Year.\n\nDid I Shave My Legs for This? is the debut album of American country artist Deana Carter, released in 1996. It features her breakthrough debut single &quot;Strawberry Wine&quot;, a Number One hit on the Billboard Hot Country Singles &amp; Tracks (now Hot Country Songs) charts at the end of that year. &quot;We Danced Anyway&quot;, &quot;Count Me In&quot;, &quot;How Do I Get There&quot;, and the title track were also released as a singles. Of these, &quot;We Danced Anyway&quot; and &quot;How Do I Get There&quot; were also Number One hits.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ab79c8a7d89040f9b305a2ffcaabeb6106b58aaf","amp;dn":"Deana+Carter+-+Strawberry+Wine++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab79c8a7d89040f9b305a2ffcaabeb6106b58aaf","infoHashBuffer":{"type":"Buffer","data":[171,121,200,167,216,144,64,249,179,5,162,255,202,171,235,97,6,181,138,175]},"announce":[],"urlList":[]}}