{"title":"Led Zeppelin - Burn Like a Candle (6-25-72 Los Angeles, Californ","uid":11476799,"size":457935492,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ab85d1f843810b468f5c16e464bb628bbde21953&amp;dn=Led+Zeppelin+-+Burn+Like+a+Candle+%286-25-72+Los+Angeles%2C+Californ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"analogkid6103","files":22,"time":1416161232,"description":"\nLed Zeppelin - Burn Like a Candle (6-25-72 Los Angeles, Calif - The Forum) (2000) (Size: 436.72 MB)\nDescription\n\nimage\nLed Zeppelin were an English rock band that consisted of guitarist Jimmy Page, singer Robert Plant, bassist and keyboardist John Paul Jones, and drummer John Bonham. Formed in London in 1968, the group's heavy, guitar-driven sound, rooted in blues and psychedelia on their early albums, has earned them recognition as one of the progenitors of heavy metal, though their unique style drew from a wide variety of influences, including folk music.\nimage\nAfter changing their name from the New Yardbirds, Led Zeppelin signed a deal with Atlantic Records that afforded them considerable artistic freedom. Although the group was initially unpopular with critics, they achieved significant commercial success with albums such as Led Zeppelin (1969), Led Zeppelin II (1969), Led Zeppelin III (1970), their untitled fourth album (1971), Houses of the Holy (1973), and Physical Graffiti (1975). Their fourth album, which features the track &quot;Stairway to Heaven&quot;, is among the most popular and influential works in rock music, and it helped to secure the group's popularity.\nimage\nPage wrote most of Led Zeppelin's music, particularly early in their career, while Plant generally supplied the lyrics. Jones' keyboard-based compositions later became central to the group's catalogue, which featured increasing experimentation. The latter half of their career saw a series of record-breaking tours that earned the group a reputation for excess and debauchery.\n\nAlthough they remained commercially and critically successful, their output and touring schedule were limited during the late 1970s, and the group disbanded following Bonham's death from alcohol-related asphyxia in 1980. In the decades that followed, the surviving members sporadically collaborated and participated in one-off Led Zeppelin reunions. The most successful of these was the 2007 Ahmet Ertegun Tribute Concert in London, with Jason Bonham taking his late father's place behind the drums.\n\nLed Zeppelin are widely considered one of the most successful, innovative, and influential rock groups in history. They are one of the best-selling music artists in the history of audio recording; various sources estimate the group's record sales at 200 to 300 million units worldwide. With RIAA-certified sales of 111.5 million units, they are the second-best-selling band in the United States. Each of their nine studio albums placed on the Billboard Top 10 and six reached the number-one spot.\n\nRolling Stone magazine described them as &quot;the heaviest band of all time&quot;, &quot;the biggest band of the '70s&quot;, and &quot;unquestionably one of the most enduring bands in rock history&quot;. They were inducted into the Rock and Roll Hall of Fame in 1995; the museum's biography of the band states that they were &quot;as influential&quot; during the 1970s as the Beatles were during the 1960s.\n\nBurn Like a Candle is a bootleg recording of the English rock group Led Zeppelin's performance at the Los Angeles Forum on June 25, 1972. It was originally released on CD format in the 1990s by the Smoking Pig label.\n\nThe audience recording includes the entire show, (with the exception of the final encore, &quot;Weekend&quot; and is well known for its many rare encores, including &quot;Louie Louie&quot;. It is also noted for its original cover artwork by William Stout, who drew many of the covers for some of the original vinyl Led Zeppelin bootlegs in the 1970s. The release has been described as &quot;a must for any collector&quot;.\n\nThe album title is derived from a comment Led Zeppelin singer, Robert Plant, delivered from the stage during this concert, in which he mentioned that their fifth album did not yet have a title: &quot;It's not gonna be called Led Zeppelin Five, it's got every possibility of being called Burn That Candle&quot; (The album, released the following year, would ultimately be entitled Houses of the Holy).\n\nFor many years this audience recording was all that existed from this show. In 2003, an edit of professionally recorded soundboard tapes from this show and the subsequent Long Beach show was officially released on the album How the West Was Won. However, this bootleg, as an internet download, contains the entire, unedited version of the show. There are versions of songs not included on How the West Was Won, such as &quot;Thank You&quot;, &quot;Communication Breakdown&quot;, and the entire acoustic set. The &quot;Whole Lotta Love&quot; medley includes a performance of &quot;Heartbreak Hotel&quot; and &quot;Slow Down&quot; both of which are not included on the official release.\n\n\n\nBand Members\n\nJimmy Page Guitar\nRobert Plant Vocals\nJohn Bonham Drums\nJohn Paul Jones Bass, Keyboards\n\n\n\nDiscography\n\nLed Zeppelin (1969)\nLed Zeppelin II (1969)\nLed Zeppelin III (1970)\nLed Zeppelin IV (1971)\nHouses of the Holy (1973)\nPhysical Graffiti (1975)\nPresence (1976)\nIn Through the Out Door (1979)\nCoda (1982)\n\n\n\nBurn Like a Candle (6-25-72 Los Angeles, California - The Forum) (2000)\n\n\n\n01.LA Drone\n02.Immigrant Song\n03.Heartbreaker\n04.Over The Hills And Far Away\n05.Black Dog\n06.Since I've Been Loving You\n07.Stairway To Heaven\n08.Going To California\n09.That's The Way\n10.Tangerine\n11.Bron-Yr-Aur Stomp\n12.Dazed And Confused\n13.What Is And What Should Never Be\n14.Dancing Days\n15.Moby Dick\n16.Whole Lotta Love\n17.Rock And Roll\n18.The Ocean\n19.Louie Louie - Everyday People - Organ Solo\n20.Thank You\n21.Communication Breakdown\n22.Bring It On Home\n23.Weekend\n(some bootlegs include a recording of this song from June 14, 1972, at the Nassau Coliseum)\n(not included on this torrent, it belongs to another show)\n\n\n\n\n\nGenre: Bootleg Audio\nSubgenre: Hard Rock\nBitrate: 320 k\nSize: 436.72 MB\nShow/Hide Files:\n22 files\nAdded: 15/11/2014\nimage","torrent":{"xt":"urn:btih:ab85d1f843810b468f5c16e464bb628bbde21953","amp;dn":"Led+Zeppelin+-+Burn+Like+a+Candle+%286-25-72+Los+Angeles%2C+Californ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab85d1f843810b468f5c16e464bb628bbde21953","infoHashBuffer":{"type":"Buffer","data":[171,133,209,248,67,129,11,70,143,92,22,228,100,187,98,139,189,226,25,83]},"announce":[],"urlList":[]}}