{"title":"Tanya Huff - An Ancient Peace (Peacekeeper #1) (Confederation #6","uid":12529749,"size":177407687,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ab914ae11e23098c354886c504c943f55dd13961&amp;dn=Tanya+Huff+-+An+Ancient+Peace+%28Peacekeeper+%231%29+%28Confederation+%236&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":1,"time":1444221123,"description":"\n\r\n\r\nGunnery Sergeant Torin Kerr had been the very model of a Confederation Marine. But when she learned the truth about the war the Confederation was fighting, she left the military for good.\r\n\r\nBut Torin couldn’t walk away from preserving and protecting everything the Confederation represented. Instead, she drew together an elite corps of friends and allies to take on covert missions that the Justice Department and the Corps could not—or would not—officially touch. Torin just hoped the one they were about to embark on wouldn’t be the death of them.\r\n\r\nAncient H’san grave goods are showing up on the black market—grave goods from just before the formation of the Confederation, when the H’san gave up war and buried their planet-destroying weapons...as grave goods for the death of war. Someone is searching for these weapons and they’re very close to finding them. As the Elder Races have turned away from war, those searchers can only be members of the Younger Races.\r\n\r\nFortunately, only the Corps Intelligence Service has this information. Unfortunately, they can do nothing about it—bound by laws of full disclosure, their every move is monitored.\r\n\r\nThough Torin Kerr and her team are no longer a part of the military, the six of them tackling the H’san defenses and the lethally armed grave robbers are the only chance the Confederation has. The only chance to avoid millions more dead.\r\n\r\nBut the more Torin learns about the relationship between the Elder Races and the Younger, the more she begins to fear war might be an unavoidable result.\r\n\r\n\r\n\r\nRead by Marguerite Gavin\r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nLength: 11 hrs and 52 mins\r\nRelease Date:10-06-15\r\nPublisher: Audible Studios\r\nUnabridged","torrent":{"xt":"urn:btih:ab914ae11e23098c354886c504c943f55dd13961","amp;dn":"Tanya+Huff+-+An+Ancient+Peace+%28Peacekeeper+%231%29+%28Confederation+%236","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab914ae11e23098c354886c504c943f55dd13961","infoHashBuffer":{"type":"Buffer","data":[171,145,74,225,30,35,9,140,53,72,134,197,4,201,67,245,93,209,57,97]},"announce":[],"urlList":[]}}