{"title":"Can't We Talk about Something More Pleasant? By Roz Chast","uid":14468923,"size":97457026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abebfcbb76b08e2a349b082fb8f5c5495277accb&amp;dn=Can%27t+We+Talk+about+Something+More+Pleasant%3F+By+Roz+Chast&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1461886203,"description":"Can't We Talk about Something More Pleasant?: A Memoir By Roz Chast\r\n2014 | 240 Pages | ISBN: 1608198065 | EPUB | 93 MB\r\n\r\n2014 NATIONAL BOOK AWARD FINALIST In her first memoir, Roz Chast brings her signature wit to the topic of aging parents. Spanning the last several years of their lives and told through four-color cartoons, family photos, and documents, and a narrative as rife with laughs as it is with tears, Chast's memoir is both comfort and comic relief for anyone experiencing the life-altering loss of elderly parents. When it came to her elderly mother and father, Roz held to the practices of denial, avoidance, and distraction. But when Elizabeth Chast climbed a ladder to locate an old souvenir from the &quot;crazy closet&quot;-with predictable results-the tools that had served Roz well through her parents' seventies, eighties, and into their early nineties could no longer be deployed. While the particulars are Chast-ian in their idiosyncrasies-an anxious father who had relied heavily on his wife for stability as he slipped into dementia and a former assistant principal mother whose overbearing personality had sidelined Roz for decades-the themes are universal: adult children accepting a parental role; aging and unstable parents leaving a family home for an institution; dealing with uncomfortable physical intimacies; managing logistics; and hiring strangers to provide the most personal care. An amazing portrait of two lives at their end and an only child coping as best she can, Can't We Talk about Something More Pleasant will show the full range of Roz Chast's talent as cartoonist and storyteller","torrent":{"xt":"urn:btih:abebfcbb76b08e2a349b082fb8f5c5495277accb","amp;dn":"Can%27t+We+Talk+about+Something+More+Pleasant%3F+By+Roz+Chast","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abebfcbb76b08e2a349b082fb8f5c5495277accb","infoHashBuffer":{"type":"Buffer","data":[171,235,252,187,118,176,142,42,52,155,8,47,184,245,197,73,82,119,172,203]},"announce":[],"urlList":[]}}