{"title":"Curriculum Development for Medical Education, 2E [Epub &amp; Mob","uid":10563923,"size":5377466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac59756a82bc74506217505179c115df42ca9f31&amp;dn=Curriculum+Development+for+Medical+Education%2C+2E+%5BEpub+%26amp%3B+Mob&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":-1,"time":1405494283,"description":"Author: David E. Kern, Patricia A. Thomas, Mark T. Hughes\nPaperback: 272 pages\nPublisher: Johns Hopkins University Press; second edition edition (October 22, 2009)\nLanguage: English\nISBN-10: 0801893674\nISBN-13: 978-0801893674\nFormat: Retail Epub and mobi\nReader Required: \nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle App, Calibre, MoonReader for Android\n\nNOTE: no PDF available. If you want the book to scroll like a PDF, use the mobi file in Kindle or either in Calibre\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick. Hope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\n\nCurriculum Development for Medical Education is designed for use by curriculum developers and others who are responsible for the educational experiences of medical students, residents, fellows, and clinical practitioners.\n\nShort, practical, and general in its approach, the book begins with a broad overview of the subject. Each succeeding chapter covers one of the six steps: problem identification and general needs assessment, targeted needs assessment, goals and objectives, educational strategies, implementation, and evaluation. Additional chapters address curriculum maintenance, enhancement, and dissemination.\n\nThe six-step approach outlined here has evolved over the past twenty years, during which time the authors have taught curriculum development and evaluation skills to faculty and fellows in the Johns Hopkins University Faculty Development Program for Clinician-Educators. Program participants have used the techniques described to develop curricula on such diverse topics as preclerkship skills building, clinical reasoning and shared decision making, outpatient internal medicine, musculoskeletal disorders, office gynecology for the generalist, chronic illness and disability, geriatrics for nongeriatric faculty, surgical skills assessment, laparoscopic surgical skills, cross-cultural competence, and medical ethics.\n\nThis thoroughly revised edition includes a broad discussion of competencies mandated by the Accreditation Council for Graduate Medical Education and other bodies, current information on education technology, increased emphasis on scholarships related to curriculum development, and advice on obtaining institutional review board approval. Updated examples throughout the book illustrate major points. The expanded appendixes include samples of complete curricula and information on funding, faculty development, and curricular resources.","torrent":{"xt":"urn:btih:ac59756a82bc74506217505179c115df42ca9f31","amp;dn":"Curriculum+Development+for+Medical+Education%2C+2E+%5BEpub+%26amp%3B+Mob","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac59756a82bc74506217505179c115df42ca9f31","infoHashBuffer":{"type":"Buffer","data":[172,89,117,106,130,188,116,80,98,23,80,81,121,193,21,223,66,202,159,49]},"announce":[],"urlList":[]}}