{"title":"Barracuda - Christos Tsiolkas.epub","uid":9113148,"size":1203373,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac7c1a36b3be6d35017e41a2c6edb43066eb0f35&amp;dn=Barracuda+-+Christos+Tsiolkas.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":1,"time":1382985922,"description":"Tender and brutal and blazingly brilliant, the new novel from the acclaimed author of the international bestseller The Slap takes an unflinching look at modern Australia - at our hopes and dreams, our friendships, and our families - and asks what it means to be a good person and what it takes to become one. \n\nHe asked the water to lift him, to carry him, to avenge him. He made his muscles shape his fury, made every stroke declare his hate. And the water obeyed; the water would give him his revenge. No one could beat him, no one came close.\n\nHis whole life, Danny Kelly's only wanted one thing: to win Olympic gold. Everything he's ever done-every thought, every dream, every action-takes him closer to that moment of glory, of vindication, when the world will see him for what he is: the fastest, the strongest and the best. His life has been a preparation for that moment.\n\nHis parents struggle to send him to the most prestigious private school with the finest swimming program; Danny loathes it there and is bullied and shunned as an outsider, but his coach is the best and knows Danny is, too, better than all those rich boys, those pretenders. Danny's win-at-all-cost ferocity gradually wins favour with the coolest boys-he's Barracuda, he's the psycho, he's everything they want to be but don't have the guts to get there. He's going to show them all.\n\nHe would be first, everything would be alright when he came first, all would be put back in place. When he thought of being the best, only then did he feel calm.\n\nShould we teach our children to win, or should we teach them to live? How do we make and remake our lives? Can we atone for our past? Can we overcome shame? And what does it mean to be a good person?\n\nA searing and provocative novel by the acclaimed author of the international bestseller The Slap, Barracuda is an unflinching look at modern Australia, at our hopes and dreams, our friendships, and our families. It is about class and sport and politics and migration and education. It contains everything a person is: family and friendship and love and work, the identities we inhabit and discard, the means by which we fill the holes at our centre. Barracuda is brutal, tender and blazingly brilliant; everything we have come to expect from this fearless vivisector of our lives and world. \nGenre: Fiction/General\n","torrent":{"xt":"urn:btih:ac7c1a36b3be6d35017e41a2c6edb43066eb0f35","amp;dn":"Barracuda+-+Christos+Tsiolkas.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac7c1a36b3be6d35017e41a2c6edb43066eb0f35","infoHashBuffer":{"type":"Buffer","data":[172,124,26,54,179,190,109,53,1,126,65,162,198,237,180,48,102,235,15,53]},"announce":[],"urlList":[]}}