{"title":"Chet Baker - Grey December (1953) [Jazz][mp3 320][schon55]","uid":6779204,"size":145566578,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:acc72b6dc320e4d84a4b87763d57c1d638fdaa2f&amp;dn=Chet+Baker+-+Grey+December+%281953%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":28,"time":1319837736,"description":"Chet Baker - Grey December \nOriginal: December, 1953\nRemastered: 1992\nAudio CD: January 14, 1992 \nLabel: Pacific Jazz\nQuality: CBR 320 kb/s\n\nTwo stray Chet Baker 10&quot; titles and a few associated alternate takes are gathered on this single disc. Grey December is one of the better CD reissues featuring Baker's early-'50s recordings on Pacific Jazz, the purveyors of West Coast cool. The instrumental sides feature two septet sessions in December of 1953 and the vocal sextet session dates to February of 1955 -- all three of which feature Baker and pianist Russ Freeman. Rather than present these sides chronologically, the four vocal tracks precede the decidedly lengthier 1953 instrumental sessions -- a programming decision that works remarkably well. Enthusiasts of Baker's laid-back vocals should consider the February 1955 sessions as essential. The combination of Bud Shank's ethereal flute work when married to Baker's muted vocals create an intense burst of melancholy. The uneven tempo and minor chord progressions featured on the title track as well as &quot;I Wish I Knew&quot; are irresistible in their appeal to fans of the genre. Baker's soft-toned trumpet solos match his vocals in spirit and passion. Even the hapless optimism of &quot;Someone to Watch Over Me&quot; is tinged in noir pathos. A much more traditional setting for Baker can be heard on the septet sides. Although the instinctual interaction between Baker and Freeman shines throughout, &quot;Headline,&quot; &quot;Moonlight Becomes You,&quot; and the up-tempo swinger &quot;A Dandy Line&quot; best exemplify everything positive about that musical relationship. The pair intertwine their melodies so closely and carefully it can be difficult to separate them. On the CD pressing, alternate takes of &quot;Bockhanal,&quot; &quot;A Dandy Line,&quot; &quot;Little Old Lady,&quot; &quot;Moonlight Becomes You,&quot; and &quot;Goodbye&quot; are also included. ~ AllMusic\n\nChet Baker was always a lyrical trumpet player, especially on ballads, his cool tone, always was romantic, and moody. However his singing is what makes him so unique. These 1st sessions of Baker's as a leader are superb, his vocalizing on teh 1st several tracks is exellent. He sings Someone To Watch Over Me &amp; This Is Always with pure romanticism. He is the original funny valentine so expressed in the Rodgers &amp; Hart song. A greta cd, and an essential perfromer of jazz. ~ lala 1 \n\nChet Baker - Grey December Tracklist\n01  Grey December\n02  I Wish I Knew\n03  Someone To Watch Over Me\n04  This Is Always\n05  Headline\n06  Ergo\n07  Bockhanal\n08  Bockhanal (Alternate Take)\n09  A Dandy Line\n10  A Dandy Line ( Alternate Take)\n11  Pro Defunctus\n12  Little Old Lady\n13  Little Old Lady (Alternate Take)\n14  Moonlight Becomes You\n15  Moonlight Becomes You (Alternate Take)\n16  Goodbye\n17  Goodbye (Alternate Take)\n\n","torrent":{"xt":"urn:btih:acc72b6dc320e4d84a4b87763d57c1d638fdaa2f","amp;dn":"Chet+Baker+-+Grey+December+%281953%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc72b6dc320e4d84a4b87763d57c1d638fdaa2f","infoHashBuffer":{"type":"Buffer","data":[172,199,43,109,195,32,228,216,74,75,135,118,61,87,193,214,56,253,170,47]},"announce":[],"urlList":[]}}