{"title":"[FSX] Aerosoft - Mykonos X 1.01","uid":7860540,"size":1231709510,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:add8c93cd09b7659f335df12edd4277c3a71f48a&amp;dn=%5BFSX%5D+Aerosoft+-+Mykonos+X+1.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"upstater","files":-1,"time":1353920360,"description":"According to a legend, the isle of Mykonos arose as Hercules encountered and defeated twelve giants which he then threw into the sea where they turned into stone. Mykonos is today one of the most popular Mediterranean islands, famous for its cosmopolitan character and culture. The scenery features the international Airport of Mykonos, which offers a spectacular approach over steeply rising terrain, bays and white beaches.\n\n\nMykonosÎ“Ã‡Ã– architecture is landmarked and unique with its look of white facades, blue windows and doors. There are also countless chapels scattered across the island, some are even located around the airport and one in particular is located inside the airport perimeter.\n\nThere are a couple of private helipads perfectly suited for some rather adventurous flights around the island. A custom made yacht with a built-in helipad is available as well for interacting.\nAll important landmarks are realistically and accurately created. The town is a highly detailed scene with over one thousand hand-placed buildings and hundreds of trees to provide the characteristic look of Mykonos.\n\nThe entire island is covered with high resolution satellite imagery (0.5m/px) and custom autogen.\nRegardless of being an airliner, a helicopter or a private pilot, this scenery covers all aspects of flight simulation in a very detailed manner and holds many things to discover.\nBoard the cockpit of a private jet or a helicopter after landing with an airliner and explore this magnificent scenery which was built to be a complete and high detailed image of the reality. \n\n                                           ***\nFollow the instructions in the readme, then enjoy this GORGEOUS scenery!\n\nDon't forget to support the developers, if you like it! ","torrent":{"xt":"urn:btih:add8c93cd09b7659f335df12edd4277c3a71f48a","amp;dn":"%5BFSX%5D+Aerosoft+-+Mykonos+X+1.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"add8c93cd09b7659f335df12edd4277c3a71f48a","infoHashBuffer":{"type":"Buffer","data":[173,216,201,60,208,155,118,89,243,53,223,18,237,212,39,124,58,113,244,138]},"announce":[],"urlList":[]}}