{"title":"Dlug (The Debt) (1999).avi","uid":4723007,"size":800734208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae66739a99b7a3ccc59d39be66f344afbc2cc963&amp;dn=Dlug+%28The+Debt%29+%281999%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"InfX","files":1,"time":1234572077,"description":"A gripping psychological thriller, The Debt tells the story of two entrepreneurs who become enmeshed in the criminal web of a Russian thug. In capitalist Warsaw, Adam and Stefan are aspiring businessmen who plan to import Italian scooters. But without collateral for a bank loan, help comes in the form of Gerard, a Russian-born acquaintance who offers money and promises success. This all-too-simple scheme falls apart as Gerard's demands exceed the duo's profits and they quickly terminate the deal. The mobster increasingly demands payment with interest and the threat of violence is inevitable for the two and their loved ones. Paralyzed with fear, Adam and Stefan decide on a plan to free themselves from this sadistic blackmail. The mounting tension of this chilling true-crime drama captures the hopelessness of a country lured into the capitalist lifestyle, while focusing on the compelling choices men make between the right and wrong sides of the law.\n\n\n\n\nNOTES: I don't know if it's a DVD Rip or not, but it looks like it is. Certainly doesn't  looks/sounds like a cam. English subs are hardcoded into the video.","torrent":{"xt":"urn:btih:ae66739a99b7a3ccc59d39be66f344afbc2cc963","amp;dn":"Dlug+%28The+Debt%29+%281999%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae66739a99b7a3ccc59d39be66f344afbc2cc963","infoHashBuffer":{"type":"Buffer","data":[174,102,115,154,153,183,163,204,197,157,57,190,102,243,68,175,188,44,201,99]},"announce":[],"urlList":[]}}