{"title":"Stossel.2014.06.12.[Libertarians vs. Conservatives].FBN.CF.avi","uid":10373949,"size":343988550,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aece89a3a09e8baadb4276448f66bec06c54fe40&amp;dn=Stossel.2014.06.12.%5BLibertarians+vs.+Conservatives%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1402969498,"description":"----------\n\nSTOSSEL - [Libertarians versus Conservatives] - Fox Business Network\n2014, June 12, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nWAR ON DRUGS: Libertarians think the war on drugs is nuts. Adults should be free to do what they want with their own bodies. Congressman Allen West disagrees.\n\nGAMBLING: Likewise, I say it ought to be your choice whether you want to gamble. Alex McFarland of the American Family Association says I'm wrong.\n\nGAY MARRIAGE: Most libertarians don't care whom you marry. Want to marry someone of your own gender? Fine. In fact, most libertarians don't see why government is involved in marriage at all. But &quot;What Is Marriage? Man and Woman: A Defense&quot; author Ryan Anderson says marriage must be a union between a man and a woman.\n\nPROSTITUTION: Sex is OK. Making money is OK. But sex for money? Not OK. We libertarians ask, why? I don't see a problem with paid consensual sex between two adults. But Fox News contributor Monica Crowley says, &quot;the social cost is far too high.&quot;\n\nMILITARY POWER: Libertarians want less military spending and less involvement in other countries' problems. Conservatives like Ambassador John Bolton support the war in Iraq and say that if Iran is about to get a nuclear weapon, we need to use military force. We gently debate.\n\nIMMIGRATION REFORM: I think immigrants are great for America. Fox Business Channel host Lou Dobbs says he does too, but we need to &quot;make decisions about who we want to work in this country.&quot;\n\nMY TAKE: F.A. Hayek wrote an essay &quot;Why I'm Not A Conservative.&quot; He argues that &quot;the conservative regards it as his mission to &quot;civilize&quot; others - not by voluntary and unhampered intercourse but by bringing them the blessings of efficient government.&quot;\n\nAs usual, Hayek was on to something. America benefits when conservatives speak out against immoral behavior. But shaming is one thing, force of law is another. Using law means people with guns demand that everyone behave the way the majority thinks they should.\n\nWe ought to be able to do anything that's peaceful. We should be allowed take drugs, gamble, pay for sex, and do self-destructive and immoral things-as long as we don't directly harm anyone else.\n\n9PM ET on Fox Business Network","torrent":{"xt":"urn:btih:aece89a3a09e8baadb4276448f66bec06c54fe40","amp;dn":"Stossel.2014.06.12.%5BLibertarians+vs.+Conservatives%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aece89a3a09e8baadb4276448f66bec06c54fe40","infoHashBuffer":{"type":"Buffer","data":[174,206,137,163,160,158,139,170,219,66,118,68,143,102,190,192,108,84,254,64]},"announce":[],"urlList":[]}}