{"title":"Power Up Your Mind - Learn Faster Work Smarter{BBS}","uid":6680910,"size":21141806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af2cddb57c1f3e7bc76c876313fb267bb3586cf0&amp;dn=Power+Up+Your+Mind+-+Learn+Faster+Work+Smarter%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316189791,"description":"Bill Lucas, a leading international expert on life-long learning, shows that while we have learned more about how the brain works in the last decade than we have ever known, only a fraction of this is known and applied by most people. Power Up Your Mind applies this practical knowledge for the first time and shows you how to learn. Drawing on research from a wide variety of subject areas, from neuroscience to psychology, from motivation theory to accelerated learning, from memory to diet, this book shows how everyone has the capacity to succeed and how most people use only a very small portion of their talents. For learning to be effective, an understanding of how the brain works is essential and unlike most of the recent thinking on the mind, Lucas connects an understanding of the brain with the reality of the workplace and translates what we know about the brain into useful insights for work. Much work-based training is a waste of time and money because the majority of people are neither emotionally ready nor practically inclined to apply their learning to the way they behave. Power Up Your Mind offers a new model of learning - READY, GO, STEADY - which will revolutionize the way you learn and perform.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 272 pages\n    * Publisher: Nicholas Brealey Publishing (August 6, 2001)\n    * Language: English\n    * ISBN-10: 185788275X\n    * ISBN-13: 978-1857882759","torrent":{"xt":"urn:btih:af2cddb57c1f3e7bc76c876313fb267bb3586cf0","amp;dn":"Power+Up+Your+Mind+-+Learn+Faster+Work+Smarter%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af2cddb57c1f3e7bc76c876313fb267bb3586cf0","infoHashBuffer":{"type":"Buffer","data":[175,44,221,181,124,31,62,123,199,108,135,99,19,251,38,123,179,88,108,240]},"announce":[],"urlList":[]}}