{"title":"Woodward-Strange Case of Francis Tidir(Francis Bacon as William ","uid":4651086,"size":351146,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af83825199cdc71740bd9aaf24ef6cf558aaa7a5&amp;dn=Woodward-Strange+Case+of+Francis+Tidir%28Francis+Bacon+as+William+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1232047639,"description":"This is Parker Woodward's mindblowing book The Strange Case of Francis Tidir (1901) which is the classic work on the thesis that Francis Bacon was the illegitimate son of Queen Elizabeth I and the actual author behind many writings of that time, including those of William Shakespeare. Long time ago Woodward decided to research the incredible claims that Francis Bacon was a son of Queen Elizabeth as the claim to Royal parentage, coupled with the allegation ot the cipher story that Bacon was the author of the poems put forth as Spenser's, of the plays attributed not only to Shakespeare, but those of Greene, Marlowe, Peele and others was so prodigious that he could well understand the mental attitude of most who have been asked to give credence. As many before him the author first concluded the story to either be right or demonstrably wrong by the known facts of English history. But as his amateurish research continued, while searching in Elizabethan history and certain biographies he found no recorded facts inconsistent with the cipher claim, but instead much in history that supports it. If the claim of parentage be true, then much that was puzzling becomes clear. Francis Bacon, after receiving an education fit for a prince, found himself at the age of sixteen to be an illegitimate son of Queen Elizabeth, suffered to attend at Court, but ignored so far as sufficient pecuniary help or advancement was concerned. He essayed poetry as an anonymous writer &quot;Immerito&quot; and fearing discovery by Elizabeth, he and his friends induced a poor clerk named Spenser to father his compositions, for which Spenser was rewarded by an appointment in Ireland. Poetry proving unprofitable, he conceived the idea of writing plays for the Booth theatres, which at that time were taking a great deal of money. It is interesting moreover to have had an answer to the proper enquiry as to why so much valuable literary work of the Elizabethan age was unclaimed. Upon the footing of the truth of the cipher-story Woodward was able to see the practice of hiding, originally adopted of necessity, became afterwards a recreation as Bacon intended to hide from those too blind to see. Just as in the game of hide and seek the hider is astonished to notice how near the seekers may go to the object hidden without discovering it, so was Francis amazed that his preliminary efforts in the way of ciphers and anagrams were not discovered by the wits of the period. This probably led him to the formation of a society of sharper wits whom he taught to read &quot;between the lines&quot;, to communicate to one another &quot;under the rose&quot; by means of emblems, word ciphers, anagrams, numbers, and the like, in the expectation that their successors might in future years unravel the ciphers and anagrams which in his printed quartos and folios he was industriously inserting. Up to the day of his death he was always altering and adding, sometimes for the purpose of his cipher-stories, sometimes for improvement of the writings themselves. At the same time he bound all his best work together with the pack thread of a cipher explaining his personal and secret history, and studded it with allusive remarks, peculiarities, anagrams, and double meanings, to induce men to search for that which was hid. That Francis deliberately contemplated and planned for the re-discovery of his authorship years after his death is corroborated by the strict manner in which all manuscripts likely to lead to an early discovery were destroyed in his lifetime or by his Secretaries after his death. It is not surprising, therefore, that the literary critics should have been frequently confused whether to class a play as by Marlowe or Greene, Shakespeare or Peele, or the joint work of two or more of them as Bacon deceived the &quot;very elect&quot;. The Strange Case of Francis Tidir attempts to shine some light on the mysterious Bacon, the founder of modern scientific method. But was he also among the founders of those &quot;who hide under the rose&quot; (Rosicrucians) and what do the highly enigmatic writings of Shakespeare really mean? 115 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:af83825199cdc71740bd9aaf24ef6cf558aaa7a5","amp;dn":"Woodward-Strange+Case+of+Francis+Tidir%28Francis+Bacon+as+William+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af83825199cdc71740bd9aaf24ef6cf558aaa7a5","infoHashBuffer":{"type":"Buffer","data":[175,131,130,81,153,205,199,23,64,189,154,175,36,239,108,245,88,170,167,165]},"announce":[],"urlList":[]}}