{"title":"Ozzy Osbourne-Speak Of The Devil 320k  mp3   ak1982","uid":10551060,"size":168721573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b1a8695fa92b16f60736a83c051b71147ce31fb2&amp;dn=Ozzy+Osbourne-Speak+Of+The+Devil+320k++mp3+++ak1982&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"analogkid6103","files":13,"time":1405296626,"description":"Ozzy Osbourne-Speak Of The Devil 320k  mp3   ak1982 What we got Ozzy Speak of the Devil This almost is a Black Sabbath album at least it seemed like it back then. More nfo..The album sleeve states that it was recorded at The Ritz in New York on the 26th and 27 September 1982, though this may not be entirely correct. In a June, 2007, interview with producer/engineer Max Norman posted at KNAC.COM, he states that the album features 3 songs that were recorded during the rehearsal for the show rather than the show itself, with crowd noise later added in postproduction. Norman did not specifically identify to which songs he was referring.\n\nThis is the only official Osbourne recording to feature Night Ranger guitarist Brad Gillis, who had temporarily stepped in for the recently deceased Randy Rhoads following Bernie Torme's brief stint in the band. However, Gillis did tour with Osbourne during this time period, and the group did play material from Osbourne's first two solo albums during this tour.\n\nOsbourne has publicly renounced the album, stating that it was only released to satisfy a contractual obligation to his record label. At the time, a live album featuring guitarist Randy Rhoads was being prepared, but it was scrapped indefinitely upon Rhoads's sudden death in a March 1982 plane crash. Speak of the Devil was hastily recorded and released in its place. The planned live album featuring Rhoads' work would eventually be released five years later in 1987, entitled Tribute. In April 2002, Speak of the Devil was deleted from Osbourne's US/North American catalog and is no longer in print.[citation needed] However, the album is still widely available in other markets, particularly Japan.\n\nThough they had been full-time members of Osbourne's band for some time, this is Osbourne's first album to feature bassist Rudy Sarzo (who left to rejoin Quiet Riot less than a month later) and drummer Tommy Aldridge. The duo had been credited on the 1981 Diary of a Madman album but did not actually play on it. Guitarist Gillis would also soon depart to rejoin Night Ranger. Bob Daisley, who had performed as bassist on both of Osbourne's previous studio albums, would return in that role, while Jake E. Lee would replace Gillis on Osbourne's next studio album, 1983's Bark at the Moon.\n\nSpeak of the Devil's gatefold includes multiple photos of a member of Osbourne's road crew (who took part in the stage show by bringing the vocalist drinks between songs) who suffered from dwarfism and who the vocalist nicknamed &quot;Ronnie&quot;,  a joke aimed at Ronnie James Dio. Dio had replaced Osbourne as Black Sabbath's lead vocalist and stood only 5' 4&quot; tall.\n\nSpeak of the Devil was released one month before Osbourne's former band, Black Sabbath, released their own live album entitled Live Evil, a situation which contributed to a growing rivalry between the two camps. In the US, sales of Speak of the Devil were much better than those of Live Evil. In the UK it was Live Evil which attained the higher chart-placing: figures on ultimate sales are not widely available.\n\nThe original CD release of Speak of the Devil omitted &quot;Sweet Leaf&quot;, presumably due to time constraints. It was, however, reinstated for the 1995 reissue of the album.\nTrack listing\n\nAll songs written by Ozzy Osbourne, Tony Iommi, Geezer Butler and Bill Ward.\nNo. \tTitle \tOriginal Album \tLength \t\n1. \t&quot;Symptom of the Universe&quot;   \tSabotage (1975) \t5:41\n2. \t&quot;Snowblind&quot;   \tBlack Sabbath Vol. 4 (1972) \t4:56\n3. \t&quot;Black Sabbath&quot;   \tBlack Sabbath (1970) \t6:04\n4. \t&quot;Fairies Wear Boots&quot;   \tParanoid (1970) \t6:33\n5. \t&quot;War Pigs&quot;   \tParanoid (1970) \t8:35\n6. \t&quot;The Wizard&quot;   \tBlack Sabbath (1970) \t4:43\n7. \t&quot;N.I.B.&quot;   \tBlack Sabbath (1970) \t5:35\n8. \t&quot;Sweet Leaf&quot;   \tMaster of Reality (1971) \t5:55\n9. \t&quot;Never Say Die&quot;   \tNever Say Die! (1978) \t4:18\n10. \t&quot;Sabbath Bloody Sabbath&quot;   \tSabbath Bloody Sabbath (1973) \t5:34\n11. \t&quot;Iron Man&quot;/&quot;Children of the Grave&quot;   \tParanoid (1970) / Master of Reality (1971) \t9:12\n12. \t&quot;Paranoid&quot;   \tParanoid (1970) \t3:10\n So thats what it was and no wonder this was hard to find for awhile it was deleted from the catalog. Anyway it's here and with seed it shall stay......so go ahead and get it..........","torrent":{"xt":"urn:btih:b1a8695fa92b16f60736a83c051b71147ce31fb2","amp;dn":"Ozzy+Osbourne-Speak+Of+The+Devil+320k++mp3+++ak1982","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a8695fa92b16f60736a83c051b71147ce31fb2","infoHashBuffer":{"type":"Buffer","data":[177,168,105,95,169,43,22,246,7,54,168,60,5,27,113,20,124,227,31,178]},"announce":[],"urlList":[]}}