{"title":"IRC - ALL English Fiction books releases from 2003-2011.07.09","uid":6538782,"size":143407790124,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b267b12aa735161c9fab10bfc12eb0037c186dba&amp;dn=IRC+-+ALL+English+Fiction+books+releases+from+2003-2011.07.09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":8,"uploader":"bill_g","files":10,"time":1310607047,"description":"instead of the preface,\n\nAs for Russian books, then questions arise - despite attempts to deal with online libraries of the Russian segment of the Internet as long as enough, starting with the famous Moshkova and ending with the terrible pirate Librusek library - hundreds of sites!\n\nNot that the English segment. Apart from collections of books that have fallen for the prescription of years in the public domain (Chief Representative - Guttenberg.org [1]), in the English section of a stretched web of difficult everywhere to find something useful to sites with questionable one-day range. In addition there are GoogleBooks, but because there kopiraytnyh zzamorochek not show all pages.\n\nIn addition to file-sharing networks, there is such a wonderful thing as &quot;IraÃ‚Â» (IRC - by analogy with &quot;ICQÃ‚Â» - ICQ). IRC was originally intended for multi-user conferences (on-Novorussky speaking, chat) - this aspect does not interest me. However, apart from communication, the protocol is implemented subprotocol IRC DCC, which allows you to successfully transfer files. Therefore, it is in the IRC are the largest repository of hacked versions of programs, pornography, music and so on. Moreover, in contrast to file-sharing networks, no you do not fooling need something to give, not just rock.\nBut rock gigs and hundreds of books with bots on irc easy speed is low, the impact slots are limited, and this release solves this problem.\nThis included all UK releases of literature from 2003 to July 2011,\ndistributed at knizhyh channels in Undernet,\none book can be presented in multiple formats - lit, epub, mobi, html + jpeg,\narchives unpacked, laid out in folders by day, and packaged it all together in the iso over the years because of restrictions on the size of the torrent file\n2010gg to go with the book amazon and barnes &amp; noble in epub, so dramatically on the rise releases.\n\n\nhave a list in the release +\nhere is not poschu because they do not fit in any way","torrent":{"xt":"urn:btih:b267b12aa735161c9fab10bfc12eb0037c186dba","amp;dn":"IRC+-+ALL+English+Fiction+books+releases+from+2003-2011.07.09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b267b12aa735161c9fab10bfc12eb0037c186dba","infoHashBuffer":{"type":"Buffer","data":[178,103,177,42,167,53,22,28,159,171,16,191,193,46,176,3,124,24,109,186]},"announce":[],"urlList":[]}}