{"title":"Richard J. Evans - The Third Reich Trilogy [epub/mobi]","uid":9096504,"size":27093184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2b12715bd05237a84e9ac6f60b9c127b9754440&amp;dn=Richard+J.+Evans+-+The+Third+Reich+Trilogy+%5Bepub%2Fmobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"overagent","files":-1,"time":1382692304,"description":"All books are in .epub and .mobi format\n\nPlease seed. \n\nBook List:\n\n\nThe Coming of the Third Reich (2004)\n\n\tRichard J. Evans' The Coming of the Third Reich: How the Nazis Destroyed Democracy and Seized Power in Germany explores how the First World War, the Weimar Republic and the Great Depression paved the way for Nazi rule. They started as little more than a gang of extremists and thugs, yet in a few years the Nazis had turned Germany into a one-party state and led one of Europe's most advanced nations into moral, physical and cultural ruin and despair. In this consummate and compelling history, the first book in his acclaimed trilogy on the rise and fall of Nazi Germany, Richard Evans reveals how and why it happened, questions whether the rise of Hitler was inevitable and dramatically re-creates the maelstrom of disorder, economic disaster, violence and polarization that gave rise to the terror of the Third Reich.  Sir Richard J. Evans is Professor of Modern History at Cambridge University. His previous books include In Defense of History, Telling Lies about Hitler and the companions to this title, The Coming of the Third Reich and The Third Reich at War.\n\n\nThe Third Reich in Power (2005)\n\n\tIn The Third Reich in Power, Richard J. Evans tells the story of Germany's radical reshaping under Nazi rule. Every area of life, from literature, culture, and the arts to religion, education, and science, was subordinated to the relentless drive to prepare Germany for war. His book shows how the Nazis attempted to penetrate and reorder every aspect of German society, encountering many kinds and degrees of resistance along the way but gradually winning the acceptance of the German people in the long run. \n\nThose who were seen as unfit to be counted among the German people were dealt with in increasingly brutal terms. After six years of foreign policy brinkmanship that took the Nazi regime from success to success, Hitler's drive to prepare Germany for the war he saw as its destiny reached its fateful hour in September 1939. The war he unleashed was to plunge the world into a maelstrom of genocide and destruction.\n\n\nThe Third Reich at War (2009)\n\n\tAdroitly blending narrative, description, and analysis, Richard J. Evans portrays a society rushing headlong to self-destruction and taking much of Europe with it. Interweaving a broad narrative of the war's progress from a wide range of people, Evans reveals the dynamics of a society plunged into war at every level. The great battles and events of the conflict are here, but just as telling is Evans's re- creation of the daily experience of ordinary Germans in wartime. At the center of the book is the Nazi extermination of the Jews. The final book in Richard J. Evan's three-volume history of Hitler's Germany, The Third Reich at War lays bare the most momentous and tragic years of the Nazi regime.","torrent":{"xt":"urn:btih:b2b12715bd05237a84e9ac6f60b9c127b9754440","amp;dn":"Richard+J.+Evans+-+The+Third+Reich+Trilogy+%5Bepub%2Fmobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2b12715bd05237a84e9ac6f60b9c127b9754440","infoHashBuffer":{"type":"Buffer","data":[178,177,39,21,189,5,35,122,132,233,172,111,96,185,193,39,185,117,68,64]},"announce":[],"urlList":[]}}