{"title":"Rhonda Vincent-Good Thing Going (2008-Bluegrass-VBR)","uid":3972629,"size":55144876,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b3857b84d7bb5b380a20941ebac66a15ce69cb7c&amp;dn=Rhonda+Vincent-Good+Thing+Going+%282008-Bluegrass-VBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cheng","files":15,"time":1200081567,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51FVdzM1pnL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51FVdzM1pnL._SS500_.jpg&lt;/a&gt;\n\n-=AMG Review=- by Rick Anderson\n\nRhonda Vincent is not only one of modern bluegrass music&amp;#039;s most conspicuously talented artists, she is also one of the savviest and cleverest. As an artist she&amp;#039;s a triple threat: her voice is sharp, clear, and sweet; she&amp;#039;s a fine mandolin player; and she&amp;#039;s pretty and not afraid to show a little skin (which guarantees her plenty of attention in the normally rather dowdy and male-oriented bluegrass world). But she has also built a musical niche for herself that sets her apart from the pack without alienating (most) purists: rather than resorting to the time-honored practice of blending bluegrass with pop and rock influences, she tempers her traditional material with elements of modern country and Western swing ? the latter a more unusual stylistic interpolation than you might think (perhaps because swinging jazz rhythms are so foreign to bluegrass, which is usually very rhythmically square). Good Thing Going finds Vincent bringing all of those styles together to create a very solid and enjoyable program. There are a few high-octane barnburners (&quot;I&amp;#039;m Leavin&amp;#039;,&quot; &quot;Bluegrass Saturday Night,&quot; a roaring version of the Jimmy Martin classic &quot;Hit Parade of Love&quot;) and they&amp;#039;re all very fun, but the standout tracks are the ones that depart a bit from the standard: the swinging &quot;World&amp;#039;s Biggest Fool,&quot; the country-folky &quot;I Gotta Start Somewhere&quot; (with drums, yikes), the Eagles-ish &quot;Just One of a Kind,&quot; and a sumptuously lovely version of the old Irish song &quot;The Water Is Wide.&quot; Her regular band is augmented by a guest list that includes Jesse McReynolds, Russell Moore, and Bryan Sutton, among others, and everything hangs together beautifully. Very highly recommended. \n\n-=Product Description=-\n\nBlending soul, intensity, and tenderness, Rhonda Vincent&amp;#039;s unique brand of bluegrass is rich in tradition while remaining unmistakeably modern. Among the most beloved figures in today&amp;#039;s bluegrass scene, Vincent has earned an unprecedented seven consecutive Female Vocalist of the Year awards from the International Bluegrass Music Association, is a top concert and festival draw, and, with her road band The Rage supporting her, is one of the most dynamic and high-energy performers in any genre of music. Encompassing heartfelt ballads and hard-driving bluegrass, along with dashes of swing and country, Good Thing Going is her most varied, personal, and accomplished album to date. It is also her most joyously uplifting, from the celebratory, autobiographical title track to the touchingly heartfelt &quot;I Give All My Love To You.&quot; \n\nSpecial guests include Keith Urban, Jesse McReynolds, Russell Moore, Bryan Sutton, Becky Isaacs-Bowman, Stuart Duncan, Kathy Chiavola, Andy Hall, and more! \n\n   ____________________________________________________________________\n                    ___           ___           ___\n                   /  /         /  /         /__/\n                  /  /:/_       /  /::          :\n                 /  /:/ /     /  /:/:          :\n                /  /:/ /:/_   /  /:/  :   _______:\n               /__/:/ /:/ / /__/:/ __: /__/::::::::\n                 :/:/ /:/   : /  /:/   :~~~~/\n                  ::/ /:/     :  /:/     :  ~~~\n                   :/:/       :/:/       :\n                    ::/         ::/         :\n                   __/         __/         __/\n   ____________________________________________________________________\n\n                    Rhonda Vincent - Good Thing Going\n   ____________________________________________________________________\n\n\n   Artist  : Rhonda Vincent\n   Album   : Good Thing Going\n\n   Genre   : Bluegrass\n   Label   : Rounder\n\n   Source  : CDDA\n   Size    : 52,6 MB\n\n   Quality : VBRkbps\n           : 44.1kHz\n           : Joint\n   ____________________________________________________________________\n\n   Tracklist:\n   ____________________________________________________________________\n\n   01    I&amp;#039;m Leavin&amp;#039;                                              03:13\n   02    World&amp;#039;s Biggest Fool                                     03:33\n   03    I Give All My Love To You (With Russell Moore)           03:30\n   04    Good Thing Going                                         03:07\n   05    Scorn Of A Lover                                         03:10\n   06    Hit Parade Of Love                                       02:25\n   07    I Will See You Again                                     04:20\n   08    Just One Of A Kind                                       02:59\n   09    I Gotta Start Somewhere                                  03:36\n   10    Who&amp;#039;s Cryin&amp;#039; Baby                                        03:06\n   11    The Water Is Wide (With Keith Urban)                     04:03\n   12    Bluegrass Saturday Night                                 03:09\n\n                                                   Total Runtime: 40:11\n   ____________________________________________________________________\n\n   Release Notes:\n   ____________________________________________________________________\n\n   Blending soul, intensity, and tenderness, Rhonda Vincent&amp;#039;s unique \n   brand of bluegrass is rich in tradition while remaining \n   unmistakeably modern. Among the most beloved figures in today&amp;#039;s \n   bluegrass scene, Vincent has earned an unprecedented seven \n   consecutive Female Vocalist of the Year awards from the \n   International Bluegrass Music Association, is a top concert and \n   festival draw, and, with her road band The Rage supporting her, is \n   one of the most dynamic and high-energy performers in any genre of \n   music. Encompassing heartfelt ballads and hard-driving bluegrass, \n   along with dashes of swing and country, Good Thing Going is her \n   most varied, personal, and accomplished album to date. It is also \n   her most joyously uplifting, from the celebratory, \n   autobiographical title track to the touchingly heartfelt &quot;I Give \n   All My Love To You.&quot;\n\n   Special guests include Keith Urban, Jesse McReynolds, Russell \n   Moore, Bryan Sutton, Becky Isaacs-Bowman, Stuart Duncan, Kathy \n   Chiavola, Andy Hall, and more!\n\n   ____________________________________________________________________\n","torrent":{"xt":"urn:btih:b3857b84d7bb5b380a20941ebac66a15ce69cb7c","amp;dn":"Rhonda+Vincent-Good+Thing+Going+%282008-Bluegrass-VBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3857b84d7bb5b380a20941ebac66a15ce69cb7c","infoHashBuffer":{"type":"Buffer","data":[179,133,123,132,215,187,91,56,10,32,148,30,186,198,106,21,206,105,203,124]},"announce":[],"urlList":[]}}