{"title":"Blue Murder - 1989 - MP3 - 128kbps","uid":4264999,"size":50335445,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b43091fff5c129ca3980d71d17b12e16b76b4733&amp;dn=Blue+Murder+-+1989+-+MP3+-+128kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jihan_aska","files":10,"time":1214652084,"description":"Blue Murder was the brainchild of guitar virtuoso John Sykes. Upon his firing from the most successful version of Whitesnake, the former Thin Lizzy and Tygers Of Pan Tang axe-man, set out to create a similar sounding bluesy hard rock band.\n  Initial trials for the band included vocalist Ray Gillen (of Black Sabbath and later Badlands) and versatile drummer Cozy Powell. However Sykes would end up doing vocals himself and adding ex-Firm bassist Tony Franklin, drummer Carmine Appice (of Vanilla Fudge, King Kobra etc) and Nik Green on keyboards. The debut album would sound a lot like Whitesnake&amp;#039;s 1987 album, showing just how important Sykes was to his former band. In fact even Sykes&amp;#039; vocals sounded an awful lot like that of David Coverdale.\n  In 1991 Sykes offered Kelly Keeling (ex-Baton Rouge) the job as lead vocalist. Upon joining, Keeling discovered that Franklin and Appice had left the band. While all the original members played parts in the follow-up album, the new band consisted of Green, Marco Mendoza (bass) and Tommy O&amp;#039;Steen (drums). Sykes was unsure about most of Keeling&amp;#039;s lead vocals, and by the time Nothin&amp;#039; But Trouble was released, had overdubbed the majority of them. In 1993 Keeling left the band and the Blue Murder moniker was put to rest as the group changed their name to Sykes. Success never came to the band, and they were dropped from their major label contract. They released one more album, a live tribute to Thin Lizzy&amp;#039;s Phil Lynott before calling it a day.\n &lt;a href=&quot;\nhttp://www.sleazeroxx.com/bands/bluemurder/bluemurder.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sleazeroxx.com/bands/bluemurder/bluemurder.shtml&lt;/a&gt;","torrent":{"xt":"urn:btih:b43091fff5c129ca3980d71d17b12e16b76b4733","amp;dn":"Blue+Murder+-+1989+-+MP3+-+128kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43091fff5c129ca3980d71d17b12e16b76b4733","infoHashBuffer":{"type":"Buffer","data":[180,48,145,255,245,193,41,202,57,128,215,29,23,177,46,22,183,107,71,51]},"announce":[],"urlList":[]}}