{"title":"Advanced Malware Analysis (gnv64)","uid":12510286,"size":18952172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b45eb5c8647051846d4b3486b63bb9cc565d0243&amp;dn=Advanced+Malware+Analysis+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":4,"time":1443534924,"description":"Advanced Malware Analysis\r\nby Christopher Elisan\r\nMcGraw-Hill Education | August 2015 | ISBN-10: 0071819746 | ePUB | 17.7 mb\r\n\r\nA one-of-a-kind guide to setting up a malware research lab, using cutting-edge analysis tools, and reporting the findings\r\nAdvanced Malware Analysis is a critical resource for every information security professional's anti-malware arsenal. The proven troubleshooting techniques will give an edge to information security professionals whose job involves detecting, decoding, and reporting on malware.\r\nAfter explaining malware architecture and how it operates, the book describes how to create and configure a state-of-the-art malware research lab and gather samples for analysis. Then, you’ll learn how to use dozens of malware analysis tools, organize data, and create metrics-rich reports.\r\n-  A crucial tool for combatting malware?which currently hits each second globally\r\n-  Filled with undocumented methods for customizing dozens of analysis software tools for very specific uses\r\n-  Leads you through a malware blueprint first, then lab setup, and finally analysis and reporting activities\r\n-  Every tool explained in this book is available in every country around the world\r\n\r\nAbout the Author\r\nElisan graduated with a degree in Bachelor's of Science in Computer Engineering and holds the following industry certifications: Certified Ethical Hacker, Microsoft Certified Systems Engineer, Microsoft Certified Systems Administrator, Microsoft Certified Professional, and Certified Scrum Master. Christopher C. Elisan is a veteran of the security industry having started his career straight out of college. He is a seasoned reverse engineer and malware researcher. He has seen malware develop from the DOS days to the more complicated and sophisticated malware we see today. He is currently the Principal Malware Scientist and Senior Manager of the Malware Intelligence Team at RSA, The Security Division of EMC\r\nElisan is considered one of the world's subject matter experts when it comes to malware, digital fraud and cybercrime. He lends his expertise to different law enforcement agencies and he provides expert opinion about malware, botnet and advance persistent threats for leading industry and mainstream publications, including USA Today, San Francisco Chronicle, SC Magazine, InformationWeek, Fox Business and Dark Reading. He is also a frequent speaker at various security conferences around the globe.\r\n\r\nCONTENTS\r\nPart I Malware Blueprint\r\nChapter 1 Malware Analysis 101\r\nChapter 2 Malware Taxonomy\r\nChapter 3 Malware Deployment\r\nChapter 4 Protective Mechanisms\r\nChapter 5 Malware Dependencies\r\nPart II Malware Research Lab\r\nChapter 6 Malware Collection\r\nChapter 7 Static Analysis Lab\r\nChapter 8 Dynamic Analysis Lab\r\nPart III Malware Inspection\r\nChapter 9 The Portable Executable File\r\nChapter 10 The Proper Way to Handle Files\r\nChapter 11 Inspecting Static Malware\r\nChapter 12 Inspecting Dynamic Malware\r\nChapter 13 Tools of the Trade\r\nPart IV Appendixes\r\nAppendix A Tools List\r\nAppendix B List of Laboratories\r\nAppendix C Volatility Framework Basic Plug-ins\r\nIndex\r\n \nhttp://s28.postimg.org/v0o0681nh/Advanced_Malware_Analysis.jpg","torrent":{"xt":"urn:btih:b45eb5c8647051846d4b3486b63bb9cc565d0243","amp;dn":"Advanced+Malware+Analysis+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b45eb5c8647051846d4b3486b63bb9cc565d0243","infoHashBuffer":{"type":"Buffer","data":[180,94,181,200,100,112,81,132,109,75,52,134,182,59,185,204,86,93,2,67]},"announce":[],"urlList":[]}}