{"title":"The Complete Miss Marple Mystery Collection - Agatha Christie","uid":11156007,"size":1734005884,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b486ef80d280b33a44e16687438851661781b641&amp;dn=The+Complete+Miss+Marple+Mystery+Collection+-+Agatha+Christie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"davieboy1966","files":89,"time":1412383432,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\nAll recordings are unabridged Mono CBR Fraunhofer MP3 and from CD.\nThese are narrations, not dramatisations.\n\nThe narrators include - James Saxon, Rosemary Leach, Rosalind Ayres, Stephanie Cole and Joan Hickson.\n\nI have paid particular attention to narrators and have chosen the ones that I consider the best for each book - sometimes there was little choice due to narrator availability and/or sound quality!\n\nI have deliberately tried to avoid readings by Joan Hickson, but it would appear she is the only narrator available for the two volumes of Miss Marple short stories.\n\nThe title numbering sequence is by year of publication of the original book.\n\n\n\n#1. The Murder at the Vicarage [1930], 7 hours 22 mins, read by James Saxon (32kbps / 22kHz )\nJames Saxon delivers a memorable and absolutely masterful performance of Christie's first Miss Marple mystery. When the unpopular Colonel Protheroe is found murdered in the vicar's study, it seems that everyone - his unhappy wife, his daughter, a visiting artist, an embittered poacher, the vicar has a motive in a mystery that confounds the authorities, consumes the village and can only be untangled by observations and deductions of our heroine: the elderly gossip-cum-sleuth Miss Marple. Saxon's artful and enthusiastic portrayal of a host of characters male and female, guilty and innocent, young and old, will delight Christie fans, mystery lovers and anyone lucky enough to listen.\n\n#2. The Thirteen Problems [1932], 6 hours 46 mins, read by Joan Hickson (32 kbps / 22 kHz)\nThere are three sets of narrative, though they themselves interrelate. The first set of six are stories told by the Tuesday Night Club, a random gathering of people at the house of Miss Marple. Each week the group tell thrilling tales of mystery, which are always solved by Miss Marple, from the comfort of her armchair. One of the guests is Sir Henry Clithering, an ex-commissioner of Scotland Yard, and this allows Christie to resolve the story, with him usually pointing out that the criminals were caught. The next set of six occur as part of a dinner party Miss Marple is invited to at the request of Sir Henry Clithering, as a result of her skill in the Tuesday Night Club. This employs a similar guessing game, and once more Miss Marple triumphs. The thirteenth story, Death by Drowning takes place some time after the dinner party when Miss Marple finds out that Clithering is staying in St. Mary Mead and asks him to help in the investigation surrounding the death of a girl in the village.\n\n#3. The Body in the Library [1942] , 5 hours 23 mins, read by Stephanie Cole (32 kbps / 22 kHz)\nIt's seven in the morning in the English village of St Mary Mead. The Bantrys wake to find the corpse of a young woman in their library. She is wearing evening dress and heavy make-up, which is now smeared across her cheeks. But who is she? How did she get there? And what is the connection with another dead girl, whose charred remains are later discovered in an abandoned quarry? The respectable Bantrys invite their friend Miss Marple to solve the mystery - before tongues start to wag...\n\n#4. The Moving Finger [1943], 5 hours 54 mins, read by James Saxon (48 kbps / 44 kHz) fixed\nJerry Burton and his sister, Joanna, are living temporarily in a quiet English village so that Jerry can recover from a disabling aviation accident. No one has warned them that vile, anonymous letters were being sent to various villagers and, indeed, they soon receive such a letter themselves. A letter, of course, is only harmful if a recipient takes it so seriously she kills herself - which happens soon after the story begins. And then there is a murder. Is this the result of a letter, or of a deranged mind that fears discovery? Jerry Burton is out of investigative ideas, when Miss Marple appears....\n\n#5. A Murder Is Announced [1950], 8 hours 44 mins, read by Rosemary Leach (48 kbps / 44 kHz) Generally regarded as the best Miss Marple novel\nThe villagers of Chipping Cleghorn, including Jane Marple, are agog with curiosity over an advertisement in the local gazette which reads: 'A murder is announced and will take place on Friday October 29th, at Little Paddocks at 6.30 pm. ' A childish practical joke? Or a hoax intended to scare poor Letitia Blacklock? Unable to resist the mysterious invitation, a crowd begins to gather at Little Paddocks at the appointed time when, without warning, the lights go out...\n\n#6. They Do It with Mirrors [1952] , 6 hours 18 mins, read by Rosemary Leach (48 kbps / 44 kHz )\nMiss Marple senses danger when she visits a friend living in a Victorian mansion which doubles as a rehabilitation centre for delinquents. Her fears are confirmed when a youth fires a revolver at the administrator, Lewis Serrocold. Neither is injured. But a mysterious visitor, Mr Gilbrandsen, is less fortunate -- shot dead simultaneously in another part of the building. Pure coincidence? Miss Marple thinks not, and vows to discover the real reason for Mr Gilbrandsen's visit....\n\n#7. A Pocket Full of Rye [1953], 6 hours 47 mins, read by Rosalind Ayres (48 kbps / 44 kHz) (Many thanks to meixiang)\nRex Fortescue was a very rich and quite unpleasant man. He ran his family and his business with an iron fist. One morning his very efficient secretary took in his morning tea and found him dying. While investigating his death the police were met with one puzzle after another, and just why did he have a pocket full of rye grain? As they were beginning to get some answers another murder occurred and then yet another each bringing more confusion to the scene. Miss Marple arrives at the house and begins to sort through the tangle of clues to steer the police in the right direction.\n\n#8. 4:50 from Paddington [1957], 7 hours 41 mins, read by Rosemary Leach (32 kbps / 22 kHz)\nFor an instant the two trains ran together, side by side. In that frozen moment, Elspeth witnessed a murder. Helplessly, she stared out of her carriage window as a man remorselessly tightened his grip around a woman's throat. The body crumpled. Then the other train drew away. But who, apart from Miss Marple, would take her story seriously? After all, there were no suspects, no other witnesses, and no corpse!\n\n#9. The Mirror Crack'd from Side to Side [1962], 8 hours 33 mins, read by Rosemary Leach (32 kbps / 22 kHz)\nThe intrepid Miss Marple is getting on and now has a full-time nurse, but the little grey cells are still working overtime. When celebrity Marina Gregg moves to St. Mary Mead, it's amazing how many people turn up at her first house party, claiming to be old friends. When one of them ends up dead, it looks like the lethal cocktail might have been meant for Gregg herself. (Rosemary Leach has a beautiful, smooth, and utterly British voice. She's got Miss Marple down to a T. Not too fluttery, not too timid, just right. She carries off the entire cast of characters with professionalism and skill).\n\n#10. A Caribbean Mystery [1964], 5 hours 58 mins, read by Rosalind Ayres (48 kbps / 44 kHz ) (Many thanks to meixiang)\nAn exotic holiday for Miss Marple is ruined when a retired major is killed...As Jane Marple sat basking in the Caribbean sunshine she felt mildly discontented with life. True, the warmth eased her rheumatism, but here in paradise nothing ever happened. Eventually, her interest was aroused by an old soldier's yarn about a strange coincidence. Infuriatingly, just as he was about to show her an astonishing photograph, the Major's attention wandered. He never did finish the story!\n\n#11. At Bertram's Hotel [1965], 7 hours 35 mins, read by Rosemary Leach (48 kbps / 44 kHz )\nIn the midst of a crime wave involving a host of startling robberies, elderly Miss Jane Marple takes a vacation at London's Bertram's Hotel - a hotel that specialises in recreating the luxuries of the bygone Edwardian age, complete with high tea, cozy armchairs by the fire, and world-class service. But when a young heiress staying at the hotel becomes involved with an undesirable man and the absent-minded Canon Pennyfeather mysteriously disappears from his rooms, Miss Marple quickly realises that the hotel's famous service may include more than meets the eye....\n\n#12. Nemesis [1971], 8 hours 15 mins, read by Rosalind Ayres (48 kbps / 44 kHz)\nWhile on vacation last year Jane Marple had met fellow traveller Jason Rafiel. Together they solved a crime (Caribbean Mystery) and then passed out of each other's lives - or so Miss Marple thought. She was quite surprised to find that he had left her a bequest in his will. She was even more surprised to find what the bequest was amd what Mr. Rafiel requested that she do. It seemed that his only son had been charged with the murder of a young woman years before, a young woman named Verity, and Mr. Rafiel wanted to truth of come out once and for all. Soon Miss Marple was on the trail of this long ago crime, set to act in the role that Mr. Rafiel had cast her, the role of 'Nemesis' - bringer of justice. Her task is further complicated by the vagueness of her instructions. Mr. Rafiel has not given her more than the barest of clues as to what he wants her to accomplish or to who is enemy or ally on her quest...\n\n#13. Sleeping Murder [1976], 6 hours 17 mins, read by Stephanie Cole (32 kbps / 22 kHz) (written in 1940, but published in 1976)\nThe owner of an English seaside villa is plagued by strange feelings about it's past...Soon after Gwenda moved into her new home, odd things started to happen. Despite her best efforts to modernise the house, she only succeeded in dredging up its past. Worse, she felt an irrational sense of terror every time she climbed the stairs! In fear, Gwenda turned to Miss Marple to exorcise her ghosts. Between them, they were to solve a 'perfect' crime committed many years before....\n\n#14. Miss Marple's Final Cases [1979], 6 hours 4 mins, read by Joan Hickson (32 kbps / 22 kHz)\nMiss Marple Tells a Story, Strange Jest, Tape-Measure Murder, The Case of the Caretaker, The Case of the Perfect Maid, Greenshaw's Folly and Sanctuary. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b486ef80d280b33a44e16687438851661781b641","amp;dn":"The+Complete+Miss+Marple+Mystery+Collection+-+Agatha+Christie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b486ef80d280b33a44e16687438851661781b641","infoHashBuffer":{"type":"Buffer","data":[180,134,239,128,210,128,179,58,68,225,102,135,67,136,81,102,23,129,182,65]},"announce":[],"urlList":[]}}