{"title":"Sexually Broken--Roxy Rox bound in a piledriver made to squirt","uid":9486168,"size":703451813,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b4a6cadbae2251ea47422f98f3c795b6481131f1&amp;dn=Sexually+Broken--Roxy+Rox+bound+in+a+piledriver+made+to+squirt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"merzedes","files":-1,"time":1389893525,"description":"Roxy Rox bound in a piledriver, made to squirt over and over, Brutal Orgasms! Massive Squirting! | Roxy Rox | Matt Williams\n\nJanuary 15, 2014\n\n\nMP4 only.\n\n\nRoxy Rox is a natural born nymphomaniac. She just cannot help it, she is at the mercy of her out of control sexual urges. She got into porn not for the money or notoriety, but so she could have as much top shelf dick as possible. She is such a slut that if she was not doing porn she would be banging random guys next to the dumpsters behind her local supermarket.\n\nHere at Sexuallybroken we have just the cure for out of control sluts like our Roxy. We fold her long lean model body in half like a pocketknife and bolt her to the floor with wooden stocks in a piledriver position. Ass up and completely exposed, holes deliciously vulnerable. In addition to being a slut in heat, our Roxy is also a major league squirter. And in this position, every drop of squirt we wring out of that fuckhole is going directly in her face. Has Roxy ever wondered what it would be like to bathe in her own cum? She is about to find out.\n\nUsing one of the most intense vibrators on the planet has an immediate and gushing reaction. Roxy unloads all over her own face. She cannot help it. Within seconds she is as drenched as if she had just gotten out of the shower. The sight of her sputtering in her own cum is just too much fun and we release orgasmaddeon on her. Multiple vibrators, fingerblasting, orgasm after orgasm is ripped out of that horny hole. She moans and gasps, her entire body dripping, as she lies in a puddle of her own squirt.\n\nNow that her pussy is all warmed up, we make use of it, pumping balls deep, owning every inch. She cannot move a single muscle and we avail ourselves to that completely exposed cunt. Then it is back to more squirting orgasms. Roxy is wrecked. She is come undone, a riptide of multiple orgasms, totally fucked stupid. We leave her bolted to our stage in a giant puddle. This one was a lot of fun. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_15rrox3/SexuallyBroken-Roxy-Rox-Matt-Williams-Roxy-Rox-bound-in-a-piledriver-made-to-squirt-over-and-over-Brutal-Orgasms-Massive-Squirting.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_15rrox3/SexuallyBroken-Roxy-Rox-Matt-Williams-Roxy-Rox-bound-in-a-piledriver-made-to-squirt-over-and-over-Brutal-Orgasms-Massive-Squirting.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:b4a6cadbae2251ea47422f98f3c795b6481131f1","amp;dn":"Sexually+Broken--Roxy+Rox+bound+in+a+piledriver+made+to+squirt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4a6cadbae2251ea47422f98f3c795b6481131f1","infoHashBuffer":{"type":"Buffer","data":[180,166,202,219,174,34,81,234,71,66,47,152,243,199,149,182,72,17,49,241]},"announce":[],"urlList":[]}}