{"title":"Sexually Broken--Ring gagged, Skull Fucked  Bella Rossi  Matt Wi","uid":9118004,"size":912273369,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b4acb4db0bb2823bab0f7cbbdaa547f43b391e2f&amp;dn=Sexually+Broken--Ring+gagged%2C+Skull+Fucked++Bella+Rossi++Matt+Wi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"merzedes","files":-1,"time":1383066011,"description":"Ring gagged, blindfolded, Straight Jacketed, Inverted, Skull Fucked into Submission! Brutal Orgasms! | Bella Rossi | Matt Williams\n\nOctober 28, 2013 \n \n\nMP4 only.    \n \n \nIt's been over a year since we last had the beautiful Bella Rossi on Sexually Broken. We missed her pretty face, huge natural tits, and awesome banging booty.\n\nIn 1974 PD hand made the Straight Jacket that Bella is now locked into. You have never seen a better Bondage Straight Jacket then this, one with custom zippers to let the massive boobs out to play. Helpless on her knees and attached to a wooden beam, Bella is blindfolded with a huge ring gag prying her mouth wide open.\n\nOne of Sexually Broken's best features is our brutal throat fucking while our girls are completely helpless. With her mouth held wide open, we bring two hard cocks to bare on Bella's delicate throat. Each cock slides into her mouth and right to the back of her mouth, cutting off any chance for air. We fuck her face like it's her pussy, long deep brutal strokes, pushing all the way down her throat over and over. We remove the gag and intensify our efforts, blasting Bella quickly into subspace.\n\nLike most of our scenes the bondage progresses right before your eyes into something completely different. Before you can say &quot;Make this bitch cum.&quot; We have Bella hanging upside down by thin leather straps. A huge dildo impales her shaved pussy and a vibrator is locked directly on her pierced clit. It doesn't take Bella long before the first orgasms rocks through her body. The cocks re-introduce themselves to Bella's tonsils, and Bells is cumming and struggling for air. The cocks continue their rampage on Bell's throat and the vibrator keeps Bella cumming like a common whore. In the end we leave Bells swaying, cumming and moaning, with a steady stream of throat gunk dripping for her well used mouth hole.. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/10_28brossi4/SexuallyBroken-Bella-Rossi-Matt-Williams-Ring-gagged-blindfolded-Straight-Jacketed-Inverted-Skull-Fucked-into-Submission-Brutal-Orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/10_28brossi4/SexuallyBroken-Bella-Rossi-Matt-Williams-Ring-gagged-blindfolded-Straight-Jacketed-Inverted-Skull-Fucked-into-Submission-Brutal-Orgasms.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:b4acb4db0bb2823bab0f7cbbdaa547f43b391e2f","amp;dn":"Sexually+Broken--Ring+gagged%2C+Skull+Fucked++Bella+Rossi++Matt+Wi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4acb4db0bb2823bab0f7cbbdaa547f43b391e2f","infoHashBuffer":{"type":"Buffer","data":[180,172,180,219,11,178,130,59,171,15,124,187,218,165,71,244,59,57,30,47]},"announce":[],"urlList":[]}}