{"title":"Top 100 Bluegrass Jamming Tunes","uid":5306413,"size":808281484,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b50607cb4e61deb51b8cc6b4666e693525341082&amp;dn=Top+100+Bluegrass+Jamming+Tunes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Hugo_Ball","files":226,"time":1264408361,"description":"Dr. Banjo (aka &quot;Pete Wernick&quot;) has a great website for all things banjo.\nHe has a list of the 100 songs every banjo (and bluegrass) player should know. \nCheck out his website here: http://drbanjo.com/\n\nI compiled an album of all the songs he lists done by various artists. For most of the songs, there are at least two versions. \n\nEnjoy\n\n- - - - - \n\nAll the Good Times are Past and Gone\tby\tFrank Wakefield Band \nAll the Good Times are Past and Gone\tby \tShoreline Bluegrass\nAngel Band\tby\tThe Stanley Brothers\nBanks Of The Ohio\tby\tJohnny Cash\nBanks of the Ohio\tby \tOlivia Newton John\nBile Them Cabbage Down\tby\tUncle Dave Macon\nBill Cheatham\tby\tDoc &amp; Merle Watson\nBill Cheatham\tby \tThe Laon Family\nBlackberry Blossom\tby\tMean Mary\nBlackberry Blossom\tby\tPeter Rowan and Tony Rice\nBlue Moon of Kentucky (live)\tby \tBill Monroe\nBlue Night\tby\tBill Monroe &amp; His Bluegrass Boys\nBlue Ridge Cabin Home\tby\tFlatt &amp; Scruggs\nBlue Ridge Cabin Home\tby \tTony Rice\nBury Me Beneath the Weeping Willow\tby\tRicky Skaggs &amp; Tony Rice\nBury Me Beneath The Willow\tby\tAnita Carter\nBury Me Beneath The Willow\tby \tClarence White\nCareless Love\tby\tBig Bill Broonzy\nCareless Love\tby\tBob Dylan and Johnny Cash\nCareless Love\tby \tLeadbelly\nCharlie and the MTA\tby\tKingston Trio\nClinch Mountain Backstep\tby\tRalph Stanley\nColumbus Stockade Blues\tby \tHot Club Of Cowtown\nColumbus Stockade Blues\tby\tWillie Nelson\nColumbus Stockade Blues \tby\tArlo Guthrie, Donovan, Hans Theesink\nCome All Ye Fair and Tender Ladies\tby \tJackson Browne\nCome All Ye Fair and Tender Ladies\tby\tMaybelle Carter\nCripple Creek\tby\tLester Flatt &amp; Earl Scruggs\nCripple Creek\tby \tRalph Stanley\nCripple Creek / Old Joe Clark / Leather Britches\tby\tPete Seeger\nCrying Holy Unto The Lord\tby\tBad Livers\nCrying Holy Unto The Lord\tby \tBill Monroe and the Bluegrass Boys\nCrying Holy Unto The Lord\tby\tThe Blue Chips\nDark As A Dungeon\tby\tJohnny Cash\nDark As A Dungeon\tby \tNitty Gritty Dirt Band\nDark As A Dungeon\tby\tRamblin' Jack Elliott\nDark Hollow\tby\tGrateful Dead\nDark Hollow\tby \tJ.D. Crowe\nDear Old Dixie\tby\tHillbilly Gypsies\nDear Old Dixie\tby\tJon Eric\nDixie Breakdown\tby \tBlue Ridge Mountain Boys\nDon't This Road Look Rough and Rocky\tby\tJust Grass \nDrifting Too Far from the Shore\tby\tEmmylou Harris\nDrifting Too Far from the Shoree\tby \tHank Williams\nFare You Well Old Joe Clark\tby\tFiddlin' John Carson\nFoggy Mountain Breakdown (Single Version)\tby\tLester Flatt and Earl Scruggs\nFoggy Mountain Special\tby \tThe Old Grey Dogs and Lee Spence\nFoggy Mountain Special \tby\tSierra Hull &amp; Highway 111 \nFoggy Mountain Top\tby\tBill Monroe &amp; Doc Watson\nFoggy Mountain Top\tby \tThe Carter Family\nFoggy Mountain Top\tby\tMaybelle Carter\nFoggy Mountain Top\tby\tWoody Guthrie\nFootprints in the Snow\tby \tRoger Miller\nFox On The Run\tby\tDale Watson\nFox On The Run\tby\tLester Flatt &amp; Earl Scruggs\nFreight Train\tby \tElizabeth Cotten\nFreight Train\tby\tRusty Draper\nFriend Of The Devil\tby\tGrateful Dead\nFriend Of The Devil\tby \tRice, Rice, Hillmann &amp; Pedersen\nGentle on My Mind\tby\tElvis Presley\nGentle on My Mind\tby\tGlen Campbell\nGray Eagle\tby \tWalt Koken\nGround Speed\tby\tEarl Scruggs\nGround Speed\tby\tLone Mountain Band\nHighway of Regret\tby \tStanley Brothers\nHit Parade of Love\tby\tJimmy Martin\nHome on the Range\tby\tIgor's Jazz Cowboys\nHot Corn, Cold Corn\tby \tFlatt &amp; Scruggs\nHot Corn, Cold Corn\tby\tThe Holy Modal Rounders\nHot Corn, Cold Corn\tby\tJerry Garcia\nHow Mountain Girls Can Love\tby \tThe Stanley Brothers\nHow Mountain Girls Can Love \tby\tLeftover Salmon With The String Cheese Incident\nI'll Fly Away\tby\tAlison Krauss &amp; Gillian Welch\nI'll Fly Away\tby \tHank Williams\nI'll Fly Away\tby\tJohnny Cash\nI'll Fly Away (with Merle Haggard)\tby\tWillie Nelson\nI'm Working on a Building\tby \tJohnny Cash\nI'm Working On A Building\tby\tThe Seventy Sevens\nI've Got That Old Feeling \tby\tAlison Krauss &amp; Union Station\nI Am A Man Of Constant Sorrow\tby \tThe Soggy Bottom Boys\nI Am A Pilgrim\tby\tLost Dogs\nI am A Pilgrim\tby\tNitty Gritty Dirt Band\nI Hear a Sweet Voice Calling\tby \tDel McCoury Band\nI Hear a Sweet Voice Calling\tby\tMatt and George and Their Pleasant Valley Boys\nI Know My Rider (I Know You Rider)\tby\tThe Byrds\nI Know You Rider\tby \tGrateful Dead\nI Know You Rider\tby\tPhil Lesh And Friends\nI Know You Rider (bonus track)\tby\tJoan Baez\nI Saw the Light\tby \tHank Williams\nI Saw The Light\tby\tNitty Gritty Dirt Band\nI Wonder Where You Are Tonight\tby\tDel McCoury\nIf I Lose\tby \tRicky Skaggs\nIf I Lose\tby\tThe Stanley Brothers\nIf I Lose \tby\tThe Band\nIn the Pines\tby \tLeadbelly\nJambalaya\tby\tJerry Lee Lewis\nJambalaya (On the Bayou)\tby\tFats Domino\nJambalaya (On The Bayou)\tby \tHank Williams\nJesse James\tby\tPete Seeger\nJohn Hardy\tby\tPete Seeger\nJohn Hardy\tby \tRamblin' Jack Elliott\nJohn Hardy (vocal)\tby\tBrian Peters\nJohn Hardy Was A Desperate Little Man\tby\tFlatt &amp; Scruggs With Doc Watson\nLife's Railway to Heaven\tby \tPatsy Cline\nLife's Railway To Heaven\tby\tRuss Taff\nLittle Cabin on the Hill\tby\tBill Monroe\nLittle Cabin On The Hill\tby \tElvis Presley\nLittle Maggie\tby\tBob Dylan\nLittle Maggie\tby\tFlatt &amp; Scruggs\nLittle Maggie\tby \tRalph Stanley\nLive and Let Live\tby\tAllen Red &amp; The Kentuckians\nLive And Let Live\tby\tBill Monroe\nLive And Let Live\tby \tDel McCoury, Doc Watson, Mac Wiseman\nThe Lonesome River\tby\tRalph Stanley &amp; Friends\nThe Lonesome River (with Ralph Stanley)\tby\tBob Dylan\nLonesome Road Blues\tby \tOld Crow Medicine Show\nLong Black Veil (Feat. Jeff Tweedy)\tby\tRosanne Cash\nLong Journey Home\tby\tJ.D. Crowe &amp; The New South\nLove of the Mountains\tby \tLarry Sparks\nLove of the Mountains\tby\tLarry Sparks\nLove Of The Mountains\tby\tLost &amp; Found\nLove Please Come Home\tby \tDoc Watson\nMama Don't 'Low No Guitar Playin' Round Here\tby\tJames 'Son' Thomas\nMama Don't Allow\tby\tDoc Watson\nMama Don't Allow\tby \tThe Ink Spots\nMama Don't Allow\tby\tSonny Stitt\nMama Don't Low 'No Music Playing In Here\tby\tBarbara Mandrell\nMan Of Constant Sorrow\tby \tTony Furtado with Tim Obrien\nMountain Dew\tby\tEric Weissberg\nMr. Freight Train\tby\tJohnny Nelms\nMy Little Georgia Rose\tby \tBill Monroe\nMy Little Georgia Rose\tby\tDel McCoury Band\nNew River Train\tby\tBill Monroe\nNew River Train\tby \tBobby Helms\nNew River Train\tby\tParty Ranch Gang\nNine Pound Hammer\tby\tNitty Gritty Dirt Band\nNine Pound Hammer\tby \tRamblin' Jack Elliott\nOld Folks at Home\tby\tVern Williams\nOld Home Place\tby\tDavid Grisman, Mike Seeger &amp; John Hartford\nOld Home Place\tby \tJ.D. Crowe\nOld Home Place\tby\tPhish\nOld Joe Clark\tby\tBrian Setzer\nOld Joe Clark\tby \tThe Kingston Trio\nOld Old House\tby\tAllan Spinney\nOld Old House\tby\tDoc Watson and Jeff Little\nOld Salty Dog Blues\tby \tLester Flatt and Earl Scruggs\nOle Slew Foot\tby\tJames McMurtry\nOle Slew Foot\tby\tJohnny Horton\nOle Slew Foot\tby \tThe Virgina Boys\nParadise\tby\tJohn Prine\nRabbit in the Log\tby\tJim And Jesse McReynolds\nRabbit in the Log\tby \tThe Stanley Brothers\nRebecca\tby\tJon Eric\nRebecca\tby\tNew Favorite\nRed-Haired Boy (with Tony Rice)\tby \tNickel Creek\nRed Haired Boy\tby\tBroken Strings\nRed Haired Boy\tby\tDr. Banjo\nRed Haired Boy\tby \tMike Stevens\nRed Haired Boy\tby\tTony Rice &amp; Seldom Scene\nRed River Valley\tby\tPete Seeger\nRed River Valley\tby \tSons Of The Pioneers\nRed River Valley\tby\tWoody Guthrie\nRed Wing\tby\tCarson Robison\nRed Wing\tby \tChet Atkins\nRed Wing\tby\tJohnny Gimble\nRed Wing\tby\tThe Quebe Sisters\nRocky Top\tby \tOsborne Brothers\nRocky Top\tby\tPhish\nRoll In My Sweet Baby's Arms (Single Version)\tby\tLester Flatt and Earl Scruggs\nRollin' In My Sweet Baby's Arm\tby \tBuck Owens\nRoving Gambler\tby\tThe Country Gentleman\nRoving Gambler\tby\tRamblin' Jack Elliott\nSally Goodin\tby \tThe Chieftains\nSally Goodin\tby\tHank Williams\nSally Goodin'\tby\tWoody Guthrie\nSalt Creek\tby \tBill Monroe\nSalt Creek\tby\tBlake &amp; Rice\nSalty Dog\tby\tJohnny Cash\nSalty Dog\tby \tLamplighters\nSalty Dog\tby\tLittle Brother Montgomery\nSalty Dog Blues\tby\tBuck Owens\nShady Grove\tby \tNew Lost City Ramblers\nShady Grove\tby\tRalph Stanley\nShady Grove \tby\tEdd Presnell\nShe'll Be Comin' Round the Mountain\tby \tBooker T. Washington White\nShe'll Be Coming 'Round the Mountain\tby\tPete Seeger\nShuckin' the Corn\tby\tAaron &quot;Boo&quot; McDaris\nShuckin' the Corn\tby \tRaymond Fairchild and the Crowe Brothers\nSitting On The Top Of The World\tby\tBob Dylan\nSitting On Top Of The World\tby\tB. B. King\nSoldier's Joy\tby \tDoc Watson &amp; David Grisman\nSoldier's Joy\tby\tThe Holy Modal Rounders\nSoldier's Joy\tby\tUnknown\nSteam Powered Aereo Plane\tby \tJohn Hartford\nSteel Rails\tby\tAlison Krauss   \nSunny Side Of The Mountain\tby\tNitty Gritty Dirt Band\nThe Tennessee Waltz\tby \tEva Cassidy\nThe Tennessee Waltz\tby\tPatti Page\nThink Of What You've Done\tby\tDan Fogelberg\nThink of What You've Done\tby \tRicky Skaggs\nThis Land is Your Land\tby\tBruce Springsteen\nThis Land Is Your Land\tby\tPete Seeger\nThis Land Is Your Land\tby \tWoody Guthrie\nTruck Driving Man\tby\tDave Dudley\nTruck Driving Man\tby\tDon Walser\nTruck Driving Man\tby \tGlen Campbell\nWabash Cannonball\tby\tNitty Gritty Dirt Band\nWabash Cannonball\tby\tPete Seeger\nWhen The Saints Go Marching In\tby \tLester Flatt And Earl Scruggs\nWhite Dove\tby\tBob Dylan\nWhite Dove\tby\tThe Stanley Brothers\nWill the Circle Be Unbroken\tby \tDoc Watson &amp; Clarence Ashley\nWill the Circle Be Unbroken\tby\tJimmy Martin\nWorking on a Building\tby\tThe Blue Ridge Rangers\nWorking on a Building\tby \tThe Cowboy Junkies\nWorking on a Building\tby\tThe Johnson Mountain Boys\nWorking on a Building\tby\tRalph Stanley &amp; The Clinch Mountain Boys\nWorried Man Blues\tby \tThe Carter Family\nWorried Man Blues\tby\tWoody Guthrie\nYou Are My Sunshine\tby\tNorman Blake\nYour Love Is Like a Flower\tby \tDailey &amp; Vincent\nYour Love Is Like A Flower\tby\tLester Flatt &amp; Earl Scruggs\nYour Love Is Like A Flower\tby\tTony Rice\n\n","torrent":{"xt":"urn:btih:b50607cb4e61deb51b8cc6b4666e693525341082","amp;dn":"Top+100+Bluegrass+Jamming+Tunes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b50607cb4e61deb51b8cc6b4666e693525341082","infoHashBuffer":{"type":"Buffer","data":[181,6,7,203,78,97,222,181,27,140,198,180,102,110,105,53,37,52,16,130]},"announce":[],"urlList":[]}}