{"title":"A.Sapkowski - Czas Pogardy cz.2 [PL]","uid":12603428,"size":397432388,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b51b5da0516221ee27c8a7475c4165682403aa61&amp;dn=A.Sapkowski+-+Czas+Pogardy+cz.2+%5BPL%5D+MP3%40160&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"everdarksoul","files":15,"time":1445359470,"description":"Audiobook PL - Andrzej Sapkowski: Saga o Wiedźminie. Tom 2 - &quot;Czas Pogardy&quot; (część druga)\r\nDane: 378 MB / 12 części -    kbps / czas: 05:30:18 / czyta: Zespół Lektorów\r\n\r\nMegaprodukcja - czyli Teatru Dźwięku i Wyobraźni od wydawnictw &quot;Fonopolis&quot; i &quot;superNOWA&quot;. To ponad 8 godzin magicznego słuchowiska, w które wprowadza nas Narrator: K.Gosztyła, w roli Wiedźmina: K.Banaszyk, oraz ok. 80 innych aktorów w obsadzie!\r\nAudiobook ten jest drugą częścią Megaprodukcji: &quot;Czas Pogardy&quot;, drugiego tomu &quot;Sagi o Wiedźminie&quot; - cyklu powieściowego, autorstwa Andrzeja Sapkowskiego, o dziejach Wiedźmina: Geralta z Rivii - będącego kontynuacją wcześniejszych zbiorów opowiadań tegoż autora: &quot;Ostatnie Życzenie&quot; (z których część wydano wcześniej w tomie Wiedźmin) oraz &quot;Miecz Przeznaczenia&quot;.\r\nW skład cyklu wchodzą powieści:\r\n\r\n1 - Krew Elfów\r\n2 - Czas Pogardy\r\n3 - Chrzest Ognia\r\n4 - Wieża Jaskółki\r\n5 - Pani Jeziora\r\n\r\n&quot;Nadchodzi czas pogardy, kolego Wiedźminie, czas wielkiej, bezbrzeżnej pogardy. Musisz się dopasować. To, co ci proponuję, to prosta alternatywa...\r\nKtoś umrze, żeby żyć mógł ktoś. Ktoś, kogo kochasz - ocaleje...&quot;\r\n\r\nKto z prostych wyrazów potrafi stworzyć świat rzeczywisty i namacalny - z całą swoją brutalnością i prawdą? Kto pisze z takim rozmachem, oraz językiem, który potrafi rozbawić i wzruszyć? - Andrzej Sapkowski!\r\nPod płaszczem fikcyjnej opowieści o Geralcie z Rivii, Autor mówi o rzeczach ponadczasowych: przyjaźń, lojalność, miłość, nienawiść - jak w kalejdoskopie układa w różne konfiguracje, byśmy mogli popatrzeć na nie z różnych perspektyw i je ocenić według własnych standardów.\r\nSłuchowisko &quot;Czas Pogardy&quot; to podróż w świat dźwiękowej wyobraźni, gdzie słychać oddech Wiedźmina tak blisko, że ma się wrażenie, ze stoi tuż za plecami. Podąża on za Ciri i Yenefer, by ochraniać je przed czyhającym zagrożeniem. Czasy są trudne i niebezpieczne. Wojna rozprzestrzenia się na nowe tereny i zbiera krwawe żniwo.\r\n\r\nDlaczego wszyscy szukają Ciri?\r\nDlaczego jest ona taka cenna?\r\nKiedy nastanie pokój - i czy w ogóle to nastąpi...?\r\n\r\nOpis produktu od wydawcy, oraz pełną obsadę słuchowiska znajdziecie np. tu: \nhttp://fonopolis.pl/wiedzmin-czas-pogardy","torrent":{"xt":"urn:btih:b51b5da0516221ee27c8a7475c4165682403aa61","amp;dn":"A.Sapkowski+-+Czas+Pogardy+cz.2+%5BPL%5D+MP3%40160","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b51b5da0516221ee27c8a7475c4165682403aa61","infoHashBuffer":{"type":"Buffer","data":[181,27,93,160,81,98,33,238,39,200,167,71,92,65,101,104,36,3,170,97]},"announce":[],"urlList":[]}}