{"title":"Three Worlds of Michelangelo (Art Ebook).pdf","uid":11821625,"size":49325672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5222c1dc47e63fb0fac05c40a29b1f597db19ac&amp;dn=Three+Worlds+of+Michelangelo+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":1,"time":1429280579,"description":"Three Worlds of Michelangelo\nW. W. Norton &amp; Co. | 1999 | ISBN: 0393045242 | English | 310 pages | PDF | 47 MB\n\nThe personalities of artists often lie hidden behind veils of fact, myth and hearsay. Drawing on clues found in hundreds of contemporary documents, many in the artist's own hand, the author redefines our view of Michelangelo from his earliest relationships to the days of his labour on the Sistine Chapel. The three worlds were dominated by the three men who shaped Michelangelo's creative powers. His father Lodovico, instilled in him a relenteless work ethic, but to the end of his days remained disappointed that Michelangelo had not become a banker or a lawyer. Yet Michelangelo was devoted to his father, and his letters, trying to please or at least to pacify the old man, are amongst his most moving documents. The imperial ruler of Florence, Lorenzo de' Medici, took Michelangelo under his wing at a critical period of his fledgling career, providing him with apprenticeships in painting and sculpture that led to the young artist's first works. Pope Julius II opened the door into the third world, when Michelangelo was in his late twenties. The alliance between two temperamental egos was stormy, as the pope was used to being obeyed and Michelangelo refused to compromise his artistic convictions for anybody. Yet this uncomfortable bond led to such masterpieces as &quot;Slaves&quot; and &quot;Moses&quot;. Pope Julius also commissioned the painting of the Sistine Chapel ceiling. The book ends with a detailed analysis of the creation of the massive fresco, from planning to completion","torrent":{"xt":"urn:btih:b5222c1dc47e63fb0fac05c40a29b1f597db19ac","amp;dn":"Three+Worlds+of+Michelangelo+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5222c1dc47e63fb0fac05c40a29b1f597db19ac","infoHashBuffer":{"type":"Buffer","data":[181,34,44,29,196,126,99,251,15,172,5,196,10,41,177,245,151,219,25,172]},"announce":[],"urlList":[]}}