{"title":"Muay Thai Boxing","uid":12886870,"size":936083074,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b58901245ae167a38ee950b01b306f105b1364d4&amp;dn=Muay+Thai+Boxing&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"chokoiboko","files":4,"time":1449069458,"description":"Vol. 1: Warm-up, Conditioning &amp; Introduction to Equipment\r\nThis DVD from Vut Kamnark will get you ready to learn the rigorous techniques of Muay Thai. After explaining Wai Kru, a dance of respect between fighters, you'll learn how to completely stretch and strengthen your body the Muay Thai way. Also full explanations are given on the different kinds of training gear and how to use them including: ankle supports, hand wraps, gloves, thai pads, focus mitts, the belly protector, heavy bags and more.\r\n\r\nVol. 2: Basic Footwork, Punches &amp; Elbows\r\nOn volume 2, you'll learn the on-guard stance and basic footwork. Next taught is the jab, cross, hook and uppercut. Detailed instruction on form and execution to develop maximum power and speed, as well as combination punching. The proper technique for delivering devastating elbow strikes from all angles concludes this tape.\r\n\r\nVol. 3: Kicks &amp; Knees\r\nVut Kamnark starts by teaching the push kick and its variations. Next he moves on to Muay Thai's trademark, The round kick. He breaks down each aspect of the kick so you can learn to harness all of its power. Next you'll learn the footwork and secrets to be able to throw this kick at any target from head to toe. The proper technique for delivering knee strikes from all angles concludes this tape.\r\n\r\nVol. 4: Fighting Techniques\r\nOn this DVD, Vut Kamnark puts it all together. He starts out with shadow boxing, the perfect way to practice all your techniques and warm-up at the same time. You'll learn how to defend against all attacks and develop an arsenal of counter combinations. Whether in a clinch or at long range, this tape will give you the information to fully utilize all your weapons. A variety of kick and punch combinations, good for fighting or just a great workout concludes the tape","torrent":{"xt":"urn:btih:b58901245ae167a38ee950b01b306f105b1364d4","amp;dn":"Muay+Thai+Boxing","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b58901245ae167a38ee950b01b306f105b1364d4","infoHashBuffer":{"type":"Buffer","data":[181,137,1,36,90,225,103,163,142,233,80,176,27,48,111,16,91,19,100,212]},"announce":[],"urlList":[]}}