{"title":"UnforgettaBulls - 1997-98 Chicago Bulls.avi","uid":7957562,"size":435133020,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b59e9b1e2ab7b5e53bfeb87643b8e13a0bc7d920&amp;dn=UnforgettaBulls+-+1997-98+Chicago+Bulls.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jleonard71","files":1,"time":1356468119,"description":"Everyone knows that the Chicago Bulls are the team of the 1990s, if not all time. In 1998 they won their unmatched sixth NBA title of the '90s. But this was not the same team that squashed all opponents that stood before them, united and led magnificently by players such as Scottie Pippen and the irresistible Michael Jordan. At the beginning of the 1998 season, this team was anything but united. His Airness was still His Airness, but the rest of the Bulls looked less than a shadow of their selves. Pippen stood injured on the sidelines demanding a trade, Rodman looked more interested in Hollywood and his hair, and the supporting cast were beginning to look extremely vulnerable. But as with all great teams, they dusted themselves off, wiped away the cobwebs (not to mention the odd ego or two), and played out the final two-thirds of the regular season like the Chicago Bulls of old. This exciting NBA video captures the highlights of this tumultuous and thrilling season, from the playoffs to the dramatic six game series final against archrivals Utah Jazz. Clips, highlights, and interviews tell the story of a season that will be very hard to forget and one that will be remembered as the last time the greatest basketball player of all time played his game. --Jeremy Storey\n","torrent":{"xt":"urn:btih:b59e9b1e2ab7b5e53bfeb87643b8e13a0bc7d920","amp;dn":"UnforgettaBulls+-+1997-98+Chicago+Bulls.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b59e9b1e2ab7b5e53bfeb87643b8e13a0bc7d920","infoHashBuffer":{"type":"Buffer","data":[181,158,155,30,42,183,181,229,59,254,184,118,67,184,225,58,11,199,217,32]},"announce":[],"urlList":[]}}