{"title":"Acronis True Image Home 2012 Plus Pack 15.0.6131 BootCD","uid":6825299,"size":290586624,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b5d03b66a7f318af97913bcaca88b3abfd6127fc&amp;dn=Acronis+True+Image+Home+2012+Plus+Pack+15.0.6131+BootCD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"nikita200","files":-1,"time":1321539207,"description":"Release Notes for Acronis True Image Home 2012 Update 1 (Build #6131, English)\nList of fixed issues\nAcronis True Image Home 2012 doesn't detect hard disk drives after installing it over a previous Acronis True Image Home version \nAcronis True Image Home 2012 may fail to create Acronis Rescue Media with the error &quot;Cannot load required components: ti_boot.so&quot; \nBackup to a Synology NAS fails with the error &quot;Access is denied&quot; \nHard drives sometimes are not detected under Windows after Acronis True Image Home 2012 installation \nAcronis True Image Home 2012 displays the error message &quot;Error while writing PEM file&quot; when attempting to log into Acronis account \nData located in the subfolders of a synchronized folder may disappear after synchronizing it with Acronis Online Storage \nInstallation fails with rollback and &quot;error CustomAction _USRCUSTACT_MsiCustomActionInstall_VddApi returned actual error code 1603&quot; \nNothing happens if a user clicks &quot;Connect&quot; for a NAS folder in the Sync creation wizard \nUpgrade from Acronis True Image Home 2011 to Acronis True Image Home 2012 fails with the &quot;Installation has failed. The value can't be found.&quot; error message \nA new sync does not appear after clicking Create New Sync \nBackup to a QNAP NAS fails with the &quot;access denied&quot; error message, NAS subfolders can't be browsed \nGUI hangs for 1 minute during program start if a mapped share is unavailable \nThe &quot;configure disk backup process&quot; window in multiple partitions selection view should contain 5-6 partitions by default (if there are many partitions in the system) \nAn unlettered storage device is always selected as a source when editing the single partition backup settings \nThe Online backup created by Acronis True Image Home 2011 isn't listed in the Recover menu of Acronis True Image Home 2012 after upgrade \nThe error &quot;Failed to update snapman driver&quot; appears when trying to upgrade Acronis True Image Home 10 (10.0.0.4942) to Acronis True Image Home 2012 \nRollback during upgrade of Acronis True Image Home 2011 to Acronis True Image Home 2012 \nThe &quot;recover&quot; function cannot browse xlsx\\txt\\docx files after the files have been edited \nThe error &quot;Failed to open (initialize) the computer&quot; may appear during the Clone operation \nActivation works incorrectly after upgrading Acronis True Image Home 2012 from the trial version to the full one \nAcronis True Image Home 2012 is seen as de-activated 30 days after activation \nAcronis True Image Home 2012 fails to restore deep level files by drag and drop \nAcronis True Image Home 2012 creates long backup names after changing a USB storage device, and does not delete previous backup versions \nOn an expanded backup plate the &quot;backup is valid&quot; banner is not seen after validation. \nList of known issues\nIncremental backups created by Acronis True Image Home 2012 when Microsoft Outlook is open differ in size from the same backups created when Microsoft Outlook is closed \nThe disk recovery options saved as default are not kept after reboot \nQueued backup tasks run in a random order and not in the order in which they were queued \nAcronis True Image Home 2012 is unable to browse for the files located at Western Digital MyBook World Edition. You need to use a full UNC path to get access to them. \nSometimes installation may fail with the error &quot;CustomAction _USRCUSTACT_MsiSyncAgentServiceInstall_SyncAgent returned actual error code 1603&quot;. In this case, please ask the Support team for the clean-up tool and install the application for &quot;the current user only&quot;. \nDuring restore, the boot media fails to pass through the credentials entry window on an UnRAID device running v4.5.6 Pro, LimeTech RB1200 \nAcronis True Image Home 2012 may prevent a USB flash drive from being properly detected under Windows. A fix will be available soon. \nThe &quot;Cleanup by number of versions&quot; option does not work for Acronis Online Backup. \nA new &quot;SyncMe&quot; sync is created after each update or reinstall of Acronis True Image Home 2012. \nAcronis True Image Home 2012 may prevent USB cards from being properly read by Windows through card readers. If this occurs, please reconnect the card reader with the already installed card. \nSyncagentsrv.exe may crash if Acronis True Image Home 2012 is removed after updating to build 6131. However, the removal will complete successfully. \nLive Update does not work for Windows Home Server 2003. To install fresh updates, users need to download and install them manually. \n\n\nCRC32: 926A6126\nMD5: EB931451B08579967CD46D6DE9401FA0\nSHA-1: 6946545F8566D21A4778490553AA1231B0F8D069","torrent":{"xt":"urn:btih:b5d03b66a7f318af97913bcaca88b3abfd6127fc","amp;dn":"Acronis+True+Image+Home+2012+Plus+Pack+15.0.6131+BootCD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5d03b66a7f318af97913bcaca88b3abfd6127fc","infoHashBuffer":{"type":"Buffer","data":[181,208,59,102,167,243,24,175,151,145,59,202,202,136,179,171,253,97,39,252]},"announce":[],"urlList":[]}}