{"title":"Quincy Jones - Q-Jazz 1956-1960 - 10CD-BOX 2013","uid":9127970,"size":3682985576,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b5d47578b080e671c7090f6b1cf8c668e055d5ca&amp;dn=Quincy+Jones+-+Q-Jazz+1956-1960+-+10CD-BOX+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"barber9","files":-1,"time":1383259002,"description":"Legendary producer, arranger and all-around musical mastermind Quincy Jones will celebrate his 80th birthday on March 14th 2013. As a special gift to 'Q' and his legion of admirers, we have compiled this 10 CD collection of his legendary Jazz-recordings. Spanning ten original albums (a few of which are 'as rare as hen's teeth') and four CDs worth of rare European live-recordings with his fabulous big band, they cover the years 1956 until 1960.\n\nIn the course of more than 100 tunes, they present the exciting Jazz-origins of the man behind the most Grammy-nominations of all time (79 in all, of which he won a record breaking 27 awards) and masterworks by Michael Jackson or Frank Sinatra. Originally a trumpet-player for Lionel Hampton and a cohort and friend of Ray Charles, Quincy Delight Jones, Jr. found his early success as an arranger - working for Sarah Vaughan, Dinah Washington, Count Basie, or even Duke Ellington while still in his teens. He began recording under his own name in the US in 1956, shortly before moving to Paris to study composition with Nadia Boulanger and Oliver Messiaen.\n\nListening to the exciting and beautiful music in this collection, it is obvious that Quincy Jones was a gift to the world of music already as a very young man. There is only one reason, why the father of seven children chose to leave his beloved Jazz-world in the mid-Sixties. 'We had the best jazz band on the planet, and yet we were literally starving', he once said. 'That's when I discovered that there was music, and there was the music business. If I were to survive, I would have to learn the difference between the two.' (membran-online.de)\n\n- - -\n\nFeat. Gerry Mulligan, Don Byas, Benny Carter, Phil Woods, Clark Terry, Benny Bailey, Lucky Thompson, Stephane Grappelli, Kenny Clarke, Art Pepper, Harry 'Sweets' Edison, Carl Perkins, Mel Lewis, Billy Taylor, Shelly Manne and many more.\n\n- - -\n\nQuincy Jones - Q-Jazz-More Than 100 Legendary Recordings 1956-1960\n(10CD Documents 2013)\n\nCD1  Go West, Man!\nCD2  This Is How I Fell About Jazz , My Fair Lady Loves Jazz\nCD3  The Great Wide World of Quincy Jones - The Wide World of Jazz\nCD4  I Dig Dancers, Et Voila\nCD5  The Birth of a Band 1 &amp; 2\nCD6  Quincy Jones Big Band in France &amp; Belgium\nCD7  Quincy Jones Big Band in Sweden\nCD8  Quincy Jones Big Band in Switzerland, PT1\nCD9  Quincy Jones Big Band in Switzerland, PT2\nCD10  Nat Adderley &amp; Harry Arnold - The Music of Quincy Jones\n","torrent":{"xt":"urn:btih:b5d47578b080e671c7090f6b1cf8c668e055d5ca","amp;dn":"Quincy+Jones+-+Q-Jazz+1956-1960+-+10CD-BOX+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5d47578b080e671c7090f6b1cf8c668e055d5ca","infoHashBuffer":{"type":"Buffer","data":[181,212,117,120,176,128,230,113,199,9,15,107,28,248,198,104,224,85,213,202]},"announce":[],"urlList":[]}}