{"title":"Surgical Anatomy of the Ocular Adnexa, 2E [PDF] [StormRG]","uid":10163494,"size":7702038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b70a2b7b0db83ec7bc9fea33be446ed5d579c386&amp;dn=Surgical+Anatomy+of+the+Ocular+Adnexa%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":3,"time":1400285039,"description":"Author: David Jordan, Louise Mawn, Richard L. Anderson\nSeries: Ophthalmology Monographs (Book 9)\nHardcover: 232 pages\nPublisher: Oxford University Press; 2 edition (March 16, 2012)\nLanguage: English\nISBN-10: 0199744262\nISBN-13: 978-0199744268\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n____________________________________________________________________________________\n\n\nSurgical Anatomy of the Ocular Adnexa is a beautifully and thoughtfully illustrated anatomical text that provides the ophthalmic surgeon or any surgeon working in the eyelid/orbital region with detailed yet concise, easy to read and understand descriptions of the anatomy in any particular region of the eyelid, orbit or nasolacrimal system. Throughout the text are clinical pearls and vignettes to help the reader appreciate why certain anatomical features are important to understand. Key anatomical concepts are highlighted and easy to visualize with real cadaver photos as well as the artists rendition of the same region.\n\nThis book:\n\n- Develops a thorough understanding of the anatomy in the eyelid, orbit, nasolacriaml and periocular regions.\n- Fosters an appreciation of how knowledge of the anatomy leads to a better understanding of the pathophysiology of various disease processes involving the eyelid, orbit, nasolacrimal and periocular region.\n- Conveys the importance of anatomy in the surgical approach to various disease processes in the eyelid, orbit, nasolacrimal and periocular regions.\n\nThis second edition will be an invaluable guidel to all those working in the eyelid, orbital, and nasolacrimal areas including residents, fellows and staff in ophthalmology, otolaryngology/head and neck surgery, plastic surgery and neurosurgeons working in and around the orbit.","torrent":{"xt":"urn:btih:b70a2b7b0db83ec7bc9fea33be446ed5d579c386","amp;dn":"Surgical+Anatomy+of+the+Ocular+Adnexa%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b70a2b7b0db83ec7bc9fea33be446ed5d579c386","infoHashBuffer":{"type":"Buffer","data":[183,10,43,123,13,184,62,199,188,159,234,51,190,68,110,213,213,121,195,134]},"announce":[],"urlList":[]}}