{"title":"JUDGE &amp; JURY - James Patterson, Gross. Joe Mantegna {FerraBit}","uid":4854578,"size":231748138,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b7bb3141b27e3ebadb5130c4de53b33961041e69&amp;dn=JUDGE+%26+JURY+-+James+Patterson%2C+Gross.+Joe+Mantegna+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FerraBit","files":-1,"time":1240007566,"description":"JUDGE &amp; JURY  by James Patterson and Andrew Gross (2006)\n\nRead by Joe Mantegna\nFormat: 7 CDs to MP3\nBitrate: ~64kbps (iTunes 8, 56kbps, VBR medium, 44kHz, mono). 130 tracks\nPublisher: Hachette Audio; Unabridged (July 2006)\nISBN-10: 159483332X; ISBN-13: 978-1594833328\n\n  Andie DeGrasse, an aspiring actress and single mom, is not your typical juror. Hoping to get dismissed from the pool, she tells the judge that most of her legal knowledge comes from a bit part curling around a stripper's pole in The Sopranos. But she still ends up as juror #11 in a landmark trial against a notorious mob boss.\n  The case quickly becomes the new Trial of the Century... Conviction is a sure thing... As the jury is about to reach a verdict, the Electrician makes one devastating move that no one could have predicted. \n\nSome dramatic music and sound effects.\n\nCheers, FerraBit\nApril 2009\n\nLinks:\nhttp://en.wikipedia.org/wiki/James_Patterson &lt;a href=&quot;\nhttp://www.jamespatterson.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jamespatterson.com&lt;/a&gt; \n\nOriginally posted: thepiratebay, demonoid, mininova\n________________________________________\n\nFrom Publishers Weekly\n  Bestsellers Patterson and Gross (Lifeguard) once again deliver what their fans expect in this slapdash revenge thriller. When mob godfather Dominic Cavello is finally brought to trial by FBI agent Nick Pellisante, his longtime nemesis, the accused is strangely unconcerned even as a parade of his former criminal associates finger him as having ordered a hit on a corrupt businessman. The gangster's plan to intimidate the decision-makers at his trial reaches its climax when he arranges for a bomb to blow up the bus transporting the jury. The sole survivor teams up with Pellisante to make Cavello pay. Numerous legal howlers that would be obvious even to those who only know about trials from watching Law and Order may annoy some readers.\n\n\nFrom Booklist\n  Judge and Jury gets off to a slightly slow start but delivers plenty of twists and turns. FBI agent Nick Pellisante has finally done the impossible: captured Mob boss Dominic Cavello. The jury is selected and Cavello's trial progresses smoothly--it seems the conviction Pellisante is hoping for is within his reach. Several formerly loyal henchmen now sitting in jail strike deals with the prosecution and testify about the savage murders Cavello ordered, and Pellisante takes the stand to detail how Cavello shot two of his colleagues while trying to elude capture. But Cavello has hired Richard Nordeshenko, a methodical and calculating killer, to make sure the trial never concludes. Nordeshenko carries out his plan with brutal efficiency, leaving a wake of devastation in his path. Pellisante is crushed by the abrupt end of the trial and determined to make sure that the retrial isn't similarly derailed, but Cavello and Nordeshenko have an even more diabolical plan in store this time around. A compelling hero and a truly evil villain distinguish this exciting read. \n\n\nFrom New York Times\n  James Patterson spins an all-out heart-pounding legal thriller that pits two people against the most vicious and powerful mobster since John Gotti. Judge &amp; Jury is a stunning feat by &quot;one of America's most influential authors.&quot;\n\n","torrent":{"xt":"urn:btih:b7bb3141b27e3ebadb5130c4de53b33961041e69","amp;dn":"JUDGE+%26+JURY+-+James+Patterson%2C+Gross.+Joe+Mantegna+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7bb3141b27e3ebadb5130c4de53b33961041e69","infoHashBuffer":{"type":"Buffer","data":[183,187,49,65,178,126,62,186,219,81,48,196,222,83,179,57,97,4,30,105]},"announce":[],"urlList":[]}}