{"title":"Conspiracies, Theories &amp; Truth E-Book Collection","uid":8719396,"size":593980052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7f052aba13c470dc9868b9dbbb76a156a99bc5b&amp;dn=Conspiracies%2C+Theories+%26amp%3B+Truth+E-Book+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"aganaa","files":227,"time":1374393441,"description":"\nG'Day, There are those of us who believe in conspiracies and the existence\nof a World Order that flies beneath the radar. There are those who seek truth\nat any cost. Sometimes you have to go through a lot of dirt to get to the gold.\nThis collection of works is from 11 years browsing the internet. I have\nkept the authours in the pdf because if it not were for them this collection\nwould not be here. All Kudos to them.\n\nWe live in an age where we are under constant surveillance, where all of our\nhistory is contained in a data collection point, and history is trying to be re-written.\nThe net is simply a mass database that can be accessed from around the globe.\nI firmly believe that the days of free internet are numbered; censorship will\nbe applied by the full force of our governments. Sites like these will be targeted\nas much valuable information for the masses is needed to understand this new age\nwe are living in and the forces we are up against. Knowing the truth is like\nfinding a needle in a haystack. Hopefully there are many needles in this collection.\n\nFear is one of the biggest tools of choice if you are not ignorant of the facts.\nJesus came to remove our fears. He is real. The history is trying to remove Him from\nall facets of reality. He is our ultimate reality in these days of doubt. If you\nview these files in the foreknowledge that Christ is there beside you there will be\nno fear.","torrent":{"xt":"urn:btih:b7f052aba13c470dc9868b9dbbb76a156a99bc5b","amp;dn":"Conspiracies%2C+Theories+%26amp%3B+Truth+E-Book+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7f052aba13c470dc9868b9dbbb76a156a99bc5b","infoHashBuffer":{"type":"Buffer","data":[183,240,82,171,161,60,71,13,201,134,139,157,187,183,106,21,106,153,188,91]},"announce":[],"urlList":[]}}