{"title":"World War II - When Lions Roared (1994 NBC Miniseries)","uid":4275539,"size":1479248247,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b886fd78b6af5dae8520598737442bb9a46beb7e&amp;dn=World+War+II+-+When+Lions+Roared+%281994+NBC+Miniseries%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rambam1776","files":3,"time":1215169269,"description":"World War II - When Lions Roared (1994)\n\nStarring: Michael Caine, Bob Hoskins, John Lithgow\n &lt;a href=&quot;\nhttp://www.amazon.com/World-War-II-Lions-Roared/dp/B000KJTG0G/ref=pd_bbs_sr_1?ie=UTF8&amp;s=dvd&amp;qid=1215161088&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/World-War-II-Lions-Roared/dp/B000KJTG0G/ref=pd_bbs_sr_1?ie=UTF8&amp;s=dvd&amp;qid=1215161088&amp;sr=8-1&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0108956/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0108956/&lt;/a&gt;\n\nAMAZON REVIEW\n\n&quot;This is great entertainment and great historical drama. It is based upon actual cables between Washington, London, and Moscow during the Second World War, and deals almost exclusively with the relationship between the leaders of these countries throughout the war. Franklin Roosevelt (played by John Lithgow), Winston Churchill (Bob Hoskins) and Josef Stalin (Michael Caine) spring to life as real but imperfect people who nevertheless are great leaders fighting a great war. Incidentally, the film focuses almost solely on the European war--the war against Japan is largely in the background, which has the effect of causing the film to somewhat diminish America&amp;#039;s contribution to the war. This is a minor quibble, however. This is a wonderful film.\n\nThe miniseries does a wonderful job of juxtaposing dialog between the great war leaders with actual footage of combat scenes from the war. It tells a great story in a highly entertaining fashion, and does a splendid job of showing the viewer some of the problems, controversies, and arguments between the allied powers while the three leaders struggled to hold together the greatest coalition of nations in history.\n\nThe striking thing about this film is that it never deviates from its theme--to tell the story of the allied war leaders and the problems they faced. No bogus &quot;love interest&quot; material--this is historical drama with emphasis on the &quot;historical.&quot; In fact, only a few actors in this film even have speaking parts--Roosevelt, Churchill, Stalin, Molotov, and Henry Hopkins are the only ones I can recall.\n\nThe acting is very fine. I thought Lithgow did a great job as Roosevelt--although he looks and speaks differently than FDR did, he nevertheless pulled it off very well in my opinion. Bob Hoskins was quite literally perfect as Churchill, and as far as I am concerned is virtually indistinguishable from him. Michael Caine was taller and better-looking than Stalin ever was, but nevertheless did a great job in the role.\n\nWonderful historical drama that will draw and retain the interest of viewers interested in World War 2.&quot; \n","torrent":{"xt":"urn:btih:b886fd78b6af5dae8520598737442bb9a46beb7e","amp;dn":"World+War+II+-+When+Lions+Roared+%281994+NBC+Miniseries%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b886fd78b6af5dae8520598737442bb9a46beb7e","infoHashBuffer":{"type":"Buffer","data":[184,134,253,120,182,175,93,174,133,32,89,135,55,68,43,185,164,107,235,126]},"announce":[],"urlList":[]}}