{"title":"Rapid Infection Control Nursing [PDF] [StormRG]","uid":10259515,"size":3432440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b951b22b660ef4a36645d31f69e5bf09e6737896&amp;dn=Rapid+Infection+Control+Nursing+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401448749,"description":"Author: Shona Ross , Sarah Furrows\nPaperback: 192 pages\nPublisher: Wiley-Blackwell; 1 edition (February 3, 2014)\nLanguage: English\nISBN-10: 1118342461\nISBN-13: 978-1118342466\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.lease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThe Rapids are a series of reference and revision pocket books that cover key facts in a simple and memorable way. Each book contains the common conditions that students and newly qualified nurses encounter on the wards, in the community, and on placements. Only the basic core relevant facts are provided to ensure that these books are perfect and concise rapid refreshers.\n\nRapid Infection Control Nursing is an essential read for all frontline nursing staff working in hospitals or community settings. Designed for quick reference, it explores the essential principles of infection control before moving on to an A-Z of the most commonly found infections. Each entry covers how the infection is spread, duration of the infectious period, key infection-control precautions, staff considerations, visitor information, and patient transfer advice.\n\nCovering all the key topics in infection prevention and control, this concise and easy-to-read title is the perfect quick-reference book for the wards.","torrent":{"xt":"urn:btih:b951b22b660ef4a36645d31f69e5bf09e6737896","amp;dn":"Rapid+Infection+Control+Nursing+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b951b22b660ef4a36645d31f69e5bf09e6737896","infoHashBuffer":{"type":"Buffer","data":[185,81,178,43,102,14,244,163,102,69,211,31,105,229,191,9,230,115,120,150]},"announce":[],"urlList":[]}}