{"title":"Potty Training in One Day","uid":7257626,"size":602830014,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b9b79d81a985693b52e8de3395b072987fec23bc&amp;dn=Potty+Training+in+One+Day&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1336631573,"description":"POTTY TRAINING IN ONE DAY - A DVD FOR TODAY'S PARENTS\n\nHere's what you have been looking for - an instructional video featuring real parents and children demonstrating the most comprehensive and proven potty training method. This is the first instructional video of its kind. For decades, parents, teachers, doctors, and clinical psychologists have used the one-day potty training method. Now you can learn the Potty Training in One Day method, step-by-step, through this visual journey.\n\nYOU WILL DISCOVER\n\n - Why Potty Training In One Day really works\n - How to know if your child is ready for potty training\n - What pre-training exercises to use to increase your child's understanding\n - Which supplies you'll need and where to purchase them\n - How to set up for the big day\n - Step by step instructions for the big day\n - How to handle accidents\n - What to do during the follow-up week\n - And so much more!\n\nSEVEN REASONS TO USE THIS METHOD\n\n  1. It is a proven method used successfully used by many parents. \n  2. It is supported by pediatricians. psychologists and Dr Phil McGraw.\n  3. It is the perfect method for working mothers with today's busy lifestyles. \n  4. Go from diapers to accident free success in record time!\n  5. Your child will learn to go potty independently when he needs to go. \n  6. The Book &amp; DVD provide comprehensive teaching package. \n  7. Gender specific and anatomically correct.\n\nTHE METHOD\n\nPotty Training in One Day is one of 5 methods of potty training your child. The method is based on 2 simple concepts: (1) The easiest way to learn something is to teach it. (2) There are consequences for behavior. The first concept is based on the fact the best way to learn something is to teach it. We know that children learn from seeing, listening and hearing. They learn actions &amp; attitudes and will copy things that they have seen. So, a potty doll is used to model the appropriate potty training behaviors for your child. The second concept is based on the fact that behavior is shaped by consequences. As a parent, you already know that children learn from the consequences of their actions and you have probably already this as an effective parenting tool.\n\nSo, basically, with your guidance, your child will teach a potty doll the appropriate &quot;going potty&quot; behaviors. Your child will start learning that the natural consequence of drinking is the urge to urinate. The logical consequence of urinating on the potty are rewards such as verbal and non verbal praise, treats, toys and maybe even a potty party! Then, you child will teach the doll the natural consequence of not using the potty is wet underwear. The logical consequence of this undesired behavior is practicing going back and forth to the potty.\n\nAnd it is as simple as that! AND IT WORKS! The Book &amp; DVD cover the method in detail. They will walk you through the method step by step!\n\nLEARN MORE\n\n &lt;a href=&quot; http://www.potty-training-in-one-day.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.potty-training-in-one-day.com/&lt;/a&gt;\n &lt;a href=&quot; http://www.pottyscotty.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.pottyscotty.com/&lt;/a&gt;\n &lt;a href=&quot; http://www.pottypatty.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.pottypatty.com/&lt;/a&gt;\n &lt;a href=&quot; http://www.pottytrainingconcepts.com/CTGY/Potty-Training-In-One-Day.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.pottytrainingconcepts.com/CTGY/Potty-Training-In-One-Day.html&lt;/a&gt;","torrent":{"xt":"urn:btih:b9b79d81a985693b52e8de3395b072987fec23bc","amp;dn":"Potty+Training+in+One+Day","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9b79d81a985693b52e8de3395b072987fec23bc","infoHashBuffer":{"type":"Buffer","data":[185,183,157,129,169,133,105,59,82,232,222,51,149,176,114,152,127,236,35,188]},"announce":[],"urlList":[]}}