{"title":"Sonic Youth - Goo (2005 Deluxe Edition) [FLAC]","uid":10753850,"size":1016280087,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b9c099be694f64d1c6bee0563fb1bef0b113bcc5&amp;dn=Sonic+Youth+-+Goo+%282005+Deluxe+Edition%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":60,"time":1407908238,"description":" Review by Jason Ankeny  [-]\n\nAny doubts as to the continuing relevance of Sonic Youth upon their jump to major-label status were quickly laid to rest by Goo, their follow-up to the monumental Daydream Nation. While paling in the shadow of its predecessor, the record is nevertheless a defiant call to arms against mainstream musical values; the Geffen logo adorning the disc is a moot point -- Goo is, if anything, a portrait of Sonic Youth at their most self-indulgently noisy and contentious, covering topics ranging from Karen Carpenter (&quot;Tunic&quot;) to UFOs (&quot;Disappearer&quot;) to dating Jesus' mom (&quot;Mary-Christ&quot;). Even Public Enemy's Chuck D joins the fracas on the single &quot;Kool Thing,&quot; which teeters on the brink of a cultural breakthrough but falls just shy of the mark; the same could be said of Goo itself -- by no means a sellout, it nevertheless lacks the coherence and force of the group's finest work, and the opportunity to violently rattle the mainstream cage slips by. [The deluxe edition features remastered sound and lots of bonus material, including outtakes, B-sides, rehearsal recordings, and a bunch of eight-track demos produced by J Mascis and Don Fleming. The eight-track demos, in particular, are worthwhile. Previously available as the semi-bootleg Blow Job (available to fan club members -- or as a bootleg), these versions are very raw and heavy on noise, often concluding in chaotic feedback jams. Taken as a whole, they showcase the album in a different light, one that hardcore fans may prefer. Either way, they're a tremendous bonus and well worth hearing if you're a fan.]\n","torrent":{"xt":"urn:btih:b9c099be694f64d1c6bee0563fb1bef0b113bcc5","amp;dn":"Sonic+Youth+-+Goo+%282005+Deluxe+Edition%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9c099be694f64d1c6bee0563fb1bef0b113bcc5","infoHashBuffer":{"type":"Buffer","data":[185,192,153,190,105,79,100,209,198,190,224,86,63,177,190,240,177,19,188,197]},"announce":[],"urlList":[]}}