{"title":"Design, Modeling and Experiments of 3-DOF Electromagnetic Spheri","uid":6500641,"size":3257626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:babb0d89c173fca50b93b5f247e8c09f2893f9da&amp;dn=Design%2C+Modeling+and+Experiments+of+3-DOF+Electromagnetic+Spheri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_F1_","files":-1,"time":1309241931,"description":"Liang Yan, I-Ming Chen, Chee Kian Lim, Guilin Yang, Kok-Meng Lee, &quot;Design, Modeling and Experiments of 3-DOF Electromagnetic Spherical Actuators (Mechanisms and Machine Science)&quot;\nPublisher: Springer | ISBN 10: 9400716451 | 2011 | PDF | 188 pages | 5.9 MB\n\nA spherical actuator is a novel electric device that can achieve 2/3-DOF rotational motions in a single joint with electric power input. It has advantages such as compact structure, low mass/moment of inertia, fast response and non-singularities within the workspace. It has promising applications in robotics, automobile, manufacturing, medicine and aerospace industry.\nThis is the first monograph that introduces the research on spherical actuators systematically. It broadens the scope of actuators from conventional single-axis to multi-axis, which will help both beginners and researchers to enhance their knowledge on electromagnetic actuators. Generic analytic modeling methods for magnetic field and torque output are developed, which can be applied to the development of other electromagnetic actuators. A parametric design methodology that allows fast analysis and design of spherical actuators for various applications is proposed. A novel non-contact high-precision 3-DOF spherical motion sensing methodology is developed and evaluated with experiments, which shows that it can achieve one order of magnitude higher precision than conventional methods. The technologies of nondimensionalization and normalization are introduced into magnetic field analysis the first time, and a benchmark database is established for the reference of other researches on spherical actuators.","torrent":{"xt":"urn:btih:babb0d89c173fca50b93b5f247e8c09f2893f9da","amp;dn":"Design%2C+Modeling+and+Experiments+of+3-DOF+Electromagnetic+Spheri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"babb0d89c173fca50b93b5f247e8c09f2893f9da","infoHashBuffer":{"type":"Buffer","data":[186,187,13,137,193,115,252,165,11,147,181,242,71,232,192,159,40,147,249,218]},"announce":[],"urlList":[]}}