{"title":"BBC.Natural.World.Whale.Shark.XviD.AC3..avi","uid":6393366,"size":923072512,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bb324bb2c8aa6f390e6a9fb11a8aafefa756f540&amp;dn=BBC.Natural.World.Whale.Shark.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1305429030,"description":"Whale sharks, Rhincodon typus, are related to great whites, but are far less fearsome - they are filter feeders, swimming about with their enormous mouths open to scoop up tasty morsels floating in their paths. They are the largest fish in the world, with the longest ever recorded at over 13.5m. Fortunately, they are harmless filter feeders that suck in plankton and small fish. Yet, despite their staggering size, very little is known about these ocean giants. These distinctively yellow-spotted sharks are migratory and found throughout the world's oceans, preferring the warm and tropical waters around the equator.\n\nBeginning at the fabulous coral reef of Ningaloo in Western Australia, intrepid marine biologist Mark Meekan attempts to unravel the mysterious wanderings of the biggest fish in the sea. Dr Meekan, who is based at the Darwin office of the Australian Institute of Marine Science, was followed by the Natural World team as he has carried out his research on these mysterious fish. Whale sharks grow to over 12 metres long but are gentle, filter-feeding giants; even Mark's five-year-old son can swim alongside them. Yet no one knows where they go once they leave Ningaloo's turquoise lagoons. Using satellite tags and photo IDs, Mark tracks them to the white coral beaches of the Seychelles and the tropical jewel of Christmas Island, where bright-red land crabs begin their annual migration. It's hard work, taking in 20 failed satellite tags and countless frustrating dives, before Mark makes a breakthrough which doesn't just add to our understanding of these huge 'dinosaur fish' but offers crucial information about how the whale sharks of Ningaloo can be protected better.\n\nNarrated by Jessica Whittaker\nProduced &amp; directed by Emma Ross\nSeries Editor Tim Martin\n\nA Big Wave production for BBC and Animal Planet (2008)\n\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2323 kbps\nVideo Resolution: 720x416\nVideo Aspect Ratio: 1.731:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 48:48.080\nNumber Of Parts: 1\nPart Size: 923,072,512 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:bb324bb2c8aa6f390e6a9fb11a8aafefa756f540","amp;dn":"BBC.Natural.World.Whale.Shark.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb324bb2c8aa6f390e6a9fb11a8aafefa756f540","infoHashBuffer":{"type":"Buffer","data":[187,50,75,178,200,170,111,57,14,106,159,177,26,138,175,239,167,86,245,64]},"announce":[],"urlList":[]}}