{"title":"The Green Beautiful DVD ISO  La Belle Verte","uid":4614452,"size":3166349312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc2f5606e6fb89bd4c68d89039ab9714c696beb5&amp;dn=The+Green+Beautiful+DVD+ISO++La+Belle+Verte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"skyaddicted","files":1,"time":1230763511,"description":"did you ever wonder why the floor under your feet , in the place where you live are covered with a gray material, &amp; you can't see the soil? why this floor is full of poop? why are there boxes of metal emitting gases that you must breath? why you live in high cages, forced to hear the noise of these metal boxes? why you're driving them, &amp; not using your feet, causing you to eventually have heart attack, if you won't die earlier from cancer from the gases, or an accident with the fast moving boxes? why you eat corpses of animals? why you use pieces of paper entitling you to any value, without which you won't have nothing, not even food? why you eat unhealthy food? why you're sitting every evening watching a box showing people telling lies, &amp; dirtying your mind? why do you let yourself be led by fat selfish people caring only about themselves, their money &amp; power, why don't we really listen to each other, talk to each other, why do we have these hierarchies, in which the stupidiest, incapable ones rule, control &amp; exploit the goodness &amp; capable weaker ones? why we go about doing wrong immoral things just because we're being told, why we we're constantly mad, worried &amp; frustrated with such small trivial things, like a scratch in the mirror of our cars, &amp; never see, appreciate &amp; thank the beautiful wonderful life, nature &amp; world that sorrounds &amp; support us? why we ruin the world, poison ourselves, live in ugliness, support the rich selfish people exploiting us, selling us lies, tobbaco, weapons &amp; arms, killing people with the money that we're forced to pay them as taxes?\n\nif you haven't wondered on all this, its because you're like an ant, small cell in the super-organism, &amp; can't see beyond your cell's vision. what you need is to be disconnected, shocked by artists such as Coline Serreau, that have a vision that you don't have, consciousness, different from that of the ants. such artists, like Jesus &amp; Johann Sebastian Bach, cause the world to change, the super-organism to evolve into something more intelligent, more good for its cells, that are given life. ","torrent":{"xt":"urn:btih:bc2f5606e6fb89bd4c68d89039ab9714c696beb5","amp;dn":"The+Green+Beautiful+DVD+ISO++La+Belle+Verte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc2f5606e6fb89bd4c68d89039ab9714c696beb5","infoHashBuffer":{"type":"Buffer","data":[188,47,86,6,230,251,137,189,76,104,216,144,57,171,151,20,198,150,190,181]},"announce":[],"urlList":[]}}