{"title":"Caleb Carr - The Angel of Darkness (Dr. Laszlo Kreizler #2)","uid":14627899,"size":371167699,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bc3fa3e32bbc501b1132e88844728cd483ef7e0c&amp;dn=Caleb+Carr+-+The+Angel+of+Darkness+%28Dr.+Laszlo+Kreizler+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":66,"time":1463329800,"description":"In The Angel of Darkness, Caleb Carr brings back the vivid world of his bestselling The Alienist but with a twist: this story is told by the former street urchin Stevie Taggert, whose rough life has given him wisdom beyond his years. Thus New York City, and the groundbreaking alienist Dr. Kreizler himself, are seen anew.\r\n\r\nIt is June 1897. A year has passed since Dr. Laszlo Kreizler, a pioneer in forensic psychiatry, tracked down the brutal serial killer John Beecham with the help of a team of trusted companions and a revolutionary application of the principles of his discipline. Kreizler and his friends--high-living crime reporter John Schuyler Moore; indomitable, derringer-toting Sara Howard; the brilliant (and bickering) detective brothers Marcus and Lucius Isaacson; powerful and compassionate Cyrus Montrose; and Stevie Taggert, the boy Kreizler saved from a life of street crime--have returned to their former pursuits and tried to forget the horror of the Beecham case. But when the distraught wife of a Spanish diplomat begs Sara's aid, the team reunites to help find her kidnapped infant daughter. It is a case fraught with danger, since Spain and the United States are on the verge of war.\r\n\r\nOnce again, Caleb Carr proves his brilliant ability to re-create the past, both high life and low. As the horror unfolds, Delmonico's still serves up wondrous meals, and a summer trip to the elegant gambling parlors of Saratoga provides precious keys to the murderer's past. At the same time, we go on revealing journeys into Stevie's New York, a place where poor and neglected children--then as now--turn to crime and drugs at shockingly early ages. Peppered throughout are characters taken from real life and rendered with historical vigor, including suffragist Elizabeth Cady Stanton; painter Albert Pinkham Ryder; and Clarence Darrow, who thunders for the defense in a tense courtroom drama during which the sanctity of American motherhood itself is put on trial. Fast-paced and chilling, The Angel of Darkness is a tour de force, a novel of modern evil in old New York.\r\n\r\n\r\n\r\n\r\nRead by George Guidall\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:bc3fa3e32bbc501b1132e88844728cd483ef7e0c","amp;dn":"Caleb+Carr+-+The+Angel+of+Darkness+%28Dr.+Laszlo+Kreizler+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc3fa3e32bbc501b1132e88844728cd483ef7e0c","infoHashBuffer":{"type":"Buffer","data":[188,63,163,227,43,188,80,27,17,50,232,136,68,114,140,212,131,239,126,12]},"announce":[],"urlList":[]}}