{"title":"A.Sapkowski - Krew Elfów [PL]   /192","uid":12603476,"size":987150431,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bca1005af8cb9c15431b973bf9ad72a7548bba36&amp;dn=A.Sapkowski+-+Krew+Elf%26oacute%3Bw+%5BPL%5D+MP3%40160%2F192&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"everdarksoul","files":35,"time":1445361530,"description":"Audiobook PL - Andrzej Sapkowski: Saga o Wiedźminie. Tom 1 - &quot;Krew Elfów&quot; (całość)\r\nDane: 941 MB / 33x    i 192 kbps / czas: 12:27:43 / czyta: Zespół Lektorów\r\n\r\nMegaprodukcja - czyli Teatr Dźwięku i Wyobraźni od wydawnictw &quot;Fonopolis&quot; i &quot;superNOWA&quot;. Po raz kolejny przyszło im zmierzyć się z pisarskim kunsztem Andrzeja Sapkowskiego, a sprawdzony zespół realizatorów i aktorów przy poprzednich słuchowiskach, zapewni wszystkim słuchaczom najwyższą jakość odbioru i zaostrzy apetyt na więcej.\r\nTo nie jest zwykły audiobook. To słuchowisko z 79 aktorami, muzyką i efektami, ilustrujące powieść &quot;Krew Elfów&quot; - pierwszy tom &quot;Sagi o Wiedźminie&quot; - cyklu powieściowego, autorstwa Andrzeja Sapkowskiego, o dziejach Wiedźmina: Geralta z Rivii - będącego kontynuacją wcześniejszych zbiorów opowiadań tegoż autora: &quot;Ostatnie Życzenie&quot; (z których część wydano wcześniej w tomie Wiedźmin) oraz &quot;Miecz Przeznaczenia&quot;.\r\nW skład cyklu wchodzą powieści:\r\n\r\n1 - Krew Elfów\r\n2 - Czas Pogardy\r\n3 - Chrzest Ognia\r\n4 - Wieża Jaskółki\r\n5 - Pani Jeziora\r\n\r\nWiedźmin Geralt i jego wychowanka - księżniczka Ciri - przybywają do wiedźmińskiej warowni i tam osiadają. Dziewczynka chce zostać wiedźminką. Geralt udziela jej wiedźmińskiego wykształcenia. Ciri uczy się walczyć, radzić sobie z mieczem i przeciwnikiem.\r\nNiespodziewany zwrot akcji uniemożliwia poddanie jej najtrudniejszej Próbie Traw. Pomoc Geralta z Rivii okazuje się zbędna.\r\nPrzypadkowo odkryty potencjał magiczny zmusza wiedźminów do sprowadzenia Triss Merigold...\r\n\r\nW rolach głównych wystąpili:\r\n\r\nKrzysztof Gosztyła - Narrator\r\nKrzysztof Banaszyk - Wiedźmin\r\nArkadiusz Bazak - Vesemir\r\nAnna Cieślak - Filippa Eilhart\r\nAnna Dereszowska - Yennefer\r\nAdam Ferency - Vizimir\r\nMałgorzata Kożuchowska - Triss Merigold\r\nTomasz Marzecki - Rience\r\nSławomir Pacek - Jaskier\r\nJoanna Pach-Żbikowska - Ciri\r\nHenryk Talar - Foltest\r\nDariusz Wnuk - Eskel\r\n\r\n&quot;...Skąd Andrzej Sapkowski zna nasze marzenia? Tego nie wie nikt. Może tylko On. Nawet jeśli nie, na pewno nam nie powie. Marzyciele nie muszą pytać o marzenia, wystarczy, że marzą.\r\nTaki jest Wiedźmin. To nauczyciel. Mówi mało, czyni wiele. Treścią i sensem jego życia jest walka ze złem. Czy z tej walki rodzi się dobro? Czasami tak, a czasami nie. Jak to w baśniach. Jak to w życiu.\r\nOpowiadamy historię życia Wiedźmina najlepiej jak potrafimy. Mamy nadzieję, że pokochacie „naszego &quot;Wiedźmina, tak jak pokochaliście tego zrodzonego z Waszej wyobraźni podczas lektury książek.\r\nMamy taką nadzieję, bo my też jesteśmy nauczycielami. To ogromne wyzwanie. Setki aktorów, tysiące trudnych efektów, a wszystko po to by sprostać Waszej wyobraźni.\r\nWiedźmin jest dla Was i w Was...&quot;\r\n\r\n- reżyser Janusz Kukuła\r\n\r\nOpis produktu od wydawcy oraz pełną obsadę słuchowiska znajdziecie np. tu: \nhttp://fonopolis.pl/Wiedzmin-Krew-elfow","torrent":{"xt":"urn:btih:bca1005af8cb9c15431b973bf9ad72a7548bba36","amp;dn":"A.Sapkowski+-+Krew+Elf%26oacute%3Bw+%5BPL%5D+MP3%40160%2F192","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca1005af8cb9c15431b973bf9ad72a7548bba36","infoHashBuffer":{"type":"Buffer","data":[188,161,0,90,248,203,156,21,67,27,151,59,249,173,114,167,84,139,186,54]},"announce":[],"urlList":[]}}