{"title":"David Weber - Safehold 06 - Midst Toil and Tribulation-CORRECTED","uid":7777814,"size":1636565117,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bcc4238f8e5618e841b33581efb115b060999673&amp;dn=David+Weber+-+Safehold+06+-+Midst+Toil+and+Tribulation-CORRECTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bbwizard","files":24,"time":1351700072,"description":"THIS IS A CORRECTION. IF YOU DOWNLOADED IT ALREADY, ONLY CD #2 HAS CHANGED AND THAT IS ALL YOU NEED TO DOWNLOAD. IT HAD A GLITCH OF SOME KIND NEAR THE END AND CHUNK OF THE TEXT WAS REPLACED BY A BLANK SPACE (AT ABOUT 1:17:17 FOR 20 SECONDS). \n\nSafehold Volume 6 - Midst Toil and Tribulation\nby David Weber\nRead by: Kevin T. Collins\nDuration: 28:27:19\nQuality: MP3 44Khz, 128kb CBR Joint Stereo\n\nNOTE: This is a direct rip from the CD's. \n\nLISTENER WARNING: Don't narrators EVER listen to the previous books? Or at least talk to the author? The new narrator is very hard to listen to because he pronounces so many place and person names in the book differently (at least different from ALL the other narrators - and he can't even pronounce regular words correctly sometimes, too), and he is OVERLY dramatic in his reading.  But, until something better comes out (SOON PLEASE), this is all there is.  Remember, the first book was read by Martha Harmon Pardee, and RE-READ by Oliver Wyman in a much better reading (I have both), so it IS possible that a re-read could be done. Funny thing is, the imprinted CD's say &quot;Read by Peter Ganim&quot;, so maybe this is a replacement reader.\n\n\n\nDescription:\n\nAfter centuries of stasis, the island kingdom of Charis began to defy the edicts of the Church of God Awaiting - egged on, some say, by the mysterious warrior-monk Merlin Athawes. Now, in the wars and intrigues that have cascaded from Charis's declaration of independence, the populous Republic of Siddermark is sliding into chaos. Vicar Clytahn of the Church of God at harvest time, King Cayleb of Charis, his queen Sharleyan, and Merlin Arthawes will have their hands full trying to stave off wholesale starvation in Siddermark while at the same time shipping in enough land combat units to fend off the &quot;volunteers&quot; from the Church's Temple Lands. And while Vicar Clyntahn is hailed in the Church for his boldness and audacity, there are those who remember how dependent Church power is on money from Siddermark...and who wonder what will happen if Siddermark starves.\n\nBursting with vivid invention and the sweep of lived history, Midst Toil and Tribulation will build its series' audience to a new level.\n\nAbout the Author:\n\nDavid Weber is a science fiction phenomenon. His popular Honor Harrington and Honorverse novels-including Mission of Honor, At All Costs, and Torch of Freedom-are New York Times bestsellers and can't come out fast enough for his devoted readers. He is also the author of the Safehold series, including Off Armageddon Reef, By Schism Rent Asunder, By Heresies Distressed and A Mighty Fortress. His other top-selling science fiction novels include Out of the Dark, the Dahak books and the Multiverse books, written with Linda Evans. He has also created an epic SF adventure series in collaboration with John Ringo, including We Few. His novels have regularly been Main Selections of the Science Fiction Book Club. Weber has a bachelor's degree from Warren Wilson College, and attended graduate school in history at Appalachian State University. He lives in South Carolina.\n","torrent":{"xt":"urn:btih:bcc4238f8e5618e841b33581efb115b060999673","amp;dn":"David+Weber+-+Safehold+06+-+Midst+Toil+and+Tribulation-CORRECTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcc4238f8e5618e841b33581efb115b060999673","infoHashBuffer":{"type":"Buffer","data":[188,196,35,143,142,86,24,232,65,179,53,129,239,177,21,176,96,153,150,115]},"announce":[],"urlList":[]}}