{"title":"Kawasaki Jet Ski Wii","uid":9186137,"size":48012532,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:bcd16060759b16c9555d48905730b8906bc57e41&amp;dn=Kawasaki+Jet+Ski+Wii&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DANHUK","files":3,"time":1384307303,"description":"ID\tRJSPUG\nregion\tPAL\ntype\tWii\nlanguages\tEN, FR, DE, ES, IT, NL\ntitle (EN)\tKawasaki Jet Ski\n\nsynopsis (EN)\n\nOfficially recreated under Kawasaki license, Jet Ski offers a level of\nplayability that allows players to easily get into the roll of things. Players can utilise\nthe Wii control system allowing both precision and easy movement of the Jet Ski. A wide\narray of impressive tracks from famous location from around the world, including The Thames\n(London), Taiwanese Islands, Canadian Rookies and the Canals of Venice. There is really no\nway one could find this title lacking in the long-term. With the vigorous challenges that\nawait in the Championship mode to the more self-improving challenges of Time Trial, and\nof course the all out mayhem of the Two-Player mode. However as impressive as these modes\nare, Stunt mode is certainly a stand out. Master a wide range of cool tricks available\ntoperfectly control the Jet Ski during air. The sheer level of addictiveness the Wii Remote\nprovides, it is really just all here. Impressive sound delivering a number of ambient\neffects as well as the more brutal engine sounds, metal clashes and of course character\nvoices and grunts. Kawasaki Jet Ski is perfect for the Wii, not only with gameplay,\nplayability and challenge but also showing what the Wii hardware is capable of amassing\nhuge, clean 3D worlds with mind-blowing effects.\n\n\n\n                              \t    Installation Information\n\n\nNone Just Extract with wii backup fusion to iso\nthe burn to DVD-R with Image Burn\nLoad via your Backup Game Launcer/Channel on wii\n","torrent":{"xt":"urn:btih:bcd16060759b16c9555d48905730b8906bc57e41","amp;dn":"Kawasaki+Jet+Ski+Wii","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcd16060759b16c9555d48905730b8906bc57e41","infoHashBuffer":{"type":"Buffer","data":[188,209,96,96,117,155,22,201,85,93,72,144,87,48,184,144,107,197,126,65]},"announce":[],"urlList":[]}}