{"title":"Wednesday Comics (DC Comics)","uid":5295427,"size":559706112,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bcf1d1bec68055c106d4259b261f7ca878bfa847&amp;dn=Wednesday+Comics+%28DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ParrowJack","files":12,"time":1264040882,"description":"Wednesday Comics is a weekly anthology comic book launched by DC Comics on July 8, 2009.  The title is published in 14&quot; x 20&quot; broadsheet format, deliberately similar to Sunday newspaper comics sections.  Each edition features 15 pages, each from a different story by a different creative team.   Spearheaded by DCU Editorial Art Director, Mark Chiarello, creators were approached and asked to develop stories for the characters they would most like to write. Each issue is 16 pages and each story takes up one full page when folded out.\n\nEvery issue prints the strips in the following sequence:\n\n* Batman - story by Brian Azzarello with art by Eduardo Risso. Batman becomes entangled in a battle over who should inherit a murdered man's estate.\n* Kamandi - story by Dave Gibbons with art by Ryan Sook. Kamandi rides to the city of the apes in an attempt to aid the Tiger army.\n* Superman - story by John Arcudi with art by Lee Bermejo. An alien attack provokes feelings of unease within the man of steel.\n* Deadman - story by Dave Bullock and Vinton Heuck with art by Dave Bullock\n* Green Lantern - story by Kurt Busiek with art by Joe QuiÃƒÂ±ones\n* Metamorpho - story by Neil Gaiman with art by Michael Allred\n* Teen Titans - story by Eddie Berganza with art by Sean Galloway\n* Strange Adventures - story and art by Paul Pope and JosÃƒÂ© Villarrubia\n* Supergirl - story by Jimmy Palmiotti with art by Amanda Conner. The girl of steel has trouble looking after the irrationally behaving Streaky and Krypto.\n* Metal Men - story by Dan DiDio with art by JosÃƒÂ© Luis GarcÃƒÂ­a-LÃƒÂ³pez and Kevin Nowlan\n* Wonder Woman - story and art by Ben Caldwell\n* Sgt. Rock - story by Adam Kubert with art by Joe Kubert\n* The Flash - story by Karl Kerschl and Brenden Fletcher with art by Karl Kerschl. Gorilla Grodd's most recent attack leaves The Flash multiplying due to falling out of line with his own chronology.\n* The Demon and Catwoman - story by Walter Simonson with art by Brian Stelfreeze\n* Hawkman - story and art by Kyle Baker. Katar Hol fights off airplane hijackers who are really aliens and ends up landing on Dinosaur Island.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:bcf1d1bec68055c106d4259b261f7ca878bfa847","amp;dn":"Wednesday+Comics+%28DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcf1d1bec68055c106d4259b261f7ca878bfa847","infoHashBuffer":{"type":"Buffer","data":[188,241,209,190,198,128,85,193,6,212,37,155,38,31,124,168,120,191,168,71]},"announce":[],"urlList":[]}}