{"title":"Larry Carlton - On Solid Ground [Flac Cue] [TNTvillage]","uid":6608188,"size":446222668,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bcf44f4ac50d8e062095360fc6925b9e448171cb&amp;dn=Larry+Carlton+-+On+Solid+Ground+%5BFlac+Cue%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"darayava","files":16,"time":1313494913,"description":"Larry Carlton - On Solid Ground [Flac Cue] [TNTvillage]\n\n\nLARRY CARLTON\n\nON SOLID GROUND\n\nTitolo: On Solid Ground\nAnno: 1989 \nGenere: Jazz Fusion\nEtichetta: MCA Record\n\n\nI haven't heard everything that Carlton's done, but I do own most of it. For those (like me) who too often find most of this music sorely lacking and getting mired in tired R'and B' grooves that have no sense of dynamics and wear out their welcome long before the tune is over, then this is a fine exception. Matter of fact this album, along with 1986's &quot;Alone//But Not Alone&quot; (where Carlton sticks to acoustic guitar for the entire recording)I would rate as the only 2 &quot;must have's&quot; of his output so far.\nCarlton may have been inspired by his famous brush with death just before this recording, who knows, but it certainly shows here in a beautiful, lyrical way. His playing still shows signs of the fusion style that he was originally known for, but the writing is more mature and many of the themes are quite beautiful and expressive. Oddly, though, the recording starts off with the weakest track &quot;Josie&quot; which sounds pretty much like everything else from this genre and isn't going to win anybody over except those already into this type of &quot;all groove and no substance&quot; type of piece. On the other side, I think the best Carlton peace EVER is on here, &quot;Sea Space&quot;, and no &quot;Best Of&quot; compilation is complete without this tune (naturally they missed putting &quot;Sea Space&quot; on either &quot;Collection&quot; volumes 1 or 2!). Usually when you see a cover version of a well known tune (in this case &quot;Layla&quot;) it's usually a sign of the leader grasping for material (and radio play)due to lack of inspiration, but, again, thankfully, that is not the case here, it actually works. Sure there are a couple of those R'andB' grooves that could easily make one put this in the same catagory as the thousands of other recordings of this type (including the by-the-book saxophone solo in &quot;All in Good Time&quot; which the player could probably have done in his sleep), but these are thankfully saved by the incredible recorded sound, and the keyboards (the wonderful Alan Pasqua and Terry Trotter) which really give most of the recording a sense of depth and beauty, often functioning kind of as a backround orchestral pallette (as is most evident on &quot;Sea Space&quot;).\nAll in all this could have been better with maybe replacing the tired sounding saxophone solos with a real Jazz sax player (anybody from Charlie Mariano to Tom Scott would work better), but all in all, I would pick this up along with 1986's &quot;Alone/But Not Alone&quot; and you will have the best of Carlton in both the electric and acoustic worlds.\n\n\n01. Josie\n02. All In Good Time\n03. The Philosopher\n04. Layla\n05. On Solid Ground\n06. The Waffer\n07. Bubble Shuffle\n08. Chapter II\n09. Honey Samba\n10. Sea Space\n\n\nGeneral\nComplete name                    : 01 Josie.flac\nFormat                           : FLAC\nFormat/Info                      : Free Lossless Audio Codec\nFile size                        : 34.0 MiB\nDuration                         : 5mn 10s\nOverall bit rate                 : 918 Kbps\nAlbum                            : On Solid Ground\nTrack name                       : Josie\nTrack name/Position              : 1\nTrack name/Total                 : 10\nPerformer                        : Larry Carlton\nGenre                            : Fusion\nRecorded date                    : 1989\nComment                          : ExactAudioCopy v0.95b4\nDISCID                           : 870CAD0A\n\nAudio\nFormat                           : FLAC\nFormat/Info                      : Free Lossless Audio Codec\nDuration                         : 5mn 10s\nBit rate mode                    : Variable\nBit rate                         : 916 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nResolution                       : 16 bits\nStream size                      : 33.9 MiB (100%)\nWriting library                  : libFLAC 1.1.3 (UTC 2006-11-20)\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:bcf44f4ac50d8e062095360fc6925b9e448171cb","amp;dn":"Larry+Carlton+-+On+Solid+Ground+%5BFlac+Cue%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcf44f4ac50d8e062095360fc6925b9e448171cb","infoHashBuffer":{"type":"Buffer","data":[188,244,79,74,197,13,142,6,32,149,54,15,198,146,91,158,68,129,113,203]},"announce":[],"urlList":[]}}