{"title":"five nights at Freddy's 2 MEGA PACK","uid":11637324,"size":225767412,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bd0112b5d4948740eef14d72cd6be610cb30bc80&amp;dn=+five+nights+at+Freddy%27s+2+MEGA+PACK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"payl0ad","files":4,"time":1417743829,"description":"taken from steam: Welcome back to the new and improved Freddy Fazbear's Pizza!\n\nIn Five Nights at Freddy's 2, the old and aging animatronics are joined by a new cast of characters. They are kid-friendly, updated with the latest in facial recognition technology, tied into local criminal databases, and promise to put on a safe and entertaining show for kids and grown-ups alike!\n\nWhat could go wrong?\n\nAs the new security guard working nights, your job is to monitor cameras and make sure nothing goes wrong after-hours. The previous guard has complained about the characters trying to get into the office (he has since been moved to day-shift). So to make your job easier, you've been provided with your very own empty Freddy Fazbear head, which should fool the animatronic characters into leaving you alone if they should accidentally enter your office.\n\nAs always, Fazbear Entertainment is not responsible for death or dismemberment.\n\nINSTALL:\n\n1. find the Five nights at Freddy's 2 folder\n2.find the five nights at Freddy's 2 install\n3. when it asks for admin rights grant them\n4. you anti virus might say it is a virus its not and your completely safe. you might have to disable it temporarily\n5. enjoy\n \nalso included in this is a FNAF 2 trainer and a level hack allowing you to instantly beat the game including 10 20 mode. credit goes to MR_ANTIFUN for trainer. please seed and enjoy. :)","torrent":{"xt":"urn:btih:bd0112b5d4948740eef14d72cd6be610cb30bc80","amp;dn":"+five+nights+at+Freddy%27s+2+MEGA+PACK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd0112b5d4948740eef14d72cd6be610cb30bc80","infoHashBuffer":{"type":"Buffer","data":[189,1,18,181,212,148,135,64,238,241,77,114,205,107,230,16,203,48,188,128]},"announce":[],"urlList":[]}}