{"title":"Vexed.Season.Complete.480p.HDTV.H264","uid":7490640,"size":944763724,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bd182843bc48fb47c21ab699dd19e2ccc97030e7&amp;dn=Vexed.Season.Complete.480p.HDTV.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"twentyforty","files":15,"time":1343731185,"description":"Two Detectives Jack and Kate who share chemistry but have complicated personal lives.\n\nStarring Lucy Punch, Toby Stephens, Ronny Jhutti.\n\nSeason 1, Episode 1: Episode #1.1\nOriginal Air Dateï¿½15 August 2010\nImmature cop Jack Armstrong and new partner Kate Bishop,whose husband is a workaholic,investigate the murder of seemingly lonely singleton Sally Jacobs. A friend of the deceased tells them that she had just met a handsome blond man and Jack connects this to another,recent murder whose victim had the same tastes as Sally. Both women had loyalty shopping cards from the Honey Bee group and the killer would seem to be an employee with access to the company's database. Kate enters false details of herself to act as decoy,learning of her husband's apparent infidelity in the process. She is duly approached by a handsome young man. But is he the killer? An after hours visit to the Honey Bee offices provides the answer.\n\nSeason 1, Episode 2: Episode #1.2\nOriginal Air Dateï¿½22 August 2010\nBanker Andrew Bridgley checks into a clinic for treatment of his depression,where somebody tries to blow him up. Kate and Jack investigate,Jack as crass as ever though he shows sympathy to Kate when she tells him that she and husband Dan are seeking marriage guidance. An attempt to shoot Andrew shows that somebody has hired a hitman,disguised as a patient. When Andrew refuses to go to a safe house the cops move in with him though they fail to save another patient,who eats a poisoned meal meant for Andrew. Kate accidentally exposes the hitman though their employer's identity comes as a surprise. Kate and Dan reconcile but Jack,following a spot of afternoon delight with the clinic's female director,is diagnosed with testicular cancer.\n\nSeason 1, Episode 3: Episode #1.3\nOriginal Air Dateï¿½29 August 2010\nSteeling himself to have his right testicle surgically removed, Jack joins Kate as they investigate the abduction of Gemma G,from pop band Candy Crew. A ransom is paid but Gemma is not released. As the group's fortunes soar due to the surrounding publicity,Jack suspects an inside job and is proved partially right when the band's manager Richard is murdered.In a showdown at a greyhound track Jack rescues both Gina and Kate from the kidnapper before undergoing his operation. He is visited in hospital by Kate - will she stay on as his partner or return to Bristol with Dan?\n\nNOTE: Probable Season Two with six episodes.","torrent":{"xt":"urn:btih:bd182843bc48fb47c21ab699dd19e2ccc97030e7","amp;dn":"Vexed.Season.Complete.480p.HDTV.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd182843bc48fb47c21ab699dd19e2ccc97030e7","infoHashBuffer":{"type":"Buffer","data":[189,24,40,67,188,72,251,71,194,26,182,153,221,25,226,204,201,112,48,231]},"announce":[],"urlList":[]}}