{"title":"Penetration Tester's Open Source Toolkit, 3rdEdition (scuba-doo","uid":6586680,"size":17816825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd76caba49f29a8638b0b21fd7520643ce814a76&amp;dn=Penetration+Tester%5C%27s+Open+Source+Toolkit%2C+3rdEdition+%28scuba-doo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"scuba-doo","files":-1,"time":1312636775,"description":"- Paperback: 464 pages\n- Publisher: Syngress; 3 edition (August 1, 2011) \n- Language: English\n- ISBN-10: 1597496278\n- ISBN-13: 978-1597496278\n\n\nReview\n\n&quot;Jeremy Faircloth continues to write about computer and network security in ways that help the InfoSec community. In Penetration Tester's Open Source Toolkit, Third Edition he combines his sharp insight into a wide variety of technologies, diverse penetration testing approaches and several penetration testing tools (then showcases these tools in action in the case study in each chapter) so the student of penetration testing can go out and get it done. This is just the kind of writing we should be expecting from our front runners in IT to be doing to support our Enterprise.&quot;--Tim Hoffman, President, Alida Connection\n\nProduct Description\n\nGreat commercial penetration testing tools can be very expensive and sometimes hard to use or of questionable accuracy. This book helps solve both of these problems. The open source, no-cost penetration testing tools presented do a great job and can be modified by the user for each situation. Many tools, even ones that cost thousands of dollars, do not come with any type of instruction on how and in which situations the penetration tester can best use them. Penetration Tester's Open Source Toolkit, Third Edition, expands upon existing instructions so that a professional can get the most accurate and in-depth test results possible. Real-life scenarios are a major focus so that the reader knows which tool to use and how to use it for a variety of situations.\n\n\n\n\nDetails current open source penetration testing tools\n\nPresents core technologies for each type of testing and the best tools for the job\n\nNew to this edition: Enterprise application testing, client-side attacks and updates on Metasploit and Backtrack\n\n\n\n\nHASH: 7BB4E7272F6C42B5A5205E4A24AD51A719C7D5BA\n\n\n\nscanned with Kaspersky  + SuperAntiSpyware + Malwarebytes = Malware FREE\n\nENJOY\n       scuba-doo\n\n\nshare the wealth and seed, comments are more then welcome","torrent":{"xt":"urn:btih:bd76caba49f29a8638b0b21fd7520643ce814a76","amp;dn":"Penetration+Tester%5C%27s+Open+Source+Toolkit%2C+3rdEdition+%28scuba-doo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd76caba49f29a8638b0b21fd7520643ce814a76","infoHashBuffer":{"type":"Buffer","data":[189,118,202,186,73,242,154,134,56,176,178,31,215,82,6,67,206,129,74,118]},"announce":[],"urlList":[]}}