{"title":"Surfing-Free as a dog- Joel Parkinson","uid":6893367,"size":826650950,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bdbaa0a00264e7c0fc5e0fec3d4135de6eb491fb&amp;dn=Surfing-Free+as+a+dog-+Joel+Parkinson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mr.festus","files":1,"time":1324099657,"description":"Free as a dog - A true dog\\\\\\'s tale is the new Billabong film staring Joel Parko\\\\\\&quot; Parkinson and his faithful hound, Trey. As seen through the eyes of the ever-loyal Trey, who is also the film\\\\\\'s narrator, the remarkable surfing talent of Joel Parkinson is showcased like never before. \\\\\\&quot;It\\\\\\'s an honour to be able to work with a surfer of this calibre. Parko is just so easy going and a regular good guy. From there the film title developed naturally as Parko and his dog Trey represent the true nature of the title,\\\\\\&quot; Jack McCoy reflects. Starring alongside Parko will be Northern NSW grommets James Wood and Ellis Ericson, both of whom are earmarked to be the bright future of Australian surfing. Ellis and James play the token surf trip grommets, which have a tendency to be distracted by beautiful beach babes. For the past year Parko, Jack, Ellis and Woody have been chasing banks, swells and whispers all over the Australian coast, scoring some of the sickest sessions to go down in 2005. Parko and Trey set off on a mission to help get a couple of groms (played by James \\\\\\&quot;Woody\\\\\\&quot; Wood and Ellis Erickson) back in line after they\\\\\\'ve gone off the rails in classic teenage puppy-love mode, fantasising about a beautiful dark-haired beauty played by Billabong free surfer Ashley Cheadle. Free as a Dog - A true dog\\\\\\'s tale is the 24th film in a long line of classic surfing films by Jack McCoy.","torrent":{"xt":"urn:btih:bdbaa0a00264e7c0fc5e0fec3d4135de6eb491fb","amp;dn":"Surfing-Free+as+a+dog-+Joel+Parkinson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdbaa0a00264e7c0fc5e0fec3d4135de6eb491fb","infoHashBuffer":{"type":"Buffer","data":[189,186,160,160,2,100,231,192,252,94,15,236,61,65,53,222,110,180,145,251]},"announce":[],"urlList":[]}}