{"title":"AVCHDCoder Beta 3.08 MKV/M2TS to AVCHD converter","uid":4758048,"size":7769825,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bdd219e7b60fc112595a6ce291da191cfc77c7c8&amp;dn=AVCHDCoder+Beta+3.08+MKV%2FM2TS+to+AVCHD+converter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"twazerty","files":1,"time":1236558220,"description":"With AVCHDCoder you can convert M2TS and MKV files to AVCHD. Almost everything will be done for you. You can add srt or sup files. If they are in your input file or not it doesn't matter. Subs and audio will be extracted automaticly. Integrated the tool with some very rare formulas to calculate the bitrate. Discs will be filled for nearly 100%. I made it almost noob proof. In this Beta version is not everything possible. More will be added in the future. Based on free tools. Requires: Java, Avisynth, Ffdshow and Haali Media Splitter.\n\n[url=http://tools.twanwintjes.nl/index.php?page=downloads]\nClick here to go to the download section[/url]\n\nThis is a list of things that are still unsupported:\n\n    * No AAC\n    * Only TrueHD, DTS-HD@3045Kbps, DTS, AC3 448Kbps and AC3 640Kbps are supported.\n    * No 2.0/7.1 sound. Only 5.1 channel audio supported.\n    * It's not possible to burn after conversion.\n    * Only 1 subtitle is supported.\n    * Only 1 audio track is supported.\n\n \n\nBut the most will be done automaticly. Here is a list of awesome features:\n\n    * You don't need to convert a srt yourself. The only thing you do is adding your srt file and choose some settings.\n    * Internal srt and PGS sup files are supported.\n    * Conversion of audio will be done automaticly.\n    * Down/up covertion from AC3 to AC3.\n    * Down convertion of DTS-HD and True-HD tracks.\n    * Chapter support.\n    * You only need to choose your output resolution. Borders will be added automaticly. Downscaling will also be done automaticly.\n    * You can choose between DVD5 and DVD9 output.\n    * Feature to watch the approx. bitrate before encoding.\n    * Iso will created for you so it is ready to burn.\n    * No need to configure the x264 encoder. There is 1 build in profile that can't be edited.\n    * Muxing will be done automaticly.\n    * Unique formules to calculate the bitrate.\n\n\n\n\nThis application uses the following applications:\n\n* BePipe and aften\n* ac3filter\n* ImgBurn\n* mkvMerge and mkvExtract\n* tsMuxer\n* x264\n* mediainfo\n* The build in profile is delivered by: ps3avchd.net\n\n\n\nTo run this application you need to have the following applications installed:\n\n* AviSynth\n* ffdshow\n* Haali Media Splitter\n* Java\n\n\n\nAll needed applications can be found in the download section.\n\nBeta v3.08\nFixed - Dragging another movie in the app while another movie was already loaded cause double information and other errors.\nFixed - You could force to use a audio track when in should not be possible. Caused encoding job skipped.\nFixed - Now running the program twice is impossible.\nAdded - Folder output.\nAdded - Dutch Language, almost everything except the Help section is translated.\nAdded - French Language, Help and some error popups are not translated, main section is 100% translated.\nAdded - option for Shutdown when conversion is completed\nAdded - Formula for AC3 384Kbit. Now movies with AC3 384Kbit can be converted without upconversion.\nChanged - renamed dut to nld for dutch language.\nUpdated - x264.exe to revision 1123\n\nUpcoming feature: Option for adding a menu and multiple movies on 1 disc.","torrent":{"xt":"urn:btih:bdd219e7b60fc112595a6ce291da191cfc77c7c8","amp;dn":"AVCHDCoder+Beta+3.08+MKV%2FM2TS+to+AVCHD+converter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdd219e7b60fc112595a6ce291da191cfc77c7c8","infoHashBuffer":{"type":"Buffer","data":[189,210,25,231,182,15,193,18,89,90,108,226,145,218,25,28,252,119,199,200]},"announce":[],"urlList":[]}}