{"title":"Beyond Good and Evil by Friedrich Wilhelm Nietzsche [republicV]","uid":7725603,"size":4045847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be41b0dcf7a533abc27d51c7a93f8d9516b7dad9&amp;dn=Beyond+Good+and+Evil+by+Friedrich+Wilhelm+Nietzsche+%5BrepublicV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"republicV","files":-1,"time":1350209100,"description":"Language: English\nPublished in: 1886\nWord count: 62,945 words\n\nNietzsche was born in Roecken, Saxony in 1844 and became professor of Greek at Basel in Switzerland. At first he was deeply influenced by the writings of Arthur Schopenhauer and the music of Richard Wagner, to whom he was both friend and advocate. But both these attractions passed, and ill health led him to leave the academic life to devote himself to producing a whole series of, in his time, unsold and unread books expounding his ideas with a boldness which is as much poetry as philosophy. In The Dawn, The Gay Science, Thus Spake Zarathustra, Towards a Genealogy of Morals, Ecce Homo, and here in Beyond Good and Evil he argues that 'God is dead', that new thinkers are needed, free to create their own values. His ideal Î¬bermensch, or 'Overman', would impose his will on the weak and worthless. He saw that knowledge is never objective but always serves some interest or some unconscious purpose, and that the 'slave morality' of Christianity has helped build a foolish system of values which comfort failure.\n\nSupposing that Truth is a woman- what then? Is there not ground for suspecting that all dogmatic philosophers, just as they have failed to understand women, have failed to woo truth?\n\nIt seems that in order to inscribe themselves upon the heart of humanity, all great things have first to wander the earth as enormous caricatures: and dogmatic philosophy has been a caricature, whether as the Vedanta in Asia, or Platonism in Europe. But the struggle against Plato, the struggle for the 'people', the struggle against Christian oppression (for Christianity is Platonism for the 'people'), has produced in Europe a magnificent tension of soul, such as had not existed anywhere previously. With such a tensely strained bow one can now aim at the furthest goals...\nFN\nSils Maria, Upper Engadine, June 1885","torrent":{"xt":"urn:btih:be41b0dcf7a533abc27d51c7a93f8d9516b7dad9","amp;dn":"Beyond+Good+and+Evil+by+Friedrich+Wilhelm+Nietzsche+%5BrepublicV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be41b0dcf7a533abc27d51c7a93f8d9516b7dad9","infoHashBuffer":{"type":"Buffer","data":[190,65,176,220,247,165,51,171,194,125,81,199,169,63,141,149,22,183,218,217]},"announce":[],"urlList":[]}}