{"title":"An Early Frost (1985).avi","uid":4438318,"size":739407872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be6188c088a8594f6e91e6479f0ff3bab0afbc15&amp;dn=An+Early+Frost+%281985%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Ennead","files":1,"time":1223675738,"description":"Director: John Erman\nStarring: Aiden Quinn, Gena Rowlands, Ben Gazzara, D.W. Moffet\nRelease date: November 11, 1985\n\n\n\nSet in the mid-eighties, &quot;An Early Frost&quot; is the story of Michael Pierson, a young gay man who is struck with AIDS in the prime of his life. He&amp;#039;s forced to be open about the disease and his homosexuality for the first time with his co-workers (he&amp;#039;s a successful lawyer) and family. He, and the people around him, must face up to the inevitablity of his death and the disease that&amp;#039;s killing him. &quot;An Early Frost&quot; was many people&amp;#039;s first look at an AIDS victim as a human being instead of a statistic.\n\nAlthough &quot;An Early Frost&quot; was just a made-for-TV movie, it was the first major, broadly-viewed film to deal with the topic of AIDS. As a result, its production and airing were fraught with controversy. NBC insisted on heavy censorship, especially for any of the scenes between the lead character and his lover. Even so, many sponsors were afraid to purchase ad spots, and the network lost approximately $500,000 for that timeslot. In the end, though, it was clear that NBC had made a good call in putting faith in the movie. It garnered the number one spot in the Nielsen ratings when it aired, won 8 awards, and was nominated for 11 more.","torrent":{"xt":"urn:btih:be6188c088a8594f6e91e6479f0ff3bab0afbc15","amp;dn":"An+Early+Frost+%281985%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be6188c088a8594f6e91e6479f0ff3bab0afbc15","infoHashBuffer":{"type":"Buffer","data":[190,97,136,192,136,168,89,79,110,145,230,71,159,15,243,186,176,175,188,21]},"announce":[],"urlList":[]}}