{"title":"Coast to Coast AM May 17, 2013 - CIA And Mind Control","uid":8501068,"size":58066408,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:be9639a1fe5ab08817d25074761ef4127f604440&amp;dn=Coast+to+Coast+AM+May+17%2C+2013+-+CIA+And+Mind+Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"pyramid91","files":5,"time":1369297092,"description":"Note: These are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \nSo far, MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nDate:\n05-17-13\nHost:\nJohn B. Wells\nGuests:\nDr. Steve  Pieczenik,                   Open  Lines\nFilling in for George Noory, John B. Wells welcomed psycho-political thriller author Dr. Steve Pieczenik for a discussion on the CIA and mind control. Techniques used in 1950s and 60s involved breaking down an individual's mental and physical capacity through sleep deprivation and decreased food intake, he explained. Pieczenik likened this method of enhance interrogation to torture, calling it unethical and ineffective. &quot;It's much easier to make friends with [the person being interrogated] and create a relationship than to create... an empty brain which you then manipulate,&quot; he said. \nPieczenik suggested that prominent news anchors, such as Anderson Cooper, engage in a kind of mind control as they get their so-called &quot;scoops&quot; from the CIA. People in the covert world have no qualms about disseminating disinformation through the media, he revealed, noting that forces in any presidential administration create their own narratives independent of the truth. Pieczenik lamented the lack of accountability for government officials. He recommended listeners empower themselves by learning about pressing issues, questioning the official stories, and doing what they can to pressure legislators to affect change. \nPieczenik also spoke about his work as a psychiatrist and political scientist in the U.S. government, role in the Iranian hostage crisis, and how he assisted in the collapse of the Soviet Union. In addition, he echoed Mike Adam's (see below) warning against women getting preventative bilateral mastectomies based on a BRCA genetic test, noting how there is no correlation between the occurrence the BRCA gene and cancer. \nThe final hour of the program featured Open Lines. \nNews segment guest: Mike Adams commented on Angelina Jolie's announcement that she underwent a bilateral mastectomy to protect against breast cancer, and how it played a role in a corporate scheme to protect Myriad Genetics' multi-billion-dollar BRCA gene patents.\nWebsite(s):\n stevetalks.tv\nBook(s):\n Net Force\n War of Eagles\n Acts of War\n","torrent":{"xt":"urn:btih:be9639a1fe5ab08817d25074761ef4127f604440","amp;dn":"Coast+to+Coast+AM+May+17%2C+2013+-+CIA+And+Mind+Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be9639a1fe5ab08817d25074761ef4127f604440","infoHashBuffer":{"type":"Buffer","data":[190,150,57,161,254,90,176,136,23,210,80,116,118,30,244,18,127,96,68,64]},"announce":[],"urlList":[]}}