{"title":"The Ultimate South Park and Philosophy-  Respect My Philosophah!","uid":8777544,"size":1058107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf77c3b38a58eba30593d613b663e8f266ec3f8b&amp;dn=The+Ultimate+South+Park+and+Philosophy-++Respect+My+Philosophah%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"F1restorm","files":-1,"time":1375595731,"description":"The Ulimate South Park and Philosophy- Respect My Philosophah!\nEdited by: Robert Arp, Kevin S Decker, William Irwin\nPublished: June 27, 2013\nFormat: Epub and mobi\n\n_____________________________________________________________________\n\nEnlightenment from the &quot;South Park&quot; gang faster than you can say, &quot;Screw you guys, I'm going home!&quot;\n\n&quot;The Ultimate South Park and Philosophy: Respect My Philosophah!&quot; presents a compilation of serious philosophical reflections on the twisted insights voiced by characters in TV's most irreverent animated series.Offers readers a philosophically smart and candid approach to one of television's most subversive and controversial shows as it enters its 17th season. Draws sharp parallels between the irreverent nature of &quot;South Park&quot; and the inquiring and skeptical approach of Western philosophy. Journeys deep beyond the surface of the show's scatological humor to address the perennial questions raised in &quot;South Park&quot; and the contemporary social and political issues that inspire each episode. Utilizes familiar characters and episodes to illustrate such philosophical topics as moral relativism, freedom of expression, gay marriage, blasphemy, democracy, feminism, animal ethics, existential questions, and much more. It's a Bigger, Longer &amp; Uncut version of the highly acclaimed &quot;South Park and Philosophy: You Know, I Learned Something Today&quot;--and is guaranteed to be much funnier than killing Kenny....\n","torrent":{"xt":"urn:btih:bf77c3b38a58eba30593d613b663e8f266ec3f8b","amp;dn":"The+Ultimate+South+Park+and+Philosophy-++Respect+My+Philosophah%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf77c3b38a58eba30593d613b663e8f266ec3f8b","infoHashBuffer":{"type":"Buffer","data":[191,119,195,179,138,88,235,163,5,147,214,19,182,99,232,242,102,236,63,139]},"announce":[],"urlList":[]}}