{"title":"Isaac Asimov - Nine Tomorrows - Unb","uid":4811865,"size":223752297,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bfb0241dde3810bc87dde3c9696796ecdd8b9301&amp;dn=Isaac+Asimov+-+Nine+Tomorrows+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"RamJamSam","files":8,"time":1238409044,"description":"Isaac Asimov - Nine Tomorrows - Unb\nRead by: Jack Fox\nRuntime: 7 Hours and 46 Minutes\n\n\n\n\n\n\nPROFESSION: A fascinating study of a future society where one's profession is dictated by a computer according to a person's talents and aptitudes. Ideas that no longer look entirely futuristic. \n\nTHE FEELING OF POWER: The guy can do math in his head! A wry take on the effects of computing power on personal computational ability. \n\nTHE DYING NIGHT: A first-rate mystery story told in the milieu of science fiction. \n\nI'M IN MARSPORT WITHOUT HILDA: Like &quot;The Dying Night&quot; a story that demonstrates Asimov's ability to effortlessly cross genre boundaries. \n\nTHE GENTLE VULTURES: Watch out for the humans. Take any work by any modern science fiction author--Asimov has already been there and has often done the story better. \n\nALL THE TROUBLES IN THE WORLD: Artificial Intelligence issues that are still being debated today. \n\nSPELL MY NAME WITH AN S: About the societal impact of near infinite computing power and governmental intrusion into scientific research. \n\nTHE LAST QUESTION: Wow. A mindblower. This one is easily among the best science-fiction short stories ever written. Asimov's take on intelligence and the future of the universe. \n\nTHE UGLY LITTLE BOY: Time travel and human experimentation are combined in this gem that teaches us that our essential humanity is more important than any scientific achievement. \n\n\n\n\nGooD SeeDinG!\n","torrent":{"xt":"urn:btih:bfb0241dde3810bc87dde3c9696796ecdd8b9301","amp;dn":"Isaac+Asimov+-+Nine+Tomorrows+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb0241dde3810bc87dde3c9696796ecdd8b9301","infoHashBuffer":{"type":"Buffer","data":[191,176,36,29,222,56,16,188,135,221,227,201,105,103,150,236,221,139,147,1]},"announce":[],"urlList":[]}}