{"title":"Miles Davis - Water Babies (1967+) [Jazz][mp3 320][h33t][schon55","uid":4706840,"size":151242788,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c0491cf85e8f86ff0054e1d33016c63cbbdc6860&amp;dn=Miles+Davis+-+Water+Babies+%281967%2B%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"schon55","files":10,"time":1233882205,"description":"Miles Davis - Water Babies (1967+)\nRecorded in 1967\nOriginal Release Date: August 20, 2002 \nAudio CD: August 20, 2002 \nFormat: Original recording remastered \nLabel: Sony\nBitrate: 320 kbps \n\nWater Babies was one of the first albums to be released durings Miles's retirement in the late 70s. Columbia was digging through the archives and they packaged together two very different sessions. They used Corky McCoy's cartoons as cover art, but this music has very little in common with On the Corner.  The first three tracks are from June 1967 and feature the 2nd Great Quintet (Miles, Wayne Shorter, Herbie Hancock, Ron Carter, and Tony Williams). All 3 themes are by Shorter, and feature the same dry, exploratory style that this group perfected on its other LPs.  If you like the albums Sorcerer and Nefertiti, you'll enjoy this stuff as well. (Wayne also recorded 'Capricorn', 'Sweet Pea' and 'Water Babies' on his own album, Super Nova.)\n\nThe next three tracks (of which 'Splash' is a bonus track not on the original LP) were recorded in November 1968. By this time Dave Holland had replaced Carter on bass. Chick Corea and Herbie Hancock both play electric piano, giving the music a similar feel to Filles de Kilimanjaro though it doesn't match that album's excellence. 'Two Faced' is a haunting Shorter composition that runs for 18 minutes and features beautiful playing by Wayne and Miles. 'Dual Mr. Anthony...' is a typical late 60s boogaloo -- funky, a little heavy on the cheese factor and not really distinctive except for Tony Williams's explosive drumming and Wayne Shorter's fierce blowing. 'Splash' is also a boogaloo, though a little less cheesy.\n\nWater Babies doesn't really hang well as an album and I'd still recommend any of the Quintet's other 6 albums (E.S.P., Miles Smiles, Sorcerer, Nefertiti, Miles in the Sky, Filles de Kilimanjaro) over this one. The material is available elsewhere, on the '65-'68 and In a Silent Way box sets, if you prefer to hear it 'in context'. But overall the music is good enough that Miles fanatics who don't have the box sets will want to pick Water Babies up. ~ G B\n\nWATER BABIES is something of a curiosity in that it catches Miles Davis mid-stream between his standard acoustic jazz period and his notorious 'fusion' period. Recorded in 1967, it was not released until 1976 early in Miles 'retirement'. To those who curse the day Davis picked up on electronics, WATER BABIES comes as a bittersweet love letter. The first three cuts are Wayne Shorter compositions and they are done in acoustic fashion. While they are Shorter compositions, Shorter fans will note that these recordings are vastly different from those made for Shorter's own solo record, SUPER NOVA, two years later. This bears witness to the honesty of those who claim that Davis transformed everything he played and made them his own. The playing is impeccable and Wayne Shorter's tenor saxophone guides and blends with Davis' rise and fall horn dance. These fall well among the best Davis recordings up to that date. Certainly nothing to deserve the 'death threats' Davis would garner in the next several years. \n\nThe remaining three cuts bring Chick Corea and his electronic keyboards into the mix. From the standpoint of 2004, this was at best a timid fording into the 'fusion' river; but for many of the 'jazz orthodox' acoustic instruments are the gold standard of jazz and they accept no substitutes. Charges of jazz heresy would follow in any event. To my taste, I don't care for the tone of early electronic keyboards and their tendency to crowd all other instruments out of the room. But this to me is more a question of balance than an objection to the electronics themselves. My early objection to Corea's playing revolved around the fact that it totally obscured Hancock's playing in the mix. That was until I read that while Hancock is credited he was in fact not even there. I wonder why at this late date the album notes haven't been corrected if this was so; but in any event I stopped trying to listen for something that wasn't there. \n\n'Two Faced' is credited to Shorter while the remaining two cuts are Davis' own compositions. Many think 'Two-Faced' in the crown of WATER BABIES and I am prone to agree-although I have a particular fondness for 'Sweet Pea'. At eighteen minutes 'Two Faced' is a small foreshadowing of what was to follow in IN A SILENT WAY-[...]. \n\nAll reservations aside, WATER BABIES is a little treasure that should be enjoyed more widely than it is. It also shows Miles Davis not as a man who lost his chops-but rather a man who had already done 'it' all before and was turning to explore new worlds. WATER BABIES was Miles giving a fond farewell as his ship slipped from the docks of the old world. ~ Crabby Apple Mick Lee\n\nMiles Davis - Water Babies (1967+) Tracks:\n01  Water Babies 5:08\n02  Capricorn 8:28\n03  Sweet Pea 8:02  \n04  Two Faced 18:03\n05  Dual Mr. Anthony Tillmon Williams Process 13:22\n06  Splash 10:07","torrent":{"xt":"urn:btih:c0491cf85e8f86ff0054e1d33016c63cbbdc6860","amp;dn":"Miles+Davis+-+Water+Babies+%281967%2B%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0491cf85e8f86ff0054e1d33016c63cbbdc6860","infoHashBuffer":{"type":"Buffer","data":[192,73,28,248,94,143,134,255,0,84,225,211,48,22,198,60,187,220,104,96]},"announce":[],"urlList":[]}}