{"title":"Dazzler 1-42 (1981-1986) [Marvel] (Requested)","uid":7931413,"size":380708522,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c069f83266a47c99124a96912d977933609cc2f1&amp;dn=Dazzler+1-42+%281981-1986%29+%5BMarvel%5D+%28Requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackcanary","files":-1,"time":1355730677,"description":"English | CBZ and CBR | 42 Issues\n\nDazzler #1-42\nPublisher:  Marvel\nPublication Date:  March 1981 - March 1986\n\nThe sleek figure of the beautiful young singer named Alison Blaire, known to her audiences as the Dazzler, sprints down a dark alley as she is pursued by a carload of would-be assailants. She confronts, and nearly defeats the thugs single-handedly with only her wits, her agility and her still untrained mutant light powers. Things turn when one of the goons shoots her transistor radio, leaving Ali without a source for her powers. Luckily, Spider-Man is in the neighborhood and gives Alison a hand in subduing the bad guys.\n\nAlison heads home and starts feeling sorry for herself over her joblessness, poverty, lack of food and estrangement from her father, which was brought on by Alison's need for a career in music instead of one in law (like her father's). Confused and lonely, she calls friends and fellow mutants, the X-Men. Storm answers the phone and excitedly asks Ali if she has decided to give up music and join the X-Men, as they had previously requested. This unsettles Alison, who say's no, but isn't quite sure. She hangs up and starts to reminisce.\n\nThe flashback begins with a teenaged Ali being denied permission to sing in a talent competition at a school dance by her overly stern father. Her grandma Bella tells her to go anyway. It is there that Ali's mutant powers first manifest themselves as she sings onstage to a captivated audience when gang members break in and attack everyone. Using her light powers offensively for the first time, she loses control but resolves the situation safely. Throughout the following years, Ali divides her time equally between school and music, yet still manages to graduate college magna cum laude. Even so, two years later she finds herself here, jobless, hungry and poor and in total estrangement from her father.\n\nFar away in Asgard, home to the Norse Gods, a fierce warrior bravely battles past two giant ogres to gain entry into the castle of the Enchantress. Once inside, he throws himself at her feet only to be mocked, turned into a tree and dismissed by her. She turns her attention to her nearby Fountain of Forever, which foretells of an upcoming shift in the cosmic axis that will cause a dimensional rift to open. It's precise location is a New York dance club (disco) called Numero Uno, which Alison discovers (with help from the Beast) is auditioning singers. Because the Enchantress wants to infiltrate this place incognito, she also auditions, using her magic to sway the club owner's decision. Dazzler begs for an audition and gets her chance. Despite the Enchantress' magic, Dazzler out sings her and gets the job, perhaps in part to her own powers. A humiliated Enchantress busts out a wall and storms off vowing revenge.\n\nBeauty and the Beast #1-4 (1984-1985): &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/3976252/Beauty_and_the_Beast_01-04&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/3976252/Beauty_and_the_Beast_01-04&lt;/a&gt;\n\nDazzler (One-Shot) (2010): &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5594975/Dazzler_(One-Shot)_(2010)_(Minutemen-Sha-Pic_)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5594975/Dazzler_(One-Shot)_(2010)_(Minutemen-Sha-Pic_)&lt;/a&gt;","torrent":{"xt":"urn:btih:c069f83266a47c99124a96912d977933609cc2f1","amp;dn":"Dazzler+1-42+%281981-1986%29+%5BMarvel%5D+%28Requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c069f83266a47c99124a96912d977933609cc2f1","infoHashBuffer":{"type":"Buffer","data":[192,105,248,50,102,164,124,153,18,74,150,145,45,151,121,51,96,156,194,241]},"announce":[],"urlList":[]}}