{"title":"All Creatures Great and Small series by James Herriot","uid":9421614,"size":15868341,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0f41d48938f50714385b6c557483440520a02fe&amp;dn=All+Creatures+Great+and+Small+series+by+James+Herriot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"7","files":-1,"time":1388601380,"description":"Overview:\n\nAll Creatures Great and Small (All Creatures Great and Small #1)\nFor over 25 years-- since All Creatures Great and Small was first published-- readers have delighted to the storytelling genius of James Herriot, the Yorkshire veterinarian whose fascinating vignettes brim with the wonder of life, animal and human.\nWhether struggling mightily to position a calf for birthing, or comforting a lonely old man whose beloved dog and only companion has died, Herriot's heartwarming and often hilarious stories of his first years as a country vet perfectly depict the wonderful relationship between man and animal-- and they intimately portray a man whose humor, compassion, and love of life are truly inspiring. [First published in the UK as 2 books: If Only They Could Talk and It Shouldn't Happen to a Vet]\n\nAll Things Bright and Beautiful (All Creatures Great and Small #2)\nMillions of readers have delighted in the wonderful storytelling and everyday miracles of James Herriot in the over thirty years since his delightful animal stories were first introduced to the world.\nAll Things Bright and Beautiful is the beloved sequel to Herriot's first collection, All Creatures Great and Small, and picks up as Herriot, now newly married, journeys among the remote hillside farms and valley towns of the Yorkshire Dales, caring for their inhabitants---both two- and four-legged. Throughout, Herriot's deep compassion, humor, and love of life shine out as we laugh, cry, and delight in his portraits of his many, varied animal patients and their equally varied owners. [First published in the UK as 2 books: Let Sleeping Vets Lie and Vet in Harness]\n\nAll Things Wise and Wonderful (All Creatures Great and Small #3)\nIn the midst of World War II, James is training for the Royal Air Force, while going home to Yorkshire whenever possible to see his very pregnant wife, Helen. Musing on past adventures through the dales, visiting with old friends, and introducing scores of new and amusing character--animal and human alike--Herriot enthralls with his uncanny ability to spin a most engaging and heartfelt yarn. [First published in the UK as 2 books: Vets Might Fly and Vet in a Spin]\n\nThe Lord God Made Them All (All Creatures Great and Small #4)\nWith each book more embraceable than the last, James Herriot once again brings us the magical beauty of Yorkshire through his heartwarming experiences as a country veterinarian. These new stories provide a grand finale to the wonderful books that began with all Creatures Great and Small.\nIt is just after World War II, and James has returned from the R.A.F. to do battle with the diseases and injuries that befall the farm animals and pets of Skeldale and the surrounding moors. Four-year-old Jimmy Herriot, Humphrey Cobb and his little beagle Myrtle, Norman the book-loving veterinary assistant, and many more new faces join old favorites among the green hills of Yorkshire, as James takes an unforgettable voyage to Russia on a freighter with 383 pedigreed sheep. Touching our hearts with laughter and wisdom, lifting our spirits with compassion and goodness, James Herriot never fails to delight.\n\nEvery Living Thing (All Creatures Great and Small #5)\nJames Herriot has captivated millions of readers and television viewers with tales of the triumphs, disasters, pride and sometimes heartache that filled his life as a vet in the Yorkshire Dales. &quot;Every Living Thing&quot; shines with the captivating storytelling that has made James Herriot a favourite the world over.\nHere is a book for all those who find laughter and joy in animals, and who know and understand the magic of wild places and beautiful countryside.\n\n\nGenre :  Fiction, General\n","torrent":{"xt":"urn:btih:c0f41d48938f50714385b6c557483440520a02fe","amp;dn":"All+Creatures+Great+and+Small+series+by+James+Herriot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0f41d48938f50714385b6c557483440520a02fe","infoHashBuffer":{"type":"Buffer","data":[192,244,29,72,147,143,80,113,67,133,182,197,87,72,52,64,82,10,2,254]},"announce":[],"urlList":[]}}