{"title":"Don't Starve - Six Feet Under (October 1st, 2013 Update)","uid":9006417,"size":110193213,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1b6e7c7cb7fbe1b7f4312a90fe9fe57668bf16e&amp;dn=Don%27t+Starve+-+Six+Feet+Under+%28October+1st%2C+2013+Update%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"brdigetrlol","files":-1,"time":1381038727,"description":"NOTE: This torrent has merely been re-uploaded here and is not my own work. The torrent was originally downloaded by me from:However I have tested it and it appears to be working, but should you have any issues I am largely unable to help with any troubleshooting.\n\nGeneral\n\nYou can now dig up turf that is underneath a road.\n\nCreatures\n\nAdded a worm enemy to the caves.\nThe Ancient Guardian has a new short range melee attack that it will use when its target is close.\nRooks can no longer instantly kill any monster in the game during a charge.\nFollowers will have an easier time keeping up with their leader.\nFire hounds are now freezable, but with a higher resistance than normal.\nIce hounds are now burnable.\n\nWorld\n\nDEATH IN THE CAVES NOW WORKS AS IT DOES IN THE OVER WORLD. IF YOU DIE YOUR SAVE FILE WILL BE DELETED.\nYou can no longer regenerate caves.\nFollowers will follow you between cave levels.\nTime is synced across cave levels.\nResurrection mechanics work between cave levels.\nCave world generation changes:\nImproved cave generation. Areas should feel more unique.\nAdded a couple new biomes:\nRed and Green fungus forests\nSunken Swamps\nThe nightmare has further influenced the caves. Fissures can be found throughout.\nSpilagmites work like rocks and can be totally destroyed.\nAdded new art for the entrance to the ruins.\n\nItems\n\nThe worm drops a magical food item.\nThe Thulecite Crown has a new magical effect.\nFire darts can now target non-burnable creatures, but will not do damage. You can use them to thaw frozen creatures.\n\nControls\n\nController support added! A few screens and objects still need to be implemented, but the game is mostly playable with a controller. Expect to see improvements in controller functionality within the next update.\n\nBug Fixes\n\nWilson no longer says &quot;It's getting late, I should make a fire&quot; while in the caves.\nWilson will no longer say &quot;It's too bright out.&quot; when attempting to use a sleeping item in the caves during the day time.\nSanity loss no longer changes based on time of day in the caves.\nMacTusk can now pathfind back to his camp if he's led very far away from it.\nImproved graphical effects on MacTusks projectile.\nBeefalo will now wake up when they're on fire.\nYou can no longer trade with sleeping pigs.\nRemoved small holes in cave worlds that were previously pillars.\nPlayer now reacts to bee and mosquito attacks.\nCancelling a placement while wielding an item with a right click action will no longer trigger that action.","torrent":{"xt":"urn:btih:c1b6e7c7cb7fbe1b7f4312a90fe9fe57668bf16e","amp;dn":"Don%27t+Starve+-+Six+Feet+Under+%28October+1st%2C+2013+Update%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1b6e7c7cb7fbe1b7f4312a90fe9fe57668bf16e","infoHashBuffer":{"type":"Buffer","data":[193,182,231,199,203,127,190,27,127,67,18,169,15,233,254,87,102,139,241,110]},"announce":[],"urlList":[]}}