{"title":"We Are Catchers (2014) [FLAC]","uid":9825858,"size":240896113,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c24a7fab5a36ea867244a2dce441bf6b4530e7ff&amp;dn=We+Are+Catchers+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1395775550,"description":"\n  We Are Catchers (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Waters Edge\n  02 Tap Tap Tap\n  03 If You Decide\n  04 Isabella\n  05 The Fear\n  06 Over the Hill\n  07 If I Fell\n  08 Thousand Steps\n  09 Richer Man\n  10 Where We Are\n\n  We Are Catchers is built around the piano and vocals of Liverpool resident Peter Jackson. He writes hooky little tunes that have the bounce and feel of early Harry Nilsson and the loose warmth of a Beach Boys demo session. So far so good, right. If Jackson's first album had been just him, his piano and ten songs that sound like the magical intersection of Laurel Canyon singer/songwriter craft and Brill Building snap, things would have been just fine. You would have walked away humming tunes like the instantly memorable &quot;Isabella&quot; and the peppy &quot;Tap Tap Tap.&quot; The end result is all that and more. Working with Bill Ryder-Jones (formerly of the Coral), Austin Murphy, Richard Formby, and Henry Broadhead, with production by himself, Ryder-Jones, and Darren Jones, We Are Catchers builds a small world of echoing sound to cushion Jackson's jolly piano and quietly yearning vocals. \n\n  The backing vocal harmonies, minimal drums, lonesome slide guitars, and other undisclosed instruments are so saturated with reverb that they billow around the melodies like ghostly swarms of warmth and comfort. It could have been recorded in an elevator shaft at the Brill Building or at the bottom of Laurel Canyon, it's that deep and intimate at once. Jackson's choice to record his songs this way gives them an emotional depth and impact they might not have had otherwise; sometimes hiding your feels behind a wall of protective musical coating just means the listener has to listen a bit harder and will get drawn in more deeply. It's far preferable to being hit over the head with big emotional songs that spell everything out lyrically and musically. We Are Catchers lets you choose your level of engagement: listen to the pretty tunes or dig in and feel something. Either way, listening to the album is a treat and those who like their pop soft as clouds should find plenty to love.\n","torrent":{"xt":"urn:btih:c24a7fab5a36ea867244a2dce441bf6b4530e7ff","amp;dn":"We+Are+Catchers+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c24a7fab5a36ea867244a2dce441bf6b4530e7ff","infoHashBuffer":{"type":"Buffer","data":[194,74,127,171,90,54,234,134,114,68,162,220,228,65,191,107,69,48,231,255]},"announce":[],"urlList":[]}}