{"title":"Six Days In June - The War That Defined The Middle East (2007) [","uid":11444568,"size":1080450829,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2bf02a1319813eefcf2a2efdd373dc752228183&amp;dn=Six+Days+In+June+-+The+War+That+Defined+The+Middle+East+%282007%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ChaosCon","files":1,"time":1415840311,"description":"&quot;Six Days In June&quot; chronicles the events of the &quot;Six-Day War&quot; of 1967, forty years later, with a fresh historical perspective. Beginning with the buildup for the war, and the political and military maneuvering of Israeli Prime Minister Levi Eshkol and Egyptian President Jame Adel Nasser, the film takes us through the six days of fighting, the war with Jordan, the occupation of the West Bank and the annexation of Jerusalem.\n\nThe shooting lasted only six tense days in June 1967, but the Six Day War has never really ended. Every crisis that has ripped through this region in the ensuing decades stems from those six fateful days. On its 40th anniversary (in 2007), the region remains trapped in conflict and is every bit as explosive as it was in 1967. &quot;Six Days In June&quot; chronicles the events of forty years ago with a fresh historical perspective. Beginning with the buildup for the war, and the political and military maneuvering of Israeli Prime Minister Levi Eshkol and Egyptian President Jame Adel Nasser, the film takes us through the six days of fighting, the war with Jordan, the occupation of the West Bank and the annexation of Jerusalem. Featuring stunning archival footage and first-hand accounts of the war from both the Israeli and Arab soldiers who fought it, &quot;Six Days&quot; explores how these events became the flash point in history that reshaped the regional political landscape, destroyed old systems and brought new forces to the surface. Rarely in modern times has so short and localized a conflict had such profound global consequences.\n\nFormat: MPEG-4 at 1 265 Kbps, 1030.40 MiB for 1h 53mn\nVideo: AVC, 720x368 (4:3), 23.976 fps at 1 100 Kbps\nCodec: avc1 (x264 core 130), Progressive\nAudio 1: AAC, 2 channels, 48.0 KHz at 160 Kbps, English\nSubtitles: English\n\nScreenshots: http://i.imgur.com/y3fJpEb.png","torrent":{"xt":"urn:btih:c2bf02a1319813eefcf2a2efdd373dc752228183","amp;dn":"Six+Days+In+June+-+The+War+That+Defined+The+Middle+East+%282007%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2bf02a1319813eefcf2a2efdd373dc752228183","infoHashBuffer":{"type":"Buffer","data":[194,191,2,161,49,152,19,238,252,242,162,239,221,55,61,199,82,34,129,131]},"announce":[],"urlList":[]}}