{"title":"Rik Mayall &amp; Ade Edmondson - Dangerous Brothers Present - World","uid":5131594,"size":524648448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c4234254fb9dd87d6df7494a9d9da87ed4fe0fb3&amp;dn=Rik+Mayall+%26+Ade+Edmondson+-+Dangerous+Brothers+Present+-+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Atilla82","files":1,"time":1256084497,"description":"Rik Mayall &amp; Ade Edmondson - Dangerous Brothers Present - World Of Danger (VHS Rip 1986).avi\n\n\n\nThe Dangerous Brothers was an early stage and TV act by anarchic comedy duo Rik Mayall and Ade Edmondson, performing respectively as &quot;Richard Dangerous&quot; and &quot;Sir (or occasionally Lady) Adrian Dangerous&quot;. They appeared in a number of brief sketches in the 1980s TV programme Saturday Live.\n\nThe act was, in essence, a prototype of the career which the pair were to forge over the next twenty years in such shows as Mr Jolly Lives Next Door, Filthy, Rich and Catflap and Bottom- two low-life loser perverts hitting each other in spectacular slapstick ways. It was arguably more hazardous than much of the material which was to follow in later incarnations - stage props in the brief run included a live (and very large, although apparently lethargic) crocodile, blank-firing submachine guns, and Edmondson apparently consuming Vim, a well-known UK brand of powder toilet cleaner. One of the early sketches went wrong when a stunt to set fire to Edmondson's trousers left him with serious burns - although much of this was left on the broadcast version.\n\nSketches included\n\n   * World Of Danger (AKA The Towering Inferno)\n   * Big Stunt\n   * Torture - featuring Norman Lovett\n   * Crocodile Snogging (which featured a live crocodile)\n   * Flying Zebra\n   * Exploding Politicians (in which Richard Dangerous attempts to become the 41st           President of the United States of America)\n   * How To Get Off With A Lady - featuring Edmondson's wife Jennifer Saunders\n   * Babysitting - featuring Morwenna Banks as the wife.\n   * Dangervision\n   * Kinky Sex\n\nThe Dangerous Brothers were notorious for their unpredictable antics, once even interrupting The Flower Arranging Sketch being performed live by Stephen Fry &amp; Hugh Laurie, Fry &amp; Laurie told The Dangerous Brothers they had been banned and they left only to return moments later disguised as The Ben Elton Brothers. One of the final sketches prepared for Saturday Live was entitled 'Kinky Sex'. This fell foul of Channel 4 censors who banned it. The duo responded by apparently hijacking the programme and blowing up the wall on which the show's logo was painted in graffiti art. The sketch, which by modern standards seems fairly tame, was finally released on a compilation video The Dangerous Brothers present: World of Danger.\n\nSeveral Dangerous Brothers sketches are also included on the DVD compilation Saturday Live: The Best of Series One.\n\n\nAVI File Details\n========================================\nName.........: Rik Mayall - Adrian Edmondson - Dangerous Brothers.avi\nFilesize.....: 500 MB (or 512,352 KB or 524,648,448 bytes)\nRuntime......: 01:16:20 (114,492 fr)\nVideo Codec..: DivX 5.0\nVideo Bitrate: 848 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-2 Layer 3\nAudio Bitrate: 64 kb/s (32/ch, stereo) CBR\nframe Size...: 448x336 (1.33:1) [=4:3]\n\nThis is not my rip so thanks to Muncher who was the original ripper.\nPlease be aware the quality is not amazing as it is an old vhs rip because this series is not available on dvd but it is very very watchable indeed, plus it's also a chance to see where the idea for their programmes like Bottom etc came from......\n","torrent":{"xt":"urn:btih:c4234254fb9dd87d6df7494a9d9da87ed4fe0fb3","amp;dn":"Rik+Mayall+%26+Ade+Edmondson+-+Dangerous+Brothers+Present+-+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4234254fb9dd87d6df7494a9d9da87ed4fe0fb3","infoHashBuffer":{"type":"Buffer","data":[196,35,66,84,251,157,216,125,109,247,73,74,157,157,168,126,212,254,15,179]},"announce":[],"urlList":[]}}