{"title":"I Wake up Screaming - 1941 - Multisubs - mp4","uid":8119638,"size":1343369511,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4423193530551b21c93279025208e250abe0b18&amp;dn=I+Wake+up+Screaming+-+1941+-+Multisubs+-+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mawricio_br","files":6,"time":1360367481,"description":"               Well-known New York sports promoter Frankie Christopher  is the prime suspect in the murder of Vicky Lynn , a successful model and would-be actress. Questioned relentlessly by the police, and particularly by hulking detective squad commander Ed Cornell , he maintains his innocence. Meanwhile, Vicky's sister Jill  is also being questioned.\n             I Wake Up Screaming is often described as Hollywood's first film noir: the first movie to feature the mix of dark psychology and mystery, not to mention the ominous mood of threat surrounding its protagonists that came to define that category of film. It's also arguably the best movie ever made by its director H. Bruce Humberstone, displaying unexpected elements of dramatic flair and creativity on the part of a director usually known for his straightforward approach to his pictures.\n             Overall, I Wake Up Screaming represents its maker's best work, Grable's most interesting performance, one of Mature's most complex roles, and a high point for Cregar, as well as being successful and opening the door for a new kind of thriller, drawing audiences into new levels of sophistication in their viewing.\n\nDirector: H. Bruce Humberstone\nStars: Betty Grable, Victor Mature, Carole Landis\n\n\nRuntime: 82 min\nmp4\nSample\nSubtitles .srt : Portuguese, French, Spanish, English\n\n\n* Converted from torrent posted by &quot;pirpawn&quot; (Thanks !)","torrent":{"xt":"urn:btih:c4423193530551b21c93279025208e250abe0b18","amp;dn":"I+Wake+up+Screaming+-+1941+-+Multisubs+-+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4423193530551b21c93279025208e250abe0b18","infoHashBuffer":{"type":"Buffer","data":[196,66,49,147,83,5,81,178,28,147,39,144,37,32,142,37,10,190,11,24]},"announce":[],"urlList":[]}}