{"title":"June Rain - Jabbour Douaihy","uid":10736679,"size":882358,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c46bcdeabd3606c8196684e734c7982cf80c2ee7&amp;dn=June+Rain+-+Jabbour+Douaihy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1407700114,"description":"On 16 June 1957, a shoot-out in a village church in northern Lebanon leaves two dozen people dead. In the aftermath of the massacre, the town is rent in two: the Al-Ramis in the north and their rivals the Al-Samaeenis in the south. But lives once so closely intertwined cannot easily be divided. Neighbours turn into enemies and husbands and wives are forced to choose between loyalty to each other and loyalty to their clan. Drawing on an actual killing that took place in his home town, Douaihy reconstructs that June day from the viewpoints of people who witnessed the killing or whose lives were forever altered by it. A young girl overhears her father lending his gun to his cousins, but refusing to accompany them to the church. A school boy walks past the dead bodies, laid out in the town square on beds brought out from the houses. A baker whose shop is trapped on the wrong side of the line hopes the women who buy his bread will protect him. At the center of the portrait is Eliyya, who, twenty years after emigrating to the US, returns to the village to learn about the father who was shot through the heart in the massacre, the father he never knew. With a masterful eye for detail, Douaihy reconstructs that fateful June Sunday when rain poured from the sky and the traditions and affections of village life were consumed by violence and revenge.","torrent":{"xt":"urn:btih:c46bcdeabd3606c8196684e734c7982cf80c2ee7","amp;dn":"June+Rain+-+Jabbour+Douaihy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46bcdeabd3606c8196684e734c7982cf80c2ee7","infoHashBuffer":{"type":"Buffer","data":[196,107,205,234,189,54,6,200,25,102,132,231,52,199,152,44,248,12,46,231]},"announce":[],"urlList":[]}}