{"title":"Mary Berrys Absolute Favourites-S01E01-WebDL-HD-x264","uid":11927595,"size":527532944,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c483cb3525b722d25d663ce3147339817aef1baf&amp;dn=Mary+Berrys+Absolute+Favourites-S01E01-WebDL-HD-x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"uggauga","files":2,"time":1431738416,"description":"Mary Berry's Absolute Favourites - Episode 1\n\nIn this delightful six-part series, the nation's best-loved home cook draws on her wealth of cookery know-how to share a selection of her absolute favourite recipes. Each week, Mary draws inspiration from a favourite place, one where she loves to spend time, and cooks up tried and tested crowd pleasers as well as a bounty of new dishes that are easy to make, yet guaranteed to impress all your family and friends.\n\nIn the first programme, Mary draws on inspiration from some of her earliest and fondest memories from her childhood holidays and regular trips to the British seaside. To start, Mary prepares some delicious goat's cheese and shallot tarts with a different, but delectable, walnut pastry - perfect for a picnic hamper or day out at the sea. To follow, a family favourite - her right royal crab and cod fishcakes with tomato salsa, followed by a special dinner party classic of sea bass with brown shrimp and caper sauce.\n\nAs well as cooking her seaside favourites, Mary visits the Botany Bay on the Kent coast, where she indulges in one her favourite seaside passions, prawning, before cooking up a new dish of seafood linguini that she's really come to adore. Finally, Mary visits an ice cream parlour in Broadstairs that has hardly changed since she was a child. This inspires her to create her favourite ice cream treat - a knickerbocker glory that's both easy to make and guaranteed to have everyone asking for more.\n\n****************\n\nNew series - Enjoy","torrent":{"xt":"urn:btih:c483cb3525b722d25d663ce3147339817aef1baf","amp;dn":"Mary+Berrys+Absolute+Favourites-S01E01-WebDL-HD-x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c483cb3525b722d25d663ce3147339817aef1baf","infoHashBuffer":{"type":"Buffer","data":[196,131,203,53,37,183,34,210,93,102,60,227,20,115,57,129,122,239,27,175]},"announce":[],"urlList":[]}}