{"title":"King-Energy Machine of T. Henry Moray-Zero-Point Energy&amp;Pulsed P","uid":5111867,"size":13173893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c497af2717d1b15adf386274ec2c66072ed90986&amp;dn=King-Energy+Machine+of+T.+Henry+Moray-Zero-Point+Energy%26Pulsed+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1254859534,"description":"This is Moray B. King's amazing book The Energy Machine of T. Henry Moray - Zero-Point Energy and Pulsed Plasma Physics (2005) which not only brings the little-known and amazing discoveries and inventions of T. Henry Moray to reader's attention, but introduces new energy developments up to the present day. In the 1920s T. Henry Moray invented a &quot;free energy&quot; device that reportedly output 50 kilowatts of electricity. It could not be explained by standard science at that time. The electricity exhibited a strange &quot;cold current&quot; characteristic where thin wires could conduct appreciable power without heating. Moray suffered ruthless suppression and in 1939 the device was destroyed. Other inventors have discovered this approach (sometimes unwittingly) and created novel energy devices, but they too were suppressed. The common pattern of their technologies clarified the fundamental operating principle. The purpose of this book is to inspire engineers and inventors so that a new energy source can become available to mankind. King shows how the technologies behind Moray's inventions are resurfacing in the hands of contemporary scientists and validating Moray's findings. He also keeps our interest up by exploring the science behind the inventions, weaving the strands into a plausable theory of how all this untapped, &quot;sea of energy&quot; can be accessed for an almost cost and pollution free source of electricity and power so badly needed by the world. 190 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:c497af2717d1b15adf386274ec2c66072ed90986","amp;dn":"King-Energy+Machine+of+T.+Henry+Moray-Zero-Point+Energy%26Pulsed+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c497af2717d1b15adf386274ec2c66072ed90986","infoHashBuffer":{"type":"Buffer","data":[196,151,175,39,23,209,177,90,223,56,98,116,236,44,102,7,46,217,9,134]},"announce":[],"urlList":[]}}