{"title":"(PSX-PSP) Capcom vs. SNK: Millennium Fight 2000 Pro converted pr","uid":5044790,"size":366363636,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:c4dc52445ffe613a14cb3c39a78f707ac2802090&amp;dn=%28PSX-PSP%29+Capcom+vs.+SNK%3A+Millennium+Fight+2000+Pro+converted+pr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1249575880,"description":"CAPCOM vs SNK - MILLENNIUM FOGHT 2000 PRO:\n\nCAPCOM VS. SNK PRO is the challenge of the millennium, with two monster corporations at war only one solution. A massive martial arts event organized to settle the score and eliminate all conflict between the two parties. Many of the world's most famous warriors have joined and the public is going mad with anticipation. Join over 30 brawlers from Capcom's legendary STREET FIGHTER and SNK's world-renowned KING OF FIGHTERS series as they fight for universal domination. CAPCOM VS. SNK PRO is the ultimate collision of strength and power.\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS... Like my work?? Please read the NFO and support me ;)\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com","torrent":{"xt":"urn:btih:c4dc52445ffe613a14cb3c39a78f707ac2802090","amp;dn":"%28PSX-PSP%29+Capcom+vs.+SNK%3A+Millennium+Fight+2000+Pro+converted+pr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4dc52445ffe613a14cb3c39a78f707ac2802090","infoHashBuffer":{"type":"Buffer","data":[196,220,82,68,95,254,97,58,20,203,60,57,167,143,112,122,194,128,32,144]},"announce":[],"urlList":[]}}