{"title":"The Jim Henson Hour RESTORED Smokey Robinson / Inner Tube Pilot","uid":9078614,"size":4814198013,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c5e0349a1cc94d5e489003f5b2097e3f6851e196&amp;dn=The+Jim+Henson+Hour+RESTORED+Smokey+Robinson+%2F+Inner+Tube+Pilot+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":212,"time":1382344188,"description":"The Jim Henson Hour Episode 107\n&quot;Health and Fitness&quot; with Smokey Robinson\nSpecial: Song of the Cloud Forest\n\nInner Tube TV (Jim Henson Hour Pilot)\nThe Jim Henson Hour Pitchreel (Jim Henson Hour Second Pilot)\n\nThe Cosby Show &quot;Cliff's Nightmare&quot; January 11, 1990 (Excerpt)\n\nBeautifully restored by the acclaimed editor of The Thief and the Cobbler: Recobbled Cut, this is the best copy of these Jim Henson Hour episodes you're likely to see unless they receive some sort of official DVD release. Multiple rare VHS sources were painstakingly cleaned and combined, with DVD and laserdisc sources used where possible.\n\nArguably, The Jim Henson Hour showed the Muppet team at their creative peak, with remarkable live-action fantasy like The Storyteller sharing space with Kermit and the Muppet gang. It was an ideal showcase for what they were capable of. \n\nHowever, when NBC showed the series in 1989 it failed in the ratings and was quickly cancelled, with some episodes going unaired. Although certain Jim Henson projects from this era have made it to DVD, VHS, and VOD [The Storyteller, Song of the Cloud Forest, Miss Piggy's Hollywood], no complete and uncut Jim Henson Hour episode has ever been released on DVD or any other format, with two known exceptions - two very rare KSS laserdiscs of Dog City and Monster Maker, dubbed in Japanese.\n\nThe first half of most episodes featured MuppetTelevision, with Kermit, Gonzo, Fozzie, Miss Piggy and new characters in the high-tech Inner Tube TV control room, with celebrity guests. The second half of most episodes were fantasy specials. Often the series had an environmental message.\n\n\n--\n\nThe Jim Henson Hour Episode 107\n&quot;Health and Fitness&quot; with Smokey Robinson\n\nAt Muppettelevision, Kermit tries to get the band in shape. But Digit gets a cold, the chickens catch sneezing fits, and Link Hogthrob worries that he has Canadian snout fever. Smokey Robinson and Solid Foam perform &quot;Just to See Her&quot; and &quot;Jump (For My Love.&quot; Rowlf the Dog (as Merlin the Magician), Bunsen and Beaker (of Muppet Labs), and The Swedish Chef (with Jacques Roach) appear.\n\nSpecial: Song of the Cloud Forest\n\nIn the rainforest, Milton the Golden Toad worries that he may be the last of his species alive, and he'll never find a mate to love. A beautiful piece with an environmental message.\n\n--\n\nInner Tube is a 10 minute pilot for The Jim Henson Hour, written in 1987 by David Misch. Directed by Jim Henson, the show includes original music and lyrics by Phil Ramone, Bob Halligan and Phil Galdston.\n\nThe show is similar in format to the MuppeTelevision segments of The Jim Henson Hour. Kermit the Frog and Miss Piggy make brief appearances in the show, but the focus is on the new characters. According to writer David Misch, the pilot was not meant to resemble The Muppet Show; Kermit was merely given a role when it became hard for Henson to sell the series.\n\n--\n\nThe Jim Henson Hour Pitch Reel is a 12Â½ minute video hosted by Jim Henson from The NY Muppet Workshop. Surrounded by all sorts of Muppet and Creature Shop creatures from previous productions, Henson explains the early concept of The Jim Henson Hour. This pitch tape was written by Jerry Juhl and Bill Prady.\n\nThe pitch tape was shot on September 25, 1988.\n\n--\n\nThe Cosby Show &quot;Cliff's Nightmare&quot; January 11, 1990 (Excerpt)\n\nBill Cosby has a nightmare featuring characters from The Jim Henson Hour.\n\n\n--\n\nSpecial Features:\n\nBehind the Scenes of &quot;Song of the Cloud Forest&quot; (5 min)\n\nEpisode Trailers: Dog City, KD Lang, Buster Pointdexter, Ted Danson\n\nSmokey Robinson episode alternate mono audio track\n\nAlternate Edits: Kermit introduces Smokey Robinson, Miss Piggy works out, Crasher breaks through\n\n\n\n---\n\n\nAlso available: Dog City, Monster Maker, KD Lang, Buster Pointdexter\n","torrent":{"xt":"urn:btih:c5e0349a1cc94d5e489003f5b2097e3f6851e196","amp;dn":"The+Jim+Henson+Hour+RESTORED+Smokey+Robinson+%2F+Inner+Tube+Pilot+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5e0349a1cc94d5e489003f5b2097e3f6851e196","infoHashBuffer":{"type":"Buffer","data":[197,224,52,154,28,201,77,94,72,144,3,245,178,9,126,63,104,81,225,150]},"announce":[],"urlList":[]}}