{"title":"[Ken_A._Priebe]The Advanced Art of Stop-Motion Animation(pdf){Zz","uid":11047764,"size":22987941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5ece2500337e2ab19dd5743172c567a4736778f&amp;dn=%5BKen_A._Priebe%5DThe+Advanced+Art+of+Stop-Motion+Animation%28pdf%29%7BZz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410973743,"description":"Take an in-depth look at the art and techniques of stop-motion animation. The Advanced Art of Stop-Motion Animation helps experienced stop-motion artists enhance their craft by exploring the professional methods and advanced technology used by top film studios today. This book features expanded coverage of the basic principles of animation, including specific applications for character performance and visual effect compositing techniques. All the newest technology is touched on, including detailed information on camera rigs, effects, and shooting stop-motion in stereoscopic 3D. Discover new puppet building techniques, including the technology behind the rapid prototyping of computer models for stop-motion production. You'll even find a thorough history of early feature-length stop-motion films. The practical techniques and skills presented are enhanced by interviews with many of the most celebrated stop-motion artists as well as coverage of the work of several artists working in the online stop-motion community. Whether your focus is low-budget indie filmmaking or big studio productions, The Advanced Art of Stop-Motion Animation provides a comprehensive look at both the latest methods and the artists who are driving the revival of stop-motion animation.\n\nPublisher: Cengage Learning PTR; 1 edition (June 17, 2010)\nLanguage: English\nISBN-10: 1435456130\nISBN-13: 978-1435456136\n\nEditorial Reviews\nReview\nIntroduction. 1. History of Stop-Motion Feature Films. 2. An Interview with Screen Novelties. 3. Building Puppets. 4. Digital Cinematography. 5. An Interview with Pete Kozachik, ASC. 6. An Interview with Trey Thomas. 7. Character Animation. 8. An Interview with Bronwen Kyffin. 9. Visual Effects. 10. An Interview with Larry Bafia and Webster Colcord. 11. An Interview with Marc Spess. 12. An Interview with Ryan McColluch. 13. An Interview with Justin &amp; Shel Rasch. Bibliography. Index.\nAbout the Author\nKen A. Priebe has a BFA from University of Michigan and a classical animation certificate from Vancouver Institute of Media Arts (VanArts). He teaches stop-motion animation courses at VanArts and the Academy of Art University Cybercampus and has worked as a 2D animator on several games and short films for Thunderbean Animation, Bigfott Studios, and his own independent projects. Ken has participated as a speaker and volunteer for the Vancouver ACM SIGGRAPH Chapter and is founder of the Breath of Life Animation Festival, an annual outreach event of animation workshops for children and their families. He is also a filmmaker, writer, puppeteer, animation historian, and author of the book &quot;The Art of Stop-Motion Animation.&quot; Ken lives near Vancouver, BC, with his graphic-artist wife Janet and their two children, Ariel and Xander. ","torrent":{"xt":"urn:btih:c5ece2500337e2ab19dd5743172c567a4736778f","amp;dn":"%5BKen_A._Priebe%5DThe+Advanced+Art+of+Stop-Motion+Animation%28pdf%29%7BZz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5ece2500337e2ab19dd5743172c567a4736778f","infoHashBuffer":{"type":"Buffer","data":[197,236,226,80,3,55,226,171,25,221,87,67,23,44,86,122,71,54,119,143]},"announce":[],"urlList":[]}}