{"title":"DJ Jazzy Jeff - The Magnificent (2002) [MP3-192Kbps] !!!","uid":4614474,"size":113338991,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c641c40cfebb1dfc5a39da46ef7bb0198909cb5c&amp;dn=DJ+Jazzy+Jeff+-+The+Magnificent+%282002%29+%5BMP3-192Kbps%5D+%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"frostyfreeze","files":19,"time":1230764760,"description":"damn, here it is... after being stuck @ 1.6% forever on the other torrent you know what i mean - kind of low bitrate, my apologies but i did not encode this.  sounds great so just be happy to finally be bumpin' this, mad PROPS to the original uploader, RNS!!  Tight, old skool hip-hop joints with the real...\n\ncapitalism is a form of economic slavery - much love, frosty\n\nps&gt; if you only came to leech this and run you should stick with the other torrent and get the 1.6% you deserve - it's all about SHARING, if i didn't share this you would not even have it &amp; i'm not the only one on here with a computer and an isp, the burden is not all on me so like, put out...\n\nLOVE the SEEDERS!!! seed, seed, seed... til your eye dem bleed!!!\n\n\nDJ Jazzy Jeff - The Magnificent\n\n1. The Magnificent - featuring Pauly Yamz &amp; Baby Blak\n2. Shake It Off - featuring Chef Word\n3. For The Love of Da Game - featuring Pauly Yamz &amp; Baby Blak\n4. How I Do - featuring Shawn Stockman (Boyz II Men)\n5. Break It Down - featuring J-Live\n6. Musik Lounge - featuring Odyssey\n7. Rock Wit U - featuring Erro\n8. Scram - featuring Freddie Foxxx\n9. My People - featuring Raheem\n10. Know Ur Hood - featuring Pauly Yamz &amp; Chef Word\n11. Love Saviour - featuring Flo Brown &amp; Raheem\n12. Mystery Man - featuring The Last Emperor\n13. We Are - featuring Cy Young &amp; Raheem\n14. A Charmed Life - featuring J-Live\n15. We Live In Philly - featuring Jill Scott\n16. In Time - featuring V\n\n\nEditorial Reviews\n\nAmazon.com\nThis solo joint from DJ Jazzy Jeff, which follows other &quot;Beat Generation&quot; albums by Jay Dee, Marley Marl, and Pete Rock, sees JJ come up with a textured album steeped in jazz, soul, and funk. Jeff has enjoyed a long and distinguished career in the rap game after his time with Will &quot;Fresh Prince&quot; Smith--he started his own production company A Touch of Jazz a few years ago--and his expertise comes shining through in this slickly produced affair, all cavernous bass lines, tight, hypnotic beats, and gorgeously unhurried feel, with guests ranging from the fresh to the famous. Names like Jill Scott, Boyz II Men's Shawn Stockman, J-Live, and ?uestlove from the Roots supply a rich selection of R&amp;B croons and MC flows, and while there's not much for the headbangers here, anyone looking for something silky, soulful, and seductive will find The Magnificent a massive aphrodisiac. --Paul Sullivan\n\nProduct Description\n'The Magnificent' is the long awaited debut solo album from legendary turntablist &amp; producer DJ Jazzy Jeff. Having worked behind the scenes on a number of projects over the years, DJ Jazzy Jeff is now stepping out of the shadows of his production company; A Touch of Jazz to bring you a ground breaking new album reflecting the rich musical heritage of Philadelphia. 'The Magnificent' features guest appearances from Jill Scott, Shaun Stockman from Boyz II Men, Freddie Foxxx, J-Live, The Last Emperor &amp; ?uestlove from the Roots as well as showcasing the many talented artists at A Touch Of Jazz. It is an album that takes you on a musical journey through all genres of urban music, from old skool hip hop, smooth R'n'B &amp; rap through to soulful spoken word &amp; deep house. K7. 2002.\n","torrent":{"xt":"urn:btih:c641c40cfebb1dfc5a39da46ef7bb0198909cb5c","amp;dn":"DJ+Jazzy+Jeff+-+The+Magnificent+%282002%29+%5BMP3-192Kbps%5D+%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c641c40cfebb1dfc5a39da46ef7bb0198909cb5c","infoHashBuffer":{"type":"Buffer","data":[198,65,196,12,254,187,29,252,90,57,218,70,239,123,176,25,137,9,203,92]},"announce":[],"urlList":[]}}