{"title":"Robert Spencer - The Truth About Muhammad Unabridged Audiobook","uid":6322745,"size":292798510,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c689bd5730b61702f4ec6a73a86b81862db394a7&amp;dn=Robert+Spencer+-+The+Truth+About+Muhammad+Unabridged+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"phosphorousredeemer666","files":42,"time":1302990844,"description":"The Truth About Muhammad: Founder of the World's Most Intolerant Religion (2006) is a controversial book by Robert Spencer, the director of Jihad Watch and Dhimmi Watch.\nIn the book the author proposes to present a &quot;scrupulously accurate account of what Muhammad said and did&quot; from the writings of the early biographers of Muhammad such as Ibn Ishaq, Ibn Sa'd al-Baghdadi, Muhammad ibn Jarir al-Tabari as well as the Qur'an and the hadith collections of Bukhari and Muslim. In the examination of the early sources, Spencer gives his view on the events of Muhammad's life which are invoked by contemporary Islamic clerics, governments, advocates and Sheikh Yusuf al-Qaradawi today as a standard for their behaviour.\nThe book aims to draw a connection between Muhammad's legacy and modern day practices like child marriages and divorce laws, punishments such as stoning for adultery and amputation for theft, execution for apostasy as well as the jihad and dhimmi doctrines adopted towards non-Muslims, as found in some parts of the Muslim world.","torrent":{"xt":"urn:btih:c689bd5730b61702f4ec6a73a86b81862db394a7","amp;dn":"Robert+Spencer+-+The+Truth+About+Muhammad+Unabridged+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c689bd5730b61702f4ec6a73a86b81862db394a7","infoHashBuffer":{"type":"Buffer","data":[198,137,189,87,48,182,23,2,244,236,106,115,168,107,129,134,45,179,148,167]},"announce":[],"urlList":[]}}