{"title":"Cross - James Patterson-viny","uid":6415941,"size":767291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6896a651007b759f4c9ef00d176c99ba60871e9&amp;dn=Cross+-+James+Patterson-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"daemonx0x","files":-1,"time":1306160881,"description":"Cross - James Patterson-viny\n\nAlex Cross was a rising star in the Washington, DC, Police Department when an unknown shooter gunned down his wife, Maria, in front of him. The killer was never found, and the case turned cold, filed among the unsolved drive-bys in D.C.'s rough neighborhoods.\n\nYears later, still haunted by his wife's death, Cross is making a bold move in his life. Now a free agent from the police and the FBI, he's set up practice as a psychologist once again. His life with Nana Mama, Damon, Jannie, and little Alex is finally getting in order. He even has a chance at a new love.\n\nThen Cross's former partner, John Sampson, calls in a favor. He is tracking a serial rapist in Georgetown, one whose brutal modus operandi recalls a case Sampson and Cross worked together years earlier. When the case reveals a connection to Maria's death, Cross latches on for the most urgent and terrifying ride of his life.\n\nFrom the man USA TODAY has called the &quot;master of the genre,&quot; CROSS is the high-velocity thriller James Patterson and Alex Cross's fans have waited years to read--and the pinnacle of the bestselling detective series of the past two decades.","torrent":{"xt":"urn:btih:c6896a651007b759f4c9ef00d176c99ba60871e9","amp;dn":"Cross+-+James+Patterson-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6896a651007b759f4c9ef00d176c99ba60871e9","infoHashBuffer":{"type":"Buffer","data":[198,137,106,101,16,7,183,89,244,201,239,0,209,118,201,155,166,8,113,233]},"announce":[],"urlList":[]}}