{"title":"Animated Realism (2011).pdf Gooner","uid":13258272,"size":22140192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6ea0e1c7cbfa9ebc60f3a40f0bf25c3c95c4551&amp;dn=Animated+Realism+%282011%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1453237883,"description":"Animated Realism - A Behind The Scenes Look at the Animated Documentary Genre - 1st Edition (2011).pdf Gooner\r\n\r\nPublisher: Focal Press; 1 edition (November 29, 2011)\r\nLanguage: English\r\nISBN-10: 0240814398\r\nISBN-13: 978-0240814391\r\n\r\nWith the development and accessibility of animation tools and techniques, filmmakers are blurring the boundaries between documentary filmmaking and animation. The intimacy, imperfection and charm of the animated form is providing live-action and animation directors with unique ways to tell stories, humanize events and convey information not easily adapted for live-action media. Animated Realism presents animation techniques as they apply to the documentary genre with an inspirational behind-the-scenes look at award-winning animated documentaries. Animators and documentary filmmakers alike will learn how to develop a visual style with animation, translate a graphic novel into a documentary and use 3D animation as a storytelling tool, all in the context of creating animated documentaries.\r\n\r\nWith insight and inspiration, Animated Realism includes interviews from industry luminaries like John Canemaker, Oscar Winning Director of The Moon and the Son, Yoni Goodman, Animation Director of Oscar Nominated Waltz with Bashir and Chris Landreth, Oscan Winning creator of Ryan.  Packed with beautiful, instructive illustrations and previously unpublished material (including storyboards, photos and hand-drawn sketches) and interspersed with interviews - this is an exceptional source of inspiration and knowledge for animators, students and fans alike. With a companion website featuring animated shorts from leading animated documentaries, animators, students and documentary filmmakers will be able to analyze and apply Oscar-winning animation techniques to their own films","torrent":{"xt":"urn:btih:c6ea0e1c7cbfa9ebc60f3a40f0bf25c3c95c4551","amp;dn":"Animated+Realism+%282011%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ea0e1c7cbfa9ebc60f3a40f0bf25c3c95c4551","infoHashBuffer":{"type":"Buffer","data":[198,234,14,28,124,191,169,235,198,15,58,64,240,191,37,195,201,92,69,81]},"announce":[],"urlList":[]}}