{"title":"GearCity v1.19","uid":13199691,"size":931480212,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c75672dcd5683598e5138dffcea6d7775e149595&amp;dn=GearCity+v1.19&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dauphong","files":1,"time":1452533412,"description":"Have you ever dreamed of running your own car company? Do you often find yourself drawing vehicle designs on the margins of your papers? Ever wondered what it would be like to be the next Henry Ford or Enzo Ferrari? Now you can with GearCity.\r\n\r\nGearCity is an Automobile Manufacturing Business Simulator. Design chassis, engines, transmissions, and vehicles. Manage production lines, supplies, prices, and employees. Build factories and distribution branches. Set marketing and racing budgets, and most importantly stay profitable. All while hundreds of AI marques attempt to do the same thing.\r\n\r\nGearCity offers a wide variety of design choices and near endless amounts of freedom when running your company. Do you want to make a pickup truck marque in Africa? A Russian supercar company? A German luxury brand? Maybe you want to be a generic marque in America? Or a budget car company in China? Let your imagination free and choose your own path.\r\n\r\nArmed with a realistic economic simulator with historical purchasing power parity per capita, population, and economic data for over 250 cities, GearCity aims to be a hardcore realistic business simulator. This is not a typical casual tycoon game. Instead GearCity is a modern descendant of the classic 90s management games Detroit and MotorCity. Despite the fidelity of the simulation, once you get the hang of the game it is fairly simple and easy to play. You can choose a more abstract style, or dive deep and micromanage every detail","torrent":{"xt":"urn:btih:c75672dcd5683598e5138dffcea6d7775e149595","amp;dn":"GearCity+v1.19","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c75672dcd5683598e5138dffcea6d7775e149595","infoHashBuffer":{"type":"Buffer","data":[199,86,114,220,213,104,53,152,229,19,141,255,206,166,215,119,94,20,149,149]},"announce":[],"urlList":[]}}