{"title":"Wings &amp; Co Fairy Detective Agency Books 1 &amp; 2 by Sally G","uid":11202104,"size":24017961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c781360df06e42b96eda6966a0115b0664f95601&amp;dn=Wings+%26amp%3B+Co+Fairy+Detective+Agency+Books+1+%26amp%3B+2+by+Sally+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gratefuldawg77","files":8,"time":1413184555,"description":"#1 Operation Bunny\nA brand-new quirky series about a fairy detective agency brimming with mystery and magic by million-copy selling author Sally Gardner, and illustrated by bestselling artist, David Roberts.\n\nEmily Vole makes headline news in the first weeks of her life, when she is found in an abandoned hatbox in Stansted Airport.\n\nThen, only a few years later, her neighbour Mrs String dies leaving Emily a mysterious inheritance: an old shop, a small bunch of golden keys and a cat called Fidget. It's the beginning of an adventure of a lifetime as the old Fairy Detective Agency comes back to life.\n\nIt is up to Emily to reopen the shop, and recall the fairies to duty. Together they must embark on their first mystery and do battle with their great fairy-snatching enemy, Harpella.\n\n#2 The Three Pickled Herrings\nAt the Wings &amp; Co. Fairy Detective Agency, Emily Vole and her friends are beginning to worry. It's five months since their official opening and they still haven't had one case. Then local landowner Sir Walter Cross dies suddenly and mysteriously. The detectives suspect fairy meddling. And when Mr Rollo the tailor mysteriously loses everything and Pan Smith's wedding plans are ruined the night before her big day, they're convinced there must be magic at play. Now they have not one, but three pickled herrings to deal with! Can they solve the mystery of who is stealing people's luck before the meddling fairy goes too far?","torrent":{"xt":"urn:btih:c781360df06e42b96eda6966a0115b0664f95601","amp;dn":"Wings+%26amp%3B+Co+Fairy+Detective+Agency+Books+1+%26amp%3B+2+by+Sally+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c781360df06e42b96eda6966a0115b0664f95601","infoHashBuffer":{"type":"Buffer","data":[199,129,54,13,240,110,66,185,110,218,105,102,160,17,91,6,100,249,86,1]},"announce":[],"urlList":[]}}