{"title":"Talisman: Digital Edition v4.000","uid":11035452,"size":277102117,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c7a696fb1aa0bf351c74cddcefb01d2c680fe92f&amp;dn=Talisman%3A+Digital+Edition+v4.000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lamasu","files":-1,"time":1410789507,"description":"Talisman: Digital Edition -- The Magical Quest Game for 1 to 4 players.\nThe officially licensed multiplayer version of the classic fantasy adventure board game, Talisman.\nIn Talisman: Digital Edition, there are 14 characters a player can control, from the heroic Warrior to the powerful Sorceress. In this perilous adventure, players battle it out to journey across a dangerous land and be the first to claim the Crown of Command, a magical artefact with the power to destroy all rivals and make the bearer the true ruler of the kingdom. On your travels, you will need strength, courage and some good dice rolls to survive the dangers you face and beat your opponents to the centre of the board.\n\nFeatures:\n- Multiplayer modes for up to 4 players.\n- Play against AI opponents.\n- 14 characters to choose from. \n- 17 powerful spells to cast.\n- Detailed, interactive tutorial.\n\nWhat is Talisman?\nImagine Monopoly with Dragons! Instead of moving around a board purchasing properties and making your opponents bankrupt, you're moving around the board building up your character's strength and magic power by battling monsters, finding treasures, completing quests and trying to be the first player to reach the center space -- the Crown of Command.\n\nHow is Talisman: Digital Edition different to Talisman: Prologue?\nTalisman: Prologue is a single-player only game in which you tried to complete a series of challenges using the rules of Talisman. Talisman: Digital Edition is the full board game experience for up to 4 players, using the same rules as the board game. \n\nDoes the multiplayer work in this version?\nYes, it does.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://store.steampowered.com/app/247000&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/247000&lt;/a&gt;","torrent":{"xt":"urn:btih:c7a696fb1aa0bf351c74cddcefb01d2c680fe92f","amp;dn":"Talisman%3A+Digital+Edition+v4.000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a696fb1aa0bf351c74cddcefb01d2c680fe92f","infoHashBuffer":{"type":"Buffer","data":[199,166,150,251,26,160,191,53,28,116,205,220,239,176,29,44,104,15,233,47]},"announce":[],"urlList":[]}}