{"title":"[VivThomas MetArt] Arian , Cristal Caitlin (The Heat - Reloaded","uid":15699018,"size":781915920,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c7b23b0b38a68526dd32a544a80b828928098bc8&amp;dn=%5BVivThomas+MetArt%5D+Arian+%2C+Cristal+Caitlin+%28The+Heat+-+Reloaded+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"distinc","files":1,"time":1472461519,"description":"[VivThomas MetArt] Arian &amp; Cristal Caitlin (The Heat - Reloaded Episode 4 - Vivid) [2016 , 720p]\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4652549122\r\n \nhttp://imagedisco.net/?g=944276122\r\n\r\n\r\nPlot:\r\n\r\nActress Name: Arian &amp; Cristal Caitlin\r\nSubsites and site: VivThomas.com / MetArt.com\r\n\r\nProduction year: 2016\r\nGenre: Lesbian sex, Face sitting, Cunnilingus, Fingering, Kissing, Red hair\r\nDuration: 00:23:51\r\n\r\nDescription: Cristal Caitlin writhes in the skimpiest of bikinis, the azure thong so small it cuts between her labia, while redheaded Arian seduces the camera in her black underwear, her small breasts free, her tight black thong riding deep between her ass cheeks. Cristal's hand slides inside her bikini briefs, rubbing her clit and spreading her juices. When the girls come together, they have changed into matching outfits of black T-shirts and cotton panties. Cristal dances sexily for Arian while she lies on the bed watching, a hand inside her panties. Arian eases off her briefs, the cotton peeling away from her hairless pussy, moistness making it stick. She gropes at her pussy, sliding two fingers bestride her clit, spreading herself open, then easing two fingers inside and fucking herself to a noisy orgasm, bucking against her hand as she comes. Arian thanks her friend for the dance the only way she knows how, by pulling her onto the bed and kissing her passionately. Cristal responds lustily and Arian pulls off her football shirt and rubs her pussy through her white cotton panties. Once she's naked, Cristal rolls the redhead onto her back and straddles her face. Arian sucks Cristal's labia greedily into her mouth, then laps hungrily at her pink hole, while the blonde pulls her hood back and offers her engorged clit to tongue. Her pussy is so sensitive that she spasms at the slightest touch, climbing off her lover's face and making a beeline for her quim. She licks her from hole to hood, then wets her fingers in her own mouth and smears them over Arian's pussy. As she becomes increasingly wet, Cristal spreads Arian's legs wide and slips a finger between her pussy lips. She adds a second, kissing and licking Arian's clitoris before the redhead takes over, grinding her palm into her clit as Cristal's fingers bring another orgasm from her lover's loins. Arian is insatiable, uncovering a double ended dildo from beneath her pillow. The sex toy slides easily into her hole, the second head at an angle that allows her to slip her panties back on and use it like a cock on her blonde friend. She rolls Cristal onto her side and enters her from behind, thrusting harder and harder into her, squeezing her breasts and pulling her back onto the plastic prick. Cristal comes hard and slides slowly off the cock, a few last grinds against the tip on her clit. When Arian is dressed and ready to leave, Cristal wants more of her, bending her over the dining table and spanking her lightly. She lifts Arian's dress over her ass and kisses her cheek before slapping her harder and harder. Naughty girls need spanking ...\r\n\r\nType of HD Video: 720p\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 1280x720 23.976fps 4238kbps\r\nAudio: AAC 48000Hz stereo 128kbps","torrent":{"xt":"urn:btih:c7b23b0b38a68526dd32a544a80b828928098bc8","amp;dn":"%5BVivThomas+MetArt%5D+Arian+%2C+Cristal+Caitlin+%28The+Heat+-+Reloaded+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7b23b0b38a68526dd32a544a80b828928098bc8","infoHashBuffer":{"type":"Buffer","data":[199,178,59,11,56,166,133,38,221,50,165,68,168,11,130,137,40,9,139,200]},"announce":[],"urlList":[]}}