{"title":"Rush Limbaugh Is A Big Fat Idiot by Al Franken [EPUB] [PDF]","uid":10116936,"size":1673608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7dc6677a3048f111a9f9dd3591ebbba4aa908d2&amp;dn=Rush+Limbaugh+Is+A+Big+Fat+Idiot+by+Al+Franken+%5BEPUB%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1399603092,"description":"Title: Rush Limbaugh Is A Big Fat Idiot And Other Observations\nAuthor: Al Franken\nGenre: Non-Fiction\nHardcover: 271 pages\nPublisher: Delacorte Press; First Edition edition (January 1, 1996)\nLanguage: English\nISBN-10: 0385314744\nISBN-13: 978-0385314749\n\nPromotional info/publisher's summary: &quot;In the grand satirical tradition of Swift, Rabelais, and Twain comes...\n\nRush Limbaugh Is a Big Fat Idiot, and Other Observations...\n\na scathing--but uncompromisingly fair--look at America's largest talk show host and the rest of the Republican right.\n\n        Penned by the Emmy award-winning Saturday Night Live writer whom John Podhoretz of the New York Post has called &quot;the man responsible for some of the most brilliant political satire of our time,&quot; Rush Limbaugh Is a Big Fat Idiot tackles the issues--and the politicians--in ways few have dared...\n        Exploding Medicare Costs: &quot;Why not shoot the elderly into space?  Stay with me.  Because I'm not just thinking about the budget here.  I'm talking about science.  Just think how many more manned space operations NASA could undertake if they didn't have to worry about getting the astronauts back.&quot;\n        Crime: &quot;I have a radical gun-buyback idea that I guarantee would be a huge success.  Here's how it works: hand in a gun, get a free vial of crack.&quot;\n        Newt Gingrich: &quot;Many of us, like Newt, have acknowledged smoking dope and reading Toffler in the early 70s.  But after reading his book, I think Newt's dirty little secret is that he smoked dope and watched The Jetsons.&quot;\n        Phil Gramm: &quot;If you get beyond the fact the Gramm is ugly, mean, hypocritical, has a boob fetish, and drives his wife like a mule, he does have a certain folksy charm.&quot;\n        On the subject of Rush Limbaugh, Franken lets the facts speak for themselves. Listen to Rush, the &quot;rugged individualist&quot; and enemy of government handouts, explain how his second wife made him stop sitting around the house eating just food and go file for unemployment insurance.  And learn all of Rush's several explanations for how he avoided the draft.\n        Of course, when it comes to draft-dodging Republicans, Rush isn't alone. Reading Al's Vietnam short story, &quot;Operation Chickenhawk,&quot; you'll savor the exploits of Privates Limbaugh, Gramm, Quayle, Buchanan, Gingrich, and George Will as Lieutenant Oliver North leads them kicking and screaming into combat.\n        And don't miss Al's informative discussion with the man who has &quot;the easiest job in America&quot;: Rush Limbaugh's fact-checker.  And much, much more.&quot;\n\nReview - &quot;Rush Limbaugh claims his talent is on loan. With this book, Franken demonstrates that he owns. The frankly Democratic author's shtick reminds us how much of a free ride conservatives have gotten in the mainstream media. For instance, he really drives home the weirdness of the conservatives' preachiness about &quot;family values&quot; in light of Newt Gingrich's and Bob Dole's first marriages, and Rush Limbaugh's first, second and third marriages. And he has great fun with Rush's and Newt's miraculous draft deferments in a chapter where he imagines all of the great conservative &quot;chicken-hawks&quot; out on a Vietnam war patrol under the leadership of Ollie North.&quot;\n\nThis torrent contains the original PDF version of the book as well as a converted EPUB by Calibre which is readable although the spacing is odd. The generated metadata.opf file as well as the front cover is also included. Please seed and enjoy! ","torrent":{"xt":"urn:btih:c7dc6677a3048f111a9f9dd3591ebbba4aa908d2","amp;dn":"Rush+Limbaugh+Is+A+Big+Fat+Idiot+by+Al+Franken+%5BEPUB%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7dc6677a3048f111a9f9dd3591ebbba4aa908d2","infoHashBuffer":{"type":"Buffer","data":[199,220,102,119,163,4,143,17,26,159,157,211,89,30,187,186,74,169,8,210]},"announce":[],"urlList":[]}}