{"title":"[Ulrich Müller]Symmetry Relationships between Crystal Struc","uid":11200089,"size":6415733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7e1198b2f5b341d8e63e7bf14cf16ec8d0d6a02&amp;dn=%5BUlrich+M%26uuml%3Bller%5DSymmetry+Relationships+between+Crystal+Struc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413160333,"description":"Review\nStructural crystallographers in biology, chemistry and physics meet symmetry and sometimes relatively complicated cases. More can be made of symmetry relations too. This book takes the reader beyond structure. The book shows how to make use of the symmetry relations described in International Tables as well as understand e.g. crystal structure types, analyse phase transitions, domain formation and twinning in crystals as well as to avoid errors in crystal structure determinations such as choice of incorrect space group. Numerous chapter exercises are a distinctive feature and offer the possibility to apply the material that has been learnt; solutions to the exercises are at the end of the book. (John R. Helliwell, School of Chemistry, The University of Manchester)\nProduct Description\nIn crystal chemistry and crystal physics, the relations between the symmetry groups (space groups) of crystalline solids are of special importance. Part 1 of this book presents the necessary mathematical foundations and tools: the fundamentals of crystallography with special emphasis on symmetry, the theory of the crystallographic groups, and the formalisms of the needed crystallographic computations. Part 2 gives an insight into applications to problems in crystal chemistry. With\nthe aid of numerous examples, it is shown how crystallographic group theory can be used to make evident relationships between crystal structures, to set up a systematic order in the huge amount of known crystal structures, to predict crystal structures, to analyse phase transitions and topotactic\nreactions in the solid state, to understand the formation of domains and twins in crystals, and to avoid errors in crystal structure determinations.\n\nA broad range of end-of-chapter exercises offers the possibility to apply the learned material. Worked-out solutions to the exercises can be found at the end of the book.","torrent":{"xt":"urn:btih:c7e1198b2f5b341d8e63e7bf14cf16ec8d0d6a02","amp;dn":"%5BUlrich+M%26uuml%3Bller%5DSymmetry+Relationships+between+Crystal+Struc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7e1198b2f5b341d8e63e7bf14cf16ec8d0d6a02","infoHashBuffer":{"type":"Buffer","data":[199,225,25,139,47,91,52,29,142,99,231,191,20,207,22,236,141,13,106,2]},"announce":[],"urlList":[]}}