{"title":"Ki &amp; Ka (2016)-BD.Rip-1080p-HEVC-x265.DTSHD.Esubs-DDR","uid":15104543,"size":7532014290,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c8e8a90411182bcfd5176c6637ec6ba99d0d26b1&amp;dn=Ki+%26amp%3B+Ka+%282016%29-BD.Rip-1080p-HEVC-x265.DTSHD.Esubs-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"SaM","files":2,"time":1466973713,"description":"Presenting a DDR Anniversary Upload\r\n\r\n\r\nKI &amp; KA (2016)\r\n(A film by R Balki)\r\n\r\nHindi - BD.Rip - 1080p - 1920x816 (2.35:1)- 7.01 GB - x.265.DTSHD-MA.Esubs - 2 Hrs:03 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n\r\n \nhttp://extraimago.com/image/a5rT \nhttp://extraimago.com/image/a5rN \nhttp://extraimago.com/image/a5r2 \nhttp://extraimago.com/image/a5rw \nhttp://extraimago.com/image/a5ra \nhttp://extraimago.com/image/a5r8 \nhttp://extraimago.com/image/a5pf \nhttp://extraimago.com/image/a5pW \nhttp://extraimago.com/image/a5pA \nhttp://extraimago.com/image/a5pv \nhttp://extraimago.com/image/a5pu \nhttp://extraimago.com/image/a5pV \nhttp://extraimago.com/image/a5p6\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/a5PI\r\n\r\nSynopsis:\r\nKia (kareena Kapoor) is a high flying marketing executive who refuses to let marriage and domesticity intervene in her career. Karan (Arjun Kapoor) dreams of being a caregiver and a homemeker as his mother was. The twain meet and decide to get merried.\r\n\r\nAt fisrst all is well as Kia keeps going up the ladder of success in her job and Karan manages their home, does the cooking, supervises their maid etc. Then one day, they decide to buy the house they live in. To make ends meet Karan takes up a job as a Gym instructor.\r\n\r\nWord gets round of this unusual couple and karan is inundated with requests for interviews and TV appearances. As he gets famous, the house gets neglected and Kia becomes resentful..\r\n\r\nwhat happens is the story of the film..\r\n\r\nComments:\r\nR balki has given us a number of offbeat films like Cheeni Kum and Paa and this is a continuation of his efforts to search out unusual themes. The film starts out well and the first half, where the reversal of roles is detailed out, is actually quite absorbing. But then things go haywire, for the Director cannot rise above cliches - and every scene in the second half is cliche ridden.\r\n\r\nKareena holds the film together with some fine acting, particularly in scenes of high drama. Karan does well in part. The rest, including the Bachchans, are passerbys.\r\n\r\nStrangely music by Illyaraja is quite ordinary. Cinematography throws up some pretty pictures but is on the whole pedestrian. Editing is good.\r\n\r\nOn the whole, a movie which takes up an interesting theme but stays at the superficial level..\r\n\r\nUploader's Notes:\r\nThis is full size (1080p) HEVC rip of the movie. Ic comes with a full DTSHD-Master Audio sound and a picture quality that matches anything else on the net. Take a look at the sample provided and the screenshots to get an idea of the amount of detail that has been preserved and the care with which grain has been adjusted to give you the full impact of the picture. We have also done a minor adjustment of the colours to make them more like the screen colours - based on the trailers of the movie.\r\n\r\nThe 10-bit compressibility and the magic of x265, allowed us to compress the video to just 7 GB and yet maintain full quality.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on most stand-alone devices. You can only watch this on a computer or a compatible device. On your computer be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4744086/","torrent":{"xt":"urn:btih:c8e8a90411182bcfd5176c6637ec6ba99d0d26b1","amp;dn":"Ki+%26amp%3B+Ka+%282016%29-BD.Rip-1080p-HEVC-x265.DTSHD.Esubs-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8e8a90411182bcfd5176c6637ec6ba99d0d26b1","infoHashBuffer":{"type":"Buffer","data":[200,232,169,4,17,24,43,207,213,23,108,102,55,236,107,169,157,13,38,177]},"announce":[],"urlList":[]}}