{"title":"Computational Aspects of Structural Acoustics and Vibration - (M","uid":6437671,"size":7129187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c92288ff9972f1afbad13ad484053cf53d96eddb&amp;dn=Computational+Aspects+of+Structural+Acoustics+and+Vibration+-+%28M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"malestrom_HH","files":-1,"time":1306849771,"description":"Goran Sandberg, Roger Ohayon &quot;Computational Aspects of Structural Acoustics and Vibration&quot;\nSpringer Vienna | English | 2009-03-16 | ISBN: 3211896503 | 276 pages | PDF \n\n\nComputational methods within structural acoustics, vibration and fluid-structure interaction are powerful tools for investigating acoustic and structural-acoustic problems in many sectors of industry; in the building industry regarding room acoustics, in the car industry and aeronautical industry for optimizing structural components with regard to vibrations characteristics etc. It is on the verge of becoming a common tool for noise characterization and design for optimizing structural properties and geometries in order to accomplish a desired acoustic environment. The book covers the field of computational mechanics, and then moved into the field of formulations of multiphysics and multiscale.\n\nThe book is addressed to graduate level, PhD students and young researchers interested in structural dynamics, vibrations and acoustics. It is also suitable for industrial researchers in mechanical, aeronautical and civil engineering with a professional interest in structural dynamics, vibrations and acoustics or involved in questions regarding noise characterization and reduction in building, car, plane, space, train, industries by means of computer simulations. ","torrent":{"xt":"urn:btih:c92288ff9972f1afbad13ad484053cf53d96eddb","amp;dn":"Computational+Aspects+of+Structural+Acoustics+and+Vibration+-+%28M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c92288ff9972f1afbad13ad484053cf53d96eddb","infoHashBuffer":{"type":"Buffer","data":[201,34,136,255,153,114,241,175,186,209,58,212,132,5,60,245,61,150,237,219]},"announce":[],"urlList":[]}}