{"title":"The Poison King: The Life and Legend of Mithradates, Rome's Dead","uid":7494736,"size":913934975,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c961f8342d24b1490698b5800a460ce3fc27284d&amp;dn=The+Poison+King%3A+The+Life+and+Legend+of+Mithradates%2C+Rome%27s+Dead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ut1880h","files":2,"time":1343844430,"description":"Machiavelli praised his military genius. European royalty sought out his secret elixir against poison. His life inspired Mozart's first opera, while for centuries poets and playwrights recited bloody, romantic tales of his victories, defeats, intrigues, concubines, and mysterious death. But until now no modern historian has recounted the full story of Mithradates, the ruthless king and visionary rebel who challenged the power of Rome in the first century BC. In this richly illustrated book--the first biography of Mithradates in fifty years--Adrienne Mayor combines a storyteller's gifts with the most recent archaeological and scientific discoveries to tell the tale of Mithradates as it has never been told before.\n\nThe Poison King describes a life brimming with spectacle and excitement. Claiming Alexander the Great and Darius of Persia as ancestors, Mithradates inherited a wealthy Black Sea kingdom at age fourteen after his mother poisoned his father. He fled into exile and returned in triumph to become a ruler of superb intelligence and fierce ambition. Hailed as a savior by his followers and feared as a second Hannibal by his enemies, he envisioned a grand Eastern empire to rival Rome. After massacring eighty thousand Roman citizens in 88 BC, he seized Greece and modern-day Turkey. Fighting some of the most spectacular battles in ancient history, he dragged Rome into a long round of wars and threatened to invade Italy itself. His uncanny ability to elude capture and surge back after devastating losses unnerved the Romans, while his mastery of poisons allowed him to foil assassination attempts and eliminate rivals.\n\nThe Poison King is a gripping account of one of Rome's most relentless but least understood foes.\n","torrent":{"xt":"urn:btih:c961f8342d24b1490698b5800a460ce3fc27284d","amp;dn":"The+Poison+King%3A+The+Life+and+Legend+of+Mithradates%2C+Rome%27s+Dead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c961f8342d24b1490698b5800a460ce3fc27284d","infoHashBuffer":{"type":"Buffer","data":[201,97,248,52,45,36,177,73,6,152,181,128,10,70,12,227,252,39,40,77]},"announce":[],"urlList":[]}}