{"title":"The Corporation: The Pathological Pursuit of Profit and Power eb","uid":8372050,"size":434621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c96f8e9a7f79c0db050ce83c93bc6176ff5a8dce&amp;dn=The+Corporation%3A+The+Pathological+Pursuit+of+Profit+and+Power+eb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"shunster","files":1,"time":1365946370,"description":"The Corporation: The Pathological Pursuit of Profit and Power ebook pdf\n\nOver the last 150 years the corporation has risen from relative obscurity to become the world's dominant economic institution. Eminent Canadian law professor and legal theorist Joel Bakan contends that today's corporation is a pathological institution, a dangerous possessor of the great power it wields over people and societies.\n\nIn this revolutionary assessment of the history, character, and globalization of the modern business corporation, Bakan backs his premise with the following observations:\n\n    The corporation's legally defined mandate is to pursue relentlessly and without exception its own economic self-interest, regardless of the harmful consequences it might cause to others.\n\n    The corporation's unbridled self-interest victimizes individuals, society, and, when it goes awry, even shareholders and can cause corporations to self-destruct, as recent Wall Street scandals reveal.\n\n    Governments have freed the corporation, despite its flawed character, from legal constraints through deregulation and granted it ever greater authority over society through privatization. \n\nBut Bakan believes change is possible and he outlines a far-reaching program of achievable reforms through legal regulation and democratic control. (Lots of luck)\n\nFeaturing in-depth interviews with such wide-ranging figures as Nobel Prize winner Milton Friedman, business guru Peter Drucker, and cultural critic Noam Chomsky, The Corporation is an extraordinary work that will educate and enlighten students, CEOs, whistle-blowers, power brokers, pawns, pundits, and politicians alike.\n\nPurchase option: http://www.amazon.com/gp/search?ie=UTF8&amp;keywords=0743247469&amp;tag=amazonnoir-20&amp;index=books&amp;linkCode=ur2&amp;camp=1789&amp;creative=9325","torrent":{"xt":"urn:btih:c96f8e9a7f79c0db050ce83c93bc6176ff5a8dce","amp;dn":"The+Corporation%3A+The+Pathological+Pursuit+of+Profit+and+Power+eb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c96f8e9a7f79c0db050ce83c93bc6176ff5a8dce","infoHashBuffer":{"type":"Buffer","data":[201,111,142,154,127,121,192,219,5,12,232,60,147,188,97,118,255,90,141,206]},"announce":[],"urlList":[]}}