{"title":"The Beatles - A Hard Day's Night (1964) WMA320","uid":6243864,"size":82331073,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9906de76838fdb7bb806beaacf918e959c566da&amp;dn=The+Beatles+-+A+Hard+Day%5C%27s+Night+%281964%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300172051,"description":"Or something like that. Um... nevermind. \n\nAnd here it is - the very first (and only) album comprised of *all* Lennon &amp; McCartney material, and what an excellent album it is. The Beatles' third album, overall, the boys had already started out with some mightily impressive songwriting skills, chops, and infectious melodies with their first two albums, _Please Please Me_ and _With The Beatles_ (both from 1963.) However, unlike those two (which feature a mix of originals and covers), this album is comprised of *all* original material, and the songwriting is also a step up, overall, from their first two albums. \n\nSomething that seems to fly over the heads of many Beatles fans is the complexity involved in the majority of their music. Yes, their later material was not the only music to be complex. In fact, this aspect started from the beginning, actually, and this album is no exception: many of the chords, progressions and structures to the songs on this album are very advanced -- especially coming from a rock band who wrote their own material back in the early '60s, and what's a hell of a lot more impressive is how they seem to make it all sound so seemingly simple; the complexity of the musicianship doesn't overwhelm the music, but in actuality, it plays an important role in making their music as infectious and devouring as it was (and still is): the way they treat the melodies, and how they sequence and arrange them are so marvelous. \n\nYou know the title track, as it features that explosive, shot-in-the-dark strum of a chord (which is complex, by the way.) And from there, we are taken on an exciting ride. We get infectious rockers like the aforementioned title track, lovely, melodic-soaked ballads like &quot;If I Fell,&quot; more infectious rockers like &quot;Happy Just To Dance With You,&quot; which is sung by George Harrison, and features some stunning arrangements, but these arrangements make for some interesting, mysterious, yet infectious melodies, which lend the track a certain sexy, elegant and utterly classy quality. We also get Latin-infused numbers like Paul McCartney's &quot;And I Love Her.&quot; \n\nMy favorite track on this excellent album is &quot;Tell Me Why.&quot; Many people on this page seem to bash this track, which is fine. It was rumored that John Lennon himself didn't think the world of this track, and said that it was a song written without much effort, and that it was inspired by his love of the R&amp;B &quot;girl groups&quot; from that time period. You can definitely hear the influence here (and in certain other Beatles songs), but the passionate, raucous, uninhibited, and alternately beautiful vocal harmonies, the sexy way in which they swing, and the jazzy basslines from McCartney are just a few of the things that contribute to the creation of something which is almost orgasmic to my ears. \n\nLater, we get to see one of the earliest examples of The Beatles exploring their love of country-rockabilly in &quot;I'll Cry Instead,&quot; while &quot;Things We Said Today&quot; is more of a melancholic-toned melody, which, ironically, features a fairly-fast tempo. &quot;You Can't Do That&quot; features some ominous lyrics to a lover, but yet the melody and the song in general sounds so up-tempo, jovial and celebratory. And, to close off the album, we have &quot;I'll Be Back,&quot; one of the most understatedly beautiful songs on the album. \n\nThe Beatles didn't ever really put out an album that wasn't filled to the brim with infectiousness, and impressive musicianship. This 1964 juggernaut is no exception. Highly recommended. \n\nby Samhot\n\nTRACKLIST:\n\n01 - A Hard Day's Night.wma                                 \n02 - I Should Have Known Better.wma                         \n03 - If I Fell.wma                                          \n04 - I'm Happy Just To Dance With You.wma                   \n05 - And I Love Her.wma                                     \n06 - Tell Me Why.wma                                        \n07 - Can't Buy Me Love.wma                                  \n08 - Any Time At All.wma                                    \n09 - I'll Cry Instead.wma                                   \n10 - Things We Said Today.wma                               \n11 - When I Get Home.wma                                    \n12 - You Can't Do That.wma                                  \n13 - I'll Be Back.wma   \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:c9906de76838fdb7bb806beaacf918e959c566da","amp;dn":"The+Beatles+-+A+Hard+Day%5C%27s+Night+%281964%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9906de76838fdb7bb806beaacf918e959c566da","infoHashBuffer":{"type":"Buffer","data":[201,144,109,231,104,56,253,183,187,128,107,234,172,249,24,233,89,197,102,218]},"announce":[],"urlList":[]}}