{"title":"The Pathfinder - How to Choose or Change Your Career for a Lifet","uid":15337247,"size":20350851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca6058321340f1d5962c57b53207e7345c3b785b&amp;dn=The+Pathfinder+-+How+to+Choose+or+Change+Your+Career+for+a+Lifet&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1468792919,"description":"The Pathfinder - How to Choose or Change Your Career for a Lifetime of Satisfaction and Success.epub\r\n\r\nDO YOU JUMP OUT OF BED EVERY MORNING AND RUSH TO A JOB YOU LOVE?\r\n\r\nOr is the work you once enjoyed now just a way to pay the bills? Perhaps you're even doubting your career choice altogether. Let The Pathfinder guide you to a more engaging, fulfilling work life. Based on breakthrough techniques developed by Rockport Institute, an innovative and award-winning career-counseling network that has changed the lives of over 10,000 people, The Pathfinder offers invaluable advice and more than 100 self-tests and diagnostic tools that will help you choose an entirely new career -- or view a current job from a new, more positive perspective. You'll learn:\r\n\r\n* How to design your new career direction step by step so that it fits your talents, personality, needs, goals, values, and is, at the same time, practical and attainable\r\n\r\n* How to deal successfully with the &quot;yeah but&quot; voices in your head that keep you going back to the same old ill-fitting job, day after day\r\n\r\n* How to land the perfect job in your new field, plus tips on writing a really exceptional résumé, personal marketing, and networking (even for those who hate to network)\r\n\r\nWhether you're a seasoned professional in search of a career change or a beginner just entering the working world, you want to make the right choices from the beginning. No matter where you are in your journey, if you want work to be more of a dance than a drag, The Pathfinder will expertly coach you through the process of designing a career you will love","torrent":{"xt":"urn:btih:ca6058321340f1d5962c57b53207e7345c3b785b","amp;dn":"The+Pathfinder+-+How+to+Choose+or+Change+Your+Career+for+a+Lifet","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6058321340f1d5962c57b53207e7345c3b785b","infoHashBuffer":{"type":"Buffer","data":[202,96,88,50,19,64,241,213,150,44,87,181,50,7,231,52,92,59,120,91]},"announce":[],"urlList":[]}}