{"title":"Theme Hospital MULTI8 (2.1.0.8)-GOG","uid":12872004,"size":173862448,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ca9c319f11fcf00e563fbfba54b8d01822cbf85e&amp;dn=Theme+Hospital+MULTI8+%282.1.0.8%29-GOG&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Tenguken","files":6,"time":1448893927,"description":"Theme Hospital (c) Electronic Arts\r\n\r\nRelease Date : 11/2015\r\nProtection : -\r\nDiscs : 1\r\nGenre : Strategy\r\nLanguages : EN/FR/DE/IT/ES/SE/PL/RU\r\n\r\nIt's a matter of laugh or death in Theme Hospital, another\r\ninstallment of the Theme series. Design, maintain and manage a\r\nhi-tech hospital facility, making the most of limited resources\r\nand turning cures into cash. The Grim Reaper stalks the corridors,\r\nthe ill have some very odd ailments, and the staff want to play\r\ndoctors and nurses together. No matter how you look at it, you're\r\nin control of a very sick hospital.\r\n\r\nIf there is one word that describes Theme Hospital then it has to\r\nbe &quot;hilarious.&quot; Almost everything in this game is made with great\r\ndose of humour. You might think that someone's illness is not a\r\nlaughing matter but wait till you see a patient with KingComplex\r\ndressed as Elvis or serious case of Hairyitis caused from\r\nprolonged exposure to the moon. Finding treatments for such\r\ndiseases is a part of your job, but there's no prescription to\r\ncure the insanity that may result from trying to figure out those\r\ncures. You start off small with an empty building, a few doctors,\r\na general diagnostic, a pharmacy, a reception desk, and a few\r\nother necessities. From there it's up to you to move your way up\r\nin the health care industry.\r\n\r\nA hospital simulator is not something you might consider a good\r\ntheme for a game but the guys from Bullfrog Productions were\r\nfamous for creating innovative and fun titles from the craziest\r\nidea--and Theme Hospital no exception. This game is a piece of art\r\nand definitely the best &quot;hospital&quot; simulation so check it out. Our\r\ndiagnosis: fun!\r\n\r\n* Polished &amp; detailed management sim with extra helpings of\r\ncrazy.\r\n* Hilarious humour will accompany you throughout the entire\r\ngame, in this strange hospital of yours there is always\r\nsomething weird and funny going on.\r\n* Be everything the national health care system shouldn't be;\r\nthere is no place for mercy and altruism in this game - you\r\ncan't buy yourself a new car with that, can you?\r\n\r\n-Install\r\n-Play","torrent":{"xt":"urn:btih:ca9c319f11fcf00e563fbfba54b8d01822cbf85e","amp;dn":"Theme+Hospital+MULTI8+%282.1.0.8%29-GOG","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca9c319f11fcf00e563fbfba54b8d01822cbf85e","infoHashBuffer":{"type":"Buffer","data":[202,156,49,159,17,252,240,14,86,63,191,186,84,184,208,24,34,203,248,94]},"announce":[],"urlList":[]}}