{"title":"Fire Hazard Assessment of Lithium Ion Battery Energy Storage Sys","uid":15543100,"size":3868688,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc2ff5a8847343f184473888ae993f053e686296&amp;dn=Fire+Hazard+Assessment+of+Lithium+Ion+Battery+Energy+Storage+Sys&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1470940496,"description":"Fire Hazard Assessment of Lithium Ion Battery Energy Storage Systems - Andrew F. Blum, R. Thomas Long Jr. (Springer, 2016).pdf\r\n\r\nProviding a concise overview of lithium-ion (Li-ion) battery energy storage systems (ESSs), this book also presents the full-scale fire testing of 100 kilowatt hour (kWh) Li-ion battery ESSs. It details a full-scale fire testing plan to perform an assessment of Li-ion battery ESS fire hazards, developed after a thorough technical study. It documents the results of the testing plan including external and internal ignition testing, ESS positioning, temperature and heat flux measurements, pressure measurement, weather meters, and data acquisition systems.\r\nA comprehensive literature review and gap analysis reveal the current state of research into this vital aspect of energy storage. The authors cover the characteristics and hazards of Li-ion batteries, their anatomy and design, commercial and residential ESSs, historical fire incidents, and ESS codes and regulations.\r\nResearchers and professionals working in fire protection engineering, battery systems engineering, or energy storage will find this book a useful example of a fire testing plan. The results of the hazard assessment offer insights for those involved in electrical, fire, and building codes, as well as practitioners in design standards and fire testing","torrent":{"xt":"urn:btih:cc2ff5a8847343f184473888ae993f053e686296","amp;dn":"Fire+Hazard+Assessment+of+Lithium+Ion+Battery+Energy+Storage+Sys","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc2ff5a8847343f184473888ae993f053e686296","infoHashBuffer":{"type":"Buffer","data":[204,47,245,168,132,115,67,241,132,71,56,136,174,153,63,5,62,104,98,150]},"announce":[],"urlList":[]}}