{"title":"Teenage Fanclub - Bandwagonesque (1991) [FLAC]","uid":8855379,"size":288683487,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cc846479309159410fbbeb0637fa11a357724a04&amp;dn=Teenage+Fanclub+-+Bandwagonesque+%281991%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mousebelt","files":-1,"time":1377638139,"description":"Bandwagonesque is the third album by Scottish alternative rock band Teenage Fanclub, released in November 1991 on Creation Records. Bandwagonesque became famous by beating Nirvana's landmark album Nevermind to be voted 'album of the year' for 1991 by American music magazine Spin. It also gave the band substantial US success when the single &quot;Star Sign&quot; reached #4 on the Modern Rock Tracks chart, becoming their biggest hit in that country. &quot;What You Do to Me&quot; and &quot;The Concept&quot; were also Top 20 hits on that chart.\nThe cover is designed by Sharon Fitzgerald. When Kiss member Gene Simmons (who had trademarked the logo of a moneybag with dollar symbol) was made aware of the record he sent a letter to Geffen Records - who in turn gave in and sent Simmons a cheque, according to Simmons's book Sex Money Kiss.[4]\nThe liner notes to the 2009 Big Star Box set Keep an Eye on the Sky say &quot;...the album was so in thrall to Chilton, Bell, and company that some critics had taken to calling it &quot;Big Star's 4th.&quot;\nIn 2006 the album was performed live in its entirety as part of the All Tomorrow's Parties-curated Don't Look Back series.[5]\n&quot;The Concept&quot; was featured prominently in the 2011 film Young Adult. &quot;The Concept&quot; was also covered by Jimmy Eat World on the Japanese deluxe edition of their 2004 album Futures.","torrent":{"xt":"urn:btih:cc846479309159410fbbeb0637fa11a357724a04","amp;dn":"Teenage+Fanclub+-+Bandwagonesque+%281991%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc846479309159410fbbeb0637fa11a357724a04","infoHashBuffer":{"type":"Buffer","data":[204,132,100,121,48,145,89,65,15,187,235,6,55,250,17,163,87,114,74,4]},"announce":[],"urlList":[]}}