{"title":"New Brain, New World (Kundalini.Meditation.Yoga)","uid":13828932,"size":3428878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccc6a56919ceb3ad5d3a874411e59786b2d4ed9c&amp;dn=New+Brain%2C+New+World+%28Kundalini.Meditation.Yoga%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"asperge","files":1,"time":1457729139,"description":"Erik Hoffman, &quot;New Brain, New World&quot; \r\n2012 | ISBN: 1848508271 | English | 248 pages | EPUB | 3 MB\r\n\r\nA fascinating insight into just how different our world could be if the human brain continues to evolve, allowing us to access higher levels of consciousness.\r\n\r\nNew Brain, New World uses cutting edge brain research to show how the ongoing evolution of the human brain could bring about a shift in human consciousness, ultimately creating a better world. We all know that over millions of years the human brain has evolved in many significant ways - so why would we assume that this process is not still happening? Based on a lifetime of research into brain function, the science of consciousness, and brain wave training, this book looks at how our brains may yet evolve, and the exciting implications that these developments may have for human consciousness.\r\n\r\nThe author maintains that the global crisis facing us is basically a crisis of consciousness, and it is the human ego with its destructive feelings and insatiable greed that stands in the way of a new and better world. He believes that the evolution of the human brain can make that world a reality. This book explores:\r\n\r\nthe science of consciousness\r\nthe evolution of the human brain - how it has developed over millions of years, and how there is a huge potential latent in the part of the brain called the frontal cortex\r\nexpanding human consciousness - the effects on the brain of meditation, feeling release therapy, and the drinking of ayahuasca, the mind-expanding herbal tea\r\nkundalini: an evolutionary energy in man\r\nawareness as a driving force in consciousness development - how we can play our own parts in helping our brains to evolve and access higher levels of consciousness by using alpha brain wave training for body-awareness and 'grounding', and frontal gamma wave training for focus and presence \r\nthe new human brain\r\nlooking towards a new future - the exciting possibilities for positive change and increased peace, love and compassion in the world if the human brain evolves","torrent":{"xt":"urn:btih:ccc6a56919ceb3ad5d3a874411e59786b2d4ed9c","amp;dn":"New+Brain%2C+New+World+%28Kundalini.Meditation.Yoga%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccc6a56919ceb3ad5d3a874411e59786b2d4ed9c","infoHashBuffer":{"type":"Buffer","data":[204,198,165,105,25,206,179,173,93,58,135,68,17,229,151,134,178,212,237,156]},"announce":[],"urlList":[]}}