{"title":"Directory Opus Pro v11.19","uid":15390276,"size":58807689,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cce86dd46adc3d1d4c45f81187d9f23e46a33e68&amp;dn=Directory+Opus+Pro+v11.19&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LxByte","files":1,"time":1469329378,"description":"Directory Opus Pro v11.19\r\n\r\nWelcome to Directory Opus, the file manager for Windows!\r\nDirectory Opus is designed with four goals in mind:\r\nEase of use: As far as possible, Opus works just like Explorer does. You don't have to learn any complicated scripting or non-standard mouse techniques to use Opus. If you've ever used Explorer to copy a file, you already know exactly how to do it in Opus as well.\r\nConfigurability: We believe in the user's right to choose how their computer operates. You'll find that almost every aspect of Opus can be changed - from the buttons on the toolbar to the color used to draw the background of a compressed file.\r\nEfficiency: Opus is designed to be as efficient as possible. The entire program makes use of multi-threading to ensure that you should never have to wait for one operation to complete before beginning another.\r\nCompatibility: As an Explorer Replacement it's important that Opus appears (to the system) just like Explorer does. Within the limits set by Microsoft, Opus achieves this and most software written with only Explorer in mind will still work fine with Opus installed.\r\n \r\nThere are far too many features to list them all here, but to name a few:\r\nSingle or dual file displays, with single or dual trees, make navigating and manipulating files a breeze\r\nFolder tabs let you keep multiple folders open and switch quickly between them\r\nUnique Explorer Replacement mode provides a full replacement for Windows Explorer\r\nIntegrated viewer pane lets you preview many common image and document file formats\r\nView and edit file metadata (EXIF, MP3, PDF, etc)\r\nSorting, grouping, filtering and searching has never been easier\r\nColor code or rate your files and folders to make them easier to find\r\nBatch renaming including the option for a fully scripted rename using metadata\r\nSupport for FTP, Zip, 7-Zip, RAR and many other archive formats\r\nAccess content on portable devices like phones, tablets and cameras\r\nBuilt-in tools including synchronize, duplicate file finder, image converter and uploader and more\r\nPrint or export folder listings, copy file listings to the clipboard, calculate folder sizes\r\nQueue multiple file copies for improved performance\r\nSupport for CD/DVD burning\r\nSupport for the latest Windows features including jumplists and indexed search\r\nFully configurable user interface - toolbars, keyboard hotkeys and much more can be tailored to suit your needs\r\nFull scripting interface supports VBScript, JScript or any installed Active Scripting language\r\nEfficient, multi-threaded, modern design\r\nSupports Windows XP, Vista, Windows 7, Windows 8 and Windows 10 (including Server versions) in both 32 and 64 bit versions\r\nThere are many more features available in Directory Opus. Why not download a free evaluation copy and see for yourself?\r\nWe guarantee you won't want to go back to Explorer!\r\n\r\nOfficial Website: https://www.gpsoft.com.au/index.html","torrent":{"xt":"urn:btih:cce86dd46adc3d1d4c45f81187d9f23e46a33e68","amp;dn":"Directory+Opus+Pro+v11.19","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cce86dd46adc3d1d4c45f81187d9f23e46a33e68","infoHashBuffer":{"type":"Buffer","data":[204,232,109,212,106,220,61,29,76,69,248,17,135,217,242,62,70,163,62,104]},"announce":[],"urlList":[]}}