{"title":"Sunset Rubdown - Snake's Got a Leg [2005] [EAC,log,cue. FLAC]","uid":8923211,"size":182712230,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd293115a1d1b110413dc2363020a7af7d6f5222&amp;dn=Sunset+Rubdown+-+Snake%27s+Got+a+Leg+%5B2005%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":15,"time":1379305070,"description":"Artist: Sunset Rubdown\nRelease: Snake's Got a Leg\nReleased: 2005\nLabel: Global Symphonic\nCatalog#: CW019\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: CAN\nStyle:folk rock,lo-fi\n\n\nThis CD is lossy-sourced; therefore not a transcode.\n\n1.\tThe Dust You Kick Up Is Too Fine (1:00)\n2.\tSnake's Got a Leg (4:01)\n3.\tI'll Believe in Anything You'll Believe in Anything (4:48)\n4.\tHey You, Handsome Vulture (1:34)\n5.\tHope You Don't Stoop to Dirty Words (4:11)\n6.\tHope You Don't Stoop to Dirty Words II (2:47)\n7.\tCecil's Bells (1:44)\n8.\tI Know the Weight of Your Throat (2:51)\n9.\tSol's Song (4:03)\n10.\tStadiums and Shrines (3:00)\n11.\tSnake's Got a Leg II (3:52)\n12.\tPortrait of a Shiny Metal Little Boy (1:20)\n\nOne of the byproducts of the great backlash against indie rock that occurred in the early '00s is the notion that lo-fi is an illegitimate tool, the go-to cover-up for artists short on cash, patience, and ideas. It's an understandable aversion, given the long trail of refuse left in the wake of Slanted &amp; Enchanted and Bee Thousand; bands seemed to think a respectable career could be bought with a four-track and a whole lotta reverb. But it's also easy to forget what an effective tool the home-studio process can be when used properly-- creating unexpected, unique sounds and enveloping the music in an intimate blanket.\nSpencer Krug's project under the name Sunset Rubdown seems to be aware of the tightrope that needs to be walked with lo-fi production, but he can't help ending up on the wrong side more often than not. Krug can be found spending his days with animal-themed acts Frog Eyes and Wolf Parade, but saves his nights for recording sparse, echo-dipped ballads for this moniker, at least one of which has already been recycled for one of his other bands' more-fidelitous recordings. Snake's Got a Leg therefore seems a little bit like a solo project, a little bit like demos, and the music contained within is similarly torn between fully realized and undercooked.\nThe elements Krug makes most prominent in his bedroom studio are his own pinched, Bowie-esque voice and a variety of keyboards, both outlined in a thick border of fuzz by heaping helpings of reverb. The echobox treatment does a good job of filling in the gaps left by the spare arrangements, and gives what are presumably rather normal instruments an extraterrestrial flair, as with the organ or Rhodes or Two-buck Casio that &quot;I'll Believe in Anything You'll Believe in Anything&quot; floats on. Pretty-okay acoustic &amp; singin' tracks like &quot;Stadiums and Shrines&quot; or &quot;I Know the Weight of Your Throat&quot; might still sound like a guy in a basement with a tape-recorder, but at least the skillful application of lo-fi makes the song sound like it was made in a haunted basement, and sometime in the 1920's to boot.","torrent":{"xt":"urn:btih:cd293115a1d1b110413dc2363020a7af7d6f5222","amp;dn":"Sunset+Rubdown+-+Snake%27s+Got+a+Leg+%5B2005%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd293115a1d1b110413dc2363020a7af7d6f5222","infoHashBuffer":{"type":"Buffer","data":[205,41,49,21,161,209,177,16,65,61,194,54,48,32,167,175,125,111,82,34]},"announce":[],"urlList":[]}}