{"title":"Twilight Zone - The Radio Series","uid":4294474,"size":957359345,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cd398f3e85213bdf9212382040befa0a6439fd1c&amp;dn=Twilight+Zone+-+The+Radio+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"captainelliotspencer","files":304,"time":1216033018,"description":"                         Twilight Zone \n                         Radio Series\n\nThe Twilight Zone Radio Dramas is a nationally syndicated radio adaptation of the classic television series The Twilight Zone, launched in October 2002. Many of the stories are based on Rod Serling&amp;#039;s scripts from the original Twilight Zone series, and are slightly expanded and updated to reflect contemporary technology and trends\n(e.g., the mention of &quot;cell phones&quot; and &quot;CD-ROMs&quot; which, of course, weren&amp;#039;t around when the television show aired in the 1960s). Taking Serling&amp;#039;s role as narrator is Stacy Keach. \nA different Hollywood actor and actress, such as Blair Underwood and James Caviezel, take the lead role in each radio drama. In addition, several stars who appeared on the original TV series, such as H.M. Wynant, Orson Bean and Morgan Brittany, appear, although purposely not in the roles they originated on television.\n\nThe radio series is produced by the Falcon Picture Group and scripts from the original Twilight Zone are adapted by Dennis Etchison (one episode by Chas Holloway). \nIn Britain it has been heard on the digital channel BBC 7.\nIn the United States, it airs mainly in small markets (with the occasional large market, the largest currently being WGN in Chicago) late at night.\nIt also airs regularly on Sirius satellite radio channel 118, &quot;Radio Classics&quot; and\non XM satellite radio channel 163, Sonic Theater. \nThe show continues to be syndicated and airs weekly (in some markets, two episodes air per week; sometimes back to back). \nOriginally distributed by Dick Brescia Associates, and later by Syndication Networks, beginning in August of 2007 the series became distributed through Westwood One. \n\nTo date eight episodes have also been released to CD in two volumes by CBS Special Products; as of the summer of 2007, the releases (more have been announced) are being sold exclusively at Movie Gallery and Hollywood Video stores in the US and Canada.\n\n\nEpisodes:\n\nThe Twilight Zone  - The Monsters Are Due on Maple Street\nThe Twilight Zone - A Hundred Yards Over the Rim\nThe Twilight Zone - A Kind of Stopwatch\nThe Twilight Zone - A Most Unusual Camera\nThe Twilight Zone - A Short Drink from a Certain Fountain\nThe Twilight Zone - A Stop at Willoughby\nThe Twilight Zone - Back There\nThe Twilight Zone - Cavender is Coming\nThe Twilight Zone - Escape Clause\nThe Twilight Zone - Five Characters In Search of An Exit\nThe Twilight Zone - Four O&amp;#039;Clock\nThe Twilight Zone - In Search of an Exit\nthe Twilight Zone - Long Distance Call\nThe Twilight Zone - Mr Dingle, The Strong\nThe Twilight Zone - Mr Garrity and the Graves\nThe Twilight Zone - Nervous Man in A Four Dollar Room\nThe Twilight Zone - Night of the Meek\nThe Twilight Zone - No Time Like the Past\nThe Twilight Zone - Of Late I Think of Cliffordville\nThe Twilight Zone - One For The Angels\nThe Twilight Zone - Ring-a-ding Girl\nThe Twilight Zone - Still Valley\nThe Twilight Zone - The After Hours\nThe Twilight Zone - The Bard\nThe Twilight Zone - The Fear\nThe Twilight Zone - The Lateness of the Hour\nThe Twilight Zone - The Lonely\nThe Twilight Zone - The Man in the Bottle\nThe Twilight Zone - The Midnight Sun\nThe Twilight Zone - The Obsolete Man\nThe Twilight Zone - The Parallel\nThe Twilight Zone - The Passersby\nThe Twilight Zone - The Rip Van Winkle Caper\nThe Twilight Zone - The Thirty &amp; Fathom Grave\nThe Twilight Zone - Twenty-Two\nThe Twilight Zone - Uncle Simon\nThe Twilight Zone - Walking Distance\n\nVarious Bitrate.\n\n-------------------------------------------------------------\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD.\n\nEnjoy!!","torrent":{"xt":"urn:btih:cd398f3e85213bdf9212382040befa0a6439fd1c","amp;dn":"Twilight+Zone+-+The+Radio+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd398f3e85213bdf9212382040befa0a6439fd1c","infoHashBuffer":{"type":"Buffer","data":[205,57,143,62,133,33,59,223,146,18,56,32,64,190,250,10,100,57,253,28]},"announce":[],"urlList":[]}}