{"title":"Between the Lines   (BBC - Season 1 - Complete)","uid":6844976,"size":17499104690,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cd6aba55b8318f65dbb20b3006bb285146ae7b6b&amp;dn=Between+the+Lines+++%28BBC+-+Season+1+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"rosie1966","files":15,"time":1322316683,"description":"TV : Crime : DVD quality : English\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Between_the_Lines_%28TV_series%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Between_the_Lines_%28TV_series%29&lt;/a&gt;\n\n \n\n\nBetween The Lines was an acclaimed television police drama series created by J.C. Wilsher and produced by World Productions for the BBC. It was first shown on BBC1 between 1992 and 1994, running for three series.\n\nThe show centred around the eventful life of Detective Superintendent Tony Clark, played by Neil Pearson. Clark was an ambitious member of the Complaints Investigation Bureau (CIB), an internal organisation that investigates claims of corruption inside the police in England and Wales. Along the way Clark had to overcome strong influence from his superiors and problems in his private life, most notably the break-up of his marriage following an affair with WPC Jenny Dean (Lesley Vickerage). Throughout the series Clark was assisted by sidekicks Harry Naylor (Tom Georgeson) and Mo Connell (Siobhan Redmond).\n\nClark's work as a lead officer in CIB was the focus of the first two series. In the first series his boss was Deakin, a tough Irish policeman. At the end of the first series Deakin was revealed to be a corrupt officer himself. He left the force but remained a recurring character working freelance for the security services and others, sometimes in conflict with Clark and sometimes assisting him. At the start of the third series (after a dramatic shootout at the end of the second) Clark, Naylor and Connell leave the police force and work in the murky world of private security, far right politics and espionage. The third series ends with the betrayal of Clark and Naylor who had been masquerading as mercenaries. The betrayal is made by Connell in league with Deakin, their former boss and nemesis. It is unclear as to whether Clark and Naylor have died as the show ended on a cliff hanger. Rumours of a remake did circulate for some years, but Pearson confirmed in 'Watching the Detectives' that he had wanted a 'final' ending at the time and would never return to the role.\n\nBetween The Lines was one of the first British TV dramas to include a homosexual character. Maureen (Mo) Connell (Siobhan Redmond) was a lesbian in the series.\n\nThe show became a surprise hit for the BBC, winning a British Academy Television Award (BAFTA) for Best Drama Series in 1994. In 2000 it was voted into the 100 Greatest British Television Programmes by the British Film Institute.\n\nIn Ontario, Canada, the program was retitled Inside the Line because the broadcaster TVOntario already had a current affairs program called Between the Lines and did not want them confused.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:cd6aba55b8318f65dbb20b3006bb285146ae7b6b","amp;dn":"Between+the+Lines+++%28BBC+-+Season+1+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd6aba55b8318f65dbb20b3006bb285146ae7b6b","infoHashBuffer":{"type":"Buffer","data":[205,106,186,85,184,49,143,101,219,178,11,48,6,187,40,81,70,174,123,107]},"announce":[],"urlList":[]}}