{"title":"300: Rise of an Empire (2014)  - English HD Bluray Rip X264 - A","uid":10676759,"size":3012569816,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:cdad9d117ee5545d33b91cb87cb57edcc457e086&amp;dn=+300%3A+Rise+of+an+Empire+%282014%29++-+English+HD+Bluray+Rip+X264+-+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1406964897,"description":"300: Rise of an Empire (2014)  - English HD Bluray Rip X264 - AC3 Audio (2013) \n\nGreek general Themistokles leads the charge against invading Persian forces led by mortal-turned-god Xerxes and Artemisia, vengeful commander of the Persian navy.\n\n300: Rise of an Empire is a 2014 American fantasy war film directed by Noam Murro. It is a follow-up to the 2007 film 300, taking place before, during, and after the events of that and based on the Battle of Salamis. It is based on the as-yet-unreleased Frank Miller graphic novel Xerxes. Zack Snyder, who directed and co-wrote the original film, acts as writer and producer on Rise of an Empire.\n\nThe cast includes Lena Headey, Rodrigo Santoro, David Wenham, Andrew Tiernan, Andrew Pleavin and Peter Mensah reprising their roles from the first film, alongside Sullivan Stapleton, Eva Green, Hans Matheson, Callan Mulvey, and Jack O'Connell. It was released in 3D and IMAX 3D on March 7, 2014. The composer for the film is Junkie XL\n\n\n****SPOILER ALERT****\n\nQueen Gorgo of Sparta tells her men about the Battle of Marathon, in which King Darius I of Persia was killed by General Themistocles of Athens. Darius' son, Xerxes, witnesses his father's death, and is advised to not continue the war, since &quot;only the gods could defeat the Greeks&quot;. Darius' naval commander, Artemisia, claims that Darius' last words were in fact a challenge and sends Xerxes on a journey through the desert. Xerxes finally reaches a cave and bathes in an otherworldly liquid, emerging as the &quot;God-King&quot;. He returns to Persia and declares war on Greece.\n\nAs Xerxes' forces advance towards Thermopylae, Themistocles meets with the council and convinces them to provide him with a fleet to engage the Persians at sea. Themistocles then travels to Sparta to ask King Leonidas for help, but is informed by Dilios that Leonidas is consulting the Oracle, and Gorgo is reluctant to side with Athens. Themistocles later reunites with his old friend Scyllas, who infiltrated the Persian troops and learned Artemisia was born Greek, but defected to Persia as her family was raped and murdered by Greek hoplites and she was taken as a sex slave to the Greeks, who left her for dead in the streets. She was rescued and adopted by the Persians. Her lust for vengeance gained the attention of King Darius and he made her a naval commander after she killed many of his enemies.\n\nThemistocles leads his men, which include Scyllas, Scyllas' son Calisto and Themistocles' right-hand man Aesyklos to the Aegean Sea. They ram their ships into the Persian ships, charge them, slaughtering several soldiers before retreating from the sinking Persian ships. The following day, the Greeks feign a retreat and lead a group of Persian ships into a crevice, where they become stuck. The Greeks charge the Persian ships from the cliffs above and kill more Persians. Impressed with Themistocles' skills, Artemisia brings him onto her ship where she has sex with him in an attempt to convince him to join the Persians as her second-in-command. He refuses, causing her to push him aside and swear revenge.\n\nThe Persians spill tar into the sea and send suicide bombers to swim to and board the Greek ships with their flame bombs. Artemisia and her men fire flaming arrows and torches to ignite the tar, but an Athenian manages to kill one of the Persians, who falls into the tar carrying a torch, causing ships from both sides to explode. Themistocles is thrown into the sea by an explosion and nearly drowns before being rescued by Aesyklos, and stands by Scyllas' side as he succumbs to his injuries. Believing Themistocles to be dead, Artemisia and her forces withdraw.\n\nDaxos, an Arcadian general, tells Themistocles that Leonidas and the 300 have been killed by Xerxes. Themistocles returns to Athens to confront Ephialtes, the deformed Spartan traitor, who reveals that Xerxes plans to attack Athens, and is regretful of his actions, welcoming death. Themistocles spares him instead, so he can warn Xerxes that the Greek forces are gathering at Salamis, and then visits Gorgo in Sparta while she is mourning Leonidas' death to ask for her help, but she is too overcome with grief. Before leaving, Themistocles returns Leonidas' sword, which he took from Ephialtes, who had earlier stolen it, and urges Gorgo to avenge Leonidas.\n\nIn Athens, Xerxes' army is laying waste when Ephialtes arrives to deliver Themistocles' message. Upon learning he is alive, Artemisia leaves to ready her troops for battle with Xerxes disapproving her plan. But she still leaves for battle, against Xerxes' objection. The Greek ships crash into the Persians ships, and the two armies battle, beginning the decisive Battle of Salamis. Themistocles and Artemisia fight, which ends in a stalemate with both receiving injuries.\n\nAt that moment Gorgo, who had been narrating the tale to the Spartans, arrives at the battle along with ships from numerous Greek city states including Delphi, Thebes, Olympia, Arcadia, and Sparta, all of them uniting against the surrounded Persians. Daxos leads the Arcadian army while Themistocles urges Artemisia to surrender, but she tries to kill him and is stabbed through the stomach. With her dying breath, she sees Xerxes turning his back on her as he retreats. Themistocles and Gorgo take a moment to silently acknowledge one another's alliance as the remaining Persians charge while Dilios leads the assault. The three then charge at the opposing Persians with the whole army of Spartans.","torrent":{"xt":"urn:btih:cdad9d117ee5545d33b91cb87cb57edcc457e086","amp;dn":"+300%3A+Rise+of+an+Empire+%282014%29++-+English+HD+Bluray+Rip+X264+-+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdad9d117ee5545d33b91cb87cb57edcc457e086","infoHashBuffer":{"type":"Buffer","data":[205,173,157,17,126,229,84,93,51,185,28,184,124,181,126,220,196,87,224,134]},"announce":[],"urlList":[]}}