{"title":"Manzikert 1071: The Breaking of Byzantium","uid":11773976,"size":12447987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdd92df9ad50d63a878a98fdf024a0136e3452a7&amp;dn=Manzikert+1071%3A+The+Breaking+of+Byzantium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427194430,"description":"On 26 August 1071 a large Byzantine army under Emperor Romanus IV met the Saljuq Turk forces of Sultan Alp Arslan near the town of Manzikert to the far east of the Byzantine Empire. The battle ended in a decisive defeat for the Byzantine forces, with the wings of the army routing following withering Turkish arrow fire, and the centre overwhelmed, with the Byzantine emperor captured and much of his fabled Varangian guard killed. This battle is justifiably regarded as a turning point in Middle Eastern, European and to some extent even world history. It is seen as the primary trigger of the Crusades, and as the moment when the power of the East Roman or Byzantine Empire was irreparably broken. The Saljuq victory opened up Anatolia to Turkish-Islamic conquest, which was eventually followed by the establishment of the Ottoman state which went on the conquer south-eastern and much of central Europe, the entire Middle East and most of North Africa. Nevertheless the battle itself was the culmination of a Christian Byzantine offensive, intended to strengthen the eastern frontiers of the empire and re-establish Byzantine domination over Armenia and northern Mesopotamia. Turkish Saljuq victory was in no sense inevitable and might, in fact, have come as something of a surprise to those who achieved it - at least in proving to be so complete. It was not only the battle of Manzikert that had such profound and far-reaching consequences, many of these stemmed from the debilitating Byzantine civil war which followed and was a direct consequence of the defeat","torrent":{"xt":"urn:btih:cdd92df9ad50d63a878a98fdf024a0136e3452a7","amp;dn":"Manzikert+1071%3A+The+Breaking+of+Byzantium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdd92df9ad50d63a878a98fdf024a0136e3452a7","infoHashBuffer":{"type":"Buffer","data":[205,217,45,249,173,80,214,58,135,138,152,253,240,36,160,19,110,52,82,167]},"announce":[],"urlList":[]}}