{"title":"Interest Rate Modeling, Volume 1: Foundations and Vanilla Models","uid":10301267,"size":29113587,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdf12435cbd0401c8bcc4dd93120838aba28d6d3&amp;dn=Interest+Rate+Modeling%2C+Volume+1%3A+Foundations+and+Vanilla+Models&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1401973444,"description":"ABOUT THIS BOOK\nThe three volumes of Interest Rate Modeling present a comprehensive and up-to-date treatment of techniques and models used in the pricing and risk management of fixed income securities. Written by two leading practitioners and seasoned industry veterans, this unique series combines finance theory, numerical methods, and approximation techniques to provide the reader with an integrated approach to the process of designing and implementing industrial-strength models for fixed income security valuation and hedging. Aiming to bridge the gap between advanced theoretical models and real-life trading applications, the pragmatic, yet rigorous, approach taken in this book will appeal to students, academics, and professionals working in quantitative finance. \n\nVolume I provides the theoretical and computational foundations for the series, emphasizing the construction of efficient grid- and simulation-based methods for contingent claims pricing. Numerical methods serve an extremely important role in the text, so we develop this topic to an advanced level suitable for professional-quality model implementations. Placing this material early in the text allows us to incorporate it into our discussion of individual models in subsequent chapters. The second part of Volume I is dedicated to local-stochastic volatility modeling and to the construction of vanilla models for individual swap and Libor rates. Although the focus is eventually turned toward fixed income securities, much of the material in this volume applies to a broad capital market setting and will be of interest to anybody working in the general area of asset pricing. \n\n\nTABLE OF CONTENTS\nVolume I. Foundations and Vanilla Models\n\n      Part I. Foundations \nIntroduction to Arbitrage Pricing Theory\nFinite Difference Methods\nMonte Carlo Methods\nFundamentals of Interest Rate Modelling\nFixed Income Instruments\n      Part II. Vanilla Models\nYield Curve Construction and Risk Management\nVanilla Models with Local Volatility\nVanilla Models with Stochastic Volatility I\nVanilla Models with Stochastic Volatility II \n\n\nABOUT THE AUTHORS\nVladimir V. Piterbarg is a Managing Director and the Global Head of the Quantitative Analytics group at Barclays Capital, and has worked since 1997 as an interest rate quant at top investment banks. He taught at the University of Chicago Mathematical Finance program for a number of years, and is a prolific and respected researcher in the area of interest rate modeling. He won two Risk Magazine's Quant of the Year Awards (2006 and 2011), and holds a PhD in Mathematics (Probability Theory) from the University of Southern California. He serves as an associate editor of the Journal of Computational Finance and the Journal of Investment Strategies.\n\nTogether with Leif B.G. Andersen, Vladimir V. Piterbarg is the author of the authoritative, 1,200 page long, three-volume set of books &quot;Interest Rate Modeling&quot;. Full details of the monograph are available at www.andersen-piterbarg-book.com","torrent":{"xt":"urn:btih:cdf12435cbd0401c8bcc4dd93120838aba28d6d3","amp;dn":"Interest+Rate+Modeling%2C+Volume+1%3A+Foundations+and+Vanilla+Models","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdf12435cbd0401c8bcc4dd93120838aba28d6d3","infoHashBuffer":{"type":"Buffer","data":[205,241,36,53,203,208,64,28,139,204,77,217,49,32,131,138,186,40,214,211]},"announce":[],"urlList":[]}}