{"title":"[Paul Elliot ,Charlotte E. Willans ,Lee Higham]Organometallic Ch","uid":11194435,"size":30439477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce07498ba1f17af65ebd3510be33b453581e91d2&amp;dn=%5BPaul+Elliot+%2CCharlotte+E.+Willans+%2CLee+Higham%5DOrganometallic+Ch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413059668,"description":"A series of critical reviews and perspectives focussing on specific aspects of organometallic chemistry interfacing with other fields of study are provided. For this volume, the critical reviews cover topics such as the activation of &quot;inert&quot; carbon-hydrogen bonds, ligand design and organometallic radical species. For example, Charlie O'Hara discusses how mixed-metal compounds may perform the highly selective activation of C-H bonds and, in particular, how synergic relationships between various metals are crucial to this approach. The chemistry of a remarkable series of air-stable chiral primary phosphine ligands is discussed in some depth by Rachel Hiney, Arne Ficks, Helge M^3ller-Bunz, Declan Gilheany and Lee Higham. This article focuses on the preparation of these ligands and also how they may be applied in various catalytic applications. Bas De Bruin reports on how ligand radical reactivity can be employed in synthetic organometallic chemistry and catalysis to achieve selectivity in radical-type transformations. As well as highlighting ligand-centered radical transformations in open-shell transition metals, an overview of the catalytic mechanism of Co(II)-catalysed olefin cyclopropanation is given, showing that enzyme-like cooperative metal-ligand-radical reactivity is no longer limited to real enzymes. Valuable and informative comprehensive reviews in the field of organometallic chemistry are also covered in this volume. For example, organolithium and organocuprate chemistry are reviewed by Joanna Haywood and Andrew Wheatley; aspects in Group 2 (Be-Ba) and Group 12 (Zn-Hg) compounds by Robert Less, Rebecca Melen and Dominic Wright; metal clusters by Mark Humphrey and Marie Cifuentes; and recent developments in the chemistry of the elements of Group 14 - focusing on low-coordination number compounds by Richard Layfield. This volume therefore covers many synthetic and applied aspects of modern organometallic chemistry which ought to be of interest to inorganic, organic and applied catalysis fields.\n\nPublisher: Royal Society of Chemistry (9 July 2014)\nLanguage: English\nISBN-10: 1849735832\nISBN-13: 978-1849735834\n\nProduct Description\nAbout the Author\nProfessor Ian Fairlamb's core interests are in transition metal chemistry in synthetic organic chemistry, catalyst design and mechanistic understanding. His work has strong links to biological chemistry, particularly the utilisation of transition metal chemistry in the synthesis of therapeutic agents such as CO releasing molecules and functionalised heteroaromatic compounds. Dr Lynam's main research interest is in the synthesis of transition metal complexes containing nucleobases with a view to utilising the hydrogen bonding properties of these species to direct the self assembly of supramolecular organometallic architectures. \n","torrent":{"xt":"urn:btih:ce07498ba1f17af65ebd3510be33b453581e91d2","amp;dn":"%5BPaul+Elliot+%2CCharlotte+E.+Willans+%2CLee+Higham%5DOrganometallic+Ch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce07498ba1f17af65ebd3510be33b453581e91d2","infoHashBuffer":{"type":"Buffer","data":[206,7,73,139,161,241,122,246,94,189,53,16,190,51,180,83,88,30,145,210]},"announce":[],"urlList":[]}}