{"title":"The Wallflowers - 1996 - Bringing Down the Horse  [EAC FLAC]","uid":4821032,"size":365563042,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ce4911bccc3f31e0097e47c08107d8fa597b844f&amp;dn=The+Wallflowers+-+1996+-+Bringing+Down+the+Horse++%5BEAC+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bludStain","files":-1,"time":1238765832,"description":"The Wallflowers - 1996 - Bringing Down the Horse  [EAC FLAC]\n\nlossless with cue, log, jpg and txt..  OF COURSE!  like it? buy it. i did.\n\n01  One Headlight     Dylan     5:12\n02  6th Avenue Heartache     Dylan     5:37\n03  Bleeders     Dylan     3:41\n04  Three Marlenas     Dylan     4:59\n05  The Difference     Dylan     3:50\n06  Invisible City     Dylan     4:47\n07  Laughing Out Loud     Dylan     3:39\n08  Josephine     Dylan     5:09\n09  God Don't Make Lonely Girls     Dylan     4:48\n10  Angel on My Bike     Dylan     4:21\n11  I Wish I Felt Nothing     Dylan     5:04 \n\nWhen people talk about Jakob Dylan these days, they're less likely to refer to his famous father than to his band, the Wallflowers, and their breakthrough album, Bringing Down the Horse. Not only a staggering commercial success, the disc is also a superb example of the folk-rock Jakob's daddy helped pioneer more than 30 years ago. The Wallflowers don't need family relations to command respect.\n\nWhen the Wallflowers recorded their self-titled album in 1992, most of the band's members were 22 and weren't ready for prime time yet. The songs had flashes of inspiration and promise but didn't really hang together. It took four years for the Wallflowers to release a second album, but this time they were ready. The folk-rock melodies were strong; the playing was clear and muscular, and the production by T-Bone Burnett (friend of the family) framed the lyrics' storytelling imaginatively. Jakob will never escape comparisons to his dad, but his new music can stand on its own as some of the decade's best.\n\nIn fact, Jakob's voice doesn't resemble his father's so much as Tom Petty's nasal drawl, and the way Wallflower Rami Jaffee soaks nearly every song in Benmont Tench-like B-3 organ makes the Heartbreaker connection unmistakable. Fortunately, Jakob's evocative songwriting and the Wallflowers' high-energy playing reminds one of the early Tom Petty &amp; the Heartbreakers records rather than the desultory, later work. Heartbreaker Mike Campbell even plays on &quot;6th Avenue Heartache,&quot; the first single and a gloriously harmonized lament for the victims of America's meanest streets. &quot;The same white line that was drawn on you,&quot; Jakob sings, &quot;was drawn on me.&quot; He takes a more defiant, more rocking approach later in the album when he proclaims he's &quot;Laughing Out Loud&quot; in the face of everyone who ever tried to push him around. \n--Geoffrey Himes \n","torrent":{"xt":"urn:btih:ce4911bccc3f31e0097e47c08107d8fa597b844f","amp;dn":"The+Wallflowers+-+1996+-+Bringing+Down+the+Horse++%5BEAC+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce4911bccc3f31e0097e47c08107d8fa597b844f","infoHashBuffer":{"type":"Buffer","data":[206,73,17,188,204,63,49,224,9,126,71,192,129,7,216,250,89,123,132,79]},"announce":[],"urlList":[]}}