{"title":"SimCity 3000 (ISO)","uid":4868162,"size":419219456,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ce637ae8ca2f2043e43953a46ad9d86322263683&amp;dn=SimCity+3000+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"agonized1","files":1,"time":1240645148,"description":"With SimCity 3000, you have more power than ever before to build and control your city. Re-create your version of the world's greatest cities using landscapes such as San Francisco or Berlin and landmark buildings like the Empire State Building or Big Ben. To put your stamp on your city, create your own buildings using the SimCity Building Architect Tool. Then zoom in close to your metropolis as it comes to life with people and traffic in living color and full 3-D sound. All new missions and cool disasters test your abilities to run your city or even destroy it. For more challenge, negotiate and barter with neighboring cities to strengthen your metropolis.\n\n- Create your own buildings with the SimCity Building Architect Tool\n- Select terrain based on real cities such as New York and San Francisco\n- Choose from improved zoning options, including historic districts\n- Place world-renowned landmarks in your city, like the Empire State Building,\n- Big Ben, and the Statue of Liberty\n- Build your city on a map four times larger than SimCity 2000's\n- Bring your city to life with bustling traffic, SimCitizens, and 3-D surround-sound\n- Customize your landscape with mountains, forests, and waterways \n\nREQUIREMENTS\n\n166 Mhz or faster Pentium or K6 processor\nMicrosoft Windows 95 or 98\n32 MB RAM\n150 MB hard drive space (plus space for saved games)\n4x CD-ROM drive\n2 MB Video Ram\nDirectX compatible sound card\n\nHOW TO INSTALL\n\nMount the ISO and install, then play. Not too hard.\n\n\n[Will be seeded by me for 1 week on my internet speed of about 10mbps upload]\n\n","torrent":{"xt":"urn:btih:ce637ae8ca2f2043e43953a46ad9d86322263683","amp;dn":"SimCity+3000+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce637ae8ca2f2043e43953a46ad9d86322263683","infoHashBuffer":{"type":"Buffer","data":[206,99,122,232,202,47,32,67,228,57,83,164,106,217,216,99,34,38,54,131]},"announce":[],"urlList":[]}}