{"title":"Voices - Music from Final Fantasy 2006 Concert (h264 720x480 60f","uid":5552942,"size":6385497508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ce6d3151e977f4fd3d164757aeae1eebdab11611&amp;dn=Voices+-+Music+from+Final+Fantasy+2006+Concert+%28h264+720x480+60f&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Czevolk","files":2,"time":1273593371,"description":"This is a DVD rip of the Voices - Music from Final Fantasy concert that was held in Yokohama in 2006, featuring vocal arrangements of Final Fantasy music.\n\nBased on compositions by Nobuo Uematsu, the music was performed by the Prima Vista Philharmonic Orchestra in the Pacifico Yokohoma Conference and Convention Center, conducted by Arnie Roth, and sung by various performers. Many of the pieces were sung by the original performers from the game. The concert features Emiko Shiratori, RIKKI, Izumi Masuda, Angela Aki, and the Black Mages. Other local singers and choirs joined the orchestra for the remaining pieces, with Etsuyo Ota, Tomoaki Watanabe, and Tetsuya Odagawa performing &quot;Opera &quot;Maria and Draco&quot;.\n\nThe DVD image is hard to get a hold of, so I decided to encode it into two videos, one containing the concert itself, and the second being the bonus disk with backstage footage and making-of videos. I did my best to preserve the quality of the DVD, and to that end I included both 5.1 and 2.0 audio tracks, and retained the 60fps framerate that the DVD originally used.\n\nThis is the best Final Fantasy concert I've ever listened to, so I hope more people can enjoy Uematsu's genius with this re-release. Enjoy!","torrent":{"xt":"urn:btih:ce6d3151e977f4fd3d164757aeae1eebdab11611","amp;dn":"Voices+-+Music+from+Final+Fantasy+2006+Concert+%28h264+720x480+60f","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce6d3151e977f4fd3d164757aeae1eebdab11611","infoHashBuffer":{"type":"Buffer","data":[206,109,49,81,233,119,244,253,61,22,71,87,174,174,30,235,218,177,22,17]},"announce":[],"urlList":[]}}