{"title":"Handbook of Applied Superconductivity - 2 Vols.pdf","uid":11157542,"size":44819866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cec8c2e3e13bfe4f74b91e346edb3cc3ee648183&amp;dn=Handbook+of+Applied+Superconductivity+-+2+Vols.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"interuniversal","files":-1,"time":1412462015,"description":"Handbook of Applied Superconductivity - 2 Vols\n\nEditor:Bernd Seeber\n\nPublisher:CRC Press\n\nThe Handbook of Applied Superconductivity, Two-Volume Set covers all important aspects of applied superconductivity and the supporting low-temperature technologies. The handbook clearly demonstrates the capabilities of superconducting technologies and illustrates how to implement these technologies in new areas of academic and industrial research and development.\n\nVolume One provides an introduction to the theoretical background of both low and high Tc superconductivity, followed by details of the basic hardware such as wires, tapes, and cables used in applications of superconductivity and the necessary supporting science and technology. Theoretical discussions are in most cases followed by examples of real designs, fabrication techniques, and practical instrumentation guidance. A final chapter examines materials properties at low temperatures.\n\nVolume Two provides examples of current and future applications of superconductivity. It covers medical systems for magnetic resonance imaging (MRI), high field magnets for research, superconducting magnets for accelerators, industrial systems for magnetic separation, and transportation systems. The final chapters look to future applications in power and superconducting electronics.\n\nWith fully referenced, peer-refereed contributions from experts in various fields, this two-volume work is an essential reference for a wide range of scientists and engineers in academic and industrial research and development environments. ","torrent":{"xt":"urn:btih:cec8c2e3e13bfe4f74b91e346edb3cc3ee648183","amp;dn":"Handbook+of+Applied+Superconductivity+-+2+Vols.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cec8c2e3e13bfe4f74b91e346edb3cc3ee648183","infoHashBuffer":{"type":"Buffer","data":[206,200,194,227,225,59,254,79,116,185,30,52,110,219,60,195,238,100,129,131]},"announce":[],"urlList":[]}}