{"title":"The Secret Meaning of Pub Names - Albert Jack - ePub","uid":9262423,"size":3598727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf35e0d8c0ed2f91932b11c94ca66bc8c98d2dcb&amp;dn=The+Secret+Meaning+of+Pub+Names+-+Albert+Jack+-+ePub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ShitBomb","files":-1,"time":1385643610,"description":"This is a book for everyone who has ever wondered why pubs should be called The Cross Keys, The Dew Drop Inn or The Hope and Anchor. You'll be glad to know that there are very good - strange and memorable - reasons behind them all.\n\nAfter much research about (and in) pubs, Albert Jack brings together the stories behind pub names to reveal how they offer fascinating and subversive insights on our history, customs, attitudes and jokes in just the same way that nursery rhymes do. The Royal Oak, for instance, commemorates the tree that hid Charles II from Cromwell's forces after his defeat at Worcester; The Bag of Nails is a corruption of the Bacchanals, the crazed followers of Bacchus, the god of wine and drunkenness; The Cat and the Fiddle a mangling of Catherine La Fidele and a guarded gesture of support for Henry VIII's first, Catholic, wife Catherine of Aragon; plus many, many more.\n\nHere too are even more facts about everything from ghosts to drinking songs to the rules of cribbage and shove ha'penny, showing that, ultimately, the story of pub history is really the story of our own popular history.","torrent":{"xt":"urn:btih:cf35e0d8c0ed2f91932b11c94ca66bc8c98d2dcb","amp;dn":"The+Secret+Meaning+of+Pub+Names+-+Albert+Jack+-+ePub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf35e0d8c0ed2f91932b11c94ca66bc8c98d2dcb","infoHashBuffer":{"type":"Buffer","data":[207,53,224,216,192,237,47,145,147,43,17,201,76,166,107,200,201,141,45,203]},"announce":[],"urlList":[]}}