{"title":"Herbie Hancock - Empyrean Isles (1964) 2013 HDtracks 24-192-FLAC","uid":11433795,"size":1464569593,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf85c741a34772312f1e12d33b3279a93b3c7dcd&amp;dn=Herbie+Hancock+-+Empyrean+Isles+%281964%29+2013+HDtracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"hal4000","files":-1,"time":1415737886,"description":"Herbert Jeffrey &quot;Herbie&quot; Hancock (born April 12, 1940) is an American pianist, keyboardist, bandleader and composer. As part of Miles Davis's Second Great Quintet, Hancock helped to redefine the role of a jazz rhythm section and was one of the primary architects of the &quot;post-bop&quot; sound. He was one of the first jazz musicians to embrace music synthesizers and funk music (characterized by syncopated drum beats). Hancock's music is often melodic and accessible; he has had many songs &quot;cross over&quot; and achieved success among pop audiences. His music embraces elements of funk and soul while adopting freer stylistic elements from jazz. In his jazz improvisation, he possesses a unique creative blend of jazz, blues, and modern classical music, with harmonic stylings much like the styles of Claude Debussy and Maurice Ravel.\n\nMy Point of View and Inventions and Dimensions found Herbie Hancock exploring the fringes of hard bop, working with a big band and a Latin-flavored percussion section, respectively. On Empyrean Isles, he returns to hard bop, but the results are anything but conventional. Working with cornetist Freddie Hubbard, bassist Ron Carter, and drummer Tony Williams -- a trio just as young and adventurous as he was -- Hancock pushes at the borders of hard bop, finding a brilliantly evocative balance between traditional bop, soul-injected grooves, and experimental, post-modal jazz. Hancock's four original concepts are loosely based on the myths of the Empyrean Isles, and they are designed to push the limits of the band and of hard bop. Even &quot;Cantaloupe Island,&quot; well-known for its funky piano riff, takes chances and doesn't just ride the groove. &quot;The Egg,&quot; with its minimal melody and extended solo improvisations, is the riskiest number on the record, but it works because each musician spins inventive, challenging solos that defy convention. In comparison, &quot;One Finger Snap&quot; and &quot;Oliloqui Valley&quot; adhere to hard bop conventions, but each song finds the quartet vigorously searching for new sonic territory with convincing fire. That passion informs all of Empyrean Isles, a record that officially established Hancock as a major artist in his own right.\n\nHDtracks PCM-24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:cf85c741a34772312f1e12d33b3279a93b3c7dcd","amp;dn":"Herbie+Hancock+-+Empyrean+Isles+%281964%29+2013+HDtracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf85c741a34772312f1e12d33b3279a93b3c7dcd","infoHashBuffer":{"type":"Buffer","data":[207,133,199,65,163,71,114,49,47,30,18,211,59,50,121,169,59,60,125,205]},"announce":[],"urlList":[]}}