{"title":"Discovery Channel - Nature of Sex Collection (2010)","uid":15372848,"size":2409897984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf8df65d9aace0137f03fc7acddd93995bfdfa0c&amp;dn=Discovery+Channel+-+Nature+of+Sex+Collection+%282010%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Volyova","files":3,"time":1469162389,"description":"Nature of Sex Collection \r\n\r\nYou won't be able to resist this tantalizing and revealing collection of Discovery Channel's distinctive programs on the mysterious and fascinating nature of sex. From science to seduction, we make some shocking discoveries as scientific experts and intimate portraits reveal little-known wonders of the reproductive process. Then travel through history to look at some surprising attitudes toward sex and uncover some unusual sexual practices. You'll be amazed at the tenacity and creativity of the human spirit and body in ensuring the survival of our species.\r\n\r\nPart 1: Science of the Sexes\r\nThis definitive trip around male and female anatomy confirms what humans often forget: men and women are made for each other. Scientific experts, intimate portraits and real-life situations explain how human bodies grow, adapt and support each other. Run-time 98mins\r\n\r\n\r\nPart 2: Architecture and Design of Man and Woman\r\nFind out how the unique anatomy of men and women encourages reproduction from attraction to conception. More efficient than any machine and more beautiful than a work of art are the male and female human bodies at the peak of reproductive fitness. Run-Time 46mins\r\n\r\n\r\nPart 3: Anatomy of Sex\r\nThe human body works in specific, yet subtle ways in order to ensure reproduction. Discover the biological responses to attraction and mating, and observe the fascinating evolutionary story of natural selection and care giving as a couple tries to start a family. Run-Time 44mins\r\n\r\n\r\n\r\n\r\n \nhttp://forums.mvgroup.org/index.php?&amp;showtopic=45762","torrent":{"xt":"urn:btih:cf8df65d9aace0137f03fc7acddd93995bfdfa0c","amp;dn":"Discovery+Channel+-+Nature+of+Sex+Collection+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf8df65d9aace0137f03fc7acddd93995bfdfa0c","infoHashBuffer":{"type":"Buffer","data":[207,141,246,93,154,172,224,19,127,3,252,122,205,221,147,153,91,253,250,12]},"announce":[],"urlList":[]}}