{"title":"Improvisation for the Spirit: Live a More Creative, Spontaneous,","uid":8957989,"size":3058905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d090c3229ddfdfedb1be84a5d76875e5f7bcfd81&amp;dn=Improvisation+for+the+Spirit%3A+Live+a+More+Creative%2C+Spontaneous%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1380041789,"description":"Improvisation for the Spirit: Live a More Creative, Spontaneous, and Courageous Life Using the Tools of Improv Comedy \nby Katie Goodman \n\n\nWish you could gag your Inner Critic? Feeling blocked creatively? Want to make a big change, but fear taking the leap?\n\nComedy improv requires quick thinking, collaboration, getting out of your own way, and being in the moment without being a perfectionist. Katie Goodman, an internationally touring improv comedian and comedy writer, uses her witty and encouraging style to show you how to acquire the skills of improv comedy and apply them to every aspect of daily life. Along the way Goodman shares hilarious and insightful stories from her experiences onstage, as well as step-by-step exercises from her popular self-discovery workshops and retreats. Packed with creative, original, and, most importantly, fun exercises, Improvisation for the Spirit offers a truly transformational guide for anyone wanting to get more out of life.\n\n&quot;Bottom line: Katie is funny. She teaches you to live your life like an improv scene - no fear and fully committed.&quot;\n- Wayne Brady, improv comedian, Whose Line Is It Anyway? and Don't Forget the Lyrics\n\n&quot;Katie Goodman's writing fl ows and then jumps with anecdotes and prescriptions for finding courage. Fun to read, hard to put down.&quot;\n- Lesley Stahl, 60 Minutes\n\n&quot;If you feel that something is holding you back, that the life you are meant to live is out there somewhere if only you could fi nd it, then this book should go straight to the top of your reading list.&quot;\n- Carl Honore, author of In Praise of Slowness and Under Pressure \n","torrent":{"xt":"urn:btih:d090c3229ddfdfedb1be84a5d76875e5f7bcfd81","amp;dn":"Improvisation+for+the+Spirit%3A+Live+a+More+Creative%2C+Spontaneous%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d090c3229ddfdfedb1be84a5d76875e5f7bcfd81","infoHashBuffer":{"type":"Buffer","data":[208,144,195,34,157,223,223,237,177,190,132,165,215,104,117,229,247,188,253,129]},"announce":[],"urlList":[]}}