{"title":"Nick Cave &amp; The Bad Seeds - Live From KCRW (2013) [EAC-FLAC]","uid":14339377,"size":345238350,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0c1e10fc56624b8385e05506060bce4faaf1208&amp;dn=Nick+Cave+%26amp%3B+The+Bad+Seeds+-+Live+From+KCRW+%282013%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pucholoco","files":19,"time":1460744304,"description":"Nick Cave &amp; The Bad Seeds - Live From KCRW (2013) \r\n              EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 318 Mb\r\n                       Full Artwork @ 300 dpi (png) -&gt; 28 Mb\r\n\r\n\r\nIn April 2013, Nick Cave &amp; the Bad Seeds were booked to play the Coachella Valley Music and Arts Festival, and with the same lineup of acts appearing two consecutive weekends, Cave and his bandmates had a few days to kill in California. During their downtime in the Golden State, Cave and the Bad Seeds cut a live-in-the-studio session for Santa Monica's public radio station KCRW-FM, and the recordings have been released under the straightforward (if less than imaginative) title Live from KCRW.\r\n\r\nGiven that Cave's Push the Sky Away had been released just two months earlier, it should come as no surprise that the KCRW set followed the soulful but understated tone of that album, and the two releases share four songs, but in many respects, this is a richer and more emotionally engaging experience, and nearly as precise. \r\n\r\nWhile some lamented the absence of Mick Harvey on Push the Sky Away, this compact version of the Bad Seeds – Cave on vocals and piano, Warren Ellis on guitar, violin, piano, and vocals, Barry Adamson on organ and vocals, Martyn Casey on bass, and Jim Sclavunos on drums and vocals – sounds remarkably tight and intuitive here, calling up a palette of sounds that range from the spectral to the majestic, and as they accompany Cave on a set of his more contemplative material, the effect is impressive, especially given the one-take nature of the recording. (Bob Clearmountain's engineering is as clean and beautifully detailed as it is unobtrusive.) \r\nIf you're looking for Cave the Fierce and Haunted Rocker, this is not the album you're hoping for, despite an aggressive, impromptu performance of &quot;Jack the Ripper&quot; that closes out the set. Instead, the introspective and literate Cave is the centerpiece here, and he sings beautifully on a set of songs that represents some of his finest work, including &quot;The Mercy Seat,&quot; &quot;And No More Shall We Part,&quot; and a truly heart-rending &quot;People Ain't No Good.&quot; Ultimately, Live from KCRW feels like an addendum to the larger work of Push the Sky Away, but the musical and emotional force of this music is more than strong enough to merit its release; this is a striking reminder of the excellence of Nick Cave &amp; the Bad Seeds as a live act, and Cave's maturation into one of the most extraordinary songwriters of his day.\r\n\r\n\r\n------------------------------------------------------------------------------\r\nTracklist:\r\n------------------------------------------------------------------------------\r\n\r\n01. Higgs Boson Blues\r\n02. Far From Me\r\n03. Stranger Than Kindness\r\n04. The Mercy Seat\r\n05. And No More Shall We Part\r\n06. Wide Lovely Eyes\r\n07. Mermaids\r\n8. People Ain’t No Good\r\n9. Push The Sky Away\r\n10. Jack The Ripper\r\n\r\n*2013 Bad Seeds Ltd | 5 060186 920924 / BS006CD\r\n\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:d0c1e10fc56624b8385e05506060bce4faaf1208","amp;dn":"Nick+Cave+%26amp%3B+The+Bad+Seeds+-+Live+From+KCRW+%282013%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c1e10fc56624b8385e05506060bce4faaf1208","infoHashBuffer":{"type":"Buffer","data":[208,193,225,15,197,102,36,184,56,94,5,80,96,96,188,228,250,175,18,8]},"announce":[],"urlList":[]}}