{"title":"Stephen Malkmus &amp; The Jicks - Wig Out at Jagbags (2014) [FLA","uid":9456160,"size":256490939,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d13502e918b1f35df6f7ca2ebf19d9872693f7a1&amp;dn=Stephen+Malkmus+%26amp%3B+The+Jicks+-+Wig+Out+at+Jagbags+%282014%29+%5BFLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1389277108,"description":"\n  Stephen Malkmus &amp; The Jicks - Wig Out at Jagbags (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Planetary Motion\n  02 The Janitor Revealed\n  03 Lariat\n  04 Houston Hades\n  05 Shibboleth\n  06 J Smoov\n  07 Rumble at the Rainbo\n  08 Chartjunk\n  09 Independence Street\n  10 Scattegories\n  11 Cinnamon and Lesbians\n  12 Surreal Teenagers\n\n  The title is quintessentially Stephen Malkmus -- a conflation of two slang terms, one dating back to the hazed-out '60s, the other a vulgar remnant of modernity -- and, as it happens, Wig Out at Jagbags also sounds quintessentially Malkmusian. It's elastic guitar rock constructed partially out of cannabis guitar jams and partially out of punk rock squalls, both sides distinguished by wry melodicism and dexterous wordplay, not to mention Malkmus' lingering tendency to hide his accessible inclinations under sheets of six-strings. On 2011's Mirror Traffic, producer Beck prevented the Jicks from taking detours, but here the band is producing on its own, assisted by Remko Schouten, so they're free to follow wherever their whims may take them. In the past, the untrammeled Jicks usually pursued one of their twin obsessions -- either riding out a cool, non-funky groove or opening up the skies with guitars, ideally blending the two -- but here, there's a distinct mellowing as the forays into psychedelia and noise skronk are tempered as Malkmus once again finds fascination in colorful, swaying pop. \n\n  Often, this takes the form of updated latter-day Pavement -- the sing-song &quot;Lariat&quot; and &quot;Cinnamon and Lesbians&quot; find their roots in Brighten the Corners -- but no matter if Malkmus is singing about &quot;music from the Best Decade Ever,&quot; there's no sense of nostalgia here, no suspicion that he'd rather be playing with a reunited Pavement than the Jicks, perhaps because Wig Out at Jagbags -- the first album he's recorded since reuniting with his '90s band in 2010; it's the also the first without Janet Weiss, who left in 2010 to play with Wild Flag and has been replaced by Jake Morris -- is nimble in a way Malkmus has rarely been. As the Jicks trim their improvisations, they retain a mischievous spirit -- witness the cheery horn stabs of &quot;Chartjunk,&quot; which swaggers like prime crossover Spoon and thereby raises the question of whether the song is a piss-take -- which means that even if Wig Out at Jagbags is quieter than, say, 2008's churning Real Emotional Trash, it feels looser than most of the Jicks records; the compositions are tight but the attitude is ragged, which winds up being more infectious and fun than albums where the songs drift but the instruments are tight.","torrent":{"xt":"urn:btih:d13502e918b1f35df6f7ca2ebf19d9872693f7a1","amp;dn":"Stephen+Malkmus+%26amp%3B+The+Jicks+-+Wig+Out+at+Jagbags+%282014%29+%5BFLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d13502e918b1f35df6f7ca2ebf19d9872693f7a1","infoHashBuffer":{"type":"Buffer","data":[209,53,2,233,24,177,243,93,246,247,202,46,191,25,217,135,38,147,247,161]},"announce":[],"urlList":[]}}