{"title":"Charade-Audrey Hepburn-thriller,mister,comedie,romantic 1963","uid":5351490,"size":734428505,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1382226f4619e86f94612f28c3bd17fd2e1fbdd&amp;dn=Charade-Audrey+Hepburn-thriller%2Cmister%2Ccomedie%2Cromantic+1963&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Blu3RO","files":2,"time":1265760516,"description":"Let's see: what we got here is one of the best romantic-comedy/thriller scripts ever made, one of the best Hollywood directors from 50's and 60's, the more elegant and classy actress ever (Audrey Hepburn), the more elegant and classy actor ever (Cary Grant), two of the best &quot;tough guys&quot; from the big screen (G. Kennedy and James Coburn), one of the best comedy actors ever (Walter Matthau), and the city of Paris. Nothing could possibly go wrong, don't you think? \n\nAudrey Hepburn is Reggie Lambert, an American girl married to a swiss guy called Charles Lambert (at least that's what she thinks)... She's spending her holidays in some ski resort with her best girlfriend Sylvie and the son of hers. Reggie has decided to divorce her husband, so she gets back to Paris. Once there she found out that her husband's been killed. From this moment on she gets involved in the funniest spy plot ever.\n\nWatching Charade you'll have an smile on your face from the beginning till the very end. And you'll burst out laughing in many moments of the movie. Stanley Donen gets out of every sequence very skillfully and, as he did before in Seven Brides or Singin' In The Rain, he probes he's an outstanding filmmaker. There're two names that come into my mind every time I watch this movie: Alfred Hitchcock and Blake Edwards. In Charade, Stanley Donen merged suspense and romantic-comedy in the best possible way. Actor's selection is just perfect, the chemical between Hepburn and Grant is simply unbeatable. One more perfect couple to add to Hollywood's Couple's Hall Of Fame: side by side with Katharine Hepburn-Spencer Tracy, Katharine Hepburn-Cary Grant (him once again!), Lauren Bacall-Humphrey Bogart... It's not easy to find two actors so compatible. What to say about George Kennedy or James Coburn? Best known for their roles in action movies, they do their best as CIA agents. And least but not less, we got Walter Matthau, one of the best comedy actors ever (I should've put Walter Matthau-Jack Lemon in my Couple's Hall Of Fame!) doing the best he can (that is a lot!) as (in principle) an American Embassy employee. \n\nSo if you liked North By Northwest or Breakfast At Tiffany's, if you think that there's never been a more classy actress than Audrey Hepburn, if you do believe that Cary Grant's been one of the more talented actors ever (and one of the funniest ones)... please, don't miss Charade. You'll spend one of the times of your life. \n\nAur Voir, Mon Amis!\n","torrent":{"xt":"urn:btih:d1382226f4619e86f94612f28c3bd17fd2e1fbdd","amp;dn":"Charade-Audrey+Hepburn-thriller%2Cmister%2Ccomedie%2Cromantic+1963","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1382226f4619e86f94612f28c3bd17fd2e1fbdd","infoHashBuffer":{"type":"Buffer","data":[209,56,34,38,244,97,158,134,249,70,18,242,140,59,209,127,210,225,251,221]},"announce":[],"urlList":[]}}