{"title":"Commandos 3: Destination Berlin","uid":8268616,"size":1940482048,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d1499c9b9614807295b62d30ebaf94980cd405d5&amp;dn=Commandos+3%3A+Destination+Berlin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tonaik59","files":-1,"time":1363557844,"description":"Commandos 3: Destination Berlin\n\nThe game contains very similar gameplay to the previous games, with the similar 'point and click' approach. However, it has fewer hotkeys compared to the previous instalment, and the user has to press buttons at the bottom of the screen on the action bar.\n\nAs in Commandos 1 and 2, you are able to see all enemies on the map, follow their movements, and make attacks depending on their behavior. There are a few differences, such as the addition of an 'Assault Rifle' - a weapon less powerful than a rifle, but more powerful than a pistol. Also, all units are able to use weapons such as the grenade, rather than just the Sapper as in previous games. The previous &quot;knapsack&quot; setup, simply showing a picture of all the items the currently selected commando has in his possession, superimposed over a picture of a rucsac, has been abandoned in favor of a &quot;box&quot;. When the inventory is selected, there are multiple blocks to put items in, such as grenades (1 block), pistols (1 block), rifles (4 blocks horizontal), enemy uniforms (4 blocks square), sub-machineguns (4 blocks square) and time-bombs (2 blocks horizontal).","torrent":{"xt":"urn:btih:d1499c9b9614807295b62d30ebaf94980cd405d5","amp;dn":"Commandos+3%3A+Destination+Berlin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1499c9b9614807295b62d30ebaf94980cd405d5","infoHashBuffer":{"type":"Buffer","data":[209,73,156,155,150,20,128,114,149,182,45,48,235,175,148,152,12,212,5,213]},"announce":[],"urlList":[]}}