{"title":"Michael McCollum - Gibraltar Series [1-3]","uid":11624495,"size":559396624,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d17d063d3ca539bef8f59d83c6df3cb4bb2ac967&amp;dn=Michael+McCollum+-+Gibraltar+Series+%5B1-3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":3,"time":1417601979,"description":"Michael McCollum - Gibraltar Series [1-3]\n\n\nGibraltar Earth (Gibraltar Stars #1)\n\nIn 2345, humanity has gained a toehold among the stars when a starship encounters two hostile alien spacecraft. The aliens come from a million-star empire whose rulers allow no competitors. What to do? Do we hide and pray the aliens overlook Earth for a few more generations, or do we take a more aggressive approach? Whatever we do, it must be done quickly! Time is running out.\n\n---\n\nGibraltar Sun (Gibraltar Stars #2) \n\nThe expedition to the Crab Nebula has returned and the news is not good. A million star systems have fallen under Broan domination. Do we submit meekly or fight and risk extermination? Do we hide and pray the Broa remain ignorant of humanity's existence for a little while longer? Are the hairless apes of Sol III finally faced with a problem that has no acceptable solution?\n\n---\n\nGibraltar Stars (Gibraltar Stars #3) \n\nThe great debate is over. The human race has rejected the idea of pulling back from the stars and hiding on Earth in the hope the Broa will overlook us for a few more generations. Instead, the World Parliament, by a 60-40 vote, has decided to throw the dice and go for a win. Parliament Hall resounds with brave words as members declare victory inevitable.\nWith the balance of forces a million to one against Homo sapiens Terra, those who must turn patriotic speeches into hard-won reality have their work cut out for them. They must expand humanitys foothold in Broan space while contending with a supply line that is 7000 light-years long.\nIf the sheer magnitude of the task isnt enough, Mark and Lisa Rykand discover they are in a race against two very different antagonists. The Broa are beginning to wonder at the strange two-legged interlopers in their domain; while back on Earth, those who lost the great debate are eager to try again.\nWhoever wins the race will determine the future of the human species... or, indeed, whether it has one","torrent":{"xt":"urn:btih:d17d063d3ca539bef8f59d83c6df3cb4bb2ac967","amp;dn":"Michael+McCollum+-+Gibraltar+Series+%5B1-3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d17d063d3ca539bef8f59d83c6df3cb4bb2ac967","infoHashBuffer":{"type":"Buffer","data":[209,125,6,61,60,165,57,190,248,245,157,131,198,223,60,180,187,42,201,103]},"announce":[],"urlList":[]}}