{"title":"Osho_The Last Testament Vol-2 #25_psychotherapist","uid":15245393,"size":746841971,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d180cc64c44a4a1661f243de4bda1c81084b69f6&amp;dn=Osho_The+Last+Testament+Vol-2+%2325_psychotherapist&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"drugarica","files":3,"time":1467997535,"description":"Documentary video talk -an interview with World press 1985, in Rajneeshpuram, Oregon, US\r\nLength: \t101 mins\r\n\r\nJournalist is also psychotherapist with interesting questions and Osho is talking about commune, relations with neighbours, Sheela, greed for power etc.\r\n\r\nText of this talk read here:\nall audio and books can be free downloaded from oshoworld.com\r\n\r\nOsho_The Last Testament, Vol 2\r\nChapter #25\r\nChapter title: None\r\n15 September 1985 pm in Sanai Grove\r\n\r\n\r\nINTERVIEW WITH TOM GREENING, HUMANISTIC PSYCHOLOGY MAGAZINE, LOS ANGELES, CALIFORNIA\r\n\r\nANSWER:* Glad to meet you.\r\n...............................\r\nexcerpt..about commune\r\nA:* No, but it has not harmed anybody. She simply befooled herself. Nobody is harmed by her bugging or taping peoples' conversations, because these people and their conversations on telephone are either simple gossips or some loving words to a friend.... Taping them is simply stupid. They are not plotting any conspiracy. But people who are power oriented are paranoid; they are always afraid that somebody is going to take over their place.\r\nOtherwise, bugging my room was absolutely stupid, because she was the only one who used to come there -- just for her work, if something was needed as advice. There was no need to bug it, but she must have been afraid: perhaps somebody else enters there without her knowing, informs me about what is going on.... Just paranoia! These people are not living happily -- they are simply trembling inside, continuously afraid and looking everywhere with suspicion. And my people are meditating, doing work, enjoying, dancing, singing -- they don't have anything to bother about. That's why she could carry on for three and a half years.\r\nJust now it became difficult for her, because I started speaking. My speaking created a trouble.\r\n\r\nQ:* THE DAY WILL COME WHEN YOU WILL STOP SPEAKING AGAIN -- WILL YOUR SANNYASINS THEN HAVE MOVED SPIRITUALLY, POLITICALLY, WHATEVER WAY, TO WHERE THEY CAN HANDLE THAT KIND OF PROBLEM?\r\n\r\nA:* I am not going to stop speaking until I am dead! And who knows? -- I may speak even after that!\r\n\r\nQ:* BUT IN CASE YOU DON'T....\r\n\r\nA:* Just old habit!\r\n\r\nQ:* OR THEY MAY HEAR YOU SPEAKING EVEN AFTER DEATH....\r\n\r\nA:* Yes!\r\n\r\nQ:*... WHETHER YOU DO OR NOT.\r\n\r\nA:* But I will prepare them... and they are preparing -- this has been a good experience for them, that this should not happen again, that they should not be political, but that they should be aware that they are not being politically cheated, that somebody does not become -- on their account -- and takes advantage. This will not happen now. I will prepare them for that too, that they should keep an eye.\r\n\r\nDecentralization of power into many peoples hands will be one of the basic things. Second, the people should be taught that they do their meditations, they rejoice their life, they need not worry too much about, but they should keep an eye. It is their life and nobody should become so powerful that he starts interfering. Now this is against human freedom: to tape somebody's phone, to bug somebody's room -- this is inhuman and ugly. And that too, of people who love you, who are not against! There is no political party here.\r\n\r\nQ:* WERE YOU... BUT PEOPLE DO THAT, WE KNOW THEY DO THAT. WERE YOU SURPRISED?\r\n\r\nA:* No. I am not surprised. I am never surprised....\r\n\r\nQ:* UH HUH.\r\n\r\nA:* Because I know human mind so clearly, that it can do any stupid thing -- there is no need to surprise.\r\n\r\nQ:* I GUESS MY HOPE IS THAT BY KNOWING THAT PEOPLE WILL DO ANY STUPID, EGO-ORIENTED, POWER TRIP OR PARANOID TRIP THAT THEN WE CAN SOMETIMES DESIGN STRATEGIES IN ADVANCE TO PREVENT THAT FROM HAPPENING.\r\n\r\nA:* I will be doing it. It will be prevented -- it won't happen again.\r\n\r\nQ:* DECENTRALIZATION OF POWER IS ONE WAY -- OTHERS WAYS OF?\r\n\r\nA:* People have to... I am now going to constantly make them aware and alert. I am going to help them not to ignore what people who are in power are doing and I am putting in power people who have simply no ambition, who have been connected with me and I know them -- they have no ambition of any kind. In fact, unwillingly they are taking the post. And my third idea is that we will be rotating. There is no need for power to remain in one hand for a long period. That the person starts taking it for granted -- that it is his.\r\nSo rotate power, change people -- and it is good: we are doing that rotation in other fields. The professors are doing gardening, some gardener who has been a professor is back in the university, some therapist is in the carpenter's workshop and some carpenter -- my own carpenter who has made this chair -- he is a Ph.D.: he can any day go to the university and be the vice-chancellor.\r\nSo we are doing that in every field, just we were not touching the power elite for the simple reason that there were so many complications with government, with legal courts, so we wanted the people to deal who know, who have been dealing, who have been going to the court, but now we will take that risk. It is better to take the risk rather than give somebody an opportunity to become an egoist.\r\nIt is against his spiritual growth to give him the opportunity to become an egoist","torrent":{"xt":"urn:btih:d180cc64c44a4a1661f243de4bda1c81084b69f6","amp;dn":"Osho_The+Last+Testament+Vol-2+%2325_psychotherapist","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d180cc64c44a4a1661f243de4bda1c81084b69f6","infoHashBuffer":{"type":"Buffer","data":[209,128,204,100,196,74,74,22,97,242,67,222,75,218,28,129,8,75,105,246]},"announce":[],"urlList":[]}}