{"title":"Anne Murray Love Songs [V0](Big Papi)","uid":9602894,"size":71255849,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d19bcb039501c4e0652fc570525e14979e7a6c06&amp;dn=Anne+Murray+Love+Songs+%5BV0%5D%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1392153244,"description":"Source: CD + Fresh Cover Art Scan\n\n\n\n\nMatthew G. Sherwin VINE VOICE wrote:\n\nLove Songs is a beautiful, classic album by Anne Murray; both newcomers to Anne's artistry as well as diehard fans will be charmed by this release. The CD features Anne in her natural element, singing pop and country songs about love with all the good and the bad that can come with love. The quality of the sound is very, very good and I like the artwork.\n\n&quot;What's forever For&quot; is the first song on this album; Anne delivers this with panache and I'm very impressed. Anne truly goes deep into the meaning of the lyrics to bring out and express every single nuance of the lyrics as she sings them; and this makes her performance shine particularly bright. I love it! &quot;What's forever For&quot; has a fine arrangement with music that fits perfectly with Anne's vocals; and this makes it a strong starter song. &quot;You're a Part of Me&quot; charms me with its natural beauty; just as another reviewer notes it's songs like this that will indeed stick in your head! Anne's cover of &quot;Dream Lover&quot; has her squarely front and center; this is a major highlight of the album and it's amazing.\n\n&quot;It Should Have Been Easy&quot; has Anne delivering this wonderfully; she sings this to perfection--and beyond! The melody is easy on the ear and that country flavor works wonders for this ballad even if the lyrics aren't all that happy. &quot;Just to Feel This Love from You&quot; sounds strong and confident; Anne performs this without ever letting go of a single superfluous note and that's grand. In addition, there's Anne singing her heart out on &quot;The Tennessee Waltz;&quot; &quot;The Tennessee Waltz&quot; is a number I first heard on a Patti Page CD and I think Patti would approve of Anne's outstanding rendition of this ballad. Anne sings this with passion and great sensitivity; and it's clearly another gem on this album.\n\n&quot;Let's Keep It That Way&quot; has a stunning arrangement and Anne Murray sings this with both style and grace; it's very memorable and I also really like &quot;We Don't Make Love Anymore.&quot; &quot;We Don't Make Love Anymore&quot; is very poignant and Anne does this very well. There's yet another highlight in the final song on the album, &quot;(He Can't Help It If) He's Not You.&quot; &quot;(He Can't Help It If) He's Not You&quot; showcases Anne singing marvelously; and that country twist makes it very special.\n\nAnne Murray's talent over the years remains a constant and a treasure; this is a must-have for her fans. We are all better off for Anne sharing her gift with us; and hopefully she'll continue to perform for many years to come.\n\n\n\n\n\nAnne Murray - Love Songs\n\nArtist...............: Anne Murray\nAlbum................: Love Songs\nGenre................: Country\nSource...............: CD\nYear.................: 1975\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 243kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n\nTracklisting\n\n1. Anne Murray - What's Forever For [03:40]\n2. - [03:26]\n3. Anne Murray - Dream Lover [03:09]\n4. Anne Murray - It Should Have Been Easy [02:37]\n5. Anne Murray - Just to Feel This Love from You [03:08]\n6. Anne Murray - Tennessee Waltz [02:48]\n7. Anne Murray - Bitter They Are, Harder They Fall [02:43]\n8. Anne Murray - Only Love [03:43]\n9. Anne Murray - Let's Keep It That Way [03:34]\n10. Anne Murray - We Don't Make Love Anymore [03:53]\n11. Anne Murray - Beginning to Feel Like Home [02:46]\n12. Anne Murray - (He Can't Help It If) He's Not You [03:09]\n\nPlaying Time.........: 38:41\nTotal Size...........: 67.89 MB","torrent":{"xt":"urn:btih:d19bcb039501c4e0652fc570525e14979e7a6c06","amp;dn":"Anne+Murray+Love+Songs+%5BV0%5D%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d19bcb039501c4e0652fc570525e14979e7a6c06","infoHashBuffer":{"type":"Buffer","data":[209,155,203,3,149,1,196,224,101,47,197,112,82,94,20,151,158,122,108,6]},"announce":[],"urlList":[]}}