{"title":"Electrical Safety Code Manual {BBS}","uid":6871065,"size":11462891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1b3f1ee94751962e263d0a654f5207cf3c2064b&amp;dn=Electrical+Safety+Code+Manual+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1323276734,"description":"Safety in any workplace is extremely important. In the case of the electrical industry, safety is critical and the codes and regulations which determine safe practices are both diverse and complicated. Employers, electricians, electrical system designers, inspectors, engineers and architects must comply with safety standards listed in the National Electrical Code, OSHA and NFPA 70E. Unfortunately, the publications which list these safety requirements are written in very technically advanced terms and the average person has an extremely difficult time understanding exactly what they need to do to ensure safe installations and working environments.\n\nThis book will tie together the various regulations and practices for electrical safety and translate these complicated standards into easy to understand terms. This will result in a publication that is a practical, if not essential, asset to not only designers and company owners but to the electricians who must put compliance requirements into action in the field.\n\n\nBest-practice methods for accident prevention and electrical hazard avoidance\nCurrent safety regulations, including new standards from OSHA, NEC, NESC, and NFPA\nInformation on low-, medium-, and high-voltage safety systems\nStep-by-step guidelines on safety audits\nTraining program how-to's, from setup to rescue and first aid procedures \n\n\n# Paperback: 400 pages\n# Publisher: Butterworth-Heinemann; 1 edition (June 22, 2010)\n# Language: English\n# ISBN-10: 1856176541\n# ISBN-13: 978-1856176545","torrent":{"xt":"urn:btih:d1b3f1ee94751962e263d0a654f5207cf3c2064b","amp;dn":"Electrical+Safety+Code+Manual+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b3f1ee94751962e263d0a654f5207cf3c2064b","infoHashBuffer":{"type":"Buffer","data":[209,179,241,238,148,117,25,98,226,99,208,166,84,245,32,124,243,194,6,75]},"announce":[],"urlList":[]}}