{"title":"Orson Welles - The Lady From Shanghai [CiN]","uid":3282767,"size":1253915447,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d27d3a4392772f65e660efe26f1dea6313987252&amp;dn=Orson+Welles+-+The+Lady+From+Shanghai+%5BCiN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Pippin","files":4,"time":1106954048,"description":"Next Welles film is The Lady From Shanghai from 1948.\n&lt;p&gt;\n&lt;img src=&quot;http://server3.uploadit.org/files/Pippin-Ladyshanghai.jpg&quot; /&gt;\n&lt;/p&gt;\n&lt;p&gt;\nOne of the mutilated masterpieces: The studio was shocked at the result and trimmed it down. But enough classic scenes and wellesian magic remain to go round - with the hall of mirrors climax a triumph. I include a small doc with Peter Bogdanovich on the film (but dont watch it before the film, it gives too much away!) and also added Bogdanovich' commentary track. He mentions an interview book he did with Welles, I got the cassette tape companion (the original conversations) to that, I'll upload as soon as I get them digitized, theyre great. English subtitles included (unfortunately in yellow....).\n&lt;/p&gt;\nAmazon.com: Legend has it that Orson Welles more or less conned studio boss Harry Cohn over the phone into making this movie by grabbing the title from a nearby paperback. In any case, The Lady from Shanghai is one of Welles's most fascinating works, a bizarre tale of an Irish sailor (Welles) who accompanies a beautiful woman (Rita Hayworth) and her handicapped husband (Everett Sloane) on a cruise and becomes involved in a murder plot. But never mind all that (the aforementioned legend also claims that Cohn offered a reward to anyone who could explain the plot to him). The film is really a dream of Welles's driving preoccupations on- and offscreen at the time: the elusiveness of identity, the mystique of things lost, and most of all the director's faltering marriage to Hayworth. In the tradition of male filmmakers who indirectly tell the story of their love affairs with leading ladies, Welles tells his own, photographing Hayworth as a deconstructed star, an obvious cinematic creation, thus reflecting, perhaps, a never-satisfied yearning that leads us back to the mystery of Citizen Kane.\n&lt;p&gt;\nCodec: DivX Pro 5.2.1\nResolution: 608x448\nFramerate: 23.976 fps\nAspect Ratio: 4:3\nBitrate: 1599 kbit/s\nAudio (both): Mp3PRO @ 64 kbit/s (Mono)\n&lt;/p&gt;\n&lt;A HREF=&quot;http://www.piratbyran.org/?view=forum&amp;a=thread&amp;id=19235&quot;&gt;Cineastklubben&lt;/A&gt;","torrent":{"xt":"urn:btih:d27d3a4392772f65e660efe26f1dea6313987252","amp;dn":"Orson+Welles+-+The+Lady+From+Shanghai+%5BCiN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d27d3a4392772f65e660efe26f1dea6313987252","infoHashBuffer":{"type":"Buffer","data":[210,125,58,67,146,119,47,101,230,96,239,226,111,29,234,99,19,152,114,82]},"announce":[],"urlList":[]}}