{"title":"The Ruts - 11 albums and demos","uid":3633492,"size":784256531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d2bce49e105e8ed9b972cebb00e584e81646f374&amp;dn=The+Ruts+-+11+albums+and+demos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"totalitor","files":173,"time":1173191990,"description":"(1977) Freerange Studio Session\n(1978) Demo - Stepping Bondage\n(1978) Rehearsal - Bethnal Green London\n(1979) Live at Strathclyde University\n(1979) Live at the Marquee\n(1979) The Crack\n(1987) Live and Loud!!\n(1990) The Peel Sessions\n(2000) In A Can\n(2002) Ruts DC vs. Mad Professor vs. Zion Train - Rythm Collison, Vol.1 and Remixes\n(2005) Grin and Bear It\n\nWith their unique blend of raucous punk rock laced with reggae and dub, the Ruts were one of the most exciting bands to emerge from Britain&amp;#039;s late-&amp;#039;70s scene. Their career was cut cruelly short by the death of their singer in 1980, but still the group released six crucial singles and a seminal album in their short lifetime. They were also a powerful force within Britain&amp;#039;s Rock Against Racism movement, ensuring a political legacy at least as vital as their music.\n\nFormed by four West London schoolmates in early 1978, the quartet of vocalist Malcolm Owen, guitarist Paul Fox, bassist John Jennings, and drummer Dave Ruffy initially gigged around their neighborhood with a fairly unremarkable post punk/early oi!-ish set. However, the rise of the neo-Nazi National Front and its deliberate recruitment of young people, saw the bandmembers take on an increasingly political stance of their own, adding their own voice to the growing grassroots opposition to the fascist threat.\n\nIt was from this grassroots response that Rock Against Racism sprang, informing and raising political awareness via musical events. The Ruts plunged into the organization very early on in their career, playing benefit shows and festivals, and it was at one such event that the group were introduced to the south London reggae band Misty in Roots. It was through Misty&amp;#039;s own People Unite label that the Ruts&amp;#039; debut single, the driving &quot;In a Rut&quot;/&quot;H-Eyes,&quot; was released in late 1978.\n\nThe single barely hinted at what was to come and when the group performed a radio session for Radio One DJ John Peel a few months later, the song didn&amp;#039;t even appear in their set. Even so, Virgin Records was one of several labels which recognized the Ruts&amp;#039; potential and signed the band in the spring of 1979.\n\nThey were immediately awarded when the group&amp;#039;s next single, &quot;Babylon&amp;#039;s Burning&quot;/&quot;Society,&quot; seared its way into the U.K. Top Ten. Inspired by the political and societal upheavals taking place across the country, the song perfectly caught the mood of rage simmering just below Britain&amp;#039;s surface. Following a national tour supporting the Damned and the release of their Top 30 follow-up single, the rabble-rousing &quot;Something That I Said,&quot; the Ruts&amp;#039; debut album, The Crack, arrived in October 1979. With its seminal blend of punk, roots reggae, dub, and hard rock meets hardcore sound, the album slammed its way to number 16 and into the national musical lexicon.\n\nPulled from the album as their next single was the seminal &quot;Jah War.&quot; Written in response to the riots that had ripped across London&amp;#039;s Southall neighborhood the previous April, resulting in one death and numerous injuries, the song was a masterpiece of deep dub, a righteous riff, and an anthemic chorus. Filled with fury and despair, it encapsulated a bitter moment in Britain&amp;#039;s history, much as the Specials&amp;#039; &quot;Ghost Town&quot; would do with equal brilliance the next summer.\n\nAmazingly the single didn&amp;#039;t chart; the song touched too raw a nerve and was thus informally banned from Britain&amp;#039;s airwaves, but this disappointment didn&amp;#039;t slow down the band. A headlining tour was followed by the quartet joining Jamaican ska legend Laurel Aitken for his first new U.K. single in years, &quot;Rudi Got Married.&quot; The Ruts themselves re-entered the Top 25 in April 1980 with &quot;Staring at the Rude Boys,&quot; their own expedition into Two Tone territory, albeit on a lyrical, not musical, journey.\n\nThe group was preparing to begin work on their second album, an American tour was also in the works, while their latest British outing was sold out long in advance. Life should have been good, but Owen&amp;#039;s own was in tatters. His marriage had fallen apart and his longtime heroin habit now raged out of control. The Ruts were forced to cancel a number of U.K. tour dates and in desperation, opted for a tough-love approach. They fired the singer, shortly after completing work on their proposed next single, &quot;West One.&quot;\n\nThis wake-up call seemed to work -- Owen cleaned up and met with his bandmates to discuss a reconciliation. The meeting was a success, but Owen&amp;#039;s own resolve was weaker. On the weekend of July 11, 1980, Owen returned home, got high, and suffered a fatal overdose. The remaining trio would continue on without him as Ruts DC (from the Latin Da Capo, meaning new beginning), but in a decidedly different musical vein. However, the Ruts&amp;#039; legacy lived on. A month after Owen&amp;#039;s death, &quot;West One&quot; broke into the U.K. chart. Virgin began collecting up outtakes and non-album cuts for The Grin and Bear It album, which also appeared later in the year.","torrent":{"xt":"urn:btih:d2bce49e105e8ed9b972cebb00e584e81646f374","amp;dn":"The+Ruts+-+11+albums+and+demos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2bce49e105e8ed9b972cebb00e584e81646f374","infoHashBuffer":{"type":"Buffer","data":[210,188,228,158,16,94,142,217,185,114,206,187,0,229,132,232,22,70,243,116]},"announce":[],"urlList":[]}}