{"title":"Yamicsoft Software Bundle","uid":15689810,"size":47675142,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d2c0f8616080c46cfae74fb6a163d45c8e2d2cec&amp;dn=Yamicsoft+Software+Bundle&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LxByte","files":5,"time":1472391556,"description":"Yamicsoft Software Bundle\n\nIncluded in this bundle..\n\nVista Manager v4.1.6\nThe complete solution to optimize, tweak, repair and clean up Windows Vista\n\nVista Manager is an all-in-one utility for Microsoft Windows Vista specially, it includes over forty different utilities to optimize, tweak, clean up, speed up and repair your Windows Vista, helps make your system perform faster, eliminate system fault, increase stability and security, personalize your copy of Windows Vista, and meet all of your expectations.\n\nVista Manager Features\n\n    Information\n    Optimizer\n    Cleaner\n    Customization\n    Security\n    Network\n    Misc. Utilities\n\n\nWindows 7 Manager v5.1.9\nThe complete solution to optimize, tweak, repair and clean up Windows 7\n\nWindows 7 Manager is an all-in-one utility for Microsoft Windows 7 specially, it includes over forty different utilities to optimize, tweak, clean up, speed up and repair your Windows 7, helps make your system perform faster, eliminate system fault, increase stability and security, personalize your copy of Windows 7, and meet all of your expectations.\nWindows 7 Manager\nWindows 7 Manager Features\n\n    Information\n    Optimizer\n    Cleaner\n    Customization\n    Security\n    Network\n    Misc. Utilities\n\n\nWindows 8 Manager v2.2.8\nThe complete solution to optimize, tweak, repair and clean up Windows 8 and Windows 8.1\n\nWindows 8 Manager is an all-in-one utility for Microsoft Windows 8 specially, it includes over forty different utilities to optimize, tweak, clean up, speed up and repair your Windows 8 and 8.1, helps make your system perform faster, eliminate system fault, increase stability and security, personalize your copy of Windows 8 and 8.1, and meet all of your expectations.\nWindows 8 Manager\nWindows 8 Manager Features\n\n    Information\n    Optimizer\n    Cleaner\n    Customization\n    Security\n    Network\n    Misc. Utilities\n\n\nWindows 10 Manager v1.1.7\nThe complete solution to optimize, tweak, repair and clean up Windows 10\n\nWindows 10 Manager is an all-in-one utility for Microsoft Windows 10 specially, it includes over forty different utilities to optimize, tweak, clean up, speed up and repair your Windows 10, helps make your system perform faster, eliminate system fault, increase stability and security, personalize your copy of Windows 10, it can meet all of your expectations.\nWindows 10 Manager\nWindows 10 Manager Features\n\n    Information\n    Optimizer\n    Cleaner\n    Customization\n    Security\n    Network\n    Misc. Utilities\n\n\nWinXP Manager v8.0.1\nThe complete solution to optimize, tweak, repair and clean up Windows XP\n\nWinXP Manager is an all-in-one utility for Microsoft Windows XP specially, it includes over forty different utilities to optimize, tweak, clean up, speed up and repair your Windows XP, helps make your system perform faster, eliminate system fault, increase stability and security, personalize your copy of Windows XP, and meet all of your expectations.\nWinXP Manager\nWinXP Manager Features\n\n    Information\n    Optimizer\n    Cleaner\n    Customization\n    Security\n    Network\n    Misc. Utilities\n\nOfficial Website: http://www.yamicsoft.com/","torrent":{"xt":"urn:btih:d2c0f8616080c46cfae74fb6a163d45c8e2d2cec","amp;dn":"Yamicsoft+Software+Bundle","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2c0f8616080c46cfae74fb6a163d45c8e2d2cec","infoHashBuffer":{"type":"Buffer","data":[210,192,248,97,96,128,196,108,250,231,79,182,161,99,212,92,142,45,44,236]},"announce":[],"urlList":[]}}