{"title":"The Forsyte Saga 7 (1967) BBC TV","uid":4714068,"size":1213759930,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d3206b8426a3c4447c21d1c5e81dd4615c9e3df9&amp;dn=The+Forsyte+Saga+7+%281967%29+BBC+TV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"jgordon20904","files":3,"time":1234195328,"description":"MY MISTAKE! It seems there is one fewer episode than I thought. Sorry. This is the last, and nothing is missing. Since I'm 84 years old you shouldn't be too surprised. I've done worse.\n\nThis submission is the final of seven DVDs to upload the complete BBC mini-series of The Forsyte Saga (1967). This DVD contains three episodes. Each episode takes 50 minutes to play. This one contains episodes 25,26,X. In all there are 26 episodes; the final one, rather than containing the last video, is labeled &quot;X&quot; and contains a documentary of making the film as well as interviews with people on the streets of London.\n\nTwo text files are included: one has commentaries taken from the IMDb site, which will give a much better overall review of the series than I can, and the other has closed captions of all four episodes together. \n\nThe quality of the picture leaves something to be desired. After several efforts to improve it by changing contrast, brightness levels and sharpness, I decided to leave things alone. It seems to me the video has too much contrast. It's strange since many other high quality movies were being made at that time.\nSome of the outdoor scenes are bad.","torrent":{"xt":"urn:btih:d3206b8426a3c4447c21d1c5e81dd4615c9e3df9","amp;dn":"The+Forsyte+Saga+7+%281967%29+BBC+TV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3206b8426a3c4447c21d1c5e81dd4615c9e3df9","infoHashBuffer":{"type":"Buffer","data":[211,32,107,132,38,163,196,68,124,33,209,197,232,29,212,97,92,158,61,249]},"announce":[],"urlList":[]}}