{"title":"Building Services Handbook","uid":4862290,"size":12376354,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d367aa80b7d0c3488bf407c1e7e495fd96ec37e5&amp;dn=Building+Services+Handbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Malkavius","files":-1,"time":1240320887,"description":"  Building Services Handbook summarises the application of all common elements of building services practice, technique and procedure, to provide an essential information resource for students and engineers working in the industry.\n\n  Information is presented in the highly illustrated and accessible style of the best-selling companion title Building Construction Handbook.\n\n  This new edition contains extended information on water system components, control systems for hot water and heating, ventilation and air conditioning, drainage, gas appliance flues and further examples of design calculations. It has been revised and expanded to take into account recent amendments to the Building Regulations Approved Documents and guidance from British and European Standards.\n\n  Online lecture facilities include PowerPoint slides illustrating a selection of services areas, providing key diagrams for use with presentations and handouts.\n\n  THE comprehensive reference for all construction and building services students, Building Services Handbook is ideal for a wide range of courses including NVQ and BTEC National through Higher National Certificate and Diploma to Foundation and three-year Degree level. \n  \n  The clear illustrations and complementary references to industry Standards combine essential guidance with a resource base for further reading and development of specific topics.\n\n  Roger Greeno is a well-known author of construction texts. He has extensive practical and consultancy experience in the industry, in addition to lecturing at several colleges of further and higher education, and the University of Portsmouth. He has also examined for City &amp; Guilds, Edexcel, the Chartered Institute of Building and the University of Reading.\n\n  Fred Halls books on Building Services have helped thousands of students gain their qualifications and pass exams. He was formerly a Senior Lecturer at Guildford College.\n\n* No other book offers the same clarity of diagrams and scope of information\n* Allows the reader to quickly get to grips with each topic\n* Updated to explain what recent energy conservation measures really MEAN ","torrent":{"xt":"urn:btih:d367aa80b7d0c3488bf407c1e7e495fd96ec37e5","amp;dn":"Building+Services+Handbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d367aa80b7d0c3488bf407c1e7e495fd96ec37e5","infoHashBuffer":{"type":"Buffer","data":[211,103,170,128,183,208,195,72,139,244,7,193,231,228,149,253,150,236,55,229]},"announce":[],"urlList":[]}}