{"title":"The Spiral Staircase - 1945 (Multisubs mp4)","uid":7904309,"size":1151122411,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d3a8a7c8045da8ffad7ff49173c81134ef364a48&amp;dn=The+Spiral+Staircase+-+1945+%28Multisubs+mp4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"mawricio_br","files":5,"time":1355011759,"description":"     The wonderfully suspenseful psychological drama Spiral Staircase is the prototype of the &quot;old dark house, lady in distress&quot; thriller, full of dark corners, flickering candles and featuring a mysterious, menacing killer whose true identity remains hidden until the end. Dorothy McGuire is exquisite as the innocent, sweet Helen and gives a totally convincing performance in the difficult role.\n     Beautiful young mute Helen is a domestic worker for old ailing Mrs. Warren. Mrs. Warren's two sons, Albert (a professor) and womanizing impudent Steven, also live in the Warren mansion. Mrs. Warren becomes concerned for Helen's safety when a rash of murders involving 'women with afflictions' hits the neighborhood. She implores her physician, Dr. Parry, to take Helen away for her own safety. When another murder occurs inside the Warren mansion, it becomes obvious that Helen is in danger.\n     Director Robert Siodmak, noted for his stylish direction of atmospheric suspense films, uses all his plot devices with great skill and craftsmanship, increasing the suspense and sense of foreboding as Helen is observed through the eyes of her stalker, who the audience sees only as a pair of menacing eyes.\n\n\nDirector: Robert Siodmak\nStars: Dorothy McGuire, George Brent and Ethel Barrymore\n\nRuntime: 83 min\nmp4\nSample\nSubtitle .srt : Portuguese, French, Spanish\nwww.imdb.com/title/tt0038975/","torrent":{"xt":"urn:btih:d3a8a7c8045da8ffad7ff49173c81134ef364a48","amp;dn":"The+Spiral+Staircase+-+1945+%28Multisubs+mp4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3a8a7c8045da8ffad7ff49173c81134ef364a48","infoHashBuffer":{"type":"Buffer","data":[211,168,167,200,4,93,168,255,173,127,244,145,115,200,17,52,239,54,74,72]},"announce":[],"urlList":[]}}