{"title":"Jean Luc Ponty - King Kong (1969) - Jean Luc Ponty Plays The Mus","uid":7196239,"size":304784660,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d46d55e626f5d1e7db4c381d2ca358a68826b1ae&amp;dn=Jean+Luc+Ponty+-+King+Kong+%281969%29+-+Jean+Luc+Ponty+Plays+The+Mus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pucholoco","files":-1,"time":1334789401,"description":"                 Jean-Luc Ponty - King Kong(1969)\n              Jean-Luc Ponty Plays The Music Of Frank Zappa \n\nEAC rip (secure mode) | FLAC+CUE+LOG -&gt; 290 Mb Full Artwork @ 300 dpi (png)\nÂ© 1993 Capitol / Blue Note | CDP 0777 7 89539 2 0 Jazz / Post Bop / Fusion\n\nNot just an album of interpretations, King Kong: Jean-Luc Ponty Plays the Music of Frank Zappa was an active collaboration; Frank Zappa arranged all of the selections, played guitar on one, and contributed a new, nearly 20-minute orchestral composition for the occasion. Made in the wake of Ponty's appearance on Zappa's jazz-rock masterpiece Hot Rats, these 1969 recordings were significant developments in both musicians' careers. In terms of jazz-rock fusion, Zappa was one of the few musicians from the rock side of the equation who captured the complexity -- not just the feel -- of jazz, and this project was an indicator of his growing credibility as a composer. For Ponty's part, King Kong marked the first time he had recorded as a leader in a fusion-oriented milieu (though Zappa's brand of experimentalism didn't really foreshadow Ponty's own subsequent work).\nOf the repertoire, three of the six pieces had previously been recorded by the Mothers of Invention, and &quot;Twenty Small Cigars&quot; soon would be. Ponty writes a Zappa-esque theme on his lone original &quot;How Would You Like to Have a Head Like That,&quot; where Zappa contributes a nasty guitar solo. The centerpiece, though, is obviously &quot;Music for Electric Violin and Low Budget Orchestra,&quot; a new multi-sectioned composition that draws as much from modern classical music as jazz or rock. It's a showcase for Zappa's love of blurring genres and Ponty's versatility in handling everything from lovely, simple melodies to creepy dissonance, standard jazz improvisation to avant-garde, nearly free group passages. In the end, Zappa's personality comes through a little more clearly (his compositional style pretty much ensures it), but King Kong firmly established Ponty as a risk-taker and a strikingly original new voice for jazz violin. \n\nPersonnel: Jean-Luc Ponty (violin); Ian Underwood (conductor, alto &amp; tenor saxophones); Ernie Watts (alto &amp; tenor saxophones); Gene Estes (vibraphone, percussion); George Duke (piano); Frank Zappa (guitar); Buell Neidlinger, Wilton Felder (bass); Arthur Tripp III, John Guerin (drums).\n\ntracklist:\n1. King Kong\n2. Idiot Bastard Son\n3. Twenty Small Cigars\n4. How Would You Like to Have a Head Like That\n5. Music For Electric Violin and Low Budget Orchestra\n6. America Drinks and Goes Home\n\n\n\n","torrent":{"xt":"urn:btih:d46d55e626f5d1e7db4c381d2ca358a68826b1ae","amp;dn":"Jean+Luc+Ponty+-+King+Kong+%281969%29+-+Jean+Luc+Ponty+Plays+The+Mus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d46d55e626f5d1e7db4c381d2ca358a68826b1ae","infoHashBuffer":{"type":"Buffer","data":[212,109,85,230,38,245,209,231,219,76,56,29,44,163,88,166,136,38,177,174]},"announce":[],"urlList":[]}}