{"title":"The Surfaris - Wipe Out/The Surfaris Play-1963  First 2 albums F","uid":6391618,"size":387789548,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d48bbaa2c2e8ccfb8befb997fe7ba206468ad391&amp;dn=The+Surfaris+-+Wipe+Out%2FThe+Surfaris+Play-1963++First+2+albums+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Skyppys","files":28,"time":1305331788,"description":"Remastered CD from 1999 BGO Records\n\n\nThe yardstick for every aspiring young drummer in the early 60\\\\\\'s was to be able to play a drum solo called \\\\\\&quot;Wipe Out\\\\\\&quot;.\n\nIn 1962, a highschool surf band called \\\\\\&quot;The Surfaris\\\\\\&quot; had dreams of forming a band like Dick Dale, whom they had seen at Harmony Park. The group included Jim Fuller on lead guitar, Bob Berryhill, guitar, Pat Connolly on bass, Jim Pash on sax and Ron Wilson on drums. Between them, they had only one guitar amp and since none of them was old enough to have a licence, had to have their parents drive them to local gigs.\n\nDrummer Ron Wilson had told the others about a dream he had about a mythical surfer and with help of the others, wrote a song about him, titled \\\\\\&quot;Surfer Joe\\\\\\&quot;. The song was recorded on a cold night in January of 1963, at a small local studio. Jim Pash was not at the session, as his father needed him to work at their family business that night. Later, when his picture was printed on the back of the Wipe Out album with the rest of the band, he sued for damages and to have his picture and name removed, as he did not want any connection with the album.\n\nTo fill the other side of the \\\\\\&quot;Surfer Joe\\\\\\&quot; single, a song called \\\\\\&quot;Wipe Out\\\\\\&quot; was cooked up in about 15 minutes. It featured a drum solo which was actually a cadence for Wilson\\\\\\'s highschool marching band. A simple rudiment called a \\\\\\&quot;paradidle\\\\\\&quot; formed the main beat and to open the song, Bob Berryhill\\\\\\'s dad broke a plaster soaked board close to the mic and studio owner Dale Smallen let out a laugh and screamed \\\\\\&quot;wipe out\\\\\\&quot;.\n\nThe song was recorded in two takes. Richard Delvy, who played drums in a band called \\\\\\&quot;The Challengers\\\\\\&quot;, worked out a deal with The Surfaris to distribute \\\\\\&quot;Wipe Out\\\\\\&quot; on his label, Princess. It was later picked up by Dot Records and soared to number 2 on the U.S. charts, remaining in the Top 40 for ten weeks. But it was actually a band called The Challengers who ended up recording most of the tracks for The Surfaris\\\\\\' debut album, \\\\\\'Wipe Out\\\\\\' and received the performance royalties. The Surfaris had to sue Dot Records for their share of those royalties. Another band, The Impacts, also claimed that it had recorded a song called \\\\\\&quot;Wipe Out\\\\\\&quot; prior to The Surfaris and that The Surfaris had stolen their idea. Music critics still debate the issue. Meanwhile, another band who called themselves The Surfaris brought suit against the boys over the name, and although that band lost the suit, it was allowed to perform as \\\\\\&quot;The Original Surfaris\\\\\\&quot;.\n\n\\\\\\&quot;Surfer Joe\\\\\\&quot; became a hit in its own right, rising to #62 after \\\\\\&quot;Wipe Out\\\\\\&quot; was no longer charting. The Surfaris followed up with a song called \\\\\\&quot;Point Panic\\\\\\&quot; in 1963 and it rose to #49, and today still gets some Classic Oldies airplay nationwide.\n\nTours were played in Japan, Hawaii, Australia and the U.S. with artists such as Roy Orbison, The Beach Boys, The Crystals, Bobby Vinton, The Righteous Brothers, Jay and the Americans, The Turtles, Paul Revere and the Raiders, The Ventures and many others.\n\nTheir third album, \\\\\\'Hit City\\\\\\' in 1964, introduced a partnership with producer Gary Usher, who employed a team of experienced session musicians on ensuing Surfaris\\\\\\' releases. In 1965, with the British Invasion in full swing, the group abandoned beach and hot-rod themes for folk rock and had a #2 hit in Japan with a song called \\\\\\&quot;Kareen\\\\\\&quot;. They also recorded music for the movie The Lively Set, starring James Darren.\n\nRon Wilson had developed into an accomplished lead singer and with Ken Forssi replacing Connolly on bass, the Surfaris completed a promising but ultimately failed recording of \\\\\\&quot;It Ain\\\\\\'t Me Babe\\\\\\&quot;. When the contract with Usher ended, the group broke up. Newcomer Forssi then joined a band called \\\\\\'Love\\\\\\', who had a hit with \\\\\\&quot;My Little Red Book\\\\\\&quot;, but no other member achieved similar success. Ron Wilson died in poverty after suffering a brain aneurysm in May of 1989.\n\nTheir current \\\\\\&quot;best of\\\\\\&quot; anthologies are available on CD from Varese Sarabande (Wipe Out, The Best Of The Surfaris and Surfaris Stomp). In addition, a live reunion concert has been released on GNP Crescendo Records entitled \\\\\\&quot;Surf Party! The best of Surfaris live\\\\\\&quot;. The Surfaris also appear on numerous recently released collections. Their international fame and original recorded output as a surf band is only exceeded by the Beach Boys and Jan &amp; Dean.\n\nThe Surfaris music continues to have a significant impact on American culture. Over the last ten years, \\\\\\&quot;Wipe Out\\\\\\&quot; has been featured in numerous national commercials and major motion pictures. Advertisers such as Nissan, Pepsi, Kodak, and Wendy\\\\\\'s Hamburgers and films such as Dirty Dancing, The Vanishing, and Sandlot are a few examples. It has also appeared in children\\\\\\'s toys such as musical tops, mechanical bouncing balls, and video games. Wipe Out\\\\\\'s melody has become cultural musical language, not only for a surfing wipe out, but \\\\\\&quot;wiping out\\\\\\&quot; at any endeavour; the drum solo is undoubtedly the most famous in the world. Guitar World Magazine declared Wipe Out as one of the ten most influential songs on rock guitarists in rock history.\n\nOn their 30th anniversary, The Surfaris were presented with numerous awards of recognition. One in particular from the California Senate reads: \\\\\\&quot;In recognition of your contribution to the musical culture of California with the introduction of Surf Music which opened countless opportunities for musicians and businesses.\\\\\\&quot;\n\nIn 1991, The Surfaris were inducted into the Surf Music Walk Of Fame at Euro Disneyland, in France. On April 12th, 1996 they were inducted into Hollywood\\\\\\'s Rock Walk and Museum, being recognized as having made a significant contribution to the history of Rock and Roll. After the ceremony, they headlined at Hollywood\\\\\\'s House of Blues, which was sold out.\n\nVarious reincarnations of The Surfaris have toured the oldies circuits over the years and television appearances included an episode of The New Gidget Show for which they recorded new music, The Vickie Lawrence Show, The Home &amp; Family Show, and numerous entertainment magazine shows.\n\nIn the late 1990\\\\\\'s, you could see George Of The Jungle playing Wipe Out on a conga drum and kids on TV playing it on the top of a Pringles potato chip can. David Letterman used \\\\\\'Point Panic\\\\\\' for his \\\\\\&quot;surfing in his suit\\\\\\&quot; skit during an L.A. broadcast.\n\nOver the years, countless millions of fans have attempted to play the Wipe Out drum solo on car dashboards, desks, and even drums! In later years, the Surfaris would invite audience members up on stage to give the drum solo their best shot, while the band performed the music.\n\nThanks to Bob Berryhill of the Surfaris for his help on this bio. For more info on the band, visit his Surfaris Web Site\n","torrent":{"xt":"urn:btih:d48bbaa2c2e8ccfb8befb997fe7ba206468ad391","amp;dn":"The+Surfaris+-+Wipe+Out%2FThe+Surfaris+Play-1963++First+2+albums+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d48bbaa2c2e8ccfb8befb997fe7ba206468ad391","infoHashBuffer":{"type":"Buffer","data":[212,139,186,162,194,232,204,251,139,239,185,151,254,123,162,6,70,138,211,145]},"announce":[],"urlList":[]}}