{"title":"Stability of Structures: Elastic, Inelastic, Fracture and Damage","uid":6616128,"size":18114786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5cec6b214314429926f492408d769ca17f1f8ce&amp;dn=Stability+of+Structures%3A+Elastic%2C+Inelastic%2C+Fracture+and+Damage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"_F1_","files":-1,"time":1313787695,"description":"Stability of Structures: Elastic, Inelastic, Fracture and Damage Theories\nZdenek P. Bazant (Author), Luigi Cedolin (Author)\n\nPaperback: 1040 pages\nPublisher: World Scientific Publishing Company (August 16, 2010)\nLanguage: English\nISBN-10: 9814317039\nISBN-13: 978-9814317030\n\nA crucial element of structural and continuum mechanics, stability theory has limitless applications in civil, mechanical, aerospace, naval and nuclear engineering. This text of unparalleled scope presents a comprehensive exposition of the principles and applications of stability analysis. It has been proven as a text for introductory courses and various advanced courses for graduate students. It is also prized as an exhaustive reference for engineers and researchers.\nThe authors' focus on understanding of the basic principles rather than excessive detailed solutions, and their treatment of each subject proceed from simple examples to general concepts and rigorous formulations. All the results are derived using as simple mathematics as possible. Numerous examples are given and 700 exercise problems help in attaining a firm grasp of this central aspect of solid mechanics.\n\nThe book is an unabridged republication of the 1991 edition by Oxford University Press and the 2003 edition by Dover, updated with 18 pages of end notes.","torrent":{"xt":"urn:btih:d5cec6b214314429926f492408d769ca17f1f8ce","amp;dn":"Stability+of+Structures%3A+Elastic%2C+Inelastic%2C+Fracture+and+Damage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5cec6b214314429926f492408d769ca17f1f8ce","infoHashBuffer":{"type":"Buffer","data":[213,206,198,178,20,49,68,41,146,111,73,36,8,215,105,202,23,241,248,206]},"announce":[],"urlList":[]}}