{"title":"The Nanotech Pioneers - Steven A. Edwards","uid":15513622,"size":2311165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d64d3eaeb494aa081ae63aeedfb45ac5da16e1a5&amp;dn=The+Nanotech+Pioneers+-+Steven+A.+Edwards&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1470680449,"description":"The Nanotech Pioneers - Steven A. Edwards (Wiley-VCH, 2006).pdf\r\n\r\nHype, hope, or horror? A vivid look at nanotechnology, written by an insider and experienced science writer.\r\nThe variety of new products and technologies that will spin out of nanoscience is limited only by the imagination of the scientists, engineers and entrepreneurs drawn to this new field. Steve Edwards concentrates on the reader's self interest: no military gadgets, wild fantasies of horror nanobot predators and other sci-fi stuff, but presents a realistic view of how this new field of technology will affect people in the near future. He is in close contact with many pioneers in nanotechnology, and includes their backgrounds to allow readers, especially college students considering a career in the field, to better imagine themselves in such positions. However, technology does not develop in a vacuum, and this book also looks at the social, political and economic changes attendant upon the development of nanotechnology.\r\nFor the science-interested general public as well as chemists, students, lecturers, chemical organizations, materials scientists, journalists, politicians, industry, physicists, and biologists","torrent":{"xt":"urn:btih:d64d3eaeb494aa081ae63aeedfb45ac5da16e1a5","amp;dn":"The+Nanotech+Pioneers+-+Steven+A.+Edwards","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d64d3eaeb494aa081ae63aeedfb45ac5da16e1a5","infoHashBuffer":{"type":"Buffer","data":[214,77,62,174,180,148,170,8,26,230,58,238,223,180,90,197,218,22,225,165]},"announce":[],"urlList":[]}}