{"title":"Steve Turre - Rhythm Within 1995 Jazz (The Shellman) TQMP","uid":4121648,"size":408513582,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d68565730c9c3fd46ceca35fa5b2aaa7690e74f1&amp;dn=Steve+Turre+-+Rhythm+Within+1995+Jazz+%28The+Shellman%29+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Breezin","files":11,"time":1207587892,"description":"Steve Turre (born September 12, 1948 in Omaha, Nebraska) is an internationally renowned trombonist, recording artist, arranger, and educator. In 1998, 1999, 2001, 2002 and 2006 he won the Down Beat Reader's Poll for best trombonist.\n\nHe was raised in San Francisco, California by Mexican American parents, and at first studied violin. However he switched to trombone at age ten and later studied at University of North Texas. In 1968 he played with Rahsaan Roland Kirk, in 1970 he recorded with Carlos Santana, and in 1972 he toured with Ray Charles. He has been the trombonist for the Saturday Night Live band since 1984 and has taught jazz trombone at the Manhattan School of Music since 1988.\n\nHe is also noted for playing conch and other seashells as musical instruments, which he has done since 1970. Kirk encouraged his interest in using seashells as a lip-reed instrument. Turre has a collection of shells of various sizes, which he has picked up during his travels in the Caribbean and elsewhere. The shells have their mouthpieces carefully cut and are tuned to specific pitches. When playing them as a soloist he frequently switches between shells, as each is limited in its register (the smallest shells, for example, have a practical register of only a fifth). His largest shell, from the Great Barrier Reef of Australia, has a range between the D and E below middle C, and was painted by a Cuban artist. Turre also leads &quot;Sanctified Shells,&quot; which is a &quot;shell choir&quot; made up of brass players who double on seashell (using shells from Turre's collection, which he loans out for rehearsals and performances). The group released its first, eponymous album in 1993.He has had long experience with Latin jazz, and is also a skilled player of the cowbell and Venezuelan maracas. He is married to the cellist Akua Dixon.(info from wikipedia)\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:   &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project! Since all TQMP torrents are tracked by countless other trackers by now, the lifetime of your uploads will increase by a BIG margin ;)\n\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless FLAC format AND include artwork.\n\nYou can find all TQMP uploads at: www.thepiratebay.se/tag/tqmp\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3e5c4c5b5b4457507e5257485b105052&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:d68565730c9c3fd46ceca35fa5b2aaa7690e74f1","amp;dn":"Steve+Turre+-+Rhythm+Within+1995+Jazz+%28The+Shellman%29+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d68565730c9c3fd46ceca35fa5b2aaa7690e74f1","infoHashBuffer":{"type":"Buffer","data":[214,133,101,115,12,156,63,212,108,236,163,95,165,178,170,167,105,14,116,241]},"announce":[],"urlList":[]}}