{"title":"Panic At The Disco","uid":9612872,"size":896237337,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d6d2fa0e44f3c89d457e91b0c4a044380da2efb0&amp;dn=Panic+At+The+Disco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jmwreck","files":42,"time":1392355576,"description":"Panic! at the Disco (stylized for a time as Panic at the Disco[1][2]) is an American rock band from Las Vegas, Nevada, formed in 2004. Since its inception, the band's line-up has included Brendon Urie (lead vocals, guitar, piano) and Spencer Smith (drums), and currently includes bass guitarist Dallon Weekes. During live performances the band is joined by touring guitarist Kenneth Harris.\n\nFounded by childhood friends, Ryan Ross, Spencer Smith, Brent Wilson and Brendon Urie, Panic! at the Disco recorded its first demos while its members were all in high school. Shortly after, the band recorded and released its debut studio album, A Fever You Can't Sweat Out (2005). Made known by the top ten lead single, &quot;I Write Sins Not Tragedies&quot;, the album eventually was certified double platinum in the US. In 2006, founding bassist Brent Wilson was fired from the band during an extensive world tour, and subsequently replaced by Jon Walker.\n\nInfluenced by 1960s rock bands, The Beatles, The Zombies and The Beach Boys, and preceded by the hit single, &quot;Nine in the Afternoon&quot;, the band's second studio album, Pretty. Odd. (2008), marked a significant departure from the sound of the band's debut, and ultimately led to the departure of guitarist and principal songwriter Ryan Ross and bassist Jon Walker, who favored the band's new direction. The duo subsequently formed a new band, The Young Veins, leaving Brendon Urie and Spencer Smith as the sole remaining members of the band.\n\nContinuing as a duo, the band released a new single, &quot;New Perspective&quot;, and recruited Dallon Weekes (bass) and Ian Crawford (guitar) to accompany the band during live performances. The band's third studio album, Vices &amp; Virtues (2011), marked a return to the band's initial Vaudevillian pop-punk sound and was recorded solely by Urie and Spencer with producers John Feldmann and Butch Walker.\n\nIn 2012, the band added touring bassist Weekes to its core line-up, rendering the band a three-piece,[3] and released its fourth studio album, Too Weird to Live, Too Rare to Die!, in 2013.\n\nWIKI","torrent":{"xt":"urn:btih:d6d2fa0e44f3c89d457e91b0c4a044380da2efb0","amp;dn":"Panic+At+The+Disco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d2fa0e44f3c89d457e91b0c4a044380da2efb0","infoHashBuffer":{"type":"Buffer","data":[214,210,250,14,68,243,200,157,69,126,145,176,196,160,68,56,13,162,239,176]},"announce":[],"urlList":[]}}