{"title":"Gunfight at the OK Corral 1957 BrRip Mp4 Lee1001","uid":10461210,"size":919556015,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d707a1b5208fe9683c5c5a8946b6632867eb5644&amp;dn=Gunfight+at+the+OK+Corral+1957+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"xultfoad","files":2,"time":1404137670,"description":"Gunfight at the OK Corral 1957 BrRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050468/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050468/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Gunfight_at_the_O.K._Corral_(1957_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Gunfight_at_the_O.K._Corral_(1957_film)&lt;/a&gt;\nThis, the most popular film account of the famous Tombstone gun battle, helped to reinvigorate the western genre in the late fifties and, thanks to its star-led cast and stunning production values, sounded the death knell for the cheap B-movie western. Leon Uris's fanciful screenplay may play fast and loose with the facts, but through John Sturges' assured direction and Charles Lang's lush colour cinematography, Gunfight at the O.K. Corral stands as one of the most well-crafted examples of its genre, a classic western that wears its age remarkably well.\n \nLancaster and Douglas are outstanding.\nTHE old gambling, boozing, boasting, shooting type of Western that more or less went out of style with the showing of such adult items as &quot;The Gunfighter,&quot; &quot;High Noon&quot; and &quot;Shane&quot; is back in full cry in Hal Wallis' &quot;Gunfight at the O. K. Corral,&quot; a big color and VistaVision picture that came to the Capitol yesterday.\nHowever, we lodge a vigorous protest to this business of starting Western films with a ballad and three horsemen coming across the horizon,and the further imitation of having verses of the ballad interspersed through the film, with Frankie Laine singing them, is shivering. He Ha!\n\nThe Gunfight at the O.K. Corral, also known as the Shootout at the O.K. Corral, was a gunfight that took place at about 3:00 p.m. on Wednesday, October 26, 1881, in Tombstone, Arizona Territory, and is generally regarded as the most famous gunfight in the history of the American Old West. The gunfight, believed to have lasted only about thirty seconds, was fought between the outlaw Cowboys Billy Claiborne, Ike and Billy Clanton, and Tom and Frank McLaury, and the opposing town Marshal Virgil Earp and his brothers Assistant Town Marshal Morgan and temporary lawman Wyatt, aided by Doc Holliday designated as a temporary marshal by Virgil. \n\nIke Clanton and Billy Claiborne ran from the fight unharmed, but Ike's brother Billy Clanton was killed, along with both McLaurys. Lawmen Virgil and Morgan Earp were wounded. Wyatt Earp and Doc Holliday came through the fight unharmed. The fight has come to represent a time in American history when the frontier was open range for outlaws opposed by law enforcement that was spread thin over vast territories, leaving some areas unprotected.\n\nVIDEO\nSize.... 876mb\nDuration.... 02:02:39\nCodec....... AVC1\nFrame Width.... 720\nFrame Height.... 404\nData Rate.... 843kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 150kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:d707a1b5208fe9683c5c5a8946b6632867eb5644","amp;dn":"Gunfight+at+the+OK+Corral+1957+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d707a1b5208fe9683c5c5a8946b6632867eb5644","infoHashBuffer":{"type":"Buffer","data":[215,7,161,181,32,143,233,104,60,92,90,137,70,182,99,40,103,235,86,68]},"announce":[],"urlList":[]}}