{"title":"Calexico - Garden Ruin [2006] [EAC,log,cue. FLAC]","uid":8137011,"size":242044174,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d70907f35de06c8fbbcf376ea9b46cd3b35cd3b0&amp;dn=Calexico+-+Garden+Ruin+%5B2006%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":15,"time":1360731296,"description":"one of Dicks Americana collection\n\nLabel: City Slang, City Slang\nCatalog#: SLANG 1038572, 706.3857.2\nFormat: FLAC / Lossless / Log (100%) / CD\nCountry: Europe\nReleased: 2006\nGenre: Rock\nStyle: Folk Rock, Indie Rock\n\nAfter nearly a decade spent playing together as Calexico, and with personal recording histories stretching as far back as 1988, Calexico's two principles are seasoned musicians who by now could just as easily stick to what they know and keep their fans happy and hungry for more. But as evidenced by their recent collaboration with Iron &amp; Wine, and now by Garden Ruin, their fifth proper full-length (not counting collections like Aerocalexico or The Book and the Canal), they're more interested these days in pushing their boundaries and building on strengths. Garden Ruin is the most straightforward &quot;rock&quot; record they've made, and the differences between it and their previous releases are immediately discernable.\nI won't lie. I already miss Calexico's old mariach-indie rock sound and the rampant eclecticism that saw them jumping from jazz to flamenco dub to folk to icy dirges on 2003's Feast of Wire, but fortunately, the sounds that replace those bygone elements are just as satisfying. Garden Ruin is beautifully fleshed out and focused, retaining some of the duo's Southwestern elements but shifting the horn sound from Ciudad Juarez to Los Angeles. Here, Calexico economically blend jazz, country, American folk, and indie rock into concise, well-oiled pop songs, complete with gorgeous vocal layering that's popped up before in a more primitive state on tracks like &quot;Not Even Stevie Nicks...&quot; and &quot;Grip-Tape&quot;, but is now fully formed.\nThe stylistic change is evident from the album's opening notes, where an acoustic guitar figure that once might have fluttered through Spanish passages becomes a minor-key riff instead, sending the song speeding off on a brisk drumbeat as Joey Burns belts out twangy vocals. The meticulously detailed mix reveals interlocking acoustic and electric guitars, piano, glockenspiel, strings, and horns, before finally ending with Burns' layered falsetto wordlessly harmonizing with itself.\nThe high harmonies on the verses of &quot;Panic Open String&quot; are absolutely beautiful, the mellifluous melodies and flowing steel guitar contrasting sharply with the much harder start/stop of the chorus. But Burns one-ups himself a few songs later, piling harmonies on &quot;Lucky Dime&quot; over Convertino's spryly shuffling drums to create a Technicolor pop nugget. &quot;Roka (Danza de la Muerte)&quot; finds that spooky corner Calexico have so often inhabited, with starlit acoustic guitar and arresting Spanish guest vocals. Its lyrics also offer pointed commentary on immigration, a rarity for this album, where the band's usual fixation on the politics of the border is largely supplanted by the politics of the heart: &quot;So close your eyes/ Slow your breath/ Dream of northern lights/ Around this dance of death.&quot;\nBy contrast, closer &quot;All Systems Red&quot; is epic. The song begins as a quiet acoustic tune, but morphs into a lurching monster as dramatic as anything the band has done to this point, guitars straining skyward, even as the chord progression descends and a maelstrom of noise reaches in to pull them down. Burns belts out from the middle of it with a power he's never harnessed before, and when it finally reaches the point of total overload, the rhythms give way to a gradual decay. It's a hell of an ending to a heck of a record, a display of sound and fury at which the duo has rarely even hinted. I'd never wanted Calexico to change, but the new direction suits them well, proving that even in the face of radical metamorphosis, they remain as stunning and distinctive as ever.\n","torrent":{"xt":"urn:btih:d70907f35de06c8fbbcf376ea9b46cd3b35cd3b0","amp;dn":"Calexico+-+Garden+Ruin+%5B2006%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d70907f35de06c8fbbcf376ea9b46cd3b35cd3b0","infoHashBuffer":{"type":"Buffer","data":[215,9,7,243,93,224,108,143,187,207,55,110,169,180,108,211,179,92,211,176]},"announce":[],"urlList":[]}}