{"title":"AI Roboform Enterprise v7.9.17.5 Incl Patch ru-board [TorDigger]","uid":13138219,"size":17911862,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d7702e4bd74ef7881e2ac37236aee4fa4f0ce43d&amp;dn=AI+Roboform+Enterprise+v7.9.17.5+Incl+Patch+ru-board+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TorDigger","files":8,"time":1451933811,"description":"AI RoboForm Enterprise\r\n\r\nAI RoboForm the best manager of passwords and form filler with a serious Artificial intelligence. Main features RoboForm: automatically saves your internet-paroli, automatically enters in the form of passwords, click on the button Login for you, fills your personal information forms, varying remains classified information and notes, generate random passwords, encrypts passwords and personal data using AES, Blowfish , RC6, 3-DES or 1-DES, stores all the information only on the local computer, works with USB- disk providing maximum mobility, synchronizes your passwords and notes with the Palm or Pocket PC, provides backups and data recovery, works on both Windows Further to your browser, works with browsers Netscape, Mozilla, and Firefox on Windows interface is Multi including Russian.\r\n\r\nFeatures:\r\n\r\n• Memorizes your passwords and Logs You In automatically.\r\n• Fills long registration and checkout forms with one click.\r\n• Encrypts your passwords to achieve complete security.\r\n• Generates random passwords that hackers cannot guess.\r\n• Fights Phishing by filling passwords only on matching web sites.\r\n• Defeats Keyloggers by not using keyboard to type passwords.\r\n• Backs up your passwords, Copies them between computers.\r\n• Synchronizes passwords between computers using GoodSync.\r\n• Searches for keywords in your passwords, notes and Internet.\r\n• Portable: RoboForm2Go runs from USB key, no install needed.\r\n• PDA-friendly: sync your passwords to Pocket PC and Palm.\r\n• Neutral: works with Internet Explorer, AOL/MSN, Firefox.\r\n• IE 7 and Vista are now supported.\r\n\r\n7.9.17.5:\r\n• IE form filler: throw more and better events to emulate human-like form filling.\r\n• IE: improve auto-submit of forms using new DOM interfaces.\r\n• Chrome: Fix memory leak on sites based on Telerik Kendo UI.\r\n• Firefox, Chrome: use the same (more relaxed) criterion for showing AutoSave as in IE.\r\n• Firefox: implement Common signed XPI for RF on Windows and Mac.\r\n• Firefox: let RF find 64-bit Firefox, it used to find WaterFox instead.\r\n• Firefox: fix Firefox shows a error when RF is opening an URL in new tab in some cases.\r\n• Firefox: fix AutoSave bar in FireFox is too large on high DPI.\r\n• RF2Go, Firefox: No SDK for FF 42 and newer is available, so allow RF2Go to attach to newer FF.\r\n• Installer: fix RF items do not appear in Windows 10 search.\r\n• Editor: fix Ctrl+F hides Safenote search in text bar if it is already shown.\r\n• Editor: fix RF cannot view/edit Identities downloaded from RFO Web Site.\r\n• Print List: fix RoboForm prints multiline passcard note as a single line.\r\n\r\nSystem Requirements:\r\n\r\nRoboForm's system requirements are minimal and can be run on just about any desktop or laptop. \r\nWindows XP/2003/Vista/2008/Win7/Win8/Win8.1/Win10\r\nInternet Explorer 6 and higher, or Mozilla/Firefox 1.0 or higher\r\n20 MB of available hard disk space\r\n128 MB RAM\r\n500 MHz Processor or better\r\n\r\nHomepage: http://www.roboform.com/enterprise/\r\n\r\nInstallation Instructions: \r\n\r\n1. Install Program.\r\n2. Run Patch (As admin Win vista and higher).\r\n3. Done, Enjoy\r\n\r\nHave A Nice Day\r\n\r\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems","torrent":{"xt":"urn:btih:d7702e4bd74ef7881e2ac37236aee4fa4f0ce43d","amp;dn":"AI+Roboform+Enterprise+v7.9.17.5+Incl+Patch+ru-board+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7702e4bd74ef7881e2ac37236aee4fa4f0ce43d","infoHashBuffer":{"type":"Buffer","data":[215,112,46,75,215,78,247,136,30,42,195,114,54,174,228,250,79,12,228,61]},"announce":[],"urlList":[]}}