{"title":"Monty Alexander Trio - Montreux Live (1976) [JazzBlues][mp3 320]","uid":4736541,"size":112666748,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d8124f055d1afead35fd971e41ac457d6192adb4&amp;dn=Monty+Alexander+Trio+-+Montreux+Live+%281976%29+%5BJazzBlues%5D%5Bmp3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":7,"time":1235317770,"description":"Monty Alexander Trio - Montreux Live\nOriginal Release Date: June 10, 1976 \nAudio CD (October 25, 1990) \nFormat: Live, Import \nLabel: Polygram Int'l \nBitrate: 320 kbps\n\n&quot;Monty Alexander ( born Montgomery Bernard Alexander on June 6, 1944 in Kingston, Jamaica ) is a Jamaican pianist and melodica player. His playing has a strong Caribbean influence and swinging feeling, but he has also been influenced by Wynton Kelly, Art Tatum, Gene Harris and Ahmad Jamal.\n\nAlexander discovered the piano at the age of 4, taking classical music lessons at 6 and became interested in jazz piano at the age of 14. Two years later, he directed a dance orchestra ( Monty and the Cyclones ) and played in the local clubs. Performances at the Carib Theater in Jamaica by Louis Armstrong and Nat King Cole left a strong impression on the young pianist.\n\nAlexander and his family moved to Miami, Florida in 1961 and he went to New York in 1962 and started to play at the jazz club Jilly's. In addition to performing with Frank Sinatra there, he also met and became friends with bassist Ray Brown and vibist Milt Jackson. In California, in 1965, he recorded his first album, Alexander the Great, for Pacific Jazz at the age of 21.\n\nAlexander recorded with Milt Jackson in 1969, with Ernest Ranglin in 1974 and in Europe the same year with Ed Thigpen. He toured regularly in Europe and recorded there, mostly with his classic trio for the MPS Records. He also toured around 1976 with the steel-drums player Othello Molineaux. Alexander has also played with several singers such as Ernestine Anderson, Mary Stallings and other important leaders (Dizzy Gillespie, Benny Golson, Jimmy Griffin and Frank Morgan). In his successive trios, he has played frequently with musicians associated with Oscar Peterson: Herb Ellis, Ray Brown, Mads Vinding, Ed Thigpen and Niels-Henning ÃƒËœrsted Pedersen.&quot; ~ from Wilkipedia\n\n&quot;Pianist Monty Alexander did some of his finest recordings for the German MPS label with this one maybe being his best. This live trio set recorded at the Montreux Jazz Festival in June 1976 with bassist John Clayton and drummer Jeff Hamilton, features Alexander playing his usual repertoire of the period with blues, standards ( &quot;Satin Doll,&quot; &quot;Work Song&quot; and &quot;Battle Hymn of the Republic&quot; ) and even a version of schmaltzy &quot;Feelings&quot;, so in vogue at the time, that uplifts the song quite a bit. The trio's soulful approach and extended improvisations to the generally familiar melodies make them sound fresh and swinging like mad. Bill Evans at the Village Vanguard it might not be, but it sure is one of the swinginest live piano trio recordings in all of jazz for my money, if the enthusiastic audience response is any measure.&quot;\n\nIn 1976 Monty Alexander was just a youngster to fill up between the Thad Joes-Mel Lewis Big Band and Stan Getz Quartet. But Monty, John Clayton and Jeff Hamilton were so eager to prove what they could, they became to hit of the Montreux Jazz Festival and famous that night. Listening to this set proves why the public became that excited. For the dazzling start with Nite Mist Blues to the splendid Worksong this is a gas. The encores Battle Hymn and the now released bonustracks simply makes this cd a jazzclassic. Buy it, play it, and wait for the reactions. Everybody will suprised by this outstanding concert. ~ Arnold van Kampen, jazzcritic\n\nI've had the CD of this for 20 years now and I still love it to this day (indeed its on my mp3 player as well). It was orginally recorded in June 1976.  The disc kicks off with a storming version of Ahmad Jamal's Nite Mist Blues and finishes with an equally storming Battle Hymn of the Republic. Apart from being a Jazz trio album the common thread through a lot of these tracks is the gospel/blues influence that pervades Monty Alexanders playing, which is again in evidence on Drown in My own Tears. Theres a great version of Satin Doll and even Feelings is pretty good.  He is one of the few Pianists who you can say was definetly influenced by Oscar Peterson. Whilst he may not quite have Oscars technique, he had by this time developed his own style to the degree that it would be hard to the confuse the two. If you like driving swinging bluesy Piano trio albums this is CD you should be buying without delay. ~ S.J. Buck\n\nMonty Alexander Trio - Montreux Live Tracks:\n01 Night Mist Blues \n02 Feelings \n03 Satin Doll \n04 Work Song \n05 Drown In My Own Tears \n06 Battle Hymn Of The Republic","torrent":{"xt":"urn:btih:d8124f055d1afead35fd971e41ac457d6192adb4","amp;dn":"Monty+Alexander+Trio+-+Montreux+Live+%281976%29+%5BJazzBlues%5D%5Bmp3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8124f055d1afead35fd971e41ac457d6192adb4","infoHashBuffer":{"type":"Buffer","data":[216,18,79,5,93,26,254,173,53,253,151,30,65,172,69,125,97,146,173,180]},"announce":[],"urlList":[]}}