{"title":"Simon Blackburn - Lust. The Seven Deadly Sins [2004][A]","uid":10529104,"size":64141866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9031d3e3be2bcc749ff018457b4949d3cbd39d3&amp;dn=Simon+Blackburn+-+Lust.+The+Seven+Deadly+Sins+%5B2004%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Anette14","files":-1,"time":1405083785,"description":"Description\nProduct Details\nBook Title: Lust: The Seven Deadly Sins\t\nBook Author: Simon Blackburn (Author)\nSeries: Seven Deadly Sins\nHardcover: 192 pages\nPublisher: Oxford University Press (February 12, 2004)\nLanguage: English\nISBN-10: 0195162005\nISBN-13: 978-0195162004\n\n===================================================================================\nBook Description\nPublication Date: February 12, 2004\nLust, says Simon Blackburn, is furtive, headlong, always sizing up opportunities. It is a trail of clothing in the hallway, the trashy cousin of love. But be that as it may, the aim of this delightful book is to rescue lust &quot;from the denunciations of old men of the deserts, to deliver it from the pallid and envious confessor and the stocks and pillories of the Puritans, to drag it from the category of sin to that of virtue.&quot;\nBlackburn, author of such popular philosophy books as Think and Being Good, here offers a sharp-edged probe into the heart of lust, blending together insight from some of the world's greatest thinkers on sex, human nature, and our common cultural foibles. Blackburn takes a wide ranging, historical approach, discussing lust as viewed by Aristophanes and Plato, lust in the light of the Stoic mistrust of emotion, and the Christian fear of the flesh that catapulted lust to the level of deadly sin. He describes how philosophical pessimists like Schopenhauer and Sartre contributed to our thinking about lust and explores the false starts in understanding lust represented by Freud, Kinsey, and modern &quot;evolutionary psychology.&quot; But most important, Blackburn reminds us that lust is also life-affirming, invigorating, fun. He points to the work of David Hume (Blackburn's favorite philosopher) who saw lust not only as a sensual delight but also &quot;a joy of the mind.&quot;\nWritten by one of the most eminent living philosophers, attractively illustrated and colorfully packaged, Lust is a book that anyone would lust over.\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nA distinguished thinker offers an unabashed defense of everyone's favorite sin, part of Oxford's series on the seven deadlies. Blackburn (The Oxford Dictionary of Philosophy; Being Good) defines lust as acute sexual desire, untrammeled by any other elements that might make it, well, sinfullike aggression, selfishness or (though he doesn't mention it) self-destructiveness. This premise, along with the unquestioned secularism of modern philosophy, leave him free to consider a broad historical range of ideas about lust-from Plato and the Stoics through Augustine and &quot;the Christian Panic&quot; to Sartre and Martha Nussbaum-with care and discernment, but with no real vulnerability to their arguments. Because lust is broadly condoned in our culture, most readers will find that Blackburn's condescension comes across quite sympathetically. He is a witty writer and a canny reader, particularly adept at pitting temporally disparate thinkers (e.g., Hume and Stephen Pinker) against each other. A juicy group of illustrations, all works of fine art (including the torso of Mick Jagger), add to the book's allure. But Blackburn is so confident of being on the side of the angels that he creates devils that aren't really there, like the feminist concept of &quot;objectification,&quot; which he conflates with lust itself. And since he insists that lust is a holiday from moral constraints, it turns out not subject to judgment. &quot;So everything is all right,&quot; he concludes cheerily; it is only the inhibition of lust &quot;by bad philosophy or ideology, by falsity, by controls, by corruptions and perversions and suspicions&quot; that we need fear. This book is not so much a defense of sexual desire as a comprehensive excuse for it, like a note from the doctor.\n\nFrom Booklist\nIn his delightfully literate, cogent, and congenial contribution to the Seven Deadly Sins lecture and book series, philosopher Blackburn argues that, far from being a sin, lust is &quot;not merely useful but essential.&quot; Blackburn first defines lust and what may be wrong with it, and then weighs major attitudes toward lust throughout Western history. Lust is the keen desire for sex and its pleasures for their own sake, he says, and problems arising from it are matters of excesses not intrinsic to it, such as violence, compulsion, and indiscretion (the ancient philosophical Cynics reputedly had sex in public). Plato, the Stoics, Augustine, and Aquinas all had varyingly severe reservations about lust that Blackburn defuses before turning relievedly to Hobbes (yes, the &quot;war of all against all&quot; fellow) with his contention that lust, affording &quot;sensual pleasure&quot; and &quot;delight of the mind,&quot; leads to the most complete personal communion possible. Kant, Freud, and Sartre backslid from Hobbes, but now, &quot;everything is all right,&quot; and &quot;we can reclaim lust for humanity.&quot; Mmmmm. Cigarette? Ray Olson\n\n===================================================================================\nReviews\n&quot;What midsummer night's feast would be digestible without Francine Prose's Gluttony; what weekend jaunt to your best friend's chateau would be survivable without Joseph Epstein's Envy? And you'll need Wendy Wasserstein's Sloth (wickedly subtitled 'And How to Get It') while you're struggling out of your deck chair.&quot;--O, The Oprah Magazine (on the series)\n\n&quot;Whimsically packaged exminations of Lust by Simon Blackburn, Gluttony by Francine Prsoe, Envy by Joseph Epstein, Anger by Robert Thurman, Greed by Phyllis Tickle, Sloth by Wendy Wasserstein and Pride by Michael Eric Dyson become playgrounds for cultural reflection by authors and playwrights in Oxford's Seven Deadly Sins series.&quot;--Publishers Weekly (on the series)\n\n&quot;A thoughtfully burnished essay on a titillating topic.&quot;--Kirkus Reviews\n\n&quot;A deft, Lilliputian trussing-up of a sprawling, Brobdingnagian body of thought...written with lucidity by a man of reason both by profession and by temperament.&quot;--The New Yorker\n\n&quot;A playful essay that delivers everything one might want--insight, historical perspective, critical bite--in books on the other six vices (pride, envy, anger, sloth, greed and gluttony).&quot;--Carlin Romano, Philadelphia Inquirer\n\n&quot;An assuredly elegant essay, wrapped around a seductive compendium of poems and pictures, an ornament to Professor Blackburn's erudition.&quot;--Daily Telegraph\n\n&quot;Blackburn's wry and learned new book, 'Lust,' is part of a seven-book series--one for each of the deadly sins--that grew from a lecture series co-sponsored by the New York Library and Oxford University Press. In this slim volume the author seeks to redeem lust from its 'bad press' and ultimately enhance its standing with a public fed centuries of propaganda and outright disinformation. Neither prude nor dirty old man, he skillfully filters art, verse and prose through the prism of lust and romantic love and does so in a tone of well-read whimsy.&quot;--San Francisco Chronicle\n\n&quot;Less a study of the sin of lust than it is a sinfully amusing defense of it.&quot;--Washington Times\n\n&quot;A learned and delightful little book on lust, one of the most outrageous (and sometimes most delightful) of the so-called 'Seven Deadly Sins.' His generous but always judicious use of the ancients, in particular, makes his Lust not only respectable but, as it should be, philosophically intriguing.&quot;--Robert C. Solomon, author of The Joy of Philosophy\n\n&quot;In his delightfully literate, cogent, and congenial contribution to the Seven Deadly Sins lecture and book series, philosopher Blackburn argues that, far from being a sin, lust is, 'not merely useful but essential.&quot;--Booklist\n\n&quot;A distinguished thinker offers an unabashed defense of everyone's favorite sin, part of Oxford's series on the seven deadlies.... [Blackburn] is a witty writer and a canny reader, particularly adept at pitting temporally disparate thinkers (e.g., Hume and Stephen Pinker) against each other.&quot;--Publishers Weekly\n\n&quot;With wit, erudition, and great good sense, Simon Blackburn builds a seductive case for lust. Rejecting all that is mean or cramped in our collective thinking about sexual desire, and exposing what is silly or fantastical, he celebrates the 'deadly sin' as a form of human vitality. Lust is, oddly enough, a heartwarming book.&quot;--Louise M. Antony, Professor of Philosophy, The Ohio State University\n\n===================================================================================\nAbout the Author\nSimon Blackburn is Professor of Philosophy at the University of Cambridge. He was Edna J. Doury Distinguished Professor of Philosophy at the University of North Carolina, and from 1969 to 1990 was a Fellow and Tutor at Pembroke College, Oxford. He is the author of The Oxford Dictionary of Philosophy and the best-selling Think and Being Good, among other books.\n===================================================================================","torrent":{"xt":"urn:btih:d9031d3e3be2bcc749ff018457b4949d3cbd39d3","amp;dn":"Simon+Blackburn+-+Lust.+The+Seven+Deadly+Sins+%5B2004%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9031d3e3be2bcc749ff018457b4949d3cbd39d3","infoHashBuffer":{"type":"Buffer","data":[217,3,29,62,59,226,188,199,73,255,1,132,87,180,148,157,60,189,57,211]},"announce":[],"urlList":[]}}