{"title":"Pedegogy of the Oppressed by Paulo Freire","uid":8717882,"size":5943959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d905b159c16837d012e8b253fc3dc2e22fbeda60&amp;dn=Pedegogy+of+the+Oppressed+by+Paulo+Freire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thedankness","files":1,"time":1374362532,"description":"Pedagogy of the Oppressed (Portuguese: Pedagogia do Oprimido), written by educator Paulo Freire, proposes a pedagogy with a new relationship between teacher, student, and society. It was first published in Portuguese in 1968, and was translated by Myra Ramos into English and published in 1970.[1] The book is considered one of the foundational texts of critical pedagogy.\n\nDedicated to what is called &quot;the oppressed&quot; and based on his own experience helping Brazilian adults to read and write, Freire includes a detailed Marxist class analysis in his exploration of the relationship between what he calls &quot;the colonizer&quot; and &quot;the colonized&quot;.\n\nIn the book Freire calls traditional pedagogy the &quot;banking model&quot; because it treats the student as an empty vessel to be filled with knowledge, like a piggy bank. However, he argues for pedagogy to treat the learner as a co-creator of knowledge.\n\nAccording to Donaldo Macedo, a former colleague of Freire and University of Massachusetts Amherst professor, Pedagogy of the Oppressed is a revolutionary text, and people in totalitarian states risk punishment reading it;[2] Arizona's former Superintendent of Public Instruction, Tom Horne, objected to its use in classrooms.[3] The book has sold over 750,000 copies worldwide.\n\n\n\n\nI had a hard time finding this book online so I'm posting it here for easier access. It's in PDF format.","torrent":{"xt":"urn:btih:d905b159c16837d012e8b253fc3dc2e22fbeda60","amp;dn":"Pedegogy+of+the+Oppressed+by+Paulo+Freire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d905b159c16837d012e8b253fc3dc2e22fbeda60","infoHashBuffer":{"type":"Buffer","data":[217,5,177,89,193,104,55,208,18,232,178,83,252,61,194,226,47,190,218,96]},"announce":[],"urlList":[]}}