{"title":"'Til Faith Do Us Part by Naomi Schaefer Riley (2013) [PDF] ","uid":10593824,"size":2867047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d95db67bc95574147496241573c02f43c3a1e6e3&amp;dn=%27Til+Faith+Do+Us+Part+by+Naomi+Schaefer+Riley+%282013%29+%5BPDF%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405837567,"description":"Title:'Til Faith Do Us Part - How Interfaith Marriage is Transforming America\nAuthor: Naomi Schaefer Riley \nCategory: Academic/Sociology/Religion\nPublisher: Oxford University Press (April 2, 2013)\nLanguage: English\nISBN-10: 0199873747\nISBN-13: 978-0199873746\n\nPromotional info/Publisher's summary - &quot;In the last decade, 45% of all marriages in the U.S. were between people of different faiths. The rapidly growing number of mixed-faith families has become a source of hope, encouraging openness and tolerance among religious communities that historically have been insular and suspicious of other faiths. \n\nYet as Naomi Schaefer Riley demonstrates in 'Til Faith Do Us Part, what is good for society as a whole often proves difficult for individual families: interfaith couples, Riley shows, are less happy than others and certain combinations of religions are more likely to lead to divorce. Drawing on in-depth interviews with married and once-married couples, clergy, counselors, sociologists, and others, Riley shows that many people enter into interfaith marriages without much consideration of the fundamental spiritual, doctrinal, and practical issues that divide them. Couples tend to marry in their twenties and thirties, a time when religion diminishes in importance, only to return to faith as they grow older and raise children, suffer the loss of a parent, or experience other major life challenges. Riley suggests that a devotion to diversity as well as to a romantic ideal blinds many interfaith couples to potential future problems. Even when they recognize deeply held differences, couples believe that love conquers all. As a result, they fail to ask the necessary questions about how they will reconcile their divergent worldviews-about raising children, celebrating holidays, interacting with extended families, and more. An obsession with tolerance at all costs, Riley argues, has made discussing the problems of interfaith marriage taboo. \n\n'Til Faith Do Us Part is a fascinating exploration of the promise and peril of interfaith marriage today. It will be required reading not only for interfaith couples or anyone considering interfaith marriage, but for all those interested in learning more about this significant, yet understudied phenomenon and the impact it is having on America.&quot;\n\nReviews:\n&quot;The book is chock-full of fascinating statistics ('Jews are the most likely and Mormons are the least likely to marry members of other faiths'), but at its heart is a cautionary thesis: the growing number of interfaith couples don't know what they're getting into...&quot; -Stanley Fish, The New York Times\n\n&quot;Engaging and incisive account--combining clear-eyed analysis with polling data and the details of more than a hundred interviews...&quot; -W. Bradford Wilcox, The Wall Street Journal\n\nThis torrent contains a scanned copy of the book in PDF form, readable at least. The front cover image is also included. Please seed, and enjoy.","torrent":{"xt":"urn:btih:d95db67bc95574147496241573c02f43c3a1e6e3","amp;dn":"%27Til+Faith+Do+Us+Part+by+Naomi+Schaefer+Riley+%282013%29+%5BPDF%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d95db67bc95574147496241573c02f43c3a1e6e3","infoHashBuffer":{"type":"Buffer","data":[217,93,182,123,201,85,116,20,116,150,36,21,115,192,47,67,195,161,230,227]},"announce":[],"urlList":[]}}