{"title":"Solomon Northup - 12 jaar slaaf NL epub","uid":9932603,"size":2953642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da3d82c54e3455f68ef04f271981f0a1bb0ff4db&amp;dn=Solomon+Northup+-+12+jaar+slaaf+NL+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"steffie70","files":3,"time":1397121069,"description":"Ik was stomverbaasd dat ik nog nooit van dit boek had gehoord. Voor mij is het even belangrijk als het dagboek van Anne Frank.' - Steve McQueen\n\nSolomon Northup, in 1808 als vrij man geboren in New York, wordt in 1841 ontvoerd en in het Zuiden verkocht als slaaf. Twaalf jaar lang werkt hij op plantages in Louisiana, vaak onder de meest wrede omstandigheden, altijd in de hoop zijn vrijheid terug te winnen. In 1853 komt Northup eindelijk vrij. In datzelfde jaar verschijnt 12 jaar slaaf, zijn eigen aangrijpende relaas van zijn gevangenschap in een van de donkerste periodes uit de Amerikaanse geschiedenis. Het boek slaat direct in als een bom en opent vele Amerikanen de ogen voor de onmenselijkheid van het slavernijsysteem.\n\n12 Years a Slave is verfilmd door de Britse filmmaker Steve McQueen en werd geproduceerd door onder anderen Brad Pitt. De film won de Golden Globe voor Beste Film en is genomineerd voor negen Oscars, waaronder die voor Beste Film. Het boek verschijnt voor het eerst in Nederlandse vertaling.\n\nMet een voorwoord van Steve McQueen en een inleiding van Bianca Stigter","torrent":{"xt":"urn:btih:da3d82c54e3455f68ef04f271981f0a1bb0ff4db","amp;dn":"Solomon+Northup+-+12+jaar+slaaf+NL+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da3d82c54e3455f68ef04f271981f0a1bb0ff4db","infoHashBuffer":{"type":"Buffer","data":[218,61,130,197,78,52,85,246,142,240,79,39,25,129,240,161,187,15,244,219]},"announce":[],"urlList":[]}}