{"title":"Bones In Her Pocket (Temperance Brennan Short Story) ","uid":8777253,"size":2261411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da6bb331559d42773f514b88ffb233035a3ee101&amp;dn=Bones+In+Her+Pocket+%28Temperance+Brennan+Short+Story%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"livhre","files":-1,"time":1375587498,"description":"Format: ePub\n\nDRM stripped in Calibre.\n\n\nDr Temperance Brennan is in unfamiliar territory as she races to learn the truth from the bones - before it's too late. A new, exclusive straight-to-digital short story from Kathy Reichs, world leading forensic anthropologist and No.1 bestselling author of Deja Dead, Bones Are Forever and Bones of the Lost.\nDr. Tempe Brennan has seen it all. Human bones. Animal bones. Old bones. Young bones. Male bones. Female bones. What she hasn't seen is all of them mixed together in the same case. \nUntil now. \nThe foothills of North Carolina aren't the only unfamiliar territory Tempe faces as she races to learn the meaning of the Bones in Her Pocket.\nMulti-million copy, international bestselling thriller writer Kathy Reichs is an expert in forensic science, giving her fiction an authenticity other crime writers would kill for.\nBones In Her Pocket also gives readers the first chance to read the opening chapters of Kathy's new thriller, Bones of the Lost, out in August. \n\n\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments.\nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps.","torrent":{"xt":"urn:btih:da6bb331559d42773f514b88ffb233035a3ee101","amp;dn":"Bones+In+Her+Pocket+%28Temperance+Brennan+Short+Story%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da6bb331559d42773f514b88ffb233035a3ee101","infoHashBuffer":{"type":"Buffer","data":[218,107,179,49,85,157,66,119,63,81,75,136,255,178,51,3,90,62,225,1]},"announce":[],"urlList":[]}}