{"title":"[DVDRip-mp3+sub-Ita-Eng-Esp]Dying Young-Scelta d'amore by CR-EW","uid":4777010,"size":1567018817,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da81133b8236b6dab8bbe11ce731568d895e28ed&amp;dn=%5BDVDRip-mp3%2Bsub-Ita-Eng-Esp%5DDying+Young-Scelta+d%5C%27amore+by+CR-EW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"CR-Bt","files":3,"time":1237245806,"description":"Maggiori Informazioni su: http://colombo-reloaded.org\nMore Info at: http://colombo-reloaded.org\n\n\nENGLISH\nAfter she discovers that her boyfriend has betrayed her, Hilary O'Neil is looking for a new start and a new job. She begins to work as a private nurse for a young man suffering from blood cancer. Slowly, they fall in love, but they always know their love cannot last because he is destined to die.\n\n\nESPANOL\nUna extraÃƒÂ±a veninteaÃƒÂ±era enfermera es seleccionada para cuidar de un joven con leucemia, pronto el amor harÃƒÂ¡ presencia entre ambos, pero la enfermedad y sus distintas clases sociales intentarÃƒÂ¡n separarlos.\n\n\nITALIANO\nHilary O'Neil, un'avvenente giovane di cultura elementare, dopo aver sperimentato la convivenza con un uomo del quale ha scoperto l'infedeltÃƒÂ , desiderosa di essere ecomicamente indipendente, riesce a farsi assumere come infermiera dal miliardario californiano Richard Geddes per assistere il ventottenne figlio di questi, Victor, da dieci anni ammalato di leucemia e soggetto a terribili periodiche crisi causate dalla cura chemioterapica. Dapprima atterrita poi mossa a pietÃƒÂ , Hilary viene coinvolta in una vicenda sentimentale che culmina con una fuga a due in un villaggio di pescatori: qui i giovani vi trascorrono giornate di svago e d'amore. PoichÃƒÂ¨ ha interrotto la terapia anzitempo, Victor con la morfina tenta di nascondere il dolore che lo ha assalito di nuovo: traumatica ÃƒÂ¨ la scoperta dell'inganno da parte di Hilary, che telefona disperata al padre di Victor perchÃƒÂ¨ lo faccia ricoverare in ospedale. Per convincere Victor a fare la cura, Hilary, che ama sinceramente lo sfortunato giovane, gli promette che resterÃƒÂ  a lui vicina nel bene e nel male.","torrent":{"xt":"urn:btih:da81133b8236b6dab8bbe11ce731568d895e28ed","amp;dn":"%5BDVDRip-mp3%2Bsub-Ita-Eng-Esp%5DDying+Young-Scelta+d%5C%27amore+by+CR-EW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da81133b8236b6dab8bbe11ce731568d895e28ed","infoHashBuffer":{"type":"Buffer","data":[218,129,19,59,130,54,182,218,184,187,225,28,231,49,86,141,137,94,40,237]},"announce":[],"urlList":[]}}