{"title":"Scram!: The Gripping First-hand Account of the Helicopter War in","uid":10575410,"size":3482438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dab18b136c8d08df52404796244a21b2009081d9&amp;dn=Scram%21%3A+The+Gripping+First-hand+Account+of+the+Helicopter+War+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1405639499,"description":"Scram!: The Gripping First-hand Account of the Helicopter War in the Falklands\nby Harry Benson\n\nDESCRIPTION:\n\nIn April 1982 Harry Benson was a 21 year-old Royal Navy commando helicopter pilot, fresh out of training and one of the youngest helicopter pilots to serve in the Falklands War. These pilots, nicknamed 'junglies', flew most of the land-based missions in the Falklands in their Sea King and Wessex helicopters. Much of what happened in the war -- the politics, task force ships, Sea Harriers, landings, Paras and Marines -- is well-known and documented. But almost nothing is known of the young commando helicopter pilots and aircrewmen who made it all happen on land and sea. This is their 'Boys Own' story, told for the very first time.\n \nHarry Benson has interviewed forty of his former colleagues for the book creating a tale of skill, initiative, resourcefulness, humour, luck, and adventure. This is a fast-paced, meticulously researched and compelling account written by someone who was there, in the cockpit of a Wessex helicopter. \n\nNone of these pilots has spoken before about:\n- The two helicopter crashes and eventual rescue following a failed SAS mission high up on an in hospitable glacier in South Georgia\n- The harrowing story of the Exocet strike that sunk the transport ship Atlantic Conveyor\n- The daring missile raid on the Argentine high command in Port Stanley\n- The constant mortar fire faced while supporting troops and evacuating casualties\n- The hair-raising head-on attacks by Argentine jets on British helicopters\n- The extraordinary courage shown during the evacuation of the bombed landing ship 'Sir Galahad' \n\nIf you liked Apache, Vulcan 607 and Chickenhawk, you'll love Scram!  The word &quot;Scram&quot; was coined by Falklands helicopter pilots to warn other 'junglies' to go to ground or risk being shot down as Argentinean jets blasted through 'bomb alley'. The term has never been used before or since.\n","torrent":{"xt":"urn:btih:dab18b136c8d08df52404796244a21b2009081d9","amp;dn":"Scram%21%3A+The+Gripping+First-hand+Account+of+the+Helicopter+War+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab18b136c8d08df52404796244a21b2009081d9","infoHashBuffer":{"type":"Buffer","data":[218,177,139,19,108,141,8,223,82,64,71,150,36,74,33,178,0,144,129,217]},"announce":[],"urlList":[]}}