{"title":"Ein Leben lang kurze Hosen tragen (The Child I Never Was) [2002]","uid":13328452,"size":805085159,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db25dc51b7ca624f9e7957cd7abd5e08045410b0&amp;dn=Ein+Leben+lang+kurze+Hosen+tragen+%28The+Child+I+Never+Was%29+%5B2002%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BREIN-HQ","files":6,"time":1453939096,"description":"Fictionalized account of Jürgen Bartsch, a German boy who became notorious in the 1960's after his conviction for the serial killings \r\nand sexual molestation of a number of young German boys. Told partly as recreation and partly as taped confession.\r\n\r\nA serial killer dispassionately discusses the nuts and bolts of his grisly avocation, as well as the youthful traumas which helped to mold him into a psychopath, \r\nin this disturbing independent drama from Germany, based on a true story. Young Jurgen Bartsch (Sebastian Urzendowsky) was raised in a family where his father (Walter Gontermann) \r\nbarely acknowledged his existence and his mother (Ulrike Bliefert) displayed an inappropriate degree of affection toward him. When he reached puberty, Bartsch (played as a teenager by Tobias Schenke) \r\nwas a young man confused and bitter about his growing sexual maturity, and possessing a deep hatred of those around him. Bartsch was a 15-year-old apprentice butcher when he kidnapped and murdered a young boy; \r\nhe would kill three more boys in a similar fashion before he was captured by police in 1966. After he was found guilty, Bartsch carefully documented his childhood and his crimes in a series of letters and essays, \r\nand Ein Leben lang kurze Hosen tragen is drawn from his own words as it dramatizes his life and his crimes.\r\n\r\n(2002) - Crime, Drama - 7.0/10\r\n\r\nIMDB \nhttp://www.imdb.com/title/tt0355683/\r\n\r\nTitles:\r\nThe Child I Never Was - English\r\nEin Leben lang kurze Hosen tragen - German\r\n\r\nLanguages:\r\nGerman (original, with hardcoded English subtitles)\r\n\r\nSubtitles (inside movie)\r\nEnglish\r\nPortuguese\r\nSpanish\r\n(Synced to our best effort)\r\n\r\nDVD to mkv(highest quality), included German speaking and all possible subtitles. Enjoy!\r\nIf someone is able to obtain a dvd without hardcoded subs, please let us know! This fine movie deserves an even better quality version.\r\n\r\nBREIN-HQ\r\nOld movies and docu's in HQ/subbed","torrent":{"xt":"urn:btih:db25dc51b7ca624f9e7957cd7abd5e08045410b0","amp;dn":"Ein+Leben+lang+kurze+Hosen+tragen+%28The+Child+I+Never+Was%29+%5B2002%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db25dc51b7ca624f9e7957cd7abd5e08045410b0","infoHashBuffer":{"type":"Buffer","data":[219,37,220,81,183,202,98,79,158,121,87,205,122,189,94,8,4,84,16,176]},"announce":[],"urlList":[]}}