{"title":"The Sahara - A Cultural History.epub","uid":9950252,"size":7234021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db38543f0eea3247108dd0459977510dd94a01dd&amp;dn=The+Sahara+-+A+Cultural+History.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1397389257,"description":"Eamonn Gearon, &quot;The Sahara: A Cultural History&quot;\nISBN: 019986196X, 0199861951 | 2011 | EPUB | 288 pages | 7 MB\n\nThe Sahara is the quintessence of isolation, epitomizing both remoteness and severity of environment unlike any other place on the face of the earth. Replete with myths and fictions, it is a wild land, dotted with oases and camel trains trudging through sand dunes that roll like the waves on a sea, as far as the distant horizon. But this is just part of the picture. The largest desert in the world, the Sahara ranges from the river Nile running through Egypt and Sudan in the east, to the Atlantic coast from Morocco to Mauritania in the west; stretching from the Atlas Mountains and the shores of the Mediterranean in the north, to the fluid Sahelian fringe that delineates the desert in the south.Invaders and traders have come and gone for millennia, but the Sahara is also the place that some people call home. While larger than the United States, this vast area contains only three million people. Africans and Arabs, Berber and Bedu, Tuareg and Tebu. Eamonn Gearon explores the history, culture and terrain of a place whose name is familiar to all, but known to few.","torrent":{"xt":"urn:btih:db38543f0eea3247108dd0459977510dd94a01dd","amp;dn":"The+Sahara+-+A+Cultural+History.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db38543f0eea3247108dd0459977510dd94a01dd","infoHashBuffer":{"type":"Buffer","data":[219,56,84,63,14,234,50,71,16,141,208,69,153,119,81,13,217,74,1,221]},"announce":[],"urlList":[]}}