{"title":"S.K. Dunstall - Linesman and Alliance","uid":13871927,"size":389178719,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:db43f6ed370dc11806da431808ba495f1dade7be&amp;dn=S.K.+Dunstall+-+Linesman+and+Alliance&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":2,"time":1458107112,"description":"\nhttp://i.imgur.com/AWr9Bnw.jpg\r\n\r\n\r\n\r\n\r\n\r\nLinesman (Linesman #1)\r\n\r\n\r\nFirst in a brand new thought-provoking science fiction series.\r\n\r\nThe lines. No ship can traverse the void without them. Only linesmen can work with them. But only Ean Lambert hears their song. And everyone thinks he’s crazy…\r\n\r\nMost slum kids never go far, certainly not becoming a level-ten linesman like Ean. Even if he’s part of a small, and unethical, cartel, and the other linesmen disdain his self-taught methods, he’s certified and working.\r\n\r\nThen a mysterious alien ship is discovered at the edges of the galaxy. Each of the major galactic powers is desperate to be the first to uncover the ship’s secrets, but all they’ve learned is that it has the familiar lines of energy—and a defense system that, once triggered, annihilates everything in a 200 kilometer radius.\r\n\r\nThe vessel threatens any linesman who dares to approach it, except Ean. His unique talents may be the key to understanding this alarming new force—and reconfiguring the relationship between humans and the ships that serve them, forever.\r\n\r\n\r\n\r\nNarrated by: Brian Hutchison\r\nLength: 12 hrs and 41 mins\r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged Audiobook\r\nRelease Date:06-30-15\r\nPublisher: Recorded Books\r\n\r\n\r\n---\r\n\r\n\r\nAlliance (Linesman #2)\r\n\r\nAs the Linesman series continues, linesman Ean Lambert finds himself facing an alien ship he doesn’t understand—and a terrifying political threat he cannot fight…\r\n\r\nThe lines. The soul of every ship. It was once thought there were only ten, but that was before an alien vessel appeared at the edge of space—before Ean Lambert heard more lines singing. Ean’s ways of communicating with lines is strange. But his abilities make him a valuable tool—or weapon—to command.\r\n\r\nCaptain Selma Kari Wang has lost everything—her ship, her crew, her legs. But the New Alliance of Worlds is not done with her yet. After they rebuild her broken body, they send her to captain one of the new alien ships, teaming her up with Ean, the only one who can understand the alien lines.\r\n\r\nKari Wang and Ean are poised on the threshold of discoveries that could change the world. But not everyone wants the New Alliance to control the secrets they uncover—and those who oppose won’t hesitate to do whatever it takes to stop them…\r\n\r\n\r\n\r\nNarrated by: Brian Hutchinson\r\nLength: 13 hrs and 17 mins\r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged Audiobook\r\nRelease Date:02-25-16\r\nPublisher: Recorded Books","torrent":{"xt":"urn:btih:db43f6ed370dc11806da431808ba495f1dade7be","amp;dn":"S.K.+Dunstall+-+Linesman+and+Alliance","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db43f6ed370dc11806da431808ba495f1dade7be","infoHashBuffer":{"type":"Buffer","data":[219,67,246,237,55,13,193,24,6,218,67,24,8,186,73,95,29,173,231,190]},"announce":[],"urlList":[]}}