{"title":"Milan Kundera - The Book of Laughter and Forgetting (pdf)","uid":10258495,"size":2651237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db46a050660e66d44fc550df4540a6c22aa14fb4&amp;dn=Milan+Kundera+-+The+Book+of+Laughter+and+Forgetting+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401426661,"description":"Milan Kundera - The Book of Laughter and Forgetting (Faber &amp; Faber, 1996). Aaron Asher, trans. 312 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nI couldn't find a digital version I liked, so I made a new scan of this book. This is the most recent translation, and the one now fully authorized by Kundera.\n\n\ndescription:\n\nA vivid mix of fictional autobiography and myth examines the human condition through five uniquely integrated parts, humorously and movingly depicting the political, erotic, and intellectual facets of modern life.\n\n\n\nIn one of the finer modern ironies of the life-imitates-art sort, the country that Kundera seemed to be writing about when he talked about Czechoslovakia is, thanks to the latest political redefinitions, no longer precisely there. This kind of disappearance and reappearance is, partly, what Kundera explores in The Book of Laughter and Forgetting. In this polymorphous work -- now a novel, now autobiography, now a philosophical treatise -- Kundera discusses life, music, sex, philosophy, literature and politics in ways that are rarely politically correct, never classifiable but always original, entertaining and definitely brilliant.\n\nReview\n\n&quot;This book, as it bluntly calls itself, is brilliant and original, written with the purity and wit that invite us directly in.&quot; -- John Updike,New York Times Book Review\n\n&quot;The Book of Laughter and Forgetting calls itself a novel, although it is part fairy tale, part literary criticism, part political tract, part musicology, and part autobiography. It can call itself whatever it wants to, because the whole is genius.&quot; -- New York Times\n\n\nNovel by Milan Kundera, written in Czech as Kniha smichu a zapomneni but originally published in French as Le Livre du rire et de l'oubli (1979). The political situation in Czechoslovakia, where history and memory are manipulated to suit those in power, becomes a symbol for all of contemporary European culture. The novel is written in seven parts with an interwoven structure that the author likened to polyphonic music. The repetition of incidents, characters, and themes provides The Book of Laughter and Forgetting with its formal shape. Memories, which the characters want to keep or to forget, are a recurring subject, as is laughter, which is as often ironic as joyous.\n\n-- The Merriam-Webster Encyclopedia of Literature\n\n","torrent":{"xt":"urn:btih:db46a050660e66d44fc550df4540a6c22aa14fb4","amp;dn":"Milan+Kundera+-+The+Book+of+Laughter+and+Forgetting+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db46a050660e66d44fc550df4540a6c22aa14fb4","infoHashBuffer":{"type":"Buffer","data":[219,70,160,80,102,14,102,212,79,197,80,223,69,64,166,194,42,161,79,180]},"announce":[],"urlList":[]}}