{"title":"The day after (1983) [DVDrip ITA ENG] TNT Village","uid":6910000,"size":1565641682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db6c7bb3921df1f7530944864caf6dd25739c1cf&amp;dn=The+day+after+%281983%29+%5BDVDrip+ITA+ENG%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"l.diliberto","files":2,"time":1324752262,"description":"The day after (1983) [DVDrip ITA ENG] TNT Village\n\nDual Audio: 1# ITA 2# ENG\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=80926&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=80926&lt;/a&gt;\n\n.: Plot :.\n\nThis film originally aired as a TV movie back in 1983 in the United States. It depicts the effects of nuclear war on the citizens of the Kansas City area. In the film, during the actual attacks, a lot of raw footage of nuclear blasts and explosions is used, but no computer enhanced special effects were needed in this film to get the point across. The point, being of course, that nuclear war is horrible. The movie was aired to show leaders of nations in the world what would happen if nuclear war was ever waged. When this film was first aired, Cold War tensions were high and the fear of nuclear war was very imminent. Though the events in the film are very powerful, a disclaimer at the end of the movie even tells the viewers that the events depicted in the film are far less worse then what would actually take place in a real nuclear war. I feel that the plot was created well. The film shows what happens before the attacks, the actual attacks and then what happens after the attacks. The attacks were not shown too soon after the movie began but well into the movie and built up enough to show a lot of drama. The acting is very good, in my opinion. The late Jason Robards plays the lead role and a few other familiar faces take part as well (Steve Guttenburg, John Lithgow). The writing is fair, but not bad for a made-for-TV movie. Overall, the movie is very excellent and places itself very positively in my book. It was a very controversial film for its time and it did scare the hell out of many people (truthfully, it did shake me up a little the first time I saw it). It's really not for the kids, even though it was a TV movie, because the scenes of the nuclear blasts and radiation sickness aren't very light. \n\n.: Trama :.\n\nMentre l'antefatto della pellicola contiene una debole esposizione sulle modalitÃƒÂ  di insorgenza della guerra, la trama tratta piuttosto della reazione e della sofferenza umana dei personaggi. Il film segue la vita di molti cittadini comuni e delle persone che incontrano nel corso di una attacco nucleare diretto contro Kansas City, Missouri. Il dottor Russell Oakes (Jason Robards) vive a Kansas City con la moglie (Georgann Johnson), e lavora nel &quot;Memorial General Hospital&quot; nel centro di Kansas City. Nel momento iniziale dell'attacco viene a trovarsi bloccato nel traffico su una autostrada, con tutti i motori, le radio e le apparecchiature elettroniche guaste per via degli effetti dell'esplosione esoatmosferica* di una bomba all'idrogeno che provoca un impulso elettromagnetico, capace di bruciare tutti i circuiti elettrici ed elettronici per induzione di Lorentz. *(Una esplosione non letale di una bomba a fusione ad altissima quota, che provoca il bombardamento delle fasce di Van Allen con uno sciame di particelle subatomiche cariche, a loro volta generanti l'impulso E.M.). L'impulso elettromagnetico ÃƒÂ¨ seguito dopo qualche minuto da un'esplosione nucleare al suolo altamente catastrofica e letale, ma comunque il dottore sopravvive all'attacco nascondendosi in un tombino e si dirige verso l'ospedale del &quot;campus&quot; all'UniversitÃƒÂ  del Kansas in Lawrence per assistere i feriti assieme al Dr. Sam Hachiya (Calvin Jung) ed all'infermiera Bauer (JoBeth Williams), e ad altri prestatori di pronto soccorso.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img103.imageshack.us/img103/2589/copertinadt4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img103.imageshack.us/img103/2589/copertinadt4.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nPaese \tStati Uniti d'America\nAnno \t1983\nGenere \tdrammatico\nRegia \tNicholas Meyer\nSoggetto \tEdward Hume\nSceneggiatura \tNicholas Meyer\nFotografia \tGayne Rescher\nMontaggio \tWilliam Paul Dornisch, Robert Florio\nMusiche \tDavid Raksin, Virgil Thomson\nProduttore \tRobert Papazian, Stephanie Austin\n\nCast:    Jason Robards\n    JoBeth Williams\n    Steve Guttenberg\n    John Cullum\n    John Lithgow\n\n0=============================0\n\n.: Info Ripping :.\n\nDimensione File: 1,45 Gb\nDurata: 2:01:48\nNumero di tracce Audio: 2\n\nNome Codec Video: XviD 1.1.2 Final\nLarghezza Frame:  672\nAltezza frame: 368\nDisplay Aspect Ratio: 1.826\nFPS: 25.000\nVideo Bitrate: 1128 kbps\nQF: 0.182\n\n--- Informazioni Audio Traccia 1---\n\nCodec audio: AC3\nFreq.audio: 48000 Hz\nBitrate: 448 kbps\nTipo: CBR\nCanali: 6\n\n--- Informazioni Audio Traccia 2---\n\nCodec audio: MP3\nFreq. audio: 48000 Hz\nBitrate: 128 kbps\nTipo: Two Mono Channels\nCanali: 2 ","torrent":{"xt":"urn:btih:db6c7bb3921df1f7530944864caf6dd25739c1cf","amp;dn":"The+day+after+%281983%29+%5BDVDrip+ITA+ENG%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db6c7bb3921df1f7530944864caf6dd25739c1cf","infoHashBuffer":{"type":"Buffer","data":[219,108,123,179,146,29,241,247,83,9,68,134,76,175,109,210,87,57,193,207]},"announce":[],"urlList":[]}}