{"title":"Angry Video Game Nerd: The Movie - Original Motion Picture Sound","uid":10959639,"size":187438059,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dba13b6e8c746be45562a3761d9c4a27e03296fc&amp;dn=Angry+Video+Game+Nerd%3A+The+Movie+-+Original+Motion+Picture+Sound&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"NEXrosoft","files":-1,"time":1409706041,"description":"Angry Video Game Nerd: The Movie - Original Motion Picture Soundtrack\n\n(Ripped from Spotify)\n\n&quot;Theme from Angry Video Game Nerd: The Movie&quot; - Adapted from the original theme song written and performed by Kyle Justin. Arranged and produced by Bear McCreary.\n&quot;Nerds Before Birds&quot; - Written by Brendan McCreary and performed by the band Young Beautiful in a Hurry.\n&quot;Nerd Nightmares&quot; Music by Bear McCreary\n&quot;The Landfill&quot; Music by Bear McCreary\n&quot;Humvee Chase&quot; Music by Bear McCreary\n&quot;Barcade&quot; - Written by Brendan McCreary and performed by the band Young Beautiful in a Hurry.\n&quot;The Story of Death Mwauthzyx&quot; Music by Bear McCreary\n&quot;Save the Fans&quot; Music by Bear McCreary\n&quot;Zandor's Tale&quot; Music by Bear McCreary\n&quot;Howard Scott Warshaw&quot; Music by Bear McCreary\n&quot;Sacred Ground of the Golden Turd&quot; - Written and performed by Kyle Justin. Arranged and produced by Bear McCreary.\n&quot;General Dark Onward&quot; Music by Bear McCreary\n&quot;Unidentified Flying Nerd&quot; Music by Bear McCreary\n&quot;Killer Robots&quot; Music by Bear McCreary\n&quot;Death Mwauthzyx Rises&quot; Music by Bear McCreary\n&quot;The Nerdy Hero&quot; Music by Bear McCreary\n&quot;Birds Before Nerds&quot; Music by Bear McCreary\n&quot;Source Music Medley&quot; Music by Bear McCreary\n&quot;Maverick Regeneration&quot; Music by Bear McCreary. Originally included on Play For Japan: The Album. The album, which was released on June 6th 2011, was made to benefit the Japanese Red Cross, and all the proceeds from the sales went to them to help victims of the recent earthquakes and tsunamis in Japan at the time. The track was also used as the background music of the first official trailer to Angry Video Game Nerd: The Movie.\n&quot;The Angry Video Game Nerd Theme (Bear McCreary Remix)&quot; - Written and performed by Kyle Justin. Arranged and produced by Bear McCreary.\n\n(PS This is my first torrent. Enjoy!)","torrent":{"xt":"urn:btih:dba13b6e8c746be45562a3761d9c4a27e03296fc","amp;dn":"Angry+Video+Game+Nerd%3A+The+Movie+-+Original+Motion+Picture+Sound","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dba13b6e8c746be45562a3761d9c4a27e03296fc","infoHashBuffer":{"type":"Buffer","data":[219,161,59,110,140,116,107,228,85,98,163,118,29,156,74,39,224,50,150,252]},"announce":[],"urlList":[]}}