{"title":"Understanding To Kill a Mockingbird","uid":6523472,"size":15229937,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc4c9dbd9de4b3212038b9931b9d9a6acca20b71&amp;dn=Understanding+To+Kill+a+Mockingbird&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_F1_","files":-1,"time":1310076368,"description":"Understanding To Kill a Mockingbird: A Student Casebook to Issues, Sources, and Historic Documents\n Greenwood | November 30, 1994 | ISBN-10: 0313291934 | 248 pages | PDF | 14.6 Mb\n\n To Kill a Mockingbird is a novel of such profound power that it has affected the lives of readers and left and indelible mark on American culture. This rich collection of historical documents, collateral readings, and commentary captures the essence of the novel's impact, making it an ideal resource for students, teachers, and library media specialists. Drawing on multi-disciplinary sources, the casebook places the issues of race, censorship, stereotyping, and heroism into sharp perspective. Through these documents, the reader also gains a taste for the historical events which influenced the novel as well as the novel's relevance in today's world. Among the documents which speak most eloquently are testimony from the Scottsboro Case of the 1930s, memoirs and interviews with African Americans and whites who grew up in Alabama in the 1930s, and news stories on civil rights activities in Alabama in the 1950s. Most of the documents presented are available in no other printed form. Study questions, project ideas, and bibliographies are also included for ease of use in further examination of the issues raised by the novel. Thirteen historical photographs complement the text.","torrent":{"xt":"urn:btih:dc4c9dbd9de4b3212038b9931b9d9a6acca20b71","amp;dn":"Understanding+To+Kill+a+Mockingbird","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc4c9dbd9de4b3212038b9931b9d9a6acca20b71","infoHashBuffer":{"type":"Buffer","data":[220,76,157,189,157,228,179,33,32,56,185,147,27,157,154,106,204,162,11,113]},"announce":[],"urlList":[]}}