{"title":"The Three Sounds - Elegant Soul (1968) [EAC-FLAC]","uid":12423204,"size":394851118,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc67f080b14fd25148f454be53147b4f55ea1c61&amp;dn=+The+Three+Sounds+-+Elegant+Soul+%281968%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pucholoco","files":21,"time":1442332172,"description":"              The Three Sounds - Elegant Soul (1968) [EAC-FLAC]\n           EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 266 Mb\n                   Full Artwork @ 600 dpi (jpg) -&gt; 149 Mb\n\n\nElegant Soul, one of two albums Higgins did with the trio, is indeed fittingly titled. \n\nThe pop tunes on the set include a reading of Tom T. Hall's hit &quot;Harper Valley P.T.A.,&quot; featuring additional players like drummer Paul Humphrey (who appears on the entire album for added muscle), Alan Estes on vibes, guitarist Al Vesvoco, and nine string players, adding a perverse, lush, deeply soulful sheen with shuffling breaks laid down by Burnett, Humphrey, and a chorus of uncredited female backing vocalists.\n\nThe centerpiece of this beautiful -- and underappreciated at the time -- album is Higgins' nine-plus-minute &quot;Sittin' Duck,&quot; with Harris at his hooky gospelized best, playing the hell out of the changes and filling the measures with his requisite taste and feel. The two drummers shuffle in unison, and Estes' vibes articulate the melody with Harris adding a warmer dimension. \n\nThe strings are rich, but are employed mostly in the codas and tags, adding to the dramatic weight of the tune, which is otherwise a long, dance-worthy strut. Elsewhere, the strings are varied in their texture on the gorgeous &quot;Sugar Hill&quot;; they outdo those in the hits of the day like Paul Mauriat's &quot;Love Is Blue,&quot; or even Roger Williams' &quot;Born Free.&quot; Ervin's &quot;African Sweets&quot; is one of the set's highlights, too. \n\nIt lifts six notes from the Rolling Stones' &quot;Paint It Black&quot; on top of a happening bass vamp and some slamming snare to introduce the cut. This is down-and-dirty soul-jazz dressed for Saturday night at the club; Harris beats the hell out of the piano's middle register in pure groove ecstasy. \n\nThe added flamenco-style guitar and rough-and-rowdy flute solo add to an already heady brew. All of this is just the tip of the iceberg in a sense. Elegant Soul was -- and could even be currently -- dismissed with a casual listen as lightweight pop with a compelling rhythmic sense. But that would be selling it way short. This album warrants close listening to discern all that's happening in its production and arrangements. Whether it's on the dancefloor, for sampling, for feel-good or deep listening, or for finger-popping, it satisfies on all levels\n\n\n----------------------------------------------------------------------------\nTracklist:\n----------------------------------------------------------------------------\n\n01. Elegant Soul\n02. Do It Right Now\n03. Sittin' Duck\n04. (Sock It To Me) Harper Valley P.T.A.\n05. Sugar Hill\n06. African Sweets\n07. Black Gold\n08. Book Of Slim\n09. Walls Of Respect\n\n*2008 Blue Note / Capitol | 5 22286 2 | 24-bit remaster\n\n\n\nPersonnel:\nGene Harris - piano\nAndy Simpkins - bass\nCarl Burnett - drums\n\n\n\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:dc67f080b14fd25148f454be53147b4f55ea1c61","amp;dn":"+The+Three+Sounds+-+Elegant+Soul+%281968%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc67f080b14fd25148f454be53147b4f55ea1c61","infoHashBuffer":{"type":"Buffer","data":[220,103,240,128,177,79,210,81,72,244,84,190,83,20,123,79,85,234,28,97]},"announce":[],"urlList":[]}}