{"title":"Alex Haley Roots","uid":6503453,"size":6072802960,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dc7dfde38bd231b0c2d03f5ed1621fe14f732c26&amp;dn=Alex+Haley+Roots&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"momamedienta","files":6,"time":1309343384,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0075572/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0075572/&lt;/a&gt;\n\n\nHis name was Kunta Kinte.  Kidnapped from Africa and enslaved in America in 1767, he refused to accept his slave name of Toby.  Heirs kept his historic defiance alive, passing on his tale across generations until it reached a young boy growing up in Tennessee.  His name was Alex Haley.  Through the lineage of one family, Haley and his Pulitzer Prize-winning Roots told a story for all America and the world.  Seen by 130 million viewers during it's premiere telecasts and the winner of dozens of awards, the David L. Wolper production remains an engrossing entertainment 30 years later.\n\nEpisode 1:  In Gambia, West Africa, Kunta Kinte, son of Omoro and Binta, distinguishes himself in manhood training rituals.  But he does not enjoy his new status long: slave traders seize him.  Chained with other captives, Kunta begins an agonized odyssey to the New World.\n\nEpisode 2: Despite a violent rebellion, the slave ship Lord Ligonier completes its voyage and Kunta Kinte endures the indignity of an Annapolis slave auction.  Fiddler, the slave in charge of Kunta's training, becomes his only friend - a friendship that is tested when Kunta plans an escape so he can be with Fanta.\n\nEpisode 3:  In 1776, a nation fights for freedom...but not for all.  Kunta Kinte escapes again and is crippled by slave catchers.  he marries, gains a daughter and loses his long-time friend Fiddler.  Another chance for escape arises, but Kunta sacrifices it to care for his wife and the newborn he names Kizzy, an African word for &quot;stay put.&quot;\n\nEpisode 4:  At age 16, Kizzy is sold and bears her new master's son, who grows up to become fun-loving Chicken George.  Yearning to see her parents, Kizzy is comforted by Samuel Bennett, but they are ill-matched.  When she returns to her birthplace, Kizzy learns her parents' fates.\n\nEpisode 5:  Chicken George is sent to England as payment for his owner's gambling debt.  Fourteen years later, he returns home a free man, a status that has a profound effect on the family begun by Kunta Kinte.  The Civil War erupts; at last the era of slavery draws to an end.\n\nEpisode 6:  The Civil War is over but night riders terrorize ex-slaves.  By marking his clients' horseshoes, Tom identifies the raiders but endangers his own life.  Chicken George, who fought for the Union, rejoins his family.  He leads them to a new home in Tennessee.\n\n\nAs always please seed...don't hit and run!","torrent":{"xt":"urn:btih:dc7dfde38bd231b0c2d03f5ed1621fe14f732c26","amp;dn":"Alex+Haley+Roots","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc7dfde38bd231b0c2d03f5ed1621fe14f732c26","infoHashBuffer":{"type":"Buffer","data":[220,125,253,227,139,210,49,176,194,208,63,94,209,98,31,225,79,115,44,38]},"announce":[],"urlList":[]}}