{"title":"African Identities: Race, Nation and Culture in Ethnography, Pan","uid":8758349,"size":834215,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd616a0a25d76b71787e40bbaf97d6672d9ff4f1&amp;dn=African+Identities%3A+Race%2C+Nation+and+Culture+in+Ethnography%2C+Pan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1375191434,"description":"\nPublication Date: May 24, 1998 | ISBN-10: 0415164451 | ISBN-13: 978-0415164450 | Edition: 1 | filetype: pdf\n\n\nThis fascinating and well researched study explores the meaning generated by `Africa' and `Blackness' throughout the century.\nUsing literary texts, autobiography, ethnography, and historical documents, African Identities discusses how ideas of Africa as an origin, as a cultural whole, or as a complicated political problematic, emerge as signifiers for analysis of modernity, nationhood and racial difference.\nKanneh provides detailed readings of a range of literary texts, including novels by:\n* Toni Morrison\n* Alice Walker\n* Gloria Naylor\n* Ngugi Wa Thiong'o\n* Chinua Achebe\n* and V.S. Naipaul.\nFor anyone interested in literature, history, anthropology, political writing, feminist or cultural analysis, this book opens up new areas of thought across disciplines.\n\n\nReview\n'African Identities is a study richly detailed and admirably sophisticated in its use of cultural theory and its engagement with the large number of writers it treats . . . The work's interdisciplinary nature will make it an invaluable resource in African studies, African-American studies, and cultural studies in general.' - Margo Hendricks, The Modern Language Review\n\n'African Identities is a brilliant and sustained effort to deconstruct and reconstruct the varied conceptualisation of African identity, ...' - Contemporary Review\n\n'Kanneh has given students of African and African-American literatures a useful tool to navigate successfully the difficult terrain of reading not only the literature of Africa and its Diaspora but also 'the meanings of African identities'without a doubt, this is a book worth reading.' - Margo Hendricks, University of California, Santa Cruz\nAbout the Author\nKadiatu Kanneh teaches at the University of Birmingham, UK.\n\n\nPaperback: 216 pages\nPublisher: Routledge; 1 edition (May 24, 1998)\nLanguage: English\nISBN-10: 0415164451\nISBN-13: 978-0415164450\n\n &lt;a href=&quot;\nhttp://www.amazon.com/African-Identities-Ethnography-Pan-Africanism-Literatures/dp/0415164451&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/African-Identities-Ethnography-Pan-Africanism-Literatures/dp/0415164451&lt;/a&gt;\n\n\n\n\nTags: race, racism, oppression, nation, nationalist, marx, marxism, marxist, das kapital, africa, african, america, american, african american, black, literature, ww2, cold war, ghana, Kwame, Nkrumah, IMF, capital, communism, capitalism, left, right, politics, pan-african, black star line, Malcolm X, W.E.B. Du Bois, Kwame Nkrumah, Martin Delany, World Bank, self-reliance, self-determination, independence, colonialism, UK, GB, Great Britain, England, French, dark continent, african studies, afro-centric, Toni Morrison, Alice Walker, Gloria Naylor, Ngugi Wa Thiong'o, Chinua Achebe, V.S. Naipaul, ","torrent":{"xt":"urn:btih:dd616a0a25d76b71787e40bbaf97d6672d9ff4f1","amp;dn":"African+Identities%3A+Race%2C+Nation+and+Culture+in+Ethnography%2C+Pan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd616a0a25d76b71787e40bbaf97d6672d9ff4f1","infoHashBuffer":{"type":"Buffer","data":[221,97,106,10,37,215,107,113,120,126,64,187,175,151,214,103,45,159,244,241]},"announce":[],"urlList":[]}}