{"title":"The Eagles of Death Metal - Speaking in Tongues [promo].VOB","uid":8699925,"size":156104704,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dd84b34dbd24dbf116f2c1ec1aceccaadb990352&amp;dn=The+Eagles+of+Death+Metal+-+Speaking+in+Tongues+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1374038793,"description":"The Eagles of Death Metal - Speaking in Tongues [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Speaking in Tongues&quot; is a song from  Peace, Love, Death Metal, the debut album by Eagles of Death Metal released on March 23, 2004.\n\nEagles of Death Metal is a garage rock band fronted by Jesse &quot;The Devil&quot; Hughes. The album was recorded primarily by Jesse Hughes (credited as &quot;J. Devil Huge&quot; or &quot;Mr. Boogie Man&quot;) and Josh Homme (credit as &quot;Carlo von Sexron&quot; or &quot;Baby Duck&quot;), and featured guest appearances by Tim Vanhamel (dEUS, Millionaire, Evil Superstars), Brody Dalle (The Distillers), Nick Oliveri (Queens of the Stone Age, Kyuss, The Dwarves, Mondo Generator), and Alain Johannes &amp; Natasha Shneider (Eleven, Queens of the Stone Age, Desert Sessions).\n\nJosh Homme told MTV News that the band is led by Hughes. &quot;I just sit behind the drums and play rock and roll, which is a great change of pace for me. J. Devil writes everything, every lyric and riff, and he's a fantastic songwriter. He and I go through and arrange them, and I lay down harmonies, but it's really his thing. It's the antithesis of the bloated rock-attitude bullshit I've had to deal with recently&quot;. Josh Homme promoted the band when appearing on the Lollapalooza tour with Queens of the Stone Age in 2003 wearing an Eagles of Death Metal t-shirt.\n\nEagles of Death Metal is an American rock band from Palm Desert, California, formed in 1998 by Jesse Hughes and Josh Homme, who are the only permanent members of the band, though Homme rarely plays live shows because of commitments to other bands. There are also a wide range of other musicians that play under the Eagles of Death Metal moniker, both on the albums and in live shows, frequently under humorous aliases. Despite their band name, Eagles of Death Metal is not a death metal band. Hughes stated that a friend was introducing Josh Homme to the death metal genre. When he played a song by the Polish band Vader and made a claim that the song was within the death metal genre, Homme then referred to Vader as &quot;The Eagles of Death Metal&quot;. After hearing this phrase, he wondered what a cross between the Eagles and a death metal band would sound like. In a 2003 interview Homme described the sound of the band as a combination of &quot;bluegrass slide guitar mixed with stripper drum beats and Canned Heat vocals.&quot; Jesse Hughes is known for his enthusiastic interaction with audiences at live performances.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Peace,_Love,_Death_Metal&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Peace,_Love,_Death_Metal&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/lANleaaEM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/lANleaaEM&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:02:50\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:dd84b34dbd24dbf116f2c1ec1aceccaadb990352","amp;dn":"The+Eagles+of+Death+Metal+-+Speaking+in+Tongues+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd84b34dbd24dbf116f2c1ec1aceccaadb990352","infoHashBuffer":{"type":"Buffer","data":[221,132,179,77,189,36,219,241,22,242,193,236,26,206,204,170,219,153,3,82]},"announce":[],"urlList":[]}}