{"title":"This Is Water - David Foster Wallace","uid":6129225,"size":20796,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dda808656aecf3da8bf13b6a5f3bcb8f4a9b2cf8&amp;dn=This+Is+Water+-+David+Foster+Wallace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mariarocio","files":1,"time":1296061060,"description":"The celebrated writer and philosopher David Foster Wallace distills the most important lessons he learned about life in this profound and witty manifesto.\n\nPresented with the challenge of collecting all he believed about life, human nature, and lasting fulfillment into a brief talk, David Foster Wallace wrote this astonishing essay, which is published here for the first time. At the heart of his philosophy are the questions\n How do we keep from going through adult life unconsciously, comfortably entrenched in habit?\n How do we remove ourselves from the foreground of our thoughts and achieve compassion?\nWhile searching for answers to these deceptively simple queries, he offers up comic observations of contemporary American life and probes the deepest fundamentals in human nature. In so doing, he reveals the most basic, most important decision we all make every day - how to think about our world.\nDelivered as a commencement address in 2005 and discussed widely in the wake of his death, This Is Water is a concise legacy of one of the great writers of our time. Written with David Foster Wallace\\'s one-of-a-kind blend of casual humor, exacting intellect, and practical philosophy, This Is Water probes the challenges of daily living and offers advice that renews us with every reading.","torrent":{"xt":"urn:btih:dda808656aecf3da8bf13b6a5f3bcb8f4a9b2cf8","amp;dn":"This+Is+Water+-+David+Foster+Wallace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda808656aecf3da8bf13b6a5f3bcb8f4a9b2cf8","infoHashBuffer":{"type":"Buffer","data":[221,168,8,101,106,236,243,218,139,241,59,106,95,59,203,143,74,155,44,248]},"announce":[],"urlList":[]}}