{"title":"Supernatural Psychic Mysteries: Four Book Boxed Set","uid":13733706,"size":437296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddb2e7caf8d852628ba7771cc032698e95555ca4&amp;dn=Supernatural+Psychic+Mysteries%3A+Four+Book+Boxed+Set&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":1,"time":1457036389,"description":"It's an entertaining, intelligent tale full of suspense and great characters - Kitty Smith, Top 500 Reviewer \r\n\r\nThis is the type of mystery that will keep you captive - Heather G, Top 1000 Reviewer \r\n\r\nThis cozy little mystery has all the turns and twist you could imagine, with just the right amount of paranormal to be fresh, yet still feel tangible and relatable. Our Heroine Misty Sales is smart, ingenious, and flat out funny from the get go! - D. Roberts \r\nThe perfect book to cozy up to - E.A. Gray - Top 1000 Reviewer \r\nI learned lots about some sneaky little poisoning techniques - Emily Lanten \r\n\r\nBoxed set of all four books from the best-selling Misty Sales series.\r\nFun light-hearted cozy mystery, paranormal suspense series.\r\n\r\nA Motive for Murder. Book 1\r\nMisty Sales is a slightly overweight journalist for a paranormal magazine in Australia. While her social life is almost non existent, she does have one skill: while wearing shapewear and with her reading glasses perched on her nose, she can out-research the best of them, especially when her caffeine levels are high. When sent to England to write articles about alchemists of the past, Misty has no sooner arrived than she finds the body of her elderly Aunt, and at once inherits her Aunt's feisty cat, Diva. Misty is suddenly drawn into a web of intrigue, secret societies, and the mystical. What secret of her aunt's gave someone a motive for murder? As time runs out, Misty races to put the pieces together before she becomes the next victim.\r\n\r\n\r\nA Reason for Murder. Book 2\r\nWhat do Voodoo spirit bottles have to do with the ghosts in an Australian touristy village? Plenty, as Misty Sales discovers to her detriment. Morpeth, once an early river port of Australia but now famous for its ghosts, plays host to Misty's latest mystery. Misty Sales, journalist for a paranormal magazine, is back from London, having been made Keeper of a Society about which she knows nothing. Her caffeine habit is out of control, as is her job security, and her cat, Diva, is more unpredictable than ever. Even Misty's life is left in the balance, as her Editor sends her to write about the ghosts of Morpeth. In danger, in shapewear, and in debt, Misty matches wits against an unseen enemy. He attacks Misty with natural and unnatural means, while Misty hits back hard with facts.\r\n\r\n\r\nA Basis for Murder. Book 3\r\nIt's Welsh Druids meets an ancient Australian evil in Misty's latest mystery. Misty finds out more about the Society of which she is Keeper - but can she trust the men in her life? Sent to the Australian village of Hillgrove which has a violent history, Misty is marked by an ancient evil to become Hillgrove's latest victim.\r\n\r\n\r\nA Plot for Murder. Book 4\r\nSkinny, Misty’s unpleasant boss, sends Misty and Melissa to investigate the disappearance of government lawyer, Lucas Wallace, from a famous Australian hotel. When Misty arrives, she discovers some clues that will lead her to the truth about the Keepership. As Jamie and Douglas arrive on the scene, Misty sets out to put the pieces of the giant puzzle of her life together. Which man has been feeding her lies and which one has been telling the truth all along? What shocking secret does Misty uncover about Skinny? All is revealed in this, the last book of the series","torrent":{"xt":"urn:btih:ddb2e7caf8d852628ba7771cc032698e95555ca4","amp;dn":"Supernatural+Psychic+Mysteries%3A+Four+Book+Boxed+Set","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddb2e7caf8d852628ba7771cc032698e95555ca4","infoHashBuffer":{"type":"Buffer","data":[221,178,231,202,248,216,82,98,139,167,119,28,192,50,105,142,149,85,92,164]},"announce":[],"urlList":[]}}