{"title":"fdhypno_Hypnodomme_Gigapack","uid":4520487,"size":6619385057,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:de6481bb8941d747f335a2ef1d87ebba1cef3809&amp;dn=fdhypno_Hypnodomme_Gigapack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sspiff9913","files":241,"time":1227140090,"description":"Hypnodomme hypnofetish erotic hypnosis hypnotic FDHYPNO femdom\n\nThis torrent, the &quot;Hypnodomme Gigapack&quot; is a TPB re-uploading of a\ntorrent I have been seeding (as sspiff9912) onfor a\ncouple of months now.  People have posted some of the files from\nit to The Pirate Bay (thanks folks!) and there seems to be some\ninterest, so I thought I would just seed the whole thing (I will\ncontinue to seed it on Empornium as well).\n\nRemember that on The Pirate Bay, you can always see what files are in a\ntorrent by clicking on the number after the &quot;Files:&quot; line in the header.\n\nThe Empornium version is at \n\n\n\nBelow are the posting notes I used there:\n\n\n------------------------------END TBP INTRO---------------------------------\n\nThis torrent, the &quot;Hypnodomme Gigapack&quot; is a follow-up to two of\nmy previous torrents:\n\n&quot;Hypnodomme Superpack&quot;\n\nand\n\n&quot;Hypnodomme Minipack&quot;\n\nIf you enjoyed those torrents (which are still seeded and active\nthough the sucky Empornium search function sometimes loses them),\nyou will likely enjoy this one as well.\n\nI have tried to make sure there are no duplications across the three\ntorrents, but given that the various files get renamed all the time\n(especially with mongo-descriptive names on Emule..), and the fact\nthat there are now so many files to check, I cannot guarantee that\nthere are no duplicates. However I feel safe in saying there is\nno massive duplication. Furthermore, trying to avoid duplication\nleads at times to some inconvienience and odd situations. For\ninstance, many hypnodommes have recordings which form a series and\nare meant to be listened to in order. If when I created the\n&quot;Hypnodomme Superpack&quot;, I had only found files 1, 5 &amp; 7 of a series,\nthat&amp;#039;s what went in. If I later found files 2, 3 &amp; 6, then those\nwent into the Minipack, and if I finally found file 4, then it would\ngo in this torrent. If you want to assemble series from across all\nmy torrents and post them as complete entities -- go for it!\n\nI am especially happy this time to be able to offer files from three\nnew dommes: Mistress Joanne, Mistress Candice and Mistress Marisa.\nPlese check out these ladies. I think Mistress Joanne is especially\ngood, though it is often the power of her voice and scenarios rather\nthan the perfections of her recording techniques that carry the day.\nIn addition, I have a significant number of additional files from Isabella\nValentine and Mz Dominica, both giants in the field and for the first\ntime, files from the pioneering (though now sadly departed) hypnodomme\nSoforia.\n\nAre these files safe? Well, as always when dealing with the\nhuman mind, there is no guarantee. Certainly if you have a\nhistory of mental illness, you should probably approach anything\nthat might alter your mental state with great caution. Remember\nhowever that no hypnotist can make you do anything you do not\nwant to do. You are always free to reject any suggestion a\nhypnotist may make. I will say that there are some things\nthat you may want to do at some level which normally you\ndo NOT do because they are not in your best interest. I\nthink it is possible a hypnotist could tip your judgement\nin the case of an ill-advised thing you may have some\nhidden desire to try. In any case, since having to\nreject a suggestion kind of spoils a trance, I suggest\nyou audit any files you are suspicious of by skipping\nthe induction (the introductory part which takes you into\ntrance) and playing parts of the middle and the end (where\nany post-hypnotic suggestions will be) to make sure there\nis nothing you will have to reject. (I would be especially\nsuspicous of any files from Mz Dominica!)\n\nAlso, recall that hypnosis is not magic. A stage hypnotist gets\n&quot;instant&quot; results since [s]he is trained to pick the half-dozen\nmost gung-ho subjects from an audience of hundreds. In most cases,\nsince you are probably not one of those half-dozen, you will have\nto play a session many times to get the full effect. The dommes\nwill often make scary and extravagent claims for their files. Some\nof this is pure showmanship, but some of it is the fact that it\nreally will work better if you believe it will work.\n\nThis torrent contains the the indicated number of files from\nthe following dommes (or hypnotists):\n\n\n27 mistress_joanne\n\n27 isabella_valentine\n\n20 wendi_friesen\n\n16 soforia\n\n16 mzdominica\n\n15 goddess_deseree\n\n13 mistress_marisa\n\n11 mistress_cat\n\n8 mistress_candice\n\n8 lady_jenifahr\n\n6 miss_drew\n\n4 queen_passionate\n\n4 mistress_seductra\n\n4 goddess_kiss_of_darkness\n\n3 mistress_of_hypnosis\n\n2 lady_izzabelle\n\n2 goddess_marquesa\n\n2 doctor_olivia\n\n1 princess_porsche\n\n1 princess_katana\n\n1 mona_blu\n\n1 mistress_shona\n\n1 mistress_lycia\n\n1 madam_desire\n\n1 leigha\n\n1 lady_novastarr\n\n1 lady_julia\n\n1 krystal_mesmer\n\n1 joslin\n\n1 inamorata\n\n1 hypnotic_arianna\n\n1 hypnogoddess_dreamsender\n\n1 enchantress_sapphire\n\n1 enchantress_allannah_rivers\n\n1 cara\n\n\nThere are a number of boards and sites serving the hypnofetish\ncommunity. Here are three that may be of interest:\n &lt;a href=&quot;\nhttp://www.hypnoladies.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hypnoladies.com&lt;/a&gt;\n\nPerpetually under construction, but a one stop\nsite to get links to almost any domme&amp;#039;s site.\nAlso monthly features profiling a different\nhypnodomme or stage hypnotist.\n &lt;a href=&quot;\nhttp://www.inraptured.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.inraptured.com&lt;/a&gt;\n\nThe Inraptured discussion forum. This is run by\nIsabella Valentine, and a number of the dommes\nand their customers hang out there. It can be\ninteresting, but remember it is not impartial.\n &lt;a href=&quot;\nhttp://www.warpmymind.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.warpmymind.com&lt;/a&gt;\n\nFrankly this site is largely BS with a large number\nof files promising things that hypnosis can&amp;#039;t actually\ndo, but there is the occasional gem in the dross.\n\nAlmost all of the files in this torrent are for men, but there are\na few for women or that can be enjoyed by either gender. I recommend\nmen or women check out Isabella Valentine&amp;#039;s &quot;Jackpot No Hands&quot; file\nfor a hands free orgasm, or her &quot;Zero Gravity&quot; file for a long spacy\ntrip. Women can check out the hypnotic orgasm files from Wendi\nFriesen (who is not a domme, but a theraputic hypnotist)\n\nMy personal suggestion for this torrent is that you start\nwith Mistress Joanne&amp;#039;s &quot;Basic Seduction&quot; file and then check\nout some of her other sessions.\n\nEnjoy!\n","torrent":{"xt":"urn:btih:de6481bb8941d747f335a2ef1d87ebba1cef3809","amp;dn":"fdhypno_Hypnodomme_Gigapack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de6481bb8941d747f335a2ef1d87ebba1cef3809","infoHashBuffer":{"type":"Buffer","data":[222,100,129,187,137,65,215,71,243,53,162,239,29,135,235,186,28,239,56,9]},"announce":[],"urlList":[]}}