{"title":"Lost treasures of Europe - A Pictorial Record, 427 Photographs (","uid":11276375,"size":55243471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de85f58f18452c06eb4cbd8e929b52f4a1f38934&amp;dn=Lost+treasures+of+Europe+-+A+Pictorial+Record%2C+427+Photographs+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1414159095,"description":"pdf / English / 1946 by Henry La Farge / 400 pages / 52.6 MB\n\nThis is the first comprehensive survey of the great cultural monuments of Europe which were either partially or totally destroyed in World War II. Cathedrals and churches, castles, ancient halftimbered houses and mediaeval streets, proud city halls, sumptuous Renaissance and baroque palaces, famous bridges, as well as individual works of art are included in this record. The book is of great significance for those who have lived or travelled in Europe; it is equally important for those who hove never seen these things forever gone.\n\nThe very fact that these monuments had survived the elements of time is witness of the degree to which they were treasured and preserved through the ages. Every one of these great structures stood as the intrinsic expression of some vital steppingstone in the mysterious unfolding of our civilization. In these very forms are concentrated the collective energies of a particular milieu, in them revealed its highest aspirations. To us they are the permanent image of great ideals and the sounding board of our own aspirations.\n\nPoland, Holland, Belgium, Russia, England, Italy, France, Germany, Austria and Hungary are the countries represented. In order to make a valid and permanent record, photographs of the highest quality and excellence available have been used. They were secured from scores of sources both here and abroad, in many cases under the greatest difficulties. A descriptive commentary, which is related to the plates by number, furnishes pertinent information regarding the significance of each monument","torrent":{"xt":"urn:btih:de85f58f18452c06eb4cbd8e929b52f4a1f38934","amp;dn":"Lost+treasures+of+Europe+-+A+Pictorial+Record%2C+427+Photographs+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de85f58f18452c06eb4cbd8e929b52f4a1f38934","infoHashBuffer":{"type":"Buffer","data":[222,133,245,143,24,69,44,6,235,76,189,142,146,155,82,244,161,243,137,52]},"announce":[],"urlList":[]}}