{"title":"Superman - Last Son Story-Arc","uid":5371479,"size":157821859,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:de8a3bc86817148cf9a635e2514b76c25454e25a&amp;dn=Superman+-+Last+Son+Story-Arc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ParrowJack","files":-1,"time":1266436748,"description":"&quot;Last Son&quot; is a comic book story-arc featuring Superman in the monthly Action Comics. It is written by Geoff Johns and Richard Donner, the director of the well-known 1978 film Superman: The Movie and a portion of Superman II, with pencils by Adam Kubert.\n\nThe story revolves around a rocket landing in Metropolis containing a boy Superman thinks is from Krypton and kicks off a war between Superman, the DCU, the new Superman Revenge Squad and General Zod! The story introduced the original character, Christopher Kent and adapts the classic Superman film villains, General Zod, Ursa and Non into the regular DC Universe continuity.\n\nThe arc's first three parts were published in Action Comics #844 through #846. The next parts were delayed to give Kubert sufficient recovery time from health problems he did not wish to disclose. Because of this, the fourth part was delayed and released with issue #851. The eleventh annual of Action Comics, released in May 2008, completed the storyline. Because the better part of 19 months passed between the publication of the first part and the final installment of the story, much criticism has been centered on the creative team and DC Comics in general.\n\n\nTracked by http://comicpirates.info\n","torrent":{"xt":"urn:btih:de8a3bc86817148cf9a635e2514b76c25454e25a","amp;dn":"Superman+-+Last+Son+Story-Arc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de8a3bc86817148cf9a635e2514b76c25454e25a","infoHashBuffer":{"type":"Buffer","data":[222,138,59,200,104,23,20,140,249,166,53,226,81,75,118,194,84,84,226,90]},"announce":[],"urlList":[]}}