{"title":"CHARLES DICKENS A CHRISTMAS CAROL [AUDIO BOOK]","uid":7256107,"size":88119320,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:df68bd937f1d85d96b764924213233e0c7bb9520&amp;dn=CHARLES+DICKENS+A+CHRISTMAS+CAROL+%5BAUDIO+BOOK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"uk_spuddybuddy","files":1,"time":1336589957,"description":"this is a public domain recording and free to use for educational purposes\nA Christmas Carol is a novella by English author Charles Dickens first published by Chapman &amp; Hall on 19 December 1843. The story tells of sour and stingy Ebenezer Scrooge's ideological, ethical, and emotional transformation after the supernatural visits of Jacob Marley and the Ghosts of Christmas Past, Present, and Yet to Come. The novella met with instant success and critical acclaim.\n\nThe book was written and published in early Victorian era Britain when it was experiencing a nostalgic interest in its forgotten Christmas traditions, and at the time when new customs such as the Christmas tree and greeting cards were being introduced. Dickens' sources for the tale appear to be many and varied but are principally the humiliating experiences of his childhood, his sympathy for the poor, and various Christmas stories and fairy tales.[1][2][3]\n\nThe tale has been viewed by critics as an indictment of 19th-century industrial capitalism.[4][5] It has been credited with restoring the holiday to one of merriment and festivity in Britain and America after a period of sobriety and sombreness. A Christmas Carol remains popular, has never been out of print,[3] and has been adapted to film, stage, opera, and other media.\n\n","torrent":{"xt":"urn:btih:df68bd937f1d85d96b764924213233e0c7bb9520","amp;dn":"CHARLES+DICKENS+A+CHRISTMAS+CAROL+%5BAUDIO+BOOK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df68bd937f1d85d96b764924213233e0c7bb9520","infoHashBuffer":{"type":"Buffer","data":[223,104,189,147,127,29,133,217,107,118,73,36,33,50,51,224,199,187,149,32]},"announce":[],"urlList":[]}}