{"title":"Drafted  [Graphic Novel] + One Hundred Days","uid":8575563,"size":221206364,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:df907028c883ec8bd5a4334d6d63c4b7ce1e0d43&amp;dn=Drafted++%5BGraphic+Novel%5D+%2B+One+Hundred+Days&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"RobbieDee","files":-1,"time":1371262967,"description":"- Contains both Drafted - The Essential Edition, Drafted - One Hundred Days AND the 99c preview! Published by Desperado Publishing!\n\n**I dont own or take credit for any of the content contained in this torrent, all credit goes to the creator(s) of the comic.**\n\n\nDrafted - The Essential Edition description:\n\nA celestial race appears out of nowhere, drafting humanity into a galactic war. In an instant, the world is changed forever. Forcibly removed from their old lives and placed into battalions in which ethnicity, status, and gender have no meaning-and facing the common threat of extinction-the human race must unite as never before. Gabriel Contreras, a convenience store clerk, is placed in a unit that includes the former President of the United States. As he and his fellow soldiers struggle with their own emotional demons, they are thrust to the forefront of Earth's defense against a terrifying enemy: the World-Eaters-a species of colossal, predatory worms who exist only to consume and destroy. After pursuing man's benefactors across space, they have come to Earth in massive numbers. And they hunger...\n\n\nDrafted - One Hundred Days description:\n\nHumanity has repulsed the first wave of alien invaders-but the battle has left much of America in shambles. As the coldest winter in a century assaults the starving, shell-shocked populace, it falls to a former U.S. Senator to rally a small construction unit in the frozen, haunted remains of Chicago. A man whose own destiny has been changed by the war: Barack Hussein Obama...\t","torrent":{"xt":"urn:btih:df907028c883ec8bd5a4334d6d63c4b7ce1e0d43","amp;dn":"Drafted++%5BGraphic+Novel%5D+%2B+One+Hundred+Days","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df907028c883ec8bd5a4334d6d63c4b7ce1e0d43","infoHashBuffer":{"type":"Buffer","data":[223,144,112,40,200,131,236,139,213,164,51,77,109,99,196,183,206,30,13,67]},"announce":[],"urlList":[]}}