{"title":"The Sword and the Dragon -M. R. Mathias (Wardstone Trilogy)","uid":6565915,"size":636236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e00c35541c83b619437ebc522ecb1e2050573b7e&amp;dn=The+Sword+and+the+Dragon+-M.+R.+Mathias+%28Wardstone+Trilogy%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Dax58","files":4,"time":1311680065,"description":"The Sword and the Dragon by M. R. Mathias\nRecently finished this book and it was great! Can't say the same for the Author's site :P \n\n[plot]\nWhen the Royal Wizard of Westland poisons the king so that his puppet prince can take the throne and start a continental war, a young squire is forced to run for his life carrying the powerful sword that his dying monarch burdened him with from the death bed.\n\n\nTwo brothers find a magic ring and start on paths to becoming the most powerful sort of enemies, while an evil young sorceress unwillingly falls in love with one of them when he agrees to help her steal a dragon's egg for her father. Her father just happens to be the Royal Wizard, and despite his daughter's feelings, he would love nothing more than to sacrifice the boy! \n\n\nAll of these characters, along with the Wolf King of Wildermont, the Lion Lord of Westland, and a magical hawk named Talon, are on a collision course toward Willa the Witch Queen's palace in the distant kingdom of Highwander. There the very bedrock is formed of the powerful magical substance called Wardstone. \n\n\nWho are the heroes? And will they get there before the Royal Wizard and his evil hordes do? \n\n\nWhatever happens, the journey will be spectacular, and the confrontation will be cataclysmic.","torrent":{"xt":"urn:btih:e00c35541c83b619437ebc522ecb1e2050573b7e","amp;dn":"The+Sword+and+the+Dragon+-M.+R.+Mathias+%28Wardstone+Trilogy%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e00c35541c83b619437ebc522ecb1e2050573b7e","infoHashBuffer":{"type":"Buffer","data":[224,12,53,84,28,131,182,25,67,126,188,82,46,203,30,32,80,87,59,126]},"announce":[],"urlList":[]}}