{"title":"[PSP] Motor Storm: Arctic edge~~(TIMETHIEF)","uid":7184968,"size":870807552,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e0a3bdd7ec94db4bf90804bd4b5003e52f1763dd&amp;dn=%5BPSP%5D+Motor+Storm%3A+Arctic+edge%7E%7E%28TIMETHIEF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TIMETHIEF","files":-1,"time":1334397657,"description":"MotorStorm: Arctic Edge (MotorStorm Raging Ice in Japan) is the third entry in the MotorStorm series of video games, developed by Bigbig Studios.\n\nGameplay\n\nA still from one of the MotorStorm: Arctic Edge trailers showing a rally car, one of the driveable vehicles in the game.\nThe game once again moves away from the desert environments of the original title and the lush island environment of the sequel and relocates itself to the harsh Arctic climate of Alaska on the edge of the Arctic Circle. Gameplay is similar to that of previous titles in the series such as Nitrous Boosts, environmental hazards and destructible environments. Unlike the previous titles in the series, the game will only feature up to a maximum of ten racers in each race.\nNew hazards include avalanches, which can be triggered by vehicle explosion or blowing the vehicle's horn, which causes a large amount of snow to rumble down the track and will strike away opponents, including the player, no matter the vehicles' strengths. Icy bridges can also be dangerous for heavy vehicles. While small vehicles can get over ice bridges, heavier vehicles can cause them to disintegrate and break, making the short-cut impossible to cross.\n\nGame modes\n\nThe main gameplay mode of the game is known as the Wreckreation Mode which consists of various game modes such as,\nFree Play, is the classic racing mode in most racing games where players select a track followed by a track and race with computer controlled opponents.\nTime-Attack, is where players are timed as to how long they take to navigate through the curves and turns one lap at the time, on later laps the ghost of the best recorded time by the player can be seen racing alongside the player on the course which allows the player to try and beat his previous set record.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nINSTRUCTIONS:\n\n-Copy the downloaded game in ISO folder of mmc and play!\n\nTESTED ON 6.20 pro b6!\n-----------------------------------------------------------------------------------\n\nCOMMENTS ARE APPRECIATED!\nKEEP SEEDING!","torrent":{"xt":"urn:btih:e0a3bdd7ec94db4bf90804bd4b5003e52f1763dd","amp;dn":"%5BPSP%5D+Motor+Storm%3A+Arctic+edge%7E%7E%28TIMETHIEF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0a3bdd7ec94db4bf90804bd4b5003e52f1763dd","infoHashBuffer":{"type":"Buffer","data":[224,163,189,215,236,148,219,75,249,8,4,189,75,80,3,229,47,23,99,221]},"announce":[],"urlList":[]}}