{"title":"Zen of Steve Jobs [EPUB][Comics] by Caleb Melby [Qwerty80]","uid":7943753,"size":53960416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0cd572a6b3da5181b0b295c1e34fe2e81c0c8a3&amp;dn=Zen+of+Steve+Jobs+%5BEPUB%5D%5BComics%5D+by+Caleb+Melby+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KatQwerty","files":3,"time":1356072102,"description":"An illustrated depiction of Steve Jobs' friendship with Zen Buddhist Kobun Chino Otogawa and the impact it had on Jobs' career\nApple cofounder Steve Jobs (1955-2011) had such an enormous impact on so many people that his life often took on aspects of myth. But much of his success was due to collaboration with designers, engineers and thinkers. The Zen of Steve Jobs tells the story of Jobs' relationship with one such person: Kobun Chino Otogawa.\n\nKobun was a Zen Buddhist priest who emigrated to the U.S. from Japan in the early 1970s. He was an innovator, lacked appreciation for rules and was passionate about art and design. Kobun was to Buddhism as Jobs was to the computer business: a renegade and maverick. It wasn't long before the two became friends--a relationship that was not built to last.\n\nThis graphic book is a reimagining of that friendship. The story moves back and forward in time, from the 1970s to 2011, but centers on the period after Jobs' exile from Apple in 1985 when he took up intensive study with Kobun. Their time together was integral to the big leaps that Apple took later on with its product design and business strategy.\n\nTold using stripped down dialogue and bold calligraphic panels, The Zen of Steve Jobs explores how Jobs might have honed his design aesthetic via Eastern religion before choosing to identify only what he needs and leave the rest behind.\n","torrent":{"xt":"urn:btih:e0cd572a6b3da5181b0b295c1e34fe2e81c0c8a3","amp;dn":"Zen+of+Steve+Jobs+%5BEPUB%5D%5BComics%5D+by+Caleb+Melby+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0cd572a6b3da5181b0b295c1e34fe2e81c0c8a3","infoHashBuffer":{"type":"Buffer","data":[224,205,87,42,107,61,165,24,27,11,41,92,30,52,254,46,129,192,200,163]},"announce":[],"urlList":[]}}