{"title":"Human Sacrifice in Ancient Greece","uid":11732543,"size":2802592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e19edfe50b2d4fa15243dca9d833117f79ae4a2d&amp;dn=Human+Sacrifice+in+Ancient+Greece&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425431331,"description":"Numerous ancient texts describe human sacrifices and other forms of ritual killing: in 480 BC Themistocles sacrifices three Persian captives to Dionysus; human scapegoats called pharmakoi are expelled yearly from Greek cities, and according to some authors they are killed; Locrin girls are hunted down and slain by the Trojans; on Mt Lykaion children are sacrificed and consumed by the worshippers; and many other texts report human sacrifices performed regularly in the cult of the gods or during emergencies such as war and plague. Archaeologists have frequently proposed human sacrifice as an explanation for their discoveries: from Minoan Crete children's bones with knife-cut marks, the skeleton of a youth lying on a platform with a bronze blade resting on his chest, skeletons, sometimes bound, in the dromoi of Mycenaean and Cypriot chamber tombs; and dual man-woman burials, where it is suggested that the woman was slain or took her own life at the man's funeral. If the archaeologists' interpretations and the claims in the ancient sources are accepted, they present a bloody and violent picture of the religious life of the ancient Greeks, from the Bronze Age well into historical times. But the author expresses caution. In many cases alternative, if less sensational, explanations of the archaeological are possible; and it can often be shown that human sacrifices in the literary texts are mythical or that late authors confused mythical details with actual practices.Whether the evidence is accepted or not, this study offers a fascinating glimpse into the religious thought of the ancient Greeks and into changing modern conceptions of their religious behaviour","torrent":{"xt":"urn:btih:e19edfe50b2d4fa15243dca9d833117f79ae4a2d","amp;dn":"Human+Sacrifice+in+Ancient+Greece","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e19edfe50b2d4fa15243dca9d833117f79ae4a2d","infoHashBuffer":{"type":"Buffer","data":[225,158,223,229,11,45,79,161,82,67,220,169,216,51,17,127,121,174,74,45]},"announce":[],"urlList":[]}}