{"title":"Will Gompertz - 150 Years of Modern Art (2013)","uid":9248562,"size":24437796,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e280193779cb2f575a6de11e0803b13b6cf05c22&amp;dn=Will+Gompertz+-+150+Years+of+Modern+Art+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"workerbee","files":-1,"time":1385421391,"description":"\nWill Gompertz - What Are You Looking At?: The Surprising, Shocking, and Sometimes Strange Story of 150 Years of Modern Art (Plume, 2013).\n\nISBN: 9780142180297 | 464 pages | EPUB\n\n\nWhat is modern art?  Why do we either love it or loathe it?  And why is it worth so much damn money?  Every year, millions of museum and gallery visitors ponder the modern art on display and secretly ask themselves these questions.  A former director at London's Tate Gallery and now the BBC arts editor, Will Gompertz made it his mission to bring modern art's exciting history alive for everyone, explaining why an unmade bed or a pickled shark can be art -- and why a five-year-old couldn't really do it.\nÂ \nRich with extraordinary tales and anecdotes, WHAT ARE YOU LOOKING AT? entertains as it arms readers with the knowledge to truly understand and enjoy what it is they're looking at.  From Monet's water lilies to Van Gogh's sunflowers, from Warhol's soup cans to Hirst's pickled shark, hear the stories behind the masterpieces, meet the artists as they really were, and discover the real point of modern art.\n\nAbout the author: Will Gompertz is the BBC Arts Editor and probably the world's first art history stand-up comedian.  He was a Director at the Tate Gallery for 7 years.  He has a particular interest in modern art and has written about the arts for The Times and the Guardian for over 20 years.  In 2009, he wrote and performed a sell-out one-man comedy show about modern art at the Edinburgh Festival.  He was recently voted one of the world's top 50 creative thinkers by New York's Creativity Magazine.\n\n\nReviews\n\n&quot;Gompertz has an uncanny knack for making difficult art (and ideas) easy. . .  A lively, witty account of the major moments and movements of the past 150 years.&quot; -- Associated Press\n\n&quot;An insightful love letter to modern art and an irreverent rejection of the notion that its pleasures are reserved for a chosen few.  Each chapter hums with engaging history and entertaining anecdotes, cheeky asides and accessible, illuminating criticism.&quot; -- NPR\n\n&quot;A deeply enlightening and buoyant history of modern art and beyond.&quot; -- Booklist\n\n&quot;[A] highly lucid, lively, and buoyantly composed history.  While his tone is breezy and conversational, Gompertz astutely and often wittily describes the core of every movement and its key artists.&quot; -- Publishers Weekly\n","torrent":{"xt":"urn:btih:e280193779cb2f575a6de11e0803b13b6cf05c22","amp;dn":"Will+Gompertz+-+150+Years+of+Modern+Art+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e280193779cb2f575a6de11e0803b13b6cf05c22","infoHashBuffer":{"type":"Buffer","data":[226,128,25,55,121,203,47,87,90,109,225,30,8,3,177,59,108,240,92,34]},"announce":[],"urlList":[]}}