{"title":"The Settlers III Gold Edition +Patch +Crack","uid":3304266,"size":1229579036,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e2b27a4827a43f3b79c04910053433ecbdac71ea&amp;dn=The+Settlers+III+Gold+Edition+%2BPatch+%2BCrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"X-Dream","files":90,"time":1111352258,"description":"The Settlers III Gold Edition includes the full version The Settlers III, The Settlers III Mission CD, the expansion pack, Quest of the Amazons as well as a slew of Gold Edition extras. There are challenging missions for new Settlers gamers, experienced Settlers gamers and professional Settlers games, too. a button for changing the level of difficulty along with an extensive assortment of tips and tricks is of special interest for newcomers.\n\nFeatures\n\nSingle-player Mode:\n\nMulticultural: Determine the fortunes of 4 Settlers races, each with its unique skills, architectural styles, music and individual god or goddess \nExciting: Play 2 campaigns for each race, all with exciting mission goals \nAwesome: Watch over 200 different figures and thousands of your industrious subjects at work \nMultifaceted: Set out in conquest of 27 single player maps and an abundance of top maps designed by fans; test the waters with the training mission \nDemanding: Let Settlers in 30 different occupations per race get to work for you - woodcutters, bakers, farmers, fishermen and smiths \nLavish: Enjoy the detailed architecture of over 140 buildings including castles, temples, residences and farms \nStrategic: Take skillful action in real-time battles with bowmen, swordsmen, and spearmen that can be individually or collectively controlled. Make use of your pioneers, thieves, geologists and priests full of wonders \nAction-Packed: Transport goods, set off to sea with your Settlers and use destructive instruments of war such as catapults, ballistras and the dreaded &amp;quot;Magic Gong&amp;quot; \nEnjoyable: Settle on tropical islands and lands with mountains, rivers, grasslands, swamps, and deserts - all with spectacular detail \nMoving: Watch lavishly animated films with the background story of The Settlers III \nCreative: Design you own islands and missions with the map editor - with easy-to-use mouse operations \nEasy: Open the comprehensive manual included on the CD, available even when you are playing.\n\nMutliplayer Mode, Online &amp;amp; Internet:\n\nUncomplicated: Join in multiplayer games with friends and co-workers on the LAN or with gamers from all around the world around the clock in the Internet without any gaming charges \nLoaded: Settle 59 multiplayer maps designed for between 2 to 14 players and the most popular maps designed by fans too \nTeam-Oriented: Form teams for games and join a clan \nPeace-Loving: Pursue economic goals in the economic competition mode \nAutomatic: Update your game version simply by logging in on the Settlers server \nCommunicative: Stop by at the Settlers discussion forum in the Internet \n \n\nRequirements:\nMinimum Configuration: 166 MHz Pentium, 32 MB RAM, 2 MB graphic card (DirectX compatible), ca. 150 MB additional free hard disk space, monitor with a resolution of 800 x 600 pixels with 65,000 colors (high color), 4x CD-ROM, Windows 95/98/Me/XP or Windows NT 4.0, DirectX 6.0\n\nRecommended Configuration: 266 MHz Pentium II, 64 MB RAM, soundcard (DirectX compatible), 28.8 modem for internet gaming.\n\nSupports: Local Area Network (LAN), Settlers III Internet Server, TCP/IP and IPX/SPX protocol, Circle Surround, CD-audio","torrent":{"xt":"urn:btih:e2b27a4827a43f3b79c04910053433ecbdac71ea","amp;dn":"The+Settlers+III+Gold+Edition+%2BPatch+%2BCrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b27a4827a43f3b79c04910053433ecbdac71ea","infoHashBuffer":{"type":"Buffer","data":[226,178,122,72,39,164,63,59,121,192,73,16,5,52,51,236,189,172,113,234]},"announce":[],"urlList":[]}}