{"title":"Doctor Who - The Ninth Doctor Collected Comics","uid":4695642,"size":185485471,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e317ca5ac50a785f1b4c290ba9706f4203db2c71&amp;dn=Doctor+Who+-+The+Ninth+Doctor+Collected+Comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Stormson","files":5,"time":1233546474,"description":"Relive the strip of a lifetime, with the new Doctor Who Magazine Collected Comics! \nBased on the smash-hit BBC One series featuring Christopher Eccleston\nand Billie Piper, this collection features five complete comic strip adventures\n from the pages of DWM, charting all-new exploits for the Ninth Doctor and Rose. \n\nJoin them as the TARDIS travels to Shakespeare's England, to Mars in the distant \nfuture, back to Swinging Sixties London and out into space. On the way, the intrepid \nTime Lord and his human companion must face demons from another universe, \ndeadly creatures formed from living water, a nightmare world where all your worst \nimaginings come true and a ghastly alien who wants to kill humanity... with kindness! \n\nCrammed with more than 100 pages of sci-fi adventure, this Special Edition contains \nthe stories The Love Invasion, Art Attack, The Cruel Sea, Mr Nobody and A Groatsworth \nof Wit. \n\nFeaturing stories from Robert Shearman (writer of the TV episode Dalek), Gareth Roberts \n(writer of BBCi's Attack of the Graske), Scott Gray and stunning illustrations from popular \nUK comics artists Mike Collins and John Ross.","torrent":{"xt":"urn:btih:e317ca5ac50a785f1b4c290ba9706f4203db2c71","amp;dn":"Doctor+Who+-+The+Ninth+Doctor+Collected+Comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e317ca5ac50a785f1b4c290ba9706f4203db2c71","infoHashBuffer":{"type":"Buffer","data":[227,23,202,90,197,10,120,95,27,76,41,11,169,112,111,66,3,219,44,113]},"announce":[],"urlList":[]}}