{"title":"Les Miserables  miniserie (2000) 2Lions-Team","uid":5248577,"size":4511096082,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e3200071d3ea5953a6805e26244cf024962745dc&amp;dn=Les+Miserables++miniserie+%282000%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"JUULTJE","files":28,"time":1262246040,"description":"Les Miserables / miniserie (2000)       \n\n\n\nFilminformatie \nVerenigde Staten / Frankrijk / ItaliÃƒÂ« / Spanje / Duitsland\nDrama / Avontuur\n360 minuten (miniserie, 4 delen)\n\ngeregisseerd door JosÃƒÂ©e Dayan\nmet GÃƒÂ©rard Depardieu, John Malkovich en Christian Clavier\n\nFilm over de strijd van een moedig man tegen een maatschappij die de armen veroordeelt. \nZijn strijd is er ÃƒÂ©ÃƒÂ©n vol actie, verdriet, woede, vergiffenis en liefde. \nNadat Valjean 20 jaar in de gevangenis heeft gezeten voor een kleine misgreep, besluit hij een eerlijk leven te gaan leiden.\n\n\nEnglish\n\nThe scene is set during the French Restoration at the beginning of the 19th century. Jean Valjean, a galley slave who was sent to prison for stealing food, is now released after serving nineteen years. At first he only encounter mistrust and closed doors; only the saintly Bishop Bienvenu treats him kindly and takes him in. The bishop's truly Christian compassion and humanity not only restores Jean Valjean's faith in the good, but also smoothes his way back to an orderly life. As Monsieur Madeleine, Valjean is soon a wealthy industrialist and popular citizen, even becoming the mayor of a small provincial town. His good fortune departs, however, when he meets Fantine, one of his workers, an unmarried mother who tragically dies of consumption. The well-intentioned Valjean frees Fantine's illegitimate daughter Cosette from the clutches of her insidious foster parents, and looks after her like a father. When Valjean reveals his true identity in order to prevent an innocent man who closely resembles him from being sold into a life of slavery as a result of a police error, he is convicted yet again. Valjean soon succeeds in escaping yet again, however, and manages to live under a false name in Paris for a few years. When Cosette, now a young lady, falls in love with the young attorney Marius Pontmercy, Valjean forbids the match - because he has fallen in love with the young girl himself... At this point, however, Marius finds out about Valjean's disreputable past and about Valjean's love for her and has no choice but to keep him away from Cosette. Valjean, thinking of his former benefactor Bishop Bienvenu, now makes the ultimate sacrifice - he decides to do without Cosette. A short while later Valjean falls seriously ill, but in the face of death he leaves a message of love to the young couple: &quot;There is only one thing in the world that is important - and that is to love each other.&quot; \n\nTV systeem : PAL\nBeeld : 16:9\nTaal : Engels DD2.0 \nOndertitels : Nederlands (EXTERN)\nMenu : ja (MAKE BY FRIEMKE)\nExtra's : NO\nCover : YES\n\n \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \n\nGenre : Avontuur\nDrama\n \nWeblink : http://www.moviemeter.nl/film/27733\nWeblink : http://www.imdb.com/title/tt0230534\n\n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n       &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n \n\n \n \n \n","torrent":{"xt":"urn:btih:e3200071d3ea5953a6805e26244cf024962745dc","amp;dn":"Les+Miserables++miniserie+%282000%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3200071d3ea5953a6805e26244cf024962745dc","infoHashBuffer":{"type":"Buffer","data":[227,32,0,113,211,234,89,83,166,128,94,38,36,76,240,36,150,39,69,220]},"announce":[],"urlList":[]}}