{"title":"The Amazing Spiderman 2 (Cinavia removed)","uid":10720334,"size":2210484538,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e33da0ba89263fa71bdd6cf9f148340b4bd015b0&amp;dn=The+Amazing+Spiderman+2+%28Cinavia+removed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fantom87","files":-1,"time":1407472265,"description":"Originally uploaded by YIFY, I've taken the liberty of removing the Cinavia copy protection for all to enjoy how they please!\n\nThe web-slingin' wall-crawler hits the screens once again in this follow-up to Marc Webb's 2012 reboot of the series. Andrew Garfield returns as Peter Parker, who squares off against the villainous Electro, played by Jamie Foxx.\n\nAs the film opens, we find Richard (Campbell Scott) and Mary Parker (Embeth Davitz) stealing away with some crucial Oscorp files while leaving young Peter in the care of Aunt May (Sally Field) and Uncle Ben. Flash forward about a decade, and Peter (Garfield) is swinging into action as Spider-Man; having successfully thwarted the hijacking of an Oscorp truck by notorious Russian criminal Aleksei Sytsevich (Paul Giamatti), Peter ditches the costume just in time to meet up with Gwen Stacy (Emma Stone) at their high school graduation. Despite his deep love for Emma, however, Peter remains haunted by his promise to her late father not to get emotionally involved with her for fear that she could be targeted by Spider-Man's enemies.\n\nMeanwhile, young Harry Osborne (Dane DeHaan) inherits OsCorp and a deadly retrovirus from his father Norman (Chris Cooper), and brilliant but timid OsCorp scientist Max Dillon (Jamie Foxx) gets infused with a powerful dose of electricity while attempting to fix a faulty power circuit in the lab. Upon regaining consciousness, Max discovers that he has the power to harness electrical currents - the higher the voltage the more powerful he becomes. When a battle with Max in Times Square shorts out Spidey's web-shooters, Peter goes to work on developing a more reliable model of his signature weapon while Harry grows convinced that Spider-Man's blood is the key to his survival. Later, villainous OsCorp chairman Donald Menken (Colm Feore) steals the company out right out from under Harry, driving the vengeful youth to break Max -- now Electro -- out of the heavily-guarded Ravencroft Institute for a two-pronged attack on Menken and Spider-Man. The stage for that battle is set when New York City goes dark just as Peter declares his love to Gwen, plunging the wise-cracking web-slinger into a fight that could forever alter the course of his life. ","torrent":{"xt":"urn:btih:e33da0ba89263fa71bdd6cf9f148340b4bd015b0","amp;dn":"The+Amazing+Spiderman+2+%28Cinavia+removed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e33da0ba89263fa71bdd6cf9f148340b4bd015b0","infoHashBuffer":{"type":"Buffer","data":[227,61,160,186,137,38,63,167,27,221,108,249,241,72,52,11,75,208,21,176]},"announce":[],"urlList":[]}}