{"title":"Oracle 11g R1 R2 Real Application Clusters Essentials","uid":6492745,"size":14555095,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e41abc8f0dd1bb47122c858d9e5011f7545af9a8&amp;dn=Oracle+11g+R1+R2+Real+Application+Clusters+Essentials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheBookie","files":-1,"time":1308944971,"description":"Oracle 11g R1/R2 Real Application Clusters Essentials By Ben Prusinski, Syed Jaffer Hussain\n\nPublisher: Packt Publishing 2011 | 552 Pages | ISBN: 1849682666 | PDF | 14 MB\n\n\nOracle RAC or Real Application Clusters is a grid computing solution that allows multiple nodes (servers) in a clustered system to mount and open a single database that resides on shared disk storage. Should a single system (node) fail, the database service will still be available on the remaining nodes. Oracle RAC is an integral part of the Oracle database setup. You have one database with multiple users accessing it, in real time. This book will enable DBAs to get their finger on the pulse of the Oracle 11g RAC environment quickly and easily.\nThis book will cover all areas of the Oracle RAC environment and is indispensable if you are an Oracle DBA who is charged with configuring and implementing Oracle11g R1, with bonus R2 information included. This book presents a complete method for the configuration, installation, and design of Oracle 11g RAC, ultimately enabling rapid administration of Oracle 11g RAC environments.\n\nThis practical handbook documents how to administer a complex Oracle 11g RAC environment. Packed with real world examples, expert tips and troubleshooting advice, the book begins by introducing the concept of Oracle RAC and High Availability. It then dives deep into the world of RAC configuration, installation and design, enabling you to support complex RAC environments for real world deployments. Chapters cover Oracle RAC and High Availability, Oracle 11g RAC Architecture, Oracle 11g RAC Installation, Automatic Storage Management, Troubleshooting, Workload Management and much more.\n\nBy following the practical examples in this book, you will learn every concept of the RAC environment and how to successfully support complex Oracle 11g R1 and R2 RAC environments for various deployments within real world situations.\n\nThis book is the updated release of our previous Oracle 11g R1/R2 Real Application Clusters Handbook. If you already own a copy of that Handbook, there is no need to upgrade to this book.\n\nWhat you will learn from this book :\n\nLearn how to administer, implement, and manage Oracle 11g RAC environments for real world deployments\nDiscover the key architectural design and installation techniques required to successfully deploy Oracle 11g RAC\nEffectively manage the complex 11g Clusterware, using key troubleshooting tips and techniques\nSuccessfully implement database creation methods, manage the Oracle RAC database and handle workload in your RAC environment efficiently\nAppropriately plan your backup and recovery strategy\nKnow when and how to upgrade your Oracle RAC environment effectively\nDiscover how to deploy Oracle 11g RAC with complex standard-off-the-shelf systems like Oracle EBS\nUnderstand new key features for Oracle 11g R1/R2 RAC and ASM\n\n\n","torrent":{"xt":"urn:btih:e41abc8f0dd1bb47122c858d9e5011f7545af9a8","amp;dn":"Oracle+11g+R1+R2+Real+Application+Clusters+Essentials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e41abc8f0dd1bb47122c858d9e5011f7545af9a8","infoHashBuffer":{"type":"Buffer","data":[228,26,188,143,13,209,187,71,18,44,133,141,158,80,17,247,84,90,249,168]},"announce":[],"urlList":[]}}