{"title":"Jack McDevitt - Academy Series [Book 1 - 6]","uid":11603760,"size":4130834233,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e471deebfb39aa7ec189f0080370d4b9e24cdc4f&amp;dn=Jack+McDevitt+-+Academy+Series+%5BBook+1+-+6%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Cybotage","files":13,"time":1417386684,"description":"Jack McDevitt - Academy Series [Book 1 - 6]\n\nFormat: MP3\nBitrate: 96 Kbps\nUnabridged\n\nBook 1 - The Engines of God\n\nInfo:\nHumans call them Monument-Makers. An unknown race, they left stunning alien statues scattered on distant planets throughout the galaxy, encoded with strange\n\ninscriptions that defy translation. Searching for clues about the Monument-Makers, teams of 23rd century linguists, historians, engineers and archaeologists have been\n\nexcavating the enigmatic alien ruins on a number of planets, uncovering strange, massive false cities made of solid rock. But their time is running out.\n\nEarth's ravaged environment is quickly making it unlivable, and colonizers want to begin terraforming these abandoned worlds for human habitation. Only interstellar\n\narchaeologist Richard Wald and starship pilot Priscilla Hutchins are convinced that uncovering the secrets of the monuments may hold the key to survival for the entire\n\nhuman race.\n\nBook 2 - Deepsix\n\nInfo:\nIn the year 2204, tragedy and terror forced a scientific team to prematurely evacuate Maleiva III. Nineteen years later, a rogue moon hurtling through space is about\n\nto obliterate the last opportunity to study this rare, life-supporting planet. With less than three weeks left before the disaster, superluminal pilot Priscilla\n\n&quot;Hutch&quot; Hutchins -- the only even remotely qualified professional within light years of the ill-fated planet -- must lead a small scientific team to the surface to\n\nglean whatever they can about its life forms and lost civilizations before time runs out.\n\nBut catastrophe awaits when they are stranded on this strange and complex world of puzzles and impossibilities. And now Hutch and her people must somehow survive on a\n\nhostile world going rapidly mad -- as the clock ticks toward apocalypse for a doomed enigma.\n\nBook 3 - Chindi\n\nInfo:\nThe universe has been explored - and humanity has all but given up on finding other intelligent life. Then an alien satellite orbiting a distant star sends out an\n\nunreadable signal. Is it the final programmed gasp of an ancient, long-dead race? Or the first greeting of an undiscovered life\n\nBook 4 - Omega\n\nInfo:\nA civilization-destroying omega cloud has switched direction, heading straight for a previously unexplored planetary system--and its alien society. And suddenly, a\n\nhandful of brave humans must try to save an entire world--without revealing their existence.\n\nBook 5 - Odyssey\n\nInfo:\nTo boost waning interest in interstellar travel, a mission is sent into deep space to learn the truth about &quot;moonriders,&quot; the strange lights supposedly being seen in\n\nnearby systems. But Academy pilot Valentina Kouros and the team of the starship Salvator will soon discover that their odyssey is no mere public-relations ploy, for\n\nthe moonriders are not a harmless phenomenon. They are very, very dangerous-in a way that no one could possibly have imagined.\n\nBook 6 - Cauldron\n\nInfo:\nThe year is 2255. The academy that trained the starfarers is long gone and veteran star pilot Priscilla &quot;Hutch&quot; Hutchins spends her retirement supporting fund-raising\n\nefforts for The Prometheus Foundation, a privately funded organization devoted to deep space exploration.\n\nBut when a young physicist unveils an efficient star drive capable of reaching the core of the galaxy, Hutch finds herself back in the deepest reaches of space, and on\n\nthe verge of discovering the origins of the deadly Omega clouds that continue to haunt her","torrent":{"xt":"urn:btih:e471deebfb39aa7ec189f0080370d4b9e24cdc4f","amp;dn":"Jack+McDevitt+-+Academy+Series+%5BBook+1+-+6%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e471deebfb39aa7ec189f0080370d4b9e24cdc4f","infoHashBuffer":{"type":"Buffer","data":[228,113,222,235,251,57,170,126,193,137,240,8,3,112,212,185,226,76,220,79]},"announce":[],"urlList":[]}}