{"title":"Jackie McLean - Let Freedom Ring[FLAC - LOSSLESS]","uid":4260443,"size":290373846,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e47f0c84c13e3c5a735bd931481a7f9c8d261733&amp;dn=Jackie+McLean+-+Let+Freedom+Ring%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"99AM","files":11,"time":1214436676,"description":"FLAC files + COVERS\nRelease Date: March 19, 1962\n\n\nTrack Listing\n1. Melody For Melonae\n2. I&amp;#039;ll Keep Loving You\n3. Rene\n4. Omega\n\n\n\nJackie McLean had always been a highly emotional soloist, so it makes sense that he was one of the first hard bop veterans to find a new voice in the burning intensity of jazz&amp;#039;s emerging avant-garde. McLean had previously experimented with Coltrane&amp;#039;s angular modes and scales and Ornette&amp;#039;s concept of chordal freedom, but Let Freedom Ring was the landmark masterpiece where he put everything together and ushered in the era of the modernists at Blue Note. A number of saxophonists were beginning to explore the ability of the instrument to mimic human cries of passion, and here McLean perfected a long, piercing squeal capable of expressing joy, anguish, fury, and more. The music on Let Freedom Ring remained more rooted in hard bop structure than Coleman&amp;#039;s, and McLean was still recognizably himself, but that was precisely what was revolutionary about the album: It validated the avant-garde aesthetic, demonstrating that it had enough value to convert members of the old guard, and wasn&amp;#039;t just the province of radical outcasts. There are only four pieces, one of which is the surging Bud Powell ballad &quot;I&amp;#039;ll Keep Loving You&quot;; the other three are McLean originals (&quot;Melody for Melonae,&quot; &quot;Rene,&quot; and &quot;Omega,&quot; dedicated to his daughter, son, and mother respectively) that spotlight his tremendous inventiveness on extended material and amaze with a smoldering fire that never lets up. Pianist Walter Davis takes the occasional solo, but the record is McLean&amp;#039;s statement of purpose, and he accordingly dominates the proceedings, with the busy, free-flowing dialogues of bassist Herbie Lewis and Ornette drummer Billy Higgins pushing him to even greater heights. The success of Let Freedom Ring paved the way for a bumper crop of other modernist innovators to join the Blue Note roster and, artistically, it still stands with One Step Beyond as McLean&amp;#039;s greatest work.\n\n(Review from All Music Guide)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:e47f0c84c13e3c5a735bd931481a7f9c8d261733","amp;dn":"Jackie+McLean+-+Let+Freedom+Ring%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e47f0c84c13e3c5a735bd931481a7f9c8d261733","infoHashBuffer":{"type":"Buffer","data":[228,127,12,132,193,62,60,90,115,91,217,49,72,26,127,156,141,38,23,51]},"announce":[],"urlList":[]}}