{"title":"The YogaFit Athlete (gnv64)","uid":14334291,"size":45026288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e538df917a22197ca992d1667a5ee76b2dc663cc&amp;dn=The+YogaFit+Athlete+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":5,"time":1460695841,"description":"The YogaFit Athlete: Up Your Game with Sport-Specific Poses to Build Strength, Flexibility, and Balance\r\nby Beth Shaw\r\nBallantine Books | April 2016 | ISBN-10: 0804178577 | ePUB | 42.6 mb\r\n\r\nBring the strength and breathing power of yoga to the sports you love—and seriously up your game!\r\nYoga routines designed specifically for swimming, running, cycling, golf, tennis, baseball, football, volleyball, basketball, skiing, snowboarding, weight lifting, kickboxing, boxing, CrossFit, and more!\r\nWhether you’re a professional athlete, a weekend warrior, or a pick-up game enthusiast, yoga can dramatically affect your athletic performance and improve your alignment, balance, core stability, strength, flexibility, agility, endurance, lung capacity, and mobility. In this motivating and practical guide, celebrated fitness expert Beth Shaw provides short, sport-specific yoga routines designed to help counter tight muscles, overuse injuries, and musculature imbalances. By adding a quick yoga routine to any workout, you will increase your overall strength and health, and achieve your personal best.\r\n\r\nInside you’ll find\r\n• fully illustrated, sport-specific yoga routines that engage the core, enhance your play, and reduce the risk of injury\r\n• essential warm-up and cool-down movements to complement any athletic endeavor\r\n• simple breathing exercises to steady your breath and calm your nerves during competition\r\n• meditation techniques to help clear your mind and bring laser focus to your goals\r\n• guided imagery and visualization exercises to improve performance\r\n• strategies for coaching yourself and others\r\n\r\nAbout the Author\r\nBeth Shaw is the president and founder of the world-renowned YogaFit® training systems, the largest yoga school in the world, as well as the author of YogaLean and Beth Shaw’s YogaFit and the creator of more than a hundred bestselling yoga and fitness DVDs and CDs. Shaw works with the NFL as well as many sports teams and athletes. A sought-after international presenter, Shaw travels the world spreading the message of health and wellness. She lives in Los Angeles, California.\r\n\r\nCONTENTS\r\nCover\r\nTitle Page\r\nCopyright\r\nINTRODUCTION\r\nThe Underpinnings of Yoga\r\n1.THE FUNDAMENTALS OF THE YOGAFIT APPROACH\r\nCHAPTER 1. GAINING PHYSICAL AND MENTAL STRENGTH THROUGH YOGAFIT\r\nCHAPTER 2. GETTING READY FOR YOGA\r\n2.THE POSES\r\n3.KEY COMPONENTS OF SPORTS SUCCESS: CORE AND BALANCE, RESTORATIVE YOGA, AND WEIGHT TRAINING\r\n4.BREATH\r\n5.VISUALIZATION, GUIDED IMAGERY, AND MEDITATION\r\nDEDICATION\r\nACKNOWLEDGMENTS\r\nOther Titles By Beth Shaw\r\nAbout the Author\r\n \nhttps://s22.postimg.org/z4mq3prip/The+YogaFit+Athlete.jpg","torrent":{"xt":"urn:btih:e538df917a22197ca992d1667a5ee76b2dc663cc","amp;dn":"The+YogaFit+Athlete+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e538df917a22197ca992d1667a5ee76b2dc663cc","infoHashBuffer":{"type":"Buffer","data":[229,56,223,145,122,34,25,124,169,146,209,102,122,94,231,107,45,198,99,204]},"announce":[],"urlList":[]}}