{"title":"Drugs Collection - Alcohol - BBC Horizon - Do I drink too much","uid":7466329,"size":3126554624,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e5a7ab764335ad293c44635e1a15f9928a5a2c03&amp;dn=Drugs+Collection+-+Alcohol+-+BBC+Horizon+-+Do+I+drink+too+much&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"GRNS3","files":-1,"time":1343005340,"description":"\n\nThe Drugs Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nBBC Horizon - Alcohol - Do I Drink Too Much?\n\nAlcohol is by far the most widely used drug - and a dangerous one at that. So why are so many of us drinking over the recommended limits?\n\nWhy does alcohol have such a powerful grip on us? How much of our relationship with this drug is written in our genes? What are the real dangers of our children drinking too young?\n\nAddiction expert John Marsden, who likes a drink, makes a professional and personal exploration of our relationship with alcohol. He undergoes physical and neurological examinations to determine its impact, and finds out why some people will find it much harder than others to resist alcohol. Even at the age of 14 there may be a way of determining which healthy children will turn into addicts.\n\nJohn experiments with a designer drug being developed that hopes to replicate all the benefits of alcohol without the dangers. Could this drug replace alcohol in the future? \n\n\nCheck this account for updates regularly :)\n\nThanks to the peers all over the globe seeding in this collection.\n\n\t\t","torrent":{"xt":"urn:btih:e5a7ab764335ad293c44635e1a15f9928a5a2c03","amp;dn":"Drugs+Collection+-+Alcohol+-+BBC+Horizon+-+Do+I+drink+too+much","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a7ab764335ad293c44635e1a15f9928a5a2c03","infoHashBuffer":{"type":"Buffer","data":[229,167,171,118,67,53,173,41,60,68,99,94,26,21,249,146,138,90,44,3]},"announce":[],"urlList":[]}}