{"title":"Homegrown Pure and Simple by Michel Nischan","uid":9666344,"size":22983588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5b2be2c8f831c8fd6a2bab99fb8309999e2354f&amp;dn=Homegrown+Pure+and+Simple+by+Michel+Nischan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1393380107,"description":"\nIn this follow-up to Taste Pure and Simple winner of the James Beard Cookbook Award Michel Nischan takes his philosophy of healthy cooking from garden to kitchen. Inspired to provide his growing family with meals as full of flavor as those he'd enjoyed at his mother's table, Michel planted a garden of his own. \n\nThe result was a delicious array of recipes based on the best the gardener, if you're not that fortunate, the organic produce in the farmers' market or grocery store has to offer. \n\nSweet tomatoes and bitter lettuces, peppery radishes and succulent strawberries these are but a handful of fruits, herbs, and vegetables that, served alone or combined with quality meats and poultry, ripened cheeses, or whole grains, inspired these 80 seasonal recipes, each one as good for the body as it is for the palate. \n\nIncluding a superb chapter on extending the harvest, full of fruit preserves and jams, pickled vegetables, sauces, salsas, flavored oils, spice mixes, and even a few refreshing drinks, Homegrown Pure and Simple is a book that not only conveys the sheer joy of feeding family and friends well, but also takes healthy cooking to an exciting and delicious new level.\n\nGenre: Non-Fiction, Cookery","torrent":{"xt":"urn:btih:e5b2be2c8f831c8fd6a2bab99fb8309999e2354f","amp;dn":"Homegrown+Pure+and+Simple+by+Michel+Nischan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b2be2c8f831c8fd6a2bab99fb8309999e2354f","infoHashBuffer":{"type":"Buffer","data":[229,178,190,44,143,131,28,143,214,162,186,185,159,184,48,153,153,226,53,79]},"announce":[],"urlList":[]}}