{"title":"Leon Degrelle - The Epic Story of the Waffen SS","uid":6622780,"size":674404550,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5c2f00fb3523d98476b84dadae4cbb5d1a8a5ec&amp;dn=Leon+Degrelle+-+The+Epic+Story+of+the+Waffen+SS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Borzoi","files":1,"time":1314058676,"description":"\nLeon Degrelle (born June 15th 1906, died March 31 1994) was a Walloon Belgian politician, who founded Rexism and later joined the Waffen SS which were front-line troops in the fight against the Soviet Union AND Communism.\n\nThis is a self-spoken biography (with an introduction by his sister).  He was one of many, who wished and believed that they could make a better Europe and struggled mightily to that end.  Whatever one's political outlook.., one cannot doubt the courage and conviction of Degrelle or the men that he led.  That he survived so much carnage and the vengeance of his enemies at the end is remarkable.  That he then went on to produce such a memorable account of his experiences we should be thankful for.  It was an epic struggle by any standards...\n\nWhen Degrelle joined the Wehrmacht he was offered the rank of lieutenant, but he refused and he went into Russian campaign as an ordinary private.  He points out that Waffen-SS was really a front-line unit and a respected fighting force.  Also, that 98% were NOT professional soldiers, or just young men after adventure, or NOT the goose-stepping &quot;half-mad&quot; stereotypes of Hollywood.  Most of the volunteer units had a tragic end as they would rather fight to the last man instead of being handed over to their vengeful countrymen.  The Waffen-SS had an estimate of 150-250 000 European (non-German) volunteers who fought with honor on the eastern front, and many of them winning the highest medal for bravery in the German armed forces, the Knights Cross.\n\nThis eye opening historical video is a daring break from the all the typical &quot;anti-German&quot; videos and publications as it tries to show the real untold truth about the Axis dealings with foreigners, volunteers, minorities, helpers and other diverse international relations.  He does quite well at telling the untold, unpopular AND startling truths of the real perspectives AND relations of Germans AND non-Germans during WWII.  Unlike Hollywood AND the general media that just LOVES to project an inaccurate historical &quot;pseudo truth&quot; !!\n\nThis speech examines AND relates the real unclouded facts tainted by the &quot;fantasy history entertainment&quot; that is so popular today...  Some people actually really believe that going to the movies AND reading books by those who won the war, etc.., is a history course made easy, simple AND fun !!\n\nYes.., and very sad to say.., &quot;the beat goes on&quot; (and on, and on).., as WW III will NOT be that much different from the first two that killed millions.., or that far off in the future !!\n\n\nThis documentary 82 minutes long with a quality of  A8 / V8, as it was made from an old VHS cassette tape.\n\nAs always.., after watching.., do your best to &quot;pass it on&quot;...\n\n\n&quot;Truth Does Not Fear Investigation&quot;\n\n&quot;He who Wins the War.., also Writes the History&quot;\n\n&quot;The Truth shall make you Free.., but at first.., it'll make you Damn Mad&quot; !!!\n\n","torrent":{"xt":"urn:btih:e5c2f00fb3523d98476b84dadae4cbb5d1a8a5ec","amp;dn":"Leon+Degrelle+-+The+Epic+Story+of+the+Waffen+SS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5c2f00fb3523d98476b84dadae4cbb5d1a8a5ec","infoHashBuffer":{"type":"Buffer","data":[229,194,240,15,179,82,61,152,71,107,132,218,218,228,203,181,209,168,165,236]},"announce":[],"urlList":[]}}