{"title":"Foyle's War S1E1(2002)[NL subs][NLtoppers][TVSerieSpot]","uid":7465006,"size":1634038453,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e6c62a8da979f37db90bb1569a0e62f2301c81a7&amp;dn=Foyle%27s+War+S1E1%282002%29%5BNL+subs%5D%5BNLtoppers%5D%5BTVSerieSpot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"chamond42","files":-1,"time":1342965697,"description":"Foyle's War S1E1(2002)[NL subs][NLtoppers][TVSerieSpot]\n\nIMDb rating: 8,5\nreviews: http://www.imdb.com/title/tt0310455/\nepisode list: http://www.imdb.com/title/tt0310455/episodes\n\nDirector: Anthony Horowitz\nStars: Michael Kitchen, Honeysuckle Weeks en Anthony Howell\n\nFoyle's War Season 1 Episode 1: The German Woman (27 oktober 2002) \n\nPlot:\nHet is 1940 en Engeland staat bijna alleen tegenover de Nazi-bezetters van het Europese continent. De verschrikkingen van de nachtelijke bombardementen worden alleen overtroffen door de vrees en hysterie van de bevolking voor een schijnbaar onontkoombare Duitse invasie. Het is in die omstandigheden dat Hoofdinspecteur Christophere Foyle van de recherche afdeling van de Hastings politie in zuid Engeland moet werken.\nAfgewezen om actief deel te nemen aan de oorlogshandelingen wordt Foyle dagelijks met de duistere praktijken er van geconfronteerd.\nMet zijn chauffeur Sam en zijn ondergeschikte Paul Milner onderzoekt Foyle moorden, diefstal en bedrog, oorlogsmisdaden, misdaden uit hartstocht en misdaden uit hebzucht omdat misdaden in het algemeen niet ophouden in oorlogstijd. \n\nEpisode 1:\nIn een tijd waarin een aantal Duitsers is ondergebracht in een Brits kamp, wordt een vrouw op gruwelijke wijze vermoord.\nOp een boom bij haar dode lichaam is een hakenkruis geverfd.\nDetective Foyle start zijn speurtocht naar de dader en realiseert zich dat het schijnbaar rustige Sussex geen enkel tekort heeft aan verdachten.\n \nBeoordeling:\n1e seizoen bekeken en deze is zeker de moeite waard. Voor degenen die houden van de Engelse detective series is Foyle's War een &quot;must&quot;.  \n\nCategorie.......... Crime/Drama\nSource............. DVDRip\nRuntime............ 1:39:02 minutes\nSize............... 1,52 GB\nForm............... DivX MP4\nResolution......... 720x576\nFrames/s........... 25\nAudio Language..... English\nAudio code......... 2 Stereo 48kHz\nSubtitles: Dutch - Nederlands\n\nSeason 1 Episode 1:\nIt is 1940 and Britain stands almost alone against the might of Nazi Germany across the continent. The terrors of nightly bombing raids are only matched by the fear and hysteria of the population at the prospect of the seemingly inevitable German invasion. It is in this environment that Detective Chief Superintendent Christopher Foyle, of the Hastings Police on the south coast of England, works. Denied a transfer to the war effort, Foyle is nonetheless forced to confront the darkest acts of humanity on a daily basis. With his official driver, Sam, and his subordinate, Paul Milner, Foyle investigates murders, looting and theft, crimes of opportunism, crimes of war, crimes of passion and crimes of greed, because crime isn't stopped because of warfare.\n\n","torrent":{"xt":"urn:btih:e6c62a8da979f37db90bb1569a0e62f2301c81a7","amp;dn":"Foyle%27s+War+S1E1%282002%29%5BNL+subs%5D%5BNLtoppers%5D%5BTVSerieSpot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6c62a8da979f37db90bb1569a0e62f2301c81a7","infoHashBuffer":{"type":"Buffer","data":[230,198,42,141,169,121,243,125,185,11,177,86,154,14,98,242,48,28,129,167]},"announce":[],"urlList":[]}}