{"title":"Osho_The Last Testament Vol-2 #05_Swedish interview-all.mp4","uid":14164818,"size":1260334169,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e8000dabefadfd12995cbe62b970240612902f65&amp;dn=Osho_The+Last+Testament+Vol-2+%2305_Swedish+interview-all.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"drugarica","files":1,"time":1459728364,"description":"The Last Testament Vol-2 #05 part1\r\n25 August 1985 pm in Jesus Grove,\r\n Rajneeshpuram, Oregon, US\r\ncomplete chapter read here.\n\r\nINTERVIEW WITH LAWRENCE MÅRTENSEN, NORRA SKÅNE, HASSELHOLM, SWEDEN\r\nQ: MY NAME IS LAWRENCE MÅRTENSEN, AND I WORK\r\nFOR A NEWSPAPER IN SOUTHERN SWEDEN. IT'S A SMALLER\r\nNEWSPAPER. AND I'VE GOT QUITE A LOT OF QUESTIONS....\r\nUNFORTUNATELY I HAVEN'T READ ANY OF YOUR BOOKS, AND I KNOW THERE'S A LOT OF THEM. SO MAYBE SOME OF MY QUESTIONS, OR ALL OF THEM, ARE UNNECESSARY IN A SENSE. BUT STILL....\r\nA:* It is good that you have not read. And you can ask the same question one thousand times, but my answer will be again and again different. So there is no problem. You start.\r\nsome questions:\r\nQ:* A QUOTE FROM ONE OF YOUR BOOK COVERS IS: &quot;I TEACH A SENSUOUS RELIGION, BEAUTY IS FAR MORE VALUABLE THAN TRUTH.....\r\n\r\nARE YOU ACTUALLY TEACHING A RELIGION -- ARE YOUR IDEAS A RELIGION? I HEAR YOU MENTIONING GOD. IS THERE A GOD? DO YOU BELIEVE IN GOD, OR MAYBE YOU'RE EVEN SOME KIND OF GOD TO YOUR DISCIPLES YOURSELF.\r\n........................\r\nQ:* SO THE POINT IS ENJOYING WHAT YOU DO AT THIS MOMENT....\r\n........................................\r\nA:* No. I'm not anarchist. This democracy is bogus, it is simply a rotary club of dictators \r\nQ:* DO YOU CONSIDER YOUR COMMUNE, YOUR TOWN OF RAJNEESHPURAM, A DEMOCRACY?\r\nA:* This is a democracy because there is no political party.\r\nQ:* BUT ALL THE DIFFERENT INDIVIDUALS HERE ARE ALL WORKING TOGETHER FOR THE SAME PURPOSE, CREATING OR MAKING YOUR IDEAS AND YOUR THOUGHTS OF HOW YOU'RE SUPPOSED TO LIVE REAL.\r\nA:* No. My whole insistence is that never try to follow me. I am not a reliable person. Don't believe in me. Don't believe in my words. Whatever I say, think over it. Unless it becomes your own idea and you can say that, &quot;Now this is my idea&quot;, work it out. Nobody here is working my idea; they are working their ideas.\r\nQ:* YOU KEEP TELLING THEM TO DOUBT EVERYTHING YOU SAY AND MAKE INQUIRIES ABOUT EVERYTHING. BUT IT SEEMS TO ME THAT THE ONLY THING THEY REALLY DON'T DOUBT IS YOU AS A PERSON. I MEAN THEY KEEP GIVING YOU GIFTS, CARS, THEIR WORK, THEIR MONEY.\r\n.............................\r\nQ:* THIS MORNING YOU WERE SORT OF MAKING FUN OF: THE MOSLEMS HAVE THEIR MECCA AND THEIR BLACK ROCK THERE, THE COMMUNISTS HAVE THEIR KREMLIN, CHRISTIANS HAVE JERUSALEM. BUT WHAT'S THE DIFFERENCE BETWEEN THEM AND THESE RAJNEESHEES, THE TOWN HERE, THE TEMPLES AND YOU?....\r\nNow there is no motivation here. \r\n........................................\r\nQ:* THIS MORNING YOU SAID SOMETHING ABOUT THAT BELIEVING IS JUST CARRYING ON KNOWLEDGE FROM SOMEBODY ELSE. BUT ISN'T THAT EXACTLY WHAT THESE SANNYASINS ARE DOING?\r\n.............\r\nQ:* WHAT DO YOU THINK WILL HAPPEN WHEN THE TIME COMES THAT YOU DIE? WILL THESE PEOPLE THAT ARE NOW WITH YOU, CONTINUE YOUR IDEAS AND YOUR THOUGHTS? IS THERE ANYBODY WHO'S GOING TO TAKE OVER YOUR POSITION OF THE ONE THAT COMES UP IDEAS? I MEAN, YOUR BOOKS ARE USELESS BECAUSE THEY'RE ALL CONTRADICTING EACH OTHER.\r\n................................ read all","torrent":{"xt":"urn:btih:e8000dabefadfd12995cbe62b970240612902f65","amp;dn":"Osho_The+Last+Testament+Vol-2+%2305_Swedish+interview-all.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8000dabefadfd12995cbe62b970240612902f65","infoHashBuffer":{"type":"Buffer","data":[232,0,13,171,239,173,253,18,153,92,190,98,185,112,36,6,18,144,47,101]},"announce":[],"urlList":[]}}