{"title":"Dave Douglas - Be Still [2012][FLAC]","uid":10577984,"size":249948612,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e80600d01c2ce4df75298c4179050242d14a063a&amp;dn=Dave+Douglas+-+Be+Still+%5B2012%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":-1,"time":1405648677,"description":"FLAC / Lossless / Log (100%) / Cue \nLabel/Cat#: Greenleaf Music #GRECD 1027\nCountry: USA\nYear: September 25, 2012\nGenre: jazz,americana\nFormat:CD,Album\n\n\n\n\n\n1. Be Still My Soul 05:01\n2. High On A Mountain 02:37\n3. God Be With You 05:00\n4. Barbara Allen 04:22\n5. This Is My Father's World 03:43\n6. Going Somewhere With You 05:23\n7. Middle March 05:46\n8. Living Streams 05:02\n9. Whither Must I Wander? 05:59\n\n\n\nBe Still is dedicated to the memory of Dave Douglas' mother, Emily, who passed in 2011 after an extended battle with cancer. Of the nine tunes here, six are hymns and folks songs that she asked him to perform at her funeral. Douglas originally arranged them for his brass group, then reimagined them for his new quintet and this recording, which he calls &quot;aspirational.&quot; His new quintet includes saxophonist Jon Irabagon, pianist Matt Mitchell, bassist Linda Oh, and drummer Rudy Royston. Guest vocalist and guitarist Aoife O'Donovan of the contemporary bluegrass group Crooked Still joins the band on five tunes. The Jean Sibelius hymn &quot;Be Still My Soul&quot; opens the set. It's obvious from the start that Douglas is trying to move this recording beyond the boundaries of song. He looks inward, not only inside the arrangements but inside music to articulate what lies beyond the artificial boundaries of language and imposed structures. O'Donovan's voice, in its plaintive yet expressive grain, takes the gentle melody and expresses it subtly, with unaffected emotional depth. Douglas is almost a duet partner. He finds the lilt in her voice, twins it, and echoes it with short phrases. Mitchell and the rhythm section make the tune sway and shimmer underneath them. &quot;High On a Mountain,&quot; a nugget from the bluegrass fakebook, features O'Donovan's best high lonesome and flatpicking guitar skills. Douglas plays the part of the mandolin in the ensemble, he solos around inside of the verses as Oh's bass walks it all out. Irabagon's big soulful saxophone break is arresting. When O'Donovan's voice and the harmonizing horns re-enter, the tune becomes something other: it exists not so much in a place beyond genres, but in one where they no longer matter in getting a great song across. &quot;Barbara Allen&quot; offers hints of &quot;Shenandoah&quot; in its intro, but as the horns carve room for O'Donovan, the entire number hovers in the ether, like a poem sung across a mountain valley. The usual solemnity of &quot;This Is My Father's World&quot; is elevated to something far brighter. Elements of early jazz, traditional English folk music, and gospel harmony pour like water between the horns and are given wings by the rhythm section. O'Donovan sings the lyric as if she needn't convince anyone of its truth because she knows it intimately and the band's intuitive accompaniment only adds to that perception. Of Douglas' own tunes here, &quot;Going Somewhere with You,&quot; with its reaching crescendos in the choruses, beautifully underplayed solos, and interconnected dialogue, not only complements, but highlights his intent for this album. The closing reading of Vaughan Williams' &quot;Whither Must I Wander&quot; underscores the simple intimacy of the composer's melody in order to reveal its true elegance. Be Still is brimming with poetic elegance; but it is also adventurous in its graceful articulation of folk forms (jazz is one of them, after all), and possesses a creativity and musical sophistication that is above all, revelatory.","torrent":{"xt":"urn:btih:e80600d01c2ce4df75298c4179050242d14a063a","amp;dn":"Dave+Douglas+-+Be+Still+%5B2012%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e80600d01c2ce4df75298c4179050242d14a063a","infoHashBuffer":{"type":"Buffer","data":[232,6,0,208,28,44,228,223,117,41,140,65,121,5,2,66,209,74,6,58]},"announce":[],"urlList":[]}}