{"title":"The Secrets of Body Language","uid":7222326,"size":873691118,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e827332f24793c372427fc50f2365306f5a0b2d6&amp;dn=The+Secrets+of+Body+Language&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Gmaildave","files":1,"time":1335562243,"description":"Uploaded by Gmaildave\n\nBody language is a form of non-verbal communication, which consists of body posture, gestures, facial expressions, and eye movements. Humans send and interpret such signals almost entirely subconsciously.\n\nJohn Borg attests that human communication consists of 93 percent body language and paralinguistic cues, while only 7% of communication consists of words themselves; however, Albert Mehrabian, the researcher whose 1960s work is the source of these statistics, has stated that this is a misunderstanding of the findings.\n\nOthers assert that research has suggested that between 60 and 70 percent of all meaning is derived from nonverbal behavior.\n\nDelve into the science of non-verbal signals as this very visual and highly entertaining expose reveals the hidden language in which 93% of human communication takes place.\n\nFrom President Franklin D. Roosevelt, to British Prime Minister Winston Churchill and 2008 presidential hopefuls Senators Barack Obama and John McCain, see how both politicians and celebrities use the subtle movements of body language to persuade masses, establish power, and advance careers..Enjoy..Dave","torrent":{"xt":"urn:btih:e827332f24793c372427fc50f2365306f5a0b2d6","amp;dn":"The+Secrets+of+Body+Language","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e827332f24793c372427fc50f2365306f5a0b2d6","infoHashBuffer":{"type":"Buffer","data":[232,39,51,47,36,121,60,55,36,39,252,80,242,54,83,6,245,160,178,214]},"announce":[],"urlList":[]}}