{"title":"Nicholas Rogers - Halloween. From Pagan Ritual to Party Night [2","uid":11223379,"size":11172321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8d6ff346b1ecbbf36121a20bbc7db2df496935d&amp;dn=Nicholas+Rogers+-+Halloween.+From+Pagan+Ritual+to+Party+Night+%5B2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Anette14","files":-1,"time":1413411092,"description":"Description\nProduct Details\nBook Title: Halloween: From Pagan Ritual to Party Night\t\nBook Author: Nicholas Rogers (Author)\nHardcover: 208 pages\nPublisher: Oxford University Press; First ed; Second Printing edition (October 31, 2002)\nLanguage: English\nISBN-10: 0195146913\nISBN-13: 978-0195146912\n\nBook Description\nPublication Date: October 31, 2002\nBoasting a rich, complex history rooted in Celtic and Christian ritual, Halloween has evolved from ethnic celebration to a blend of street festival, fright night, and vast commercial enterprise. In this colorful history, Nicholas Rogers takes a lively, entertaining look at the cultural origins and development of one of the most popular holidays of the year.\nDrawing on a fascinating array of sources, from classical history to Hollywood films, Rogers traces Halloween as it emerged from the Celtic festival of Samhain (summer's end), picked up elements of the Christian Hallowtide (All Saint's Day and All Soul's Day), arrived in North America as an Irish and Scottish festival, and evolved into an unofficial but large-scale holiday by the early 20th century. He examines the 1970s and '80s phenomena of Halloween sadism (razor blades in apples) and inner-city violence (arson in Detroit), as well as the immense influence of the horror film genre on the reinvention of Halloween as a terror-fest. Throughout his vivid account, Rogers shows how Halloween remains, at its core, a night of inversion, when social norms are turned upside down, and a temporary freedom of expression reigns supreme. He examines how this very license has prompted censure by the religious Right, occasional outrage from law enforcement officials, and appropriation by Left-leaning political groups.\nEngagingly written and based on extensive research, Halloween is the definitive history of the most bewitching day of the year, illuminating the intricate history and shifting cultural forces behind this enduring trick-or-treat holiday.\n\nEditorial Review\nFrom Publishers Weekly\nIf America is a melting pot, then Halloween is the stew that simmers in our national cauldron. In this fascinating study, Rogers shows how the holiday is a hodgepodge of ancient European pagan traditions, 19th-century Irish and Scottish celebrations, Western Christian interpretations of All Souls' Day and thoroughly modern American consumer ideals. At its heart, he says, Halloween is a celebration of the inversion of social codes-children have power over adults, marauders can make demands of established homeowners and anyone may assume a temporary disguise. Canadian professor Rogers is a fine cultural historian, who carefully sifts through complex social and religious data to tease out meanings and trajectories. One excellent chapter illuminates Halloween and Hollywood, while a chapter entitled Border Crossings discusses Halloween observance among non-Anglo populations in North America, including Mexico's &quot;Dia de los Muertos.&quot; Rogers's is the best study to date of the history and growing significance of Halloween.\n\nReviews\n&quot;Halloween is a rich mix of historical detail and keen cultural observation about the holiday in North America. He reaches far back to the festival's pagan roots and follows its development into a unique celebration of liminality, cultural borrowing, and outrageous invention. Halloween is surely an important contribution to a growing literature that takes seriously our moments of play.&quot; --Penne Restad, author of Christmas in America: A History\n\n&quot;This book paints its subject in very broad strokes, giving us a glimpse of an increasingly significant holiday over a vast expanse of space and time. How delightful, too, to read about an event through a North American, rather than strictly American perspective.&quot; --Jack Kugelmass, author of Masked Culture: The Greenwich Village Halloween Parade\n\nAbout the Author\nNicholas Rogers is Professor of History at York University. He is the co-author of Eighteenth-Century English Society: Shuttles and Swords (OUP) and the author of Crowds, Culture, and Politics in Georgian Britain (OUP), for which he received the 1999 Wallace K. Ferguson Prize of the Canadian Historical Association for the best book on non-Canadian history","torrent":{"xt":"urn:btih:e8d6ff346b1ecbbf36121a20bbc7db2df496935d","amp;dn":"Nicholas+Rogers+-+Halloween.+From+Pagan+Ritual+to+Party+Night+%5B2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8d6ff346b1ecbbf36121a20bbc7db2df496935d","infoHashBuffer":{"type":"Buffer","data":[232,214,255,52,107,30,203,191,54,18,26,32,187,199,219,45,244,150,147,93]},"announce":[],"urlList":[]}}