{"title":"GWAR - This Toilet Earth - 1994 - Full Album","uid":5149251,"size":42541056,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e904719d09093c910c6bd973c2e4a825bc9329cd&amp;dn=GWAR+-+This+Toilet+Earth+-+1994+-+Full+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"5noosh","files":16,"time":1257455608,"description":"This Toilet Earth is the fourth album released by rock/heavy metal/punk band GWAR. Released in 1994, this album was to be one of their oddest and most bittersweet albums. It was the first GWAR album to be censored (the second was We Kill Everything, which comes in both censored and uncensored versions), due to their gain in popularity as a result of MTV exposure. The music and artwork is almost cartoonish when compared to the previous albums, and the instrumentation has expanded to include horns (in the opener, &quot;Saddam a Go-Go&quot;) that reinforce the goofiness.\n\nThe album is a blend of chaotic styles reminiscent of Faith No More and Frank Zappa. Skulhedface was the movie released to document this album. &quot;Jack the World&quot; was also featured in the Beavis and Butt-head video game for the Sega Genesis.\n\nStorywise, the enemy is now Skulhedface, an alien queen who was deformed in a Synnite Warrior raid on her planet centuries before. In retaliation, she travels to Antarctica, encounters GWAR while they are hibernating, and steals their Jizmoglobin, or life force. Her midget slave Flopsy and she then create a creature made up of the melded parts of evil historical figures (such as Hitler) called the Flesh Column. Skulhedface disguises herself as an evil executive for the Glomco corporation, and uses propaganda to turn GWAR into sickeningly cuddly cartoon characters. Meanwhile, GWAR discovers that the World Maggot is their only opportunity to escape Earth, but Skullhedface stands in their way. Oderus &amp; Co. must regain their Jizz and catch the maggot in time. Both the movie Skulhedface and the album feature the voice of Scott Krahl as Skulhedface (Krahl played Gor-Gor in the tour prior to this album). Krahl also played the World Maggot on this tour and movie.\n\nTrack listing\n\n1. \t&quot;Saddam a Go-Go&quot;\t\n2. \t&quot;Penis I See&quot;\n3. \t&quot;Eat Steel&quot; \n4. \t&quot;Jack The World&quot;\n5. \t&quot;Sonderkommando&quot;\n6. \t&quot;Bad Bad Men&quot;\n7. \t&quot;Pepperoni&quot;\n8. \t&quot;The Insidious Soliloquy of Skulhed Face&quot;\n9. \t&quot;B.D.F.&quot;\n10. \t&quot;Fight&quot;   \t\n11. \t&quot;The Issue of Tissue (Spacecake)&quot; \n12. \t&quot;Pocket Pool&quot;\n13. \t&quot;Slap U Around&quot;\n14. \t&quot;Krak Down&quot;\n15. \t&quot;Filthy Flow&quot;\n16. \t&quot;The Obliteration of Flab Quarv 7&quot;","torrent":{"xt":"urn:btih:e904719d09093c910c6bd973c2e4a825bc9329cd","amp;dn":"GWAR+-+This+Toilet+Earth+-+1994+-+Full+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e904719d09093c910c6bd973c2e4a825bc9329cd","infoHashBuffer":{"type":"Buffer","data":[233,4,113,157,9,9,60,145,12,107,217,115,194,228,168,37,188,147,41,205]},"announce":[],"urlList":[]}}