{"title":"Mighty.Med.S02E06.Storm.End.1080p.MiMa.m4v","uid":11672912,"size":927014996,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e9479768f9295dd34e09eef14605e618088b096c&amp;dn=Mighty.Med.S02E06.Storm.End.1080p.MiMa.m4v&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"QQQQQ1","files":1,"time":1422738474,"description":"Picking up where 'Do You Want to Build a Lava-Man' left off, Kaz, Oliver, and Hapax are trapped by the Annihilator and Skylar. Hapax battles the Annihilator, using their mutant powers against each other. When Hapax appears to lose, Oliver grabs the Annihilator's power cannon and threatens to kill the Annihilator if Skylar doesn't surrender. To everyone's surprise, Skylar saves Oliver the trouble by appearing to kill the Annihilator herself, then announcing that she wants to rule the whole universe, with Kaz and Oliver as her evil minion-friends by her side, but the reappearance of the doringbosh allows Kaz, Oliver, and a weak Hapax to escape. Out in the desert, Kaz and Oliver argue about what to do next, as Kaz now believes Skylar is beyond rescue and brutally tells Oliver that a future with Skylar isn't possible. Skylar catches the trio, but Oliver weakens her with a lump of coal. Hapax drains Skylar of her powers, turning her back to normal. But the Annihilator, having survived Skylar's blast, weakly attempts one final act of revenge and shoots Skylar with a shot of stolen Black Widower's poison. Hapax kills the Annihilator, which sends out a blast that turns every infected superhero good again, but Skylar is now in danger of dying. Hapax transports the boys and Skylar back to Mighty Med, where the doctors try to save Skylar, but it's too late and Skylar dies. Kaz and Oliver plead with Horace to do something, so Horace uses a unique power to bring Skylar back to life. When Kaz and Oliver question him, Horace tells them that the only one who can bring people back to life is Caduceo, the Legendary Healer of Superheroes. Horace reveals that he is Caduceo, and that he has five lives he can bring back, now down to one. Meanwhile, after the Annihilator saw Oliver alive on Caldera, Skylar allowed him to think that Caduceo was responsible for saving Oliver. The brainwashed Tecton and Blue Tornado arrive at The Domain to seek a legendary mirror to drain Caduceo's powers. Unbeknownst to them, Gus and Jordan are now running The Domain, and Jordan sees Tecton land and transform. Unable to convince Gus, Jordan displays a Kaz-and-Oliver like knowledge of superheroes to prove that the visitor is Tecton. When she hits Tecton in the leg with a spear, he seems genuinely hurt and Jordan believes she was mistaken. When Gus and Jordan's backs are turned, Tecton heals himself easily. He then requests the mirror from Gus, who breaks it, trying to prove a point. Angry, Tecton picks up the couch to throw it from behind at Gus when Hapax's blast pulse turns him back to normal. He puts the couch down, but Gus now thinks he knows Tecton from somewhere","torrent":{"xt":"urn:btih:e9479768f9295dd34e09eef14605e618088b096c","amp;dn":"Mighty.Med.S02E06.Storm.End.1080p.MiMa.m4v","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9479768f9295dd34e09eef14605e618088b096c","infoHashBuffer":{"type":"Buffer","data":[233,71,151,104,249,41,93,211,78,9,238,241,70,5,230,24,8,139,9,108]},"announce":[],"urlList":[]}}