{"title":"JSA (1999-2006 series)","uid":4272710,"size":867575458,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e952f76872d53d47b4157c25425205ad1e4c6068&amp;dn=JSA+%281999-2006+series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Rishab","files":94,"time":1215022661,"description":"The Justice Society of America, or JSA, is a DC Comics superhero group, the first team of superheroes in comic book history. Conceived by editor Sheldon Mayer and writer Gardner Fox, the JSA first appeared in All Star Comics #3 (Winter 1940). \n\nUnlike subsequent &quot;all-star&quot; teams, the JSA was limited to heroes not already featured in their own titles because the publisher wanted to expose their lesser known characters. Hence, Superman and Batman were only honorary members and Flash and Green Lantern&amp;#039;s early tenures were brief, ending when each character was awarded his own book. However, a 1944 change in policy allowed them back into the group. Other popular members were Hawkman, the Spectre, Hourman, Doctor Fate and the Atom. \n\nThe Justice Society was again revived in 1999 in a popular and critically acclaimed series (called simply JSA) which mixed the few remaining original members with younger counterparts. This incarnation of the team was focused on the theme of generational legacy and of carrying on the heroic example established by their predecessors. The modern JSA was unique among superhero teams in that its membership contained three different generations of characters. The series was launched by James Robinson and David S. Goyer. \n\nThis torrent contains JSA run up from 1999-2006 which is also called vol 2. It is a request from the demonoid forum. Enjoy and Seed. ","torrent":{"xt":"urn:btih:e952f76872d53d47b4157c25425205ad1e4c6068","amp;dn":"JSA+%281999-2006+series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e952f76872d53d47b4157c25425205ad1e4c6068","infoHashBuffer":{"type":"Buffer","data":[233,82,247,104,114,213,61,71,180,21,124,37,66,82,5,173,30,76,96,104]},"announce":[],"urlList":[]}}