{"title":"Williams-Sonoma Collection: Cake by Fran Gage","uid":9666359,"size":16190398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9d94f36c0cc25a1615a7b80133602b1e1b47d63&amp;dn=Williams-Sonoma+Collection%3A+Cake+by+Fran+Gage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1393380540,"description":"\nA slice of rich, moist cake is irresistible. From a tart, sweet lemon sponge or airy angel food cake to a decadent chocolate torte, there is a cake to satisfy every craving. Whether you are searching for a special cake to establish a birthday tradition or are simply looking for a sweet ending to an everyday meal, there are cakes to fit any occasion.\n\nWilliams-Sonoma Collection Cake offers more than 35 tantalizing recipes, including updated classics as well as fresh new ideas. For elegant entertaining, make an impressive Rolled Chestnut Cream Cake before your guests arrive, then relax and enjoy the party. When time is short, keep it simple with easy Chocolate-Orange Cupcakes or Espresso Pound Cake. \n\nThe many delicious recipes inside these pages will inspire you to tempt and dazzle friends and family alike. A chapter devoted to deorating ideas will help you transform any cake into a work of art.\nFull-color photographs of each recipe help you easily decide which cake you want to preapare, and photographic side notes throughout the book highlight key techniques and ingredients. \n\nIn addition, an informative basics section, with tips for both beginning and experienced bakers, makes this book the ideal source to have on hand for creating the perfect cake.\n\nGenre: Non-Fiction, Cookery","torrent":{"xt":"urn:btih:e9d94f36c0cc25a1615a7b80133602b1e1b47d63","amp;dn":"Williams-Sonoma+Collection%3A+Cake+by+Fran+Gage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9d94f36c0cc25a1615a7b80133602b1e1b47d63","infoHashBuffer":{"type":"Buffer","data":[233,217,79,54,192,204,37,161,97,90,123,128,19,54,2,177,225,180,125,99]},"announce":[],"urlList":[]}}