{"title":"Sam Keene - The Disappearing Spoon.","uid":8224581,"size":1072706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea3d75d86519084ef3261335b335a96ec34e66db&amp;dn=Sam+Keene+-+The+Disappearing+Spoon.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SectorVector","files":1,"time":1362565020,"description":"Full Title:\n\nThe Disappearing Spoon: And Other True Tales of Madness, Love, and the History of the World from the Periodic Table of the Elements.\n\nWhy did Gandhi hate iodine (I, 53)? How did radium (Ra, 88) nearly ruin Marie Curie's reputation? And why is gallium (Ga, 31) the go-to element for laboratory pranksters?*\n\nThe Periodic Table is a crowning scientific achievement, but it's also a treasure trove of adventure, betrayal, and obsession. These fascinating tales follow every element on the table as they play out their parts in human history, and in the lives of the (frequently) mad scientists who discovered them. THE DISAPPEARING SPOON masterfully fuses science with the classic lore of invention, investigation, and discovery--from the Big Bang through the end of time.\n\n*Though solid at room temperature, gallium is a moldable metal that melts at 84 degrees Fahrenheit. A classic science prank is to mold gallium spoons, serve them with tea, and watch guests recoil as their utensils disappear.\n\n-------------------------------------------------------------------------------\n\nAbout the author:\n================\nSam Kean spent years collecting mercury from broken thermometers as a kid, and now he's a writer in in Washington, DC. His work has appeared in the New York Times Magazine, Mental Floss, Slate, and Science, and has been featured on NPR's &quot;Radiolab&quot; and &quot;All Things Considered.&quot; The Disappearing Spoon, his first book, was a New York Times national bestseller. Read excerpts at http://www.samkean.com.\n\nSam Kean gets called Sean once a month. He grew up in South Dakota, which means more to him than it probably should. He's a fast reader but a very slow eater. He went to college in Minnesota and studied physics and English. He taught for a few years at an experimental charter school in St. Paul, where the kids showed up at night. After that, he tried to move to Spain (it didn't take) and ended up in Washington, D.C. He has a master's degree in library science he will probably never use. He wishes he had a sports team he was passionate about, but doesn't, though he does love track &amp; field. \n\n","torrent":{"xt":"urn:btih:ea3d75d86519084ef3261335b335a96ec34e66db","amp;dn":"Sam+Keene+-+The+Disappearing+Spoon.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea3d75d86519084ef3261335b335a96ec34e66db","infoHashBuffer":{"type":"Buffer","data":[234,61,117,216,101,25,8,78,243,38,19,53,179,53,169,110,195,78,102,219]},"announce":[],"urlList":[]}}