{"title":"War Driver's Essential ToolKit","uid":3561760,"size":25151415,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ea76959b54089ba7cbff5dac400f05f5021a33a4&amp;dn=War+Driver%5C%27s+Essential+ToolKit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Nightwalker05","files":25,"time":1164121711,"description":"30/04/2006                                               v.0.1\n\n           -== War-Driver&amp;#039;s Essential Toolkit ==-\n\n\n:: Introduction ::\n                    - http://en.wikipedia.org/wiki/War_driving\n\n&quot;Wardriving is searching for Wi-Fi wireless networks by moving\nvehicle. It involves using a car or truck and a Wi-Fi-equipped\ncomputer, such as a laptop or a PDA, to detect the networks.&quot;\n\nI have been Wardriving for a few years now and over time I\nhave gathered more tools and equipment. Through use and\nexperience I bring you this first toolkit release that I have\ngathered together and consider to be a good essential package\nfor every War-Driver to have in their arsenal.\n\nI provide you with tools to detect, analyse, hack and even\nsecure yourself and your data.\n\nI am mostly a Windows user; so all the tools here are for\nWindows XP. Some of the best hardc0re wifi tools run on\nLinux &amp; other OS&amp;#039;s, however they generally require a lot more\ntechnical know-how, and thats not what this toolkit is about.\nBut if you do like Linux and like to dable I recommend learning\nabout Kismet and other wifi linux apps out there.\n\nAll software provided in this package is freely avaliable\non the internet, there are no cracks, serials or warez here,\nJust quality freeware utilities.\n\nIf you are unfamiliar with any of the terms used within this\nReadMe.txt then please use http://en.wikipedia.org/ to get\ndetailed definitions of termonology.\n\n                                      ~Freedom of Information!\n                                           Nightwalker | 2006\n            -========================-\n\n\n -== dpl.html ==- http://www.phenoelit.de/dpl/dpl.html\n\nThe War-Driver&amp;#039;s must have! Default Password List.. this is a\nlist of default usernames and passwords that manufactorurs\ngive their routers. A good war driver will memorise the easy,\ndefault ones for popular brands.\n\n\n\n-== eraser53.zip ==- http://www.tolvanen.com/eraser/\n\nGood for security, this handy little tool adds a &quot;Erase&quot;\nfunction to your right click menu. Simply right click on\nfile(s) or folders and select erase to have files securly\nscrubbed from your hard disk.\n\n\n\n -== Ethereal v.0.10.14 ==- http://www.ethereal.com/\n\nEthereal is a powerful packet sniffer. Here is their website&amp;#039;s\nspiel: &quot;EtherealÂ® is used by network professionals around the\nworld for troubleshooting, analysis, software and protocol\ndevelopment, and education. It has all of the standard features \nyou would expect in a protocol analyzer, and several features\nnot seen in any other product. Its open source license allows\ntalented experts in the networking community to add enhancements.\nIt runs on all popular computing platforms, including Unix, Linux,\nand Windows.&quot;\n\n\n\n-== superscan4 ==-\n &lt;a href=&quot;\nhttp://www.foundstone.com/resources/proddesc/superscan4.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.foundstone.com/resources/proddesc/superscan4.htm&lt;/a&gt;\n\n&quot;Powerful TCP port scanner, pinger, resolver.&quot;\n\n\n\n-== Tor ==- http://tor.eff.org/\n\nTor allows you to utilise a special network to allow you to\nbrowse the web with true anonimity.\n\n&quot;Using Tor can help you anonymize web browsing and publishing,\ninstant messaging, IRC, SSH, and other applications that use\nthe TCP protocol. Tor also provides a platform on which software\ndevelopers can build new applications with built-in anonymity,\nsafety, and privacy features.&quot;\n\n\n\n-== klitekpp241e.exe ==-\n\nA version of Kazaa Lite that in the past has proven itself\nto be useful to me. The installation is free of viruses or spyware\nand the network still works, so I consider it to be one of the\nbest kazaa network apps.\n\n\n\n-== lalsetup250.exe ==- http://www.lookatlan.com/\n\nAnother essential part of the War-Driver&amp;#039;s kit; Look@LAN is a\nsuperb freeware application for monitoring networks easily.\nIt offers an entire suite of very handy intergrated tools that\nmake life easy and do a lot of the work for you quickly.\n\nJust on opening the application it will do a full port-scan\nof your active network interface, it will alert you off changes\nto the network, nodes coming online or offline etc. Simply\ndouble-clicking a online node will scan the system for ports and\nopen services, its truly superb. Heres the company spiel:\n\n&quot;While Look@LAN lets you be able to entirely monitor a complex\nand wide network, with Medas VNS (Visual Network Statistics) you\ncan keep under control your network primary nodes, such as routers,\nfirewalls, NATs, switches, HUBs. Medas VNS gives you detailed\nstatistics about any node that supports SNMP: network interface\nstastics and correlated analysis, protocol statistics about any\nTCP/IP layer, active TCP and UDP connections and services, TCP/IP\nnetworks list, routes list. This is a perfect software solution for\nanyone who wants to carefully monitor and manage a network by\nkeeping under strict control its primary nodes.&quot;\n\n\n-== macshift.zip ==- http://devices.natetrue.com/macshift/\n\n&quot;The definitive free command-line MAC changing utility for Windows XP&quot;\nThis is one of few applications that will effectively and quickly\nchange the hardware MAC code of your WiFi network card. It is a \ncommand line application for WinXP. Learn how it works, its switches\nand then make batch scripts to execute all the commands for you when\nyou need them.\n\nFor example; on my War-Driving system I have a file on my desktop\nname: &quot;macshift.bat&quot; that contains the following text:\n\ncd C:\\Windows\\system32\\\n\nmacshift -i &quot;Wireless Network Connection&quot;\n\nexit\n\n\n\n-== NetStumbler ==- http://www.netstumbler.com/\n\n&quot;NetStumbler is a tool for Windows that allows you to detect\nWireless Local Area Networks (WLANs) using 802.11b, 802.11a and\n802.11g.&quot;\n\nAnother essential for the War-Drivers Toolkit, this application\nis nice and easy to introduce you novice&amp;#039;s to the game. Great\nhandy free app for detecting wifi networks, still gets used by\nme every time :)\n\n\n\n-== Port Scanner.exe ==- http://www.radmin.com/\n\nA dedicated free application for port scanning. A good all-round\nport scanner with nifty features etc.\n\n\n\n-== truecrypt-4.1.zip ==- http://www.truecrypt.org/\n\n&quot;Free open-source disk encryption software for Windows XP/2000/2003\nand Linux&quot; This free open-source software is superb for data\nencryption and security. It takes a little learning but you can soon\nbe encrypting whole disks, partitions or volumes. It supports\non-the-fly encryption which (once auth&amp;#039;d) you can drag and drop data\nonto a drive and it will encrypt the data for you.\n\nYou can choose your own strength and algorithm of encryption.\n\nYou can even create hidden encrypted volumes, so not only would\nsomeone not be able to break the encryption, but it would be imposible\nfor them to tell if there was even encrypted data on the system at all.\n\n=======================================================================\nCredit:\n\n                                                            Nightwalker\n                                               He who walks the shadows\nPlease post comments &amp; feedback.","torrent":{"xt":"urn:btih:ea76959b54089ba7cbff5dac400f05f5021a33a4","amp;dn":"War+Driver%5C%27s+Essential+ToolKit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea76959b54089ba7cbff5dac400f05f5021a33a4","infoHashBuffer":{"type":"Buffer","data":[234,118,149,155,84,8,155,167,203,255,93,172,64,15,5,245,2,26,51,164]},"announce":[],"urlList":[]}}