{"title":"Monsieur Verdoux (1947) Charles Chaplin Eng","uid":6014531,"size":1469481680,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb7a4e6aa6e576c66c4d8fb2dacd1a833f2b12b5&amp;dn=Monsieur+Verdoux+%281947%29+Charles+Chaplin+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"johnefp","files":-1,"time":1291583612,"description":"&quot;Von Clausewitz said that war is the logical extension of diplomacy; Monsieur Verdoux feels that murder is the logical extension of business.&quot; With his controversial &quot;comedy of murders&quot; Monsieur Verdoux, Charles Chaplin makes his final, definitive break with the Little Tramp character that had brought him fame and fortune. Verdoux (Chaplin), a mild-mannered family man of pre-war France, has hit upon a novel method of supporting his loved ones. He periodically heads out of town, assumes an alias, marries a foolish, wealthy woman, then murders her for the insurance money. He does this thirteen times with success, but wife #14, brassy Martha Raye, proves impossible to kill (nor does she ever suspect what Verdoux has in mind for her). A subplot develops when Verdoux, planning to test a new poison, chooses streetwalker Marilyn Nash as his guinea pig. She tells him so sad a life story that Verdoux takes pity on her, gives her some money, and sends her on her way. Years later, the widowed and impoverished Verdoux meets Nash once more; now she is the mistress of a munitions magnate. This ironic twist sets the stage for the finale, when Verdoux, finally arrested for his crimes and on trial for his life, gently argues in his own defense that he is an &quot;amateur&quot; by comparison to those profiteers who build weapons for war. &quot;It's all business. One murder makes a villain. Millions, a hero. Numbers sanctify...&quot; Sentenced to death, Verdoux remains calmly philosophical to the end. As the condemned man walks to the guillotine, a priest prays for God to have mercy on Verdoux's soul. &quot;Why not?&quot; replies Verdoux jauntily. &quot;After all, it belongs to him.&quot; The original idea of Monsieur Verdoux originated with Orson Welles, who'd wanted to make a picture about notorious modern &quot;Bluebeard&quot; Landru. Welles wanted to cast Chaplin in the lead; Chaplin liked the idea, but preferred to direct himself, as he'd been doing since 1914. It is possible that Chaplin might have gotten away with the audacious notion of presenting a cold-blood murderer as a sympathetic, almost lovable figure. Alas, Monsieur Verdoux was released at a time when Chaplin was under a political cloud for his allegedly Communistic philosophy; too, it came out shortly after a well-publicized paternity suit involving Chaplin and Joan Barry. Picketed in several communities, banned outright in others, Monsieur Verdoux was Chaplin's first financial flop. Today, it can be seen to be years ahead of its time in terms of concept, even though the execution is old-fashioned and occasionally wearisome. Monsieur Verdoux doesn't always hit the bull's-eye, but it remains one of Charles Chaplin's most fascinating projects. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0039631/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0039631/&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-1107&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-1107&lt;/a&gt;\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 02:03:48\nMovie complete : Yes\n\n[Video]\nResolution : 704x528  4/3\nCodec : DivX (4 / 5 / 6)\nFPS : 25,00\nBitRate : 1455 Kbps\nQuality Factor : 0,16 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\nPlease seed at least as much as you D/L.\n\nDon't hit and run.\n=======================================\nThanks \n\nJohn\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/johnefp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/johnefp&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:eb7a4e6aa6e576c66c4d8fb2dacd1a833f2b12b5","amp;dn":"Monsieur+Verdoux+%281947%29+Charles+Chaplin+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb7a4e6aa6e576c66c4d8fb2dacd1a833f2b12b5","infoHashBuffer":{"type":"Buffer","data":[235,122,78,106,166,229,118,198,108,77,143,178,218,205,26,131,63,43,18,181]},"announce":[],"urlList":[]}}