{"title":"Jimmy Smith - The Fantastic Jimmy Smith (1953-1955)","uid":9698382,"size":117439620,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:eb8df2e9b42ef19b4214b8178d0f654ab5f2b364&amp;dn=Jimmy+Smith+-+The+Fantastic+Jimmy+Smith+%281953-1955%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1393964811,"description":"Jimmy Smith - The Fantastic Jimmy Smith (1953-1955)\n\n'The Fantastic Jimmy Smith' documents the beginnings of a remarkable career in music. This album is from the period of 1953-1955 when Smith first began to dedicate himself to the organ. While the recordings here do not match the level of his later sides, the album provides insight into a man about to become the greatest at his instrument. It does provide a missing chapter for collectors and completists.\n\n\nTracklist:\n01. Stranger in Paradise\n02. Jimmy's Jam\n03. Its a Sin to Tell A Lie\n04. I Can't Give You Anything but Love\n05. I Had the Craziest Dream\n06. Tell Me\n07. I Hear a Rhapsody\n08. Jeepers Creepers\n09. Jimmys Swing\n10. Misery\n11. Jughead\n12. Tea For Two Mambo\n13. Sonotone Bounce\n14. Dancing in the Ceiling\n15. I'll Walk Alone\n16. Skokiaan\n\nTotal Time: 46:23\n\nPersonnel:\nJimmy Smith - Hammond organ\nDon Gardner - Drums, Vocals\nAl Cass - Tenor Sax\n\nRecorded: 1953-1955\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n---------------------\n\n\nReview by Bill Milkowski\nIn any discussion of the Hammond organ, all praises must be given to Jimmy Smith, the acknowledged Master of the B-3. The native of Norristown, Pa., single-handedly revolutionized the concept of jazz on that hulking 400-pound instrument in the same way that Charlie Parker altered the course of the saxophone. \n\nSmith exploded onto the national scene in 1956 with his audacious Blue Note debut, A New Sound, A New Star, on which he flaunted his dazzling right-hand technique and an inherent desire to burn. Smith didn't always play that way; prior to that turning point in his career he was the kind of organ player who was very much under the influence of his primary inspiration, Wild Bill Davis. \n\nThe Fantastic Jimmy Smith, a rarity from the vaults of Bruce Records, documents the organist in his developing stage when he was a member of the Sonotones, a local Philly group led by singing drummer Don Gardner, between 1953 and 1955. Smith takes a bit of a backseat to honking tenor saxophonist Al Cass on the 16 Rhythm&amp;Blues-flavored tracks here. The burn is still present in his playing, particularly on uptempo instrumental tracks like 'Jimmy's Jam', 'Jughead' and 'Jimmy's Swing'. But even on those romper-stompers he doesn't break free of Wild Bill's locked-hands approach and sail off on those multinote right-hand excursions that would later become a Smith trademark. Gardner lends his velvety Herb Jeffries-styled vocals to two doo-wop numbers, 'Tell Me' and 'I Hear a Rhapsody', and the overly dramatic ballad 'I'll Walk Alone. \n\nThis disc hardly measures up expectations of what Smith can do, but it does provide a missing chapter for collectors and completists.\n\n\n\nReview by Charlie B. Dahan\nThe Fantastic Jimmy Smith, documents the beginnings of a remarkable career in music. This album is from the period of 1953-1955 when Smith first began to dedicate himself to the organ. While the recording here do not match the level of his later sides, the album provides insight into a man about to become the greatest at his instrument.\n\nBefore Jimmy Smith became the legendary jazz organist, he was an in-house session pianist and organist for New York R&amp;B label, Bruce Records. This album is a collection of his first series of recordings on the organ both as a sideman and a band-leader. While this recording probably isn't for fans of organ trio or hard bop jazz, it does provide a rare glimpse into an artist in the early stages of their career. Listening to these recording is like hearing Charlie Parker with Jay McShann or Louis Armstrong with King Oliver, the innocence and raw talent that would soon lead to a significant body of work.\n\nThe majority of these recordings have been unreleased since their initial offering almost 40 years ago and offer a variety of styles both instrumental and with vocal. What is evident on the vocal recordings is you hear Smith trying to find his place in the session. On sides such as 'I Can't Give You Anything But Love', Smith struggles with trying to accent the lead vocal and saxophone while also trying to step out and make himself heard. However on the instrumental tracks one can hear the foreshadowing for what is to come from Smith on the recordings of 'Dancing on the Ceiling' and 'Jimmy's Jam'.\n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n\n","torrent":{"xt":"urn:btih:eb8df2e9b42ef19b4214b8178d0f654ab5f2b364","amp;dn":"Jimmy+Smith+-+The+Fantastic+Jimmy+Smith+%281953-1955%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb8df2e9b42ef19b4214b8178d0f654ab5f2b364","infoHashBuffer":{"type":"Buffer","data":[235,141,242,233,180,46,241,155,66,20,184,23,141,15,101,74,181,242,179,100]},"announce":[],"urlList":[]}}