{"title":"BBC Radio 4 - Neil Gaiman - Neverwhere - FLAC","uid":9419595,"size":2434937623,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:eda47b17e21f5d1c76704454caa66ecd51ef47c3&amp;dn=BBC+Radio+4+-+Neil+Gaiman+-+Neverwhere+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"the_berus","files":7,"time":1388540948,"description":"BBC Radio 4 - Neil Gaiman's Neverwhere\n\n***Lossless FLAC files***\n\nBeneath the streets of London there is another London. A subterranean labyrinth of sewers and abandoned tube stations. A somewhere that is Neverwhere.\n\nAn act of kindness sees Richard Mayhew catapulted from his ordinary life into a subterranean world under the streets of London. Stopping to help an injured girl on a London street, Richard is thrust from his workaday existence into the strange world of London Below.\n\nSo begins a curious and mysterious adventure deep beneath the streets of London, a London of shadows where the tube cry of 'Mind the Gap' takes on new meaning; for the inhabitants of this murky domain are those who have fallen through the gaps in society, the dispossessed, the homeless. Here Richard meets the Earl of Earl's Court, Old Bailey and Hammersmith, faces a life-threatening ordeal at the hands of the Black Friars, comes face to face with Great Beast of London, and encounters an Angel. Called Islington.\n\nJoining the mysterious girl named Door and her companions, the Marquis de Carabas and the bodyguard, Hunter, Richard embarks on an extraordinary quest to escape from the clutches of the fiendish assassins Croup and Vandemar and to discover who ordered them to murder her family. All the while trying to work out how to get back to his old life in London Above.\n\nA six part adaption of Neil Gaiman's novel adapted by Dirk Maggs, sees James McAvoy as Richard lead a stellar cast which includes Natalie Dormer, David Harewood, Sophie Okonedo, Benedict Cumberbatch, Christopher Lee, Anthony Head, David Schofield, Bernard Cribbins, Romola Garai, George Harris, Andrew Sachs, Lucy Cohu, Johnny Vegas, Paul Chequer, Don Gilet and Abdul Salis.\n\n-------------------------------------------------------------------------------\n\nEpisode 1: London Below - An act of kindness catapults Richard from his ordinary life into a subterranean world.\nFirst broadcast: 16 March 2013\n\nEpisode 2: Earl's Court - To learn who killed Door's family, Richard visits a venerable resident of London Below.\nFirst broadcast: 18 March 2013\n\nEpisode 3: The Angel Islington - Richard and Door travel to the British Museum to locate the citadel of the legendary Angel\nFirst broadcast: 19 March 2013\n\nEpisode 4: The Black Friars - Richard heads to the monastery where he must undergo a terrifying ordeal to obtain the key\nFirst broadcast: 20 March 2013\n\nEpisode 5: Market Afloat - Richard and Door find a guide to lead them through the labyrinth deep beneath London.\nFirst broadcast: 21 March 2013\n\nEpisode 6: The Key - Richard and Door finally discover who ordered the death of Door's family. Can they escape?\nFirst broadcast: 22 March 2013","torrent":{"xt":"urn:btih:eda47b17e21f5d1c76704454caa66ecd51ef47c3","amp;dn":"BBC+Radio+4+-+Neil+Gaiman+-+Neverwhere+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda47b17e21f5d1c76704454caa66ecd51ef47c3","infoHashBuffer":{"type":"Buffer","data":[237,164,123,23,226,31,93,28,118,112,68,84,202,166,110,205,81,239,71,195]},"announce":[],"urlList":[]}}