{"title":"Parquet Courts - Content Nausea (2014) [FLAC]","uid":11426601,"size":172114364,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ee02d56de8763094670922fee8c97bc9d4a3c0d7&amp;dn=Parquet+Courts+-+Content+Nausea+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1415671274,"description":"\n  Parquet Courts - Content Nausea (2014) [FLAC]\n\n  Genre: Rock\n  Styles: Alternative\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Everyday It Starts\n  02 Content Nausea\n  03 Urban Ease\n  04 Slide Machine\n  05 Kevlar Walls\n  06 Pretty Machines\n  07 Psycho Structures\n  08 The Map\n  09 These Boots\n  10 Insufferable\n  11 No Concept\n  12 Uncast Shadow of a Southern Myth\n\n  Not even six months after the arrival of their dazzling third album Sunbathing Animal, New York's brainy clatter-rock collective Parquet Courts quickly re-emerged with album-length art rock tirade Content Nausea. Released under the mixed-up but identically pronounced moniker Parkay Quarts, this isn't the first time the band has blurted out a stylistically divergent slab of jumbled weirdness. Following 2012's Light Up Gold, this evil twin version of the band showed up in 2013 with an EP entitled Tally All the Things That You Broke that let loose with more uninhibited forays into shambling punk and robotic vamps. In the same loosely arranged fashion, Content Nausea was churned out on a four-track in the course of two weeks, mostly by Parquet Courts songwriters Andrew Savage and Austin Brown with some guest spots from Jackie-O Motherfucker's Jef Brown on saxophone and noisy violin from Eaters member Bob Jones. Almost all of this virtual grab bag's 12 songs go in slightly different directions, from the spoken-sung punk essay of the title track to cold lo-fi synth minimalism on &quot;Psycho Structures&quot; to a fairly straight-faced cover of Nancy Sinatra's country-rock classic &quot;These Boots.&quot; There are some echoes of both the aggression and exhaustion that characterized the best moments of Sunbathing Animal. The midtempo &quot;Slide Machine&quot; stumbles dourly through, evoking the spirit of both Pavement and the 13th Floor Elevators, while &quot;Uncast Shadow of a Southern Myth&quot; ambles on for six and a half minutes of rootsy despair somewhere between the Silver Jews and Dylan himself","torrent":{"xt":"urn:btih:ee02d56de8763094670922fee8c97bc9d4a3c0d7","amp;dn":"Parquet+Courts+-+Content+Nausea+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee02d56de8763094670922fee8c97bc9d4a3c0d7","infoHashBuffer":{"type":"Buffer","data":[238,2,213,109,232,118,48,148,103,9,34,254,232,201,123,201,212,163,192,215]},"announce":[],"urlList":[]}}