{"title":"PDR Nurse's Drug Handbook 2014 [PDF] [StormRG]","uid":10564393,"size":35750502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee13e2cb4e3a11123a90d6765854c662261d93dd&amp;dn=PDR+Nurse%27s+Drug+Handbook+2014+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":-1,"time":1405501424,"description":"Author: PDR Staff\nSeries: Physicians' Desk Reference Nurse's Drug Handbook\nPaperback: 1800 pages\nPublisher: PDR Network; 2014 Edition edition (July 16, 2013)\nLanguage: English\nISBN-10: 1563638169\nISBN-13: 978-1563638169\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nNurses are on the front line when it comes to safe medication use and counseling patients. The 2014 PDRÂ® Nurse's Drug Handbook provides all nursing professionals, no matter what the clinical setting, with an accurate, up-to-date, and easily accessible guide to over 1,500 of the most commonly prescribed drugs. Based on the FDA-approved prescribing information, PDR's staff of pharmacists has developed concise monographs that highlight the most important information on each drug, including its approved use; dosages; interactions with other drugs, food, and alcohol; side effects; safety information; and more. Clear, straightforward nursing considerations provide guidance on proper patient assessment and monitoring, as well as patient counseling and drug administration. In addition, product comparison tables are updated for each edition, with new tables added to reflect the latest information and current practice standards.","torrent":{"xt":"urn:btih:ee13e2cb4e3a11123a90d6765854c662261d93dd","amp;dn":"PDR+Nurse%27s+Drug+Handbook+2014+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee13e2cb4e3a11123a90d6765854c662261d93dd","infoHashBuffer":{"type":"Buffer","data":[238,19,226,203,78,58,17,18,58,144,214,118,88,84,198,98,38,29,147,221]},"announce":[],"urlList":[]}}