{"title":"The Politics Of Freedom - David Boaz","uid":11710010,"size":1371220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eebe785c6e404d3653690a4c07692bc93c1fac49&amp;dn=The+Politics+Of+Freedom+-+David+Boaz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424293731,"description":"\nThe Politics of Freedom: Taking on The Left, The Right and Threats to Our Liberties\nIs it any wonder that Americans have become so dissatisfied with government today? Politicians have given us soaring federal spending, rampant violations of our constitutional rights, a futile war in Iraq, corruption, incompetence, and a growing nanny state. Now one of the leading libertarian critics of big government raises the flag of freedom. David Boaz takes on both liberals and conservatives who seek to impose their own partisan agendas on the whole country. He discusses the roots of American freedom, the growing libertarian vote in America, the arrogance of politicians, and everything from taxes and education to terrorism and the war on drugs. For the millions of Americans who don't fit the red-blue divide, who are fiscally conservative and socially liberal, who reject big-government conservatism and nanny-state liberalism, this book points the way to a new politics of freedom.\n\nAbout the author:\nDavid Boaz, the executive vice president of the Cato Institute, has played a key role in the growth of the libertarian movement. He is the author of &quot;The Libertarian Mind: A Manifesto for Freedom&quot; and editor of &quot;The Libertarian Reader.&quot;\n\nThe earlier edition of &quot;The Libertarian Mind,&quot; titled &quot;Libertarianism: A Primer,&quot; was described by the Los Angeles Times as &quot;a well-researched manifesto of libertarian ideas&quot; and by Richard Epstein as &quot;unit[ing] history, philosophy, economics and law--spiced with just the right anecdotes--to bring alive a vital tradition of American political thought.&quot; His other books include &quot;The Politics of Freedom,&quot; the &quot;Cato Handbook For Policymakers,&quot; &quot;Liberating Schools,&quot; and &quot;The Crisis in Drug Prohibition.&quot; His articles have been published in the Wall Street Journal, the New York Times, the Washington Post, the Los Angeles Times, National Review, Slate, and the Encyclopedia Britannica","torrent":{"xt":"urn:btih:eebe785c6e404d3653690a4c07692bc93c1fac49","amp;dn":"The+Politics+Of+Freedom+-+David+Boaz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eebe785c6e404d3653690a4c07692bc93c1fac49","infoHashBuffer":{"type":"Buffer","data":[238,190,120,92,110,64,77,54,83,105,10,76,7,105,43,201,60,31,172,73]},"announce":[],"urlList":[]}}