{"title":"Patisserie Second Edition","uid":6608966,"size":14476722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efb95a1ab1bcdbf1039ef2bd4647e2413e93bd66&amp;dn=Patisserie+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lionzbay","files":1,"time":1313512876,"description":"\n\nAuthor(s): Leonard J Hanneman\nPublisher: Butterworth-Heinemann\nDate: 2005-11-15\nFormat: pdf\nLanguage: English\nISBN10: 0750669284\nPages: 352\nISBN13: 9780750669283\n\nProduct Description: This classic book, widely known and used by patissiers is a professional text on the art of patisserie. In the twenty years that Patisserie has been published there have been great changes in almost every aspect of this art, and the author has thoroughly updated this new edition to take account of these.\n\nUpdated in paperback format the revised edition of this classic text is now even more affordable, practical and enjoyable. Complete with the original, beautiful seventy-three colour photographs, each shows clearly how the finished product should be presented, and a wide range of diagrams demonstrate the more complex processes.\n\nNew dishes have been added, for example, pavlova, sticky toffee pudding, blinis, pasta dough, frangipan apple, cheesecake, and sugar balls, while some of the existing ones have been amended or replaced. Additional information on fruits, and on using eggs or egg substitutes in patisserie have been included. Of special interest are the chapters on equipment, commodities, and hygiene, which include the provisions of the Food Hygiene (Amended) Regulations 1990, as far as they affect the patisserie section of the catering industry.\n\n* New in paperback format, making this classic text even more affordable, practical and enjoyable\n* Lay flat binding makes cooking from this text easy\n* Complete with beautiful, original colour photographs of each finished dish","torrent":{"xt":"urn:btih:efb95a1ab1bcdbf1039ef2bd4647e2413e93bd66","amp;dn":"Patisserie+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efb95a1ab1bcdbf1039ef2bd4647e2413e93bd66","infoHashBuffer":{"type":"Buffer","data":[239,185,90,26,177,188,219,241,3,158,242,189,70,71,226,65,62,147,189,102]},"announce":[],"urlList":[]}}