{"title":"Roccos Perfect Slaves 4: American Edition (NEW 2014 Evil Angel)","uid":10995479,"size":3129854561,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:efc6ce71312666052b68f4c97f8d0853c4b37e71&amp;dn=Roccos+Perfect+Slaves+4%3A+American+Edition+%28NEW+2014+Evil+Angel%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":null,"files":4,"time":1410059227,"description":"Roccos Perfect Slaves 4: American Edition (NEW 2014 Evil Angel) (Split Scenes) \n\n\nRocco Siffredi, Ava Addams, Maddy O'Reilly, Dana Vespoli, Veronica Avluv, Toni Ribas, Erik Everhard, Allie James, Ash Hollywood.\n\nWhen Italian superstud Rocco Siffredi visits the U.S., no American girl is safe! Rocco`s Perfect Slaves #4: American Edition shows the veteran director`s continuing quest for absolute anal dominance. Rocco can`t resist redheaded MILF Veronica Avluv; he brutally pounds her experienced pussy and even sprays a bottle of champagne inside her rectum! Busty bombshell Ava Addams enlists the help of Rocco`s enormous cock to loosen up young cutie Maddy O`Reilly in a nasty, ass fucking three-way. The ladies share a hot load of Italian cum. Sultry fetish queen Dana Vespoli torments blindfolded male slaves Erik Everhard and Toni Ribas, but she quickly switches roles to slurp the guys` cock meat and take a double-penetration by their massive members. Stunning model Ash Hollywood takes turns with Rocco, overpowering bespectacled blonde beauty Allie James in a menage-a-trois of foot domination, strap-on ass fucking and creamy cum swapping.\n&quot;The American Edition of 'Perfect Slaves' is the best one of my career. I haven't worked with American girls for a long time, and what better way to start again than with perfect MILF Veronica Avluv? I have been in this business a long time, and if I only work with one MILF ever again, it would be her. We filmed this scene over five hours, and she was an orgasm machine! Just kept cumming and cumming; I can't say enough about her incredible performance. The second scene is with pretty and petite Maddy O'Reilly and another amazing MILF, Ava Addams. Maddy and I had our first anal scene together, and man can she take it forever! The next scene features beautiful blonde Ash Hollywood and lovely, amazing Jayden Lee. It's the best scene I've ever shot with Jayden, who is one of the most sexy and submissive girls I've met in my whole life. Altogether, this was a really incredible movie to shoot, and entirely for fans that love beautiful, submissive girls.&quot;\n-Rocco Siffredi\n\n\nScreens:\n\n &lt;a href=&quot;\nhttp://imgfun.biz/img-540bafa48e387.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfun.biz/img-540bafa48e387.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgfun.biz/img-540bafa4b67be.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfun.biz/img-540bafa4b67be.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:efc6ce71312666052b68f4c97f8d0853c4b37e71","amp;dn":"Roccos+Perfect+Slaves+4%3A+American+Edition+%28NEW+2014+Evil+Angel%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efc6ce71312666052b68f4c97f8d0853c4b37e71","infoHashBuffer":{"type":"Buffer","data":[239,198,206,113,49,38,102,5,43,104,244,201,127,141,8,83,196,179,126,113]},"announce":[],"urlList":[]}}