{"title":"Mozart - Cosi fan tutte","uid":5238317,"size":185329634,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f02b7e5b66c097d8152bd0a8f1bec86005636d49&amp;dn=Mozart+-+Cosi+fan+tutte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"CharlieAllnut51","files":-1,"time":1261636707,"description":"Wolfgang Amadeus Mozart\nCosÃƒÂ¬ fan tutte, K.588\n\nKiri Te Kanawa\nAnn Murray, Marie McLaughlin, Hans Peter Blochwitz\nThomas Hampson, Ferruccio Furlanetto\nKonzertvereinigung Wiener Staatsopernchor\nWiener Philharmoniker\nJames Levine\n\nRecording date:     June 1988 \nLive / Studio:      Studio \nRecording Location: Grosser Saal, Musikverein, Wien, Austria\n\nLabel: Deutsche Grammophon\n\n128/kbps MP3 CBR\n\n\nCD 1\n==================================\n1 Overture (Wiener Philharmoniker, James Levine)\n\nAct 1\n\n2 &quot;La mia Dorabella&quot; (Hans Peter Blochwitz, Thomas Hampson, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n3 &quot;E la fede delle femmine&quot; - &quot;Scioccherie di poeti!&quot; (Ferruccio Furlanetto, Hans Peter Blochwitz, Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n4 &quot;Una bella serenata&quot; (Hans Peter Blochwitz, Thomas Hampson, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n5 Ah, guarda, sorella&quot; - &quot;Mi par che stamattina&quot; - Eccoli.. Non son essi... (Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\n6 &quot;Vorrei dir, e cor non ho&quot; - &quot;Stelle! Per caritÃƒÂ , signor Alfonso&quot; (Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n7 &quot;Sento, oh Dio, che questo piede&quot; - &quot;Non piangere, idol mio!&quot; (Thomas Hampson, Hans Peter Blochwitz, Ferruccio Furlanetto, Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\n8 &quot;Al fato dan legge&quot; - &quot;La commedia ÃƒÂ¨ graziosa&quot; (Hans Peter Blochwitz, Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n9 Bella vita militar! (Wiener Philharmoniker, James Levine, Konzertvereinigung Wiener Staatsopernchor, Karl Kamper)\n\n10 &quot;Non v'ÃƒÂ¨ piÃƒÂ¹ tempo, amici&quot;-&quot;Di scrivermi ogni giorno&quot;- &quot;Dove son?&quot;-&quot;Son partiti&quot; (Kiri Te Kanawa, Ann Murray, Thomas Hampson, Hans Peter Blochwitz, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n11 &quot;Soave sia il vento&quot; (Kiri Te Kanawa, Ann Murray, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n12 &quot;Non son cattivo comico&quot; (Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n13 &quot;Che vita maledetta&quot; - &quot;Madame, ecco la vostra colazione&quot; (Marie McLaughlin, Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\n14 &quot;Ah, scostati!&quot; (Ann Murray, Wiener Philharmoniker, James Levine)\n\n15 &quot;Smanie implacabili che m'agitate&quot;-&quot;Signora Dorabella&quot; (Ann Murray, Wiener Philharmoniker, James Levine)\n\n16 &quot;In uomini, in soldati&quot; - &quot;Che silenzio!&quot; (Marie McLaughlin, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n17 &quot;Alla bella Despinetta&quot; (Ferruccio Furlanetto, Hans Peter Blochwitz, Thomas Hampson, Marie McLaughlin, Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\n18 &quot;Che sussurro! Che strepito!&quot; (Ferruccio Furlanetto, Ann Murray, Kiri Te Kanawa, Hans Peter Blochwitz, Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n19 &quot;Come scoglio!&quot; - &quot;Ah, non partite&quot; (Kiri Te Kanawa, Wiener Philharmoniker, James Levine)\n\n20 Aria alternativa: &quot;Rivolgete a lui lo sguardo&quot; (Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n21 &quot;E voi ridete?&quot; - &quot;Si puÃƒÂ² sapere un poco&quot; (Ferruccio Furlanetto, Hans Peter Blochwitz, Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n22 &quot;Un'aura amorosa&quot; (Hans Peter Blochwitz, Wiener Philharmoniker, James Levine)\n\n23 &quot;Non siate ritrosi&quot; (Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n\n\n\nCD 2\n==================================\nAct 1\n\n1 &quot;Oh, la saria da ridere!&quot; (Ferruccio Furlanetto, Marie McLaughlin, Wiener Philharmoniker, James Levine)\n\n2 &quot;Ah, che tutta in un momento&quot; (Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\n3 &quot;Si mora, sÃƒÂ¬, si mora&quot; (Hans Peter Blochwitz, Thomas Hampson, Ferruccio Furlanetto, Kiri Te Kanawa, Ann Murray, Marie McLaughlin, Wiener Philharmoniker, James Levine)\n\n4 &quot;Eccovi il medico&quot; (Ferruccio Furlanetto, Hans Peter Blochwitz, Thomas Hampson, Marie McLaughlin, Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\nAct 2\n\n5 &quot;Andate lÃƒÂ , che siete due bizzarre ragazze&quot; (Marie McLaughlin, Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\n6 &quot;Una donna a quindici anni&quot; - &quot;Sorella, cosa dici?&quot; (Marie McLaughlin, Kiri Te Kanawa, Wiener Philharmoniker, James Levine)\n\n7 &quot;PrenderÃƒÂ² quel brunettino&quot; - &quot;Ah, correte al giardino&quot; (Kiri Te Kanawa, Ann Murray, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n8 &quot;Secondate, aurette amiche&quot; - &quot;Il tutto deponete&quot; (Hans Peter Blochwitz, Thomas Hampson, Ferruccio Furlanetto, Kiri Te Kanawa, Ann Murray, Marie McLaughlin, Wiener Philharmoniker, James Levine, Konzertvereinigung Wiener Staatsopernchor, Karl Kamper)\n\n9 &quot;La mano a me date&quot; - &quot;Oh che bella giornata!&quot; (Ferruccio Furlanetto, Hans Peter Blochwitz, Thomas Hampson, Marie McLaughlin, Kiri Te Kanawa, Ann Murray, Wiener Philharmoniker, James Levine)\n\n10 &quot;Il core vi dono&quot; (Thomas Hampson, Ann Murray, Wiener Philharmoniker, James Levine)\n\n11 &quot;Barbara! PerchÃƒÂ© fuggi?&quot; (Hans Peter Blochwitz, Kiri Te Kanawa, Wiener Philharmoniker, James Levine)\n\n12 &quot;Ah, lo veggio&quot; (Hans Peter Blochwitz, Wiener Philharmoniker, James Levine)\n\n\n\n\nCD 3\n==================================\nAct 2\n\n1 &quot;Ei parte... senti... ah no!&quot; (Kiri Te Kanawa, Wiener Philharmoniker, James Levine)\n\n2 &quot;Per pietÃƒÂ , ben mio, perdona&quot; (Kiri Te Kanawa, Wiener Philharmoniker, James Levine)\n\n3 &quot;Amico, abbiamo vinto!&quot; (Hans Peter Blochwitz, Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n4 &quot;Donne mie, la fate a tanti&quot; (Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n5 &quot;In qual fiero contrasto&quot; (Hans Peter Blochwitz, Wiener Philharmoniker, James Levine)\n\n6 &quot;Tradito, schernito dal perfido cor&quot; - &quot;Bravo, questa e constanza&quot; (Hans Peter Blochwitz, Ferruccio Furlanetto, Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n7 &quot;Ora vedo che siete&quot; (Marie McLaughlin, Ann Murray, Kiri Te Kanawa, Wiener Philharmoniker, James Levine)\n\n8 &quot;E amore un ladroncello&quot; (Ann Murray, Wiener Philharmoniker, James Levine)\n\n9 &quot;Come tutto congiura&quot; - &quot;L'abito di Ferrando&quot; (Kiri Te Kanawa, Thomas Hampson, Marie McLaughlin, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n10 Fra gli amplessi - Ah, poveretto me, cosa ho veduto (Kiri Te Kanawa, Hans Peter Blochwitz, Thomas Hampson, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n\n11 &quot;Tutti accusan le donne&quot; - &quot;Vittoria, padroncini!&quot; (Ferruccio Furlanetto, Marie McLaughlin, Hans Peter Blochwitz, Thomas Hampson, Wiener Philharmoniker, James Levine)\n\n12 &quot;Fate presto, o cari amici&quot; (Marie McLaughlin, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine, Konzertvereinigung Wiener Staatsopernchor)\n\n13 &quot;Benedetti i doppi coniugi&quot; (Kiri Te Kanawa, Ann Murray, Hans Peter Blochwitz, Thomas Hampson, Wiener Philharmoniker, James Levine, Konzertvereinigung Wiener Staatsopernchor)\n\n14 &quot;Miei signori, tutto ÃƒÂ¨ fatto&quot; (Ferruccio Furlanetto, Kiri Te Kanawa, Ann Murray, Hans Peter Blochwitz, Thomas Hampson, Marie McLaughlin, Wiener Philharmoniker, James Levine, Konzertvereinigung Wiener Staatsopernchor)\n\n15 &quot;Sani e salvi&quot; (Kiri Te Kanawa, Ann Murray, Thomas Hampson, Hans Peter Blochwitz, Marie McLaughlin, Ferruccio Furlanetto, Wiener Philharmoniker, James Levine)\n","torrent":{"xt":"urn:btih:f02b7e5b66c097d8152bd0a8f1bec86005636d49","amp;dn":"Mozart+-+Cosi+fan+tutte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f02b7e5b66c097d8152bd0a8f1bec86005636d49","infoHashBuffer":{"type":"Buffer","data":[240,43,126,91,102,192,151,216,21,43,208,168,241,190,200,96,5,99,109,73]},"announce":[],"urlList":[]}}