{"title":"Charles Mingus 24 Bit Vinyl Pack","uid":8580398,"size":7541896771,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0b1477cc29cbaca31c593a667d4cad4cd90099f&amp;dn=Charles+Mingus+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"politux","files":-1,"time":1371400712,"description":"\n  Charles Mingus 24 Bit Vinyl Pack\n\n  Genre: Jazz\n  Styles: Avant-Garde Jazz, Hard Bop, Jazz Instrument\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: 2,800 - 3,100 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  Oh Yeah\n  Dynasty\n  Nostalgia in Times Square\n  Let My Children Hear Music\n  Mingus Mingus Mingus Mingus Mingus\n  The Black Saint and the Sinner Lady\n  Mingus Ah Um (180g)\n\n  Irascible, demanding, bullying, and probably a genius, Charles Mingus cut himself a uniquely iconoclastic path through jazz in the middle of the 20th century, creating a legacy that became universally lauded only after he was no longer around to bug people. As a bassist, he knew few peers, blessed with a powerful tone and pulsating sense of rhythm, capable of elevating the instrument into the front line of a band. But had he been just a string player, few would know his name today. Rather, he was the greatest bass-playing leader/composer jazz has ever known, one who always kept his ears and fingers on the pulse, spirit, spontaneity, and ferocious expressive power of jazz.\n\n  Intensely ambitious yet often earthy in expression, simultaneously radical and deeply traditional, Mingus' music took elements from everything he had experienced -- from gospel and blues through New Orleans jazz, swing, bop, Latin music, modern classical music, even the jazz avant-garde. His touchstone was Duke Ellington, but Mingus took the sonic blend and harmonies of Ellingtonia much further, throwing in abrasive dissonances and abrupt changes in meter and tempo, introducing tremendously exhilarating accelerations that generated a momentum of their own. While his early works were written out in a classical fashion, by the mid-'50s, he had worked out a new way of getting his unconventional visions across, dictating the parts to his musicians while allowing plenty of room for the players' own musical personalities and ideas. He was also a formidable pianist, fully capable of taking that role in a group -- which he did in his 1961-62 bands, hiring another bassist to fill in for him.\n\n  Along the way, Mingus made a lot of enemies, causing sometimes violent confrontations on and off the bandstand. A big man physically, he used his bulk as a weapon of intimidation, and he was not above halting concerts to chew out inattentive audiences or errant sidemen, even cashiering a musician now and then on the spot. At one of his concerts in Philadelphia -- and a memorial to a dead colleague at that -- he broke up the show by slamming the piano lid down, nearly smashing his pianist's hands, and then punched trombonist Jimmy Knepper in the mouth. For a savage physical portrait of the emotions that seethed within him, check out the photo on the cover of Duke Ellington's Money Jungle; Mingus looks as if he is about to kill someone. But he could also be a gentle giant as his moods permitted, and that quality can be felt in some of his music.","torrent":{"xt":"urn:btih:f0b1477cc29cbaca31c593a667d4cad4cd90099f","amp;dn":"Charles+Mingus+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0b1477cc29cbaca31c593a667d4cad4cd90099f","infoHashBuffer":{"type":"Buffer","data":[240,177,71,124,194,156,186,202,49,197,147,166,103,212,202,212,205,144,9,159]},"announce":[],"urlList":[]}}