{"title":"Stairway to Heaven (kdrama, complete batch, english subtitles)","uid":3664918,"size":7329332860,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f0d5380090da3a202b3f14680521d4f20ccf17e8&amp;dn=Stairway+to+Heaven+%28kdrama%2C+complete+batch%2C+english+subtitles%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Melz","files":28,"time":1176658322,"description":"Jung-suh and Song-joo grew up together. They were always there for each other. Tragedy begins when Song Joo begins his studies overseas without Jung-suh. Jung-suh&amp;#039;s father remarries Tae Mira. Mira takes in her two children from a previous marriage, Tae-hwa and Yuri. Yuri is envious of the life that Jung-suh leads and is determined to take everything away from her, including Song-joo. Tae-hwa begins to develop feelings for his stepsister, however Jung-suh still loves Song-joo. Five years later, tragedy occurs when Jung-suh gets into a car accident causing her to lose her memory. Together with Tae-hwa, they start anew. Song-joo is led to believe that she is dead. However, when they meet again one day, he is determined to remind her of the love they had for one another. When fate finally seemed to be on their side, Jung-suh is diagnosed with eye cancer. \n\nCredit for uploading this drama goes to kdrama, the rips are from their clubbox.\n\nCredits for the subs go to foB&amp;kdrama, and also KBFD.\n\nThis is an awesome drama, so be sure to watch it!!  Enjoy!!","torrent":{"xt":"urn:btih:f0d5380090da3a202b3f14680521d4f20ccf17e8","amp;dn":"Stairway+to+Heaven+%28kdrama%2C+complete+batch%2C+english+subtitles%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0d5380090da3a202b3f14680521d4f20ccf17e8","infoHashBuffer":{"type":"Buffer","data":[240,213,56,0,144,218,58,32,43,63,20,104,5,33,212,242,12,207,23,232]},"announce":[],"urlList":[]}}