{"title":"Karen Marie Moning - Darkfever (Fever Series, Book 1)","uid":4450135,"size":260917102,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f10bd7980d182f6b0002255ab29f9a7f956a5492&amp;dn=Karen+Marie+Moning+-+Darkfever+%28Fever+Series%2C+Book+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"shemyaza","files":789,"time":1224224617,"description":"Karen Marie Moning - Darkfever (Fever Series, Book 1) \n\nMacKayla Lane's life is good. She has great friends, a decent job, and a car that breaks down only every other week or so. In other words, she's your perfectly ordinary twenty-first-century woman. Or so she thinks until something extraordinary happens.\n\nWhen her sister is murdered, leaving a single clue to her death a cryptic message on Mac's cell phone Mac journeys to Ireland in search of answers. The quest to find her sister's killer draws her into a shadowy realm where nothing is as it seems, where good and evil wear the same treacherously seductive mask. She is soon faced with an even greater challenge: staying alive long enough to learn how to handle a power she had no idea she possessed a gift that allows her to see beyond the world of man, into the dangerous realm of the Fae.\n\nAs Mac delves deeper into the mystery of her sister's death, her every move is shadowed by the dark, mysterious Jericho, a man with no past and only mockery for a future. As she begins to close in on the truth, the ruthless Vlane an alpha Fae who makes sex an addiction for human women closes in on her. And as the boundary between worlds begins to crumble, Mac's true mission becomes clear: find the elusive Sinsar Dubh before someone else claims the all-powerful Dark Book because whoever gets to it first holds nothing less than complete control of the very fabric of both worlds in their hands...","torrent":{"xt":"urn:btih:f10bd7980d182f6b0002255ab29f9a7f956a5492","amp;dn":"Karen+Marie+Moning+-+Darkfever+%28Fever+Series%2C+Book+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f10bd7980d182f6b0002255ab29f9a7f956a5492","infoHashBuffer":{"type":"Buffer","data":[241,11,215,152,13,24,47,107,0,2,37,90,178,159,154,127,149,106,84,146]},"announce":[],"urlList":[]}}