{"title":"Cornershop - When I Was Born for the 7th Time [1997]","uid":10587166,"size":367898272,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1493b30904247b1c4bd73325fd9fea003e1543e&amp;dn=Cornershop+-+When+I+Was+Born+for+the+7th+Time+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GenXRock","files":-1,"time":1405758708,"description":"Review by Stephen Thomas Erlewine  [-]\nWhen I Was Born for the 7th Time is a remarkable leap forward for Cornershop, the place where the group blends all of their diverse influences into a seamless whole. Cornershop uses Indian music as a foundation, finding its droning repetition similar to the trancier elements of electronica, the cut-and-paste collages of hip-hop, and the skeletal melodicism of indie pop. Tying all of these strands together, the band creates a multicultural music that is utterly modern; it is conscious of its heritage, but instead of being enslaved to tradition, it pushes into the future and finds a common ground between different cultures and musics. Like Woman's Gotta Have It, large portions of When I Was Born for the 7th Time are devoted to hypnotic instrumentals, but the music here is funkier and fully realized. Cornershop hits an appealing compromise between detailed arrangements and lo-fi technology. There may be cheap keyboards and drum machines scattered throughout the album, but they are used as sonic texturing, similar to the turntables, synthesizers, samplers, sitars, and guitars that drive the instrumentals punctuating the full-fledged songs. When it chooses, Cornershop can write hooky, immediate pop songs -- &quot;Sleep on the Left Side&quot; and &quot;Brimful of Asha&quot; are wonderful pop singles, and &quot;Good to Be on the Road Back Home&quot; is an impressive, country-tinged tale -- but what makes When I Was Born for the 7th Time such a rich, intoxicating listen is that it balances these melodic tendencies with deceptively complex arrangements, chants, drones, electronic instrumentals, and funky rhythms, resulting in an album that becomes better with each listen. (4.5/5)","torrent":{"xt":"urn:btih:f1493b30904247b1c4bd73325fd9fea003e1543e","amp;dn":"Cornershop+-+When+I+Was+Born+for+the+7th+Time+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1493b30904247b1c4bd73325fd9fea003e1543e","infoHashBuffer":{"type":"Buffer","data":[241,73,59,48,144,66,71,177,196,189,115,50,95,217,254,160,3,225,84,62]},"announce":[],"urlList":[]}}