{"title":"ACT Made Simple- Russ Harris [PDF &amp; Epub] [StormRG]","uid":10251801,"size":14150032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f176923d395805d93576760ffd110c0d4bd93bce&amp;dn=ACT+Made+Simple-+Russ+Harris+%5BPDF+%26amp%3B+Epub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401361324,"description":"Author: Russ Harris (Author), Steven C. Hayes PhD (Foreword)\nPaperback: 280 pages\nPublisher: New Harbinger Publications; 1 edition (November 1, 2009)\nLanguage: English\nISBN-10: 1572247053\nISBN-13: 978-1572247055\nFormat: Retail Epub, Retail PDF\nReader Required: \nPDF- Adobe Reader, Adobe Digital Editions\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nFormat conversion: convert epub to mobi (Kindle) with Calibre or online &lt;a href=&quot;\nhttp://ebook.online-convert.com/convert-to-mobi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ebook.online-convert.com/convert-to-mobi&lt;/a&gt;\n\nNOTE: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nWhy is it so hard to be happy? Why is life so difficult? Why do humans suffer so much? And what can we realistically do about it? No matter how rewarding your job, as a mental health professional, you may sometimes feel helpless in the face of these questions. You are also well-aware of the challenges and frustrations that can present during therapy.\n\nIf you are looking for ways to optimize your client sessions, consider joining the many thousands of therapists and life coaches worldwide who are learning acceptance and commitment therapy (ACT). ACT is not just a proven effective treatment for depression, anxiety, stress, addictions, eating disorders, schizophrenia, borderline personality disorder, and myriad other psychological issues that focuses on mindfulness, client values, and a commitment to change. It's also a revolutionary new way to view the human condition, packed full of exciting new tools, techniques, and strategies for promoting profound behavioral change.\n\nA practical and entertaining primer, ideal for ACT newcomers and experienced ACT professionals alike, ACT Made Simple offers clear explanations of the six ACT processes and a set of real-world tips and solutions for rapidly and effectively implementing them in your practice. This book gives you everything you need to start using ACT with your clients for impressive results. Inside, you'll find: scripts, exercises, metaphors, and worksheets to use with your clients; a session-by-session guide to implementing ACT; transcripts from therapy sessions; guidance for creating your own therapeutic techniques and exercises; and practical tips to overcome 'therapy roadblocks.'\n\nThis book aims to take the complex theory and practice of ACT and make it accessible and enjoyable for both you, the therapist, and your clients.","torrent":{"xt":"urn:btih:f176923d395805d93576760ffd110c0d4bd93bce","amp;dn":"ACT+Made+Simple-+Russ+Harris+%5BPDF+%26amp%3B+Epub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f176923d395805d93576760ffd110c0d4bd93bce","infoHashBuffer":{"type":"Buffer","data":[241,118,146,61,57,88,5,217,53,118,118,15,253,17,12,13,75,217,59,206]},"announce":[],"urlList":[]}}