{"title":"Ave, César! VOSTFR WEB-DL 2015","uid":14654742,"size":1471821014,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1b7db7f61d04b3a639b81af0df5821eeea095cf&amp;dn=Ave%2C+C%26eacute%3Bsar%21+VOSTFR+WEB-DL+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"annuaireweb","files":1,"time":1463689977,"description":"Hail.Caesar.2016.FANSUB.VOSTFR.WEB-DL.XviD-TeamSuW\r\n\r\nLa folle journée d’Eddie Mannix va nous entraîner dans les coulisses d’un grand studio Hollywoodien. Une époque où la machine à rêves turbinait sans relâche pour régaler indifféremment ses spectateurs de péplums, de comédies musicales, d’adaptations de pièces de théâtre raffinées, de westerns ou encore de ballets nautiques en tous genres. Eddie Mannix est fixer chez Capitole, un des plus célèbres Studios de cinéma américain de l’époque. Il y est chargé de régler tous les problèmes inhérents à chacun de leurs films. Un travail qui ne connaît ni les horaires, ni la routine. En une seule journée il va devoir gérer aussi bien les susceptibilités des différentes communautés religieuses, pour pouvoir valider leur adaptation de la Bible en Technicolor, que celles du très précieux réalisateur vedette Laurence Laurentz qui n’apprécie que modérément qu’on lui ait attribué le jeune espoir du western comme tête d’affiche de son prochain drame psychologique.Il règle à la chaîne le pétrin dans lequel les artistes du studio ont l’art et la manière de se précipiter tous seuls. En plus de sortir une starlette des griffes de la police, ou de sauver la réputation et la carrière de DeeAnna Moran la reine du ballet nautique, Eddie Mannix va devoir élucider les agissements louches du virtuose de claquettes, Burt Gurney. Cerise sur le gâteau, il a maille à partir avec un obscur groupuscule d’activistes politique qui, en plein tournage de la fameuse superproduction biblique AVE CÉSAR lui réclame une rançon pour l’enlèvement de la plus grosse star du Studio, Baird Whitlok. Le tout en essayant de juguler les ardeurs journalistiques des deux jumelles et chroniqueuses ennemies, Thora et Thessaly Thacker. La journée promet d’être mouvementée","torrent":{"xt":"urn:btih:f1b7db7f61d04b3a639b81af0df5821eeea095cf","amp;dn":"Ave%2C+C%26eacute%3Bsar%21+VOSTFR+WEB-DL+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b7db7f61d04b3a639b81af0df5821eeea095cf","infoHashBuffer":{"type":"Buffer","data":[241,183,219,127,97,208,75,58,99,155,129,175,13,245,130,30,238,160,149,207]},"announce":[],"urlList":[]}}