{"title":"The Majestic Qur'an: An English Rendition of Its Meanings","uid":10153285,"size":24026886,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2391baca82d57528a8f554fba0c1b85902c27f2&amp;dn=The+Majestic+Qur%27an%3A+An+English+Rendition+of+Its+Meanings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1400124981,"description":"The Majestic Qur'an: An English Rendition of Its Meanings, 4th edition (The Nawawi Foundation, 2000). 610 pages.\n\nTranslators: Ali Ozek, Nureddin Uzunoglu; edited by Abdal Hakim Murad (aka Timothy Winter), Mostafa Badawi, Uthman Hutchinson\n\nSearchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThis translation of the Qur'an is little known, out of print, and very hard to find -- despite winning high praise from those who've read it -- but evidently the copyright holders have released a scanned version to the web. It can be found atand other places. That scanned version is a very large file and more difficult to use than necessary. It also has one missing page. For this version I extracted all the images from the pdf onand found another scan to supply the missing page, then processed them all with Scan Tailor before reassembling them into a new pdf. This new version is much smaller in size than its source, the page images were deskewed, centered, and cropped, and the pages are black text on a white background.\n\n\ndescription:\n\nThis translation is distinctive among the dozens of existing English translations of the Quran because of the fluidity and clarity of its language, the elegance of its style, and the inclusion of more than 800 explanatory notes. The modern standard English makes the message of the Quran easily accessible to today's reader. When curiosity arises about Islam, all roads lead to its Book. People want to read for themselves what the Quran projects: the message it offers, the spirituality it excites, and the world view it establishes. However far removed a given translation may be from the sublimity of the original Arabic text, it behooves Muslims to offer translations that not only represent the Book's message loyally but also connect and resonate with the language and idiom of its readers. The Majestic Quran succeeds on both counts. This volume contains both the Arabic text and English translation of the Quran's meanings designed in an easy-to-follow fashion.","torrent":{"xt":"urn:btih:f2391baca82d57528a8f554fba0c1b85902c27f2","amp;dn":"The+Majestic+Qur%27an%3A+An+English+Rendition+of+Its+Meanings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2391baca82d57528a8f554fba0c1b85902c27f2","infoHashBuffer":{"type":"Buffer","data":[242,57,27,172,168,45,87,82,138,143,85,79,186,12,27,133,144,44,39,242]},"announce":[],"urlList":[]}}