{"title":"Listening to Popular Music Or, How I Learned to Stop Worrying an","uid":11470648,"size":13702047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f27ce0ce08aa012a32ffcdc520327c5b6af59d77&amp;dn=Listening+to+Popular+Music+Or%2C+How+I+Learned+to+Stop+Worrying+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416078124,"description":"\nIt's long been assumed that people who prefer Led Zeppelin to Mozart live aesthetically impoverished lives. But why? In &quot;Listening to Popular Music&quot;, award-winning popular music scholar Theodore Gracyk argues that aesthetic value is just as important in popular listening as it is with &quot;serious&quot; music. And we don't have to treat popular music as art in order to recognize its worth. Aesthetic values are realized differently in different musical styles, and each requires listening skills that people must learn. &quot;Listening to Popular Music&quot; thus offers a new, general framework for understanding what it means to appreciate music, showing that an informed preference for popular music is a response to real values of the music, including aesthetic values. Boldly merging insights from popular music studies, aesthetic theory, cognitive science, psychology, identity theory, and cultural studies, Gracyk crafts an innovative study that will be essential reading for scholars, students, and general readers concerned with the role of popular music in everyday life.\n\nProduct Description\nReview\n&quot;Gracyk's arguments are thoughtful, clear, and persuasive, and it's refreshing to see him expose the flaws in commonly repeated critiques of popular music. This book will challenge open-minded doubters to take popular music seriously.&quot; - Mark Katz, Assistant Professor of Music, University of North Carolina at Chapel Hill, and author of Capturing Sound: How Technology Has Changed Music&quot;\n\nAbout the Author\nTheodore Gracyk is Department Chair and Professor of Philosophy at Minnesota State University Moorhead, and author of Rhythm and Noise: An Aesthetics of Rock and I Wanna Be Me: Rock Music and the Politics of Identity, which won the 2002 IASPM/US Book Award.\n\nPublisher: The University of Michigan Press (15 May 2007)\nLanguage: English\nISBN-10: 0472069837\nISBN-13: 978-0472069835","torrent":{"xt":"urn:btih:f27ce0ce08aa012a32ffcdc520327c5b6af59d77","amp;dn":"Listening+to+Popular+Music+Or%2C+How+I+Learned+to+Stop+Worrying+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f27ce0ce08aa012a32ffcdc520327c5b6af59d77","infoHashBuffer":{"type":"Buffer","data":[242,124,224,206,8,170,1,42,50,255,205,197,32,50,124,91,106,245,157,119]},"announce":[],"urlList":[]}}