{"title":"PlayStation Mobile Development Cookbook - Michael Fleischauer [E","uid":8736025,"size":7887325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2ae31fab5072f1f066315c20ba39389182d6605&amp;dn=PlayStation+Mobile+Development+Cookbook+-+Michael+Fleischauer+%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374685148,"description":"\nWhat you will learn from this book\n\n    Discover how to handle multiple sources of input to really help you create something unique\n    Load and animate sprites within your own 2D game to get up and running quickly with the SDK\n    Harness the power of the GameEngine 2D library to make your workflow easier\n    Add engaging physics to your game projects with amazing ease\n    Learn how to play a variety of sound effects and music and increase player immersion\n    Create and navigate a 3D world, taking your visuals to the next level\n    Use 3D models and shaders to make your projects look stunning\n    Add multiplayer functionality for exciting competitive and cooperative gameplay\n\nIn Detail\n\nWith the PlayStationÂ®Mobile SDK you can create stunning games for the PlayStationÂ®Vita and PlayStationâ„¢Certified devices (PS Certified devices). It includes everything you need to get started, including an IDE for developing your code and even an emulator to test your creations.\n\n&quot;PlayStationÂ®Mobile Development Cookbook&quot;| is an exciting and practical collection of recipes that help you make the most of this exciting new platform. It provides you with everything you need to create complete 2D or 3D games and applications that fully unlock the potential of the SDK.\n\nAfter quickly covering the basics, you'll learn how to utilize input sources like touch, gamepads, and motion controls, and then move on to more advanced content like creating and animating 2D graphics, networking, playing sound effects and music, adding physics, and then finally jumping into the world of 3D.\n\nApproach\n\nWritten as a series of engaging and practical recipes, this essential Cookbook has been meticulously designed and reviewed in order to provide you with the ultimate reference for PlayStationÂ®Mobile development.\nWho this book is for\n\nIf you've got some prior experience with C# and want to create awesome projects for the PlayStationÂ®Vita and PlayStationâ„¢Certified devices, then this book is for you.\n\n\nProduct Details\n\n    ISBN-13: 9781849694186\n    Publisher: Packt Publishing\n    Publication date: 3/25/2013\n    Pages: 322\n\n\n\nMichael Fleischauer\n\nMichael Fleischauer has spent the last 16 years working as a programmer in a number of different industries from 3D tools creation to automotive and banking. Most recently he launched the internet start-up Flexamail. In his spare time he writes for and runs the game development site GameFromScratch.com, a popular destination for game development tutorials and news. Michael was recently made the first PlayStation Mobile MVP by Sony. Michael lives in Toronto, Canada with his wife and daughter.\n","torrent":{"xt":"urn:btih:f2ae31fab5072f1f066315c20ba39389182d6605","amp;dn":"PlayStation+Mobile+Development+Cookbook+-+Michael+Fleischauer+%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2ae31fab5072f1f066315c20ba39389182d6605","infoHashBuffer":{"type":"Buffer","data":[242,174,49,250,181,7,47,31,6,99,21,194,11,163,147,137,24,45,102,5]},"announce":[],"urlList":[]}}