{"title":"[DVDRip-ac3-ITA-mp3-ENG+sub]LOVE GURU by CR-EW [CR-Bt]","uid":4754496,"size":1566116358,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2cc84b14b08e70961d8a938acf6616f1c6d882e&amp;dn=%5BDVDRip-ac3-ITA-mp3-ENG%2Bsub%5DLOVE+GURU+by+CR-EW+%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"CR-Bt","files":3,"time":1236376012,"description":"Maggiori Informazioni su: http://colombo-reloaded.org\nMore Info at: http://colombo-reloaded.org\n\nPER FAVORE RIMANETE IN SEED, GRAZIE!\nSTAY IN SEEDING AFTER DOWNLOADING, THX!\t\t\n\n\nSubtitle Italian &amp; English\n\nDarren Roanoke (Romany Malco), the star player of the Toronto Maple Leafs, is suffering from stress because his wife, Prudence Roanoke (Meagan Good), has left him for Jacques &quot;Le Coq&quot; GrandÃƒÂ© (Justin Timberlake). The stress causes his hand to shake, which affects his hockey performance. Jane Bullard (Jessica Alba) enlists the support of Guru Maurice Pitka (Mike Myers) to help Darren with his stress so that the team can hopefully break their losing streak. In addition to getting a considerable payment, Pitka would be invited to Oprah Winfrey's show, which he hopes would help him become the #1 guru, a place currently held by Deepak Chopra. Pitka succeeds, but feels no need anymore to become #1, more important is his love for Bullard. However, in connection with a vow Guru Tugginmypudha gave him a chastity belt. He returns to him to have it removed. Tugginmypudha agrees that it can be removed now, and explains how to do that; to Pitka's surprise no key is needed.\n\n\nQuando da piccolo, Pitka, americano di origine, fu abbandonato davanti alla porta di un tempio in India, i guru che ci abitavano decisero di crescerlo e prendersene cura. Una volta diventato adulto, Pitka, decide di ritornare negli Stati Uniti, dove intraprende la carriera di consulente di coppia, riuscendo a diventare ricco e famoso. La sua fama arriva sino alle orecchie della presidentessa di una squadra di hockey, che per migliorare il rendimento di uno dei suoi giocatori, che viene tradito dalla moglie, decide di assumerlo; ben presto perÃƒÂ² le attenzioni di Pitka, si spostano su Jane, la bella ed affascinante presidentessa della squadra...","torrent":{"xt":"urn:btih:f2cc84b14b08e70961d8a938acf6616f1c6d882e","amp;dn":"%5BDVDRip-ac3-ITA-mp3-ENG%2Bsub%5DLOVE+GURU+by+CR-EW+%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2cc84b14b08e70961d8a938acf6616f1c6d882e","infoHashBuffer":{"type":"Buffer","data":[242,204,132,177,75,8,231,9,97,216,169,56,172,246,97,111,28,109,136,46]},"announce":[],"urlList":[]}}