{"title":"Joe Lovano - Us Five - 2013 - Cross Culture FLAC","uid":8656698,"size":399342185,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f4619c794c08fcea6611e174d695c5e0fc151aaf&amp;dn=Joe+Lovano+-+Us+Five+-+2013+-+Cross+Culture+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1373233616,"description":"Joe Lovano - Us Five - 2013 - Cross Culture\n\nJoe Lovano's third album featuring his Us Five quintet, 2013's Cross Culture, furthers the adventurous collective aesthetic the saxophonist developed on 2009's Folk Art and 2011's Bird Songs. Once again working with drummers Francisco Mela and Otis Brown III, pianist James Weidman, and bassist Esperanza Spalding, Lovano also employs bassist Peter Slavov on a few tracks here, as well as West African guitarist Lionel Loueke. The result is an album of exploratory jazz that is often more about group interplay on various musical themes rather than straightforward improvisation on melodic compositions -- though there is that, too. Tracks like the frenetic &quot;In a Spin&quot; and the sinewy, rambling &quot;Journey Within&quot; sound like Lovano and Loueke might have written them on the spot together and, though thoughtfully composed, evince a conversational, stream-of-consciousness approach. Elsewhere, cuts like the ruminative and languid &quot;Journey Within&quot; and the atmospheric, dreamlike &quot;Golden Horn&quot; move back and forth from group interplay to extended solo sections. The musical boundary-crossing title of the album takes on more significance on &quot;Drum Chant,&quot; in which Mela, playing the West African balafon (a kind of wooden xylophone), and Brown build an insistent rhythmic palette over which Lovano and Loueke add their knotty, free-leaning improvisational lines. Interestingly, Lovano switches to the double-soprano &quot;autochrome&quot; for his solo on &quot;In a Spin,&quot; creating a bright, almost atonal sound that jumps out at you halfway through the track. The autochrome's sound also acts as a kind of response to Loueke's harplike, synthesizer-esque guitar style. In fact, both Loueke and Spalding utilize a percussive style here that complements the two-drummer approach and allows Lovano, who has always leaned more on the rhymically slippery, harmonically advanced end of the spectrum, a large musical bed to spring from. Ultimately, that's what Cross Culture is all about.\n\nTrack list:\n01 - Blessings in May\n02 - Myths and Legends\n03 - Cross Culture\n04 - In a Spin\n05 - Star Crossed Lovers\n06 - Journey Within\n07 - Drum Chant\n08 - Golden Horn\n09 - Royal Roost\n10 - Modern Man\n11 - PM\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:f4619c794c08fcea6611e174d695c5e0fc151aaf","amp;dn":"Joe+Lovano+-+Us+Five+-+2013+-+Cross+Culture+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4619c794c08fcea6611e174d695c5e0fc151aaf","infoHashBuffer":{"type":"Buffer","data":[244,97,156,121,76,8,252,234,102,17,225,116,214,149,197,224,252,21,26,175]},"announce":[],"urlList":[]}}