{"title":"Jim Marrs - The Terror Conspiracy Revisited-BoWL","uid":7115819,"size":2762835,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5959645490728feae980a1798ab355f58a8816e&amp;dn=Jim+Marrs+-+The+Terror+Conspiracy+Revisited-BoWL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BoWL","files":2,"time":1332210503,"description":"--Book Description\nPublication Date: September 27, 2011 \n\nThe year 2011 will mark the tenth anniversary of the terror attacks of September 11, 2001, those history-changing events that have come to be known simply as 9/11. In The Terror Conspiracy Revisited, the world's leading conspiracy writer updates his authoritative dissection of the official story of 9/11. This revised edition is packed with explosive new material including:\n\n    The revelations of former New Jersey attorney General John Farmer, who served as Senior Counsel to the 9/11 Commission: &quot;At some level of the government, at some point in time. . .there was an agreement not to tell the truth about what happened.&quot;\n    Commission co-chairman Thomas Kean's suspicions of deceit: &quot;We to this day don't know why NORAD told us what they told us. It was just so far from the truth.&quot;\n    The European scientists' determination that there was nano-thermite in the World Trade Center debris, a high explosive generally available only through the US military.\n    Pilots For 9/11 Truth's findings that Flight 77's flight deck door was never opened during flight, and their conclusion that hijackers could not have accessed the cockpit.\n\nWhat is the truth? It is quite simply that the truth has not yet been presented to the American public. Jim Marrs busts wide open whatever credibility the US government's version of 9/11 ever had and leaves the reader with some unsavory but indisputable conclusions.\n\nJim Marrs is the New York Times best-selling author of Rule By Secrecy, The Trillion Dollar Conspiracy: The Plot That Killed Kennedy, and Above Top Secret.","torrent":{"xt":"urn:btih:f5959645490728feae980a1798ab355f58a8816e","amp;dn":"Jim+Marrs+-+The+Terror+Conspiracy+Revisited-BoWL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5959645490728feae980a1798ab355f58a8816e","infoHashBuffer":{"type":"Buffer","data":[245,149,150,69,73,7,40,254,174,152,10,23,152,171,53,95,88,168,129,110]},"announce":[],"urlList":[]}}