{"title":"Leo Strauss and the Conservative Movement by Paul Gottfried","uid":10133074,"size":2936239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f66972929617ba6c9e905cb60d6b74ee23b72f80&amp;dn=Leo+Strauss+and+the+Conservative+Movement+by+Paul+Gottfried&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":-1,"time":1399906433,"description":"Leo Strauss and the Conservative Movement in America (2011) by Paul Edward Gottfried.pdf\n\nThis book offers an original interpretation of the achievement of Leo Strauss, stressing how his ideas and followers reshaped the American conservative movement. According to this study, Strauss and his disciples came to influence the establishment Right almost by accident. The conservative movement that reached out to Strauss and his legacy was extremely fluid and lacked a self-confident leadership. Conservative activists and journalists felt a desperate need for academic acceptability, which they thought Strauss and his disciples would furnish. They also became deeply concerned with the problem of &quot;value relativism,&quot; which self-described conservatives thought Strauss had effectively addressed. But until recently, neither Strauss nor his disciples have considered themselves to be &quot;conservatives.&quot; Strauss's followers continue to view themselves as stalwart Truman-Kennedy Democrats and liberal internationalists. Contrary to another misconception, Straussians have never wished to convert Americans to ancient political ideals and practices, except in a very selective rhetorical fashion. Strauss and his disciples have been avid champions of American modernity, and &quot;timeless&quot; values as interpreted by Strauss and his followers often look starkly contemporary.\n\n194 pages\nPublisher: Cambridge University Press; 1 edition (December 29, 2011)\nLanguage: English\nISBN-10: 1107017246\nISBN-13: 978-1107017245","torrent":{"xt":"urn:btih:f66972929617ba6c9e905cb60d6b74ee23b72f80","amp;dn":"Leo+Strauss+and+the+Conservative+Movement+by+Paul+Gottfried","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f66972929617ba6c9e905cb60d6b74ee23b72f80","infoHashBuffer":{"type":"Buffer","data":[246,105,114,146,150,23,186,108,158,144,92,182,13,107,116,238,35,183,47,128]},"announce":[],"urlList":[]}}