{"title":"SetCPU for Root Users v3.1.2 Full","uid":8704850,"size":1716238,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f6c57e3e6a629d859ddb628cf72e483b488b9979&amp;dn=SetCPU+for+Root+Users+v3.1.2+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Purplebeanz","files":1,"time":1374123265,"description":"SetCPU for Root Users v3.1.2\n\nRequirements: Android OS 2.1+\n\nOverview: Supercharge your Android device with SetCPU. A must-have tool for root users.\n\nSetCPU is a tool for changing the CPU settings on a rooted Android phone or tablet, including the Galaxy Nexus, HTC One series, Nexus S, Nexus One, Motorola Droid, Samsung Galaxy series, and most other devices. You're under control: SetCPU can improve your performance, save battery, or both!\n\nAutomate SetCPU with profiles! SetCPU allows you to set up powerful profiles to change your settings under certain conditions, such as what app is running, when the phone is asleep or charging, when the battery level drops below a certain point, when the phone's temperature is too high, or during certain times of day. See the screenshots for examples of how you might set up profiles.\n\nSetCPU's wide feature set make it useful to Android beginners and enthusiasts alike. Accelerate your processor to unleash your phone's true multitasking potential, or dial your CPU's speed down to save battery.\n\nSetCPU also includes a &quot;voltage control&quot; menu, available to certain devices with custom kernels that support it, to control undervolting to save even more battery. Keep in mind that undervolting is only available for certain kernels.\n\nRecent Changes:\nAdditional permission: Read logs is used for efficient app condition checking. That is currently all it's used for.\n\n3.0.0:\n\nProfiles tab\n- Completely rewrote profiles.\n- Older profiles will automatically be converted into new profiles.\n- Added app and day of week in addition to the older conditions, and more are coming.\n- Profiles now support combining conditions under logical trees, with nestable &quot;and,&quot; &quot;or,&quot; and &quot;not&quot; operators available. It is now possible to easily build complex profiles that take the place of multiple profiles in the older version.\n- Actions can now be selected individually.\n- Profiles can now be marked as &quot;non-exclusive,&quot; which means they will not block profiles with lower priorities from evaluating. In this case, the profiles with lower priorities will perform only actions which have not been performed by profiles with higher priorities. SetCPU will keep evaluating profiles until it reaches an &quot;exclusive&quot; profile that evaluates as true.\n- All number selectors in profiles are now in the style of the frequency selector in the main tab.\n- The new file extension for exported profile settings is &quot;.setcpu.json.&quot;\n- To prevent ambiguous situations, it's no longer possible to select priorities that have been used by other profiles.\n- The CPU temperature sensor on OMAP4 and some other devices should now be supported for profiles. The option will appear if available.\n- Notifications are now set as an action per profile and can now be non-persistent.\n- SetCPU will still use the main screen as a &quot;default profile&quot; to set if no other profiles are active. It is now possible to specify an alternate default profile by creating an exclusive profile with no conditions at priority 0.\n- SetCPU now asks for a file name before backing up profiles to storage.\n- It is now possible to share profiles without having the internal/external storage mounted.\n\nMain tab\n- IO scheduler selection has been added via a drop down menu in the main tab.\n\nBugfixes\n- Fixed a bug where the short benchmark always reported 0 ms.\n- Fixed the labels in the pie graph in system info.\n- Fixed some common crashes.\n\nPermissions:\nRoot: SetCPU needs root permissions to modify the CPU speed and other settings.\n\nStart at boot: SetCPU will start a profiles service at boot, if enabled. It also sets default boot settings, if enabled. SetCPU does not run in the background if profiles are not enabled, and becomes inactive after settings, if any, are applied.\n\nWake lock: This prevents the phone from sleeping while stress testing and benchmarking.\n\nWrite external storage: SetCPU needs to read from and write to the SD card or internal storage to back up profiles.\n\nRead phone state: The &quot;in call&quot; condition needs this to determine if the user is making a phone call or not, and trigger the profile if the user wants to.\n\nWhat's in this version:\n\n3.1.2:\n- Added support for wireless chargers in profiles.\n- Fixed more voltage bugs.\n- Multicore control menu coming soon!\n\n\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.mhuang.overclocking&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.mhuang.overclocking&lt;/a&gt;","torrent":{"xt":"urn:btih:f6c57e3e6a629d859ddb628cf72e483b488b9979","amp;dn":"SetCPU+for+Root+Users+v3.1.2+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6c57e3e6a629d859ddb628cf72e483b488b9979","infoHashBuffer":{"type":"Buffer","data":[246,197,126,62,106,98,157,133,157,219,98,140,247,46,72,59,72,139,153,121]},"announce":[],"urlList":[]}}