{"title":"Diana Ross - Every Day Is A New Day [1999, 320 kbps]","uid":5030944,"size":168395888,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f7bfeb27395d2f71a8e949fee1f174a40b31ac9e&amp;dn=Diana+Ross+-+Every+Day+Is+A+New+Day+%5B1999%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"musicalibera","files":25,"time":1248906371,"description":"DIANA ROSS -  Every Day Is A New Day (1999)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD.\nNumber of tracks 12.\n\nAmazon.com review:\n\n&quot;After ten years of making adult-contemporary ballads and weak hip/hop dance tunes, Diana Ross has finally returned to her roots - pure unabashed soul. This album is a sensuous collection of eleven breathy tunes that all but make up for her decade of mediocracy. While &quot;Love Is All That Matters&quot; isn't exactly all it was hyped up to be, the rest of the album is just astonishing. She creates soulful urban grooves (&quot;Not Over You Yet&quot;, &quot;Got To Be Free&quot;, &quot;So They Say&quot;) steaming urban jazz (&quot;Every Day Is A New Day&quot;, &quot;Sugarfree&quot;) hip/hop gospel (&quot;Hope Is An Open Window&quot;), latin balladry (&quot;Until We Meet Again&quot;), and even a Broadway production number (&quot;He Lives In You&quot;). Also included is a haunting Diane Warren-penned ballad &quot;Someone That You Loved Before&quot; and top-notch dance anthems with &quot;Carry On&quot; and not one, but two (!) hot remixes of &quot;Until We Meet Again&quot;. This album is by far the best piece of work she has come up with in years. It goes up there with &quot;The Force Behind The Power&quot; as one of the very few masterpieces she has created in over a decade, and is a must for every Diana Ross fan&quot; \n\nWikipedia bio:\n\n&quot;Every Day is a New Day&quot; is a 1999 album released by American soul singer Diana Ross, produced by among others Arif Mardin, Ric Wake, Chuckii Brooker, Bobby Guy, Steve Skinner, Hex Hector, Soul Solution, Love To Infinity and Metro and with Ross herself as executive producer. This album, released around the time of Ross' TV movie, &quot;Double Platinum&quot;, which co-starred her and Brandy, was the last contractual album she released in her second Motown tenure before being let go in 2002 and would be the last Motown studio effort until the label released the shelved jazz standards album, &quot;Blue&quot;, in 2006 and would also be Ross' last studio album of new material in seven years. One single from the album, &quot;Not Over You Yet&quot;, was remixed and became a Top 10 hit in the UK, peaking at #9. &quot;Every Day Is A New Day&quot; was released in the UK with slightly different cover graphics and an amended track listing. UK TV promotion included the ITV special &quot;An Audience With Diana Ross&quot;.&quot;\n\n\nTRACK LIST\n\nEvery Day Is A New Day\n======================\n\n01. He Lives in You \n02. Love Is All That Matters\n03. Until We Meet Again\n04. Got to Be Free \n05. Not Over You Yet \n06. So They Say \n07. Every Day is a New Day \n08. Sugar Free\n09. Someone That You Loved Before\n10. Hope Is An Open Window\n11. Carry On (Remix)\n12. Until We Meet Again (Hex Hector Mix)\n\nEnjoy and share with your fellow sisters. ;-)\n\n","torrent":{"xt":"urn:btih:f7bfeb27395d2f71a8e949fee1f174a40b31ac9e","amp;dn":"Diana+Ross+-+Every+Day+Is+A+New+Day+%5B1999%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7bfeb27395d2f71a8e949fee1f174a40b31ac9e","infoHashBuffer":{"type":"Buffer","data":[247,191,235,39,57,93,47,113,168,233,73,254,225,241,116,164,11,49,172,158]},"announce":[],"urlList":[]}}