{"title":"The Biggest Scam In The History Of Mankind (Debt Ceiling Truth)","uid":9086292,"size":348733110,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f7c4a29a3cb8cb4c5bd788460bd66412a8bb1778&amp;dn=The+Biggest+Scam+In+The+History+Of+Mankind+%28Debt+Ceiling+Truth%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"s5822607","files":2,"time":1382498805,"description":"Also available on YouTube until for the time being... It might get removed or blocked by the &quot;Powers That Be&quot; sooner or later.\n\n\n==========================================\n\nPublished on Oct 15, 2013\n\nFor more, visit: http://HiddenSecretsOfMoney.com\nYou are about to learn one of the biggest secrets in the history of the world... it's a secret that has huge effects for everyone who lives on this planet. Most people can feel deep down that something isn't quite right with the world economy, but few know what it is.\n\nGone are the days where a family can survive on just one paycheck... every day it seems that things are more and more out of control, yet only one in a million understand why. You are about to discover the system that is ultimately responsible for most of the inequality in our world today.\n\nThe powers that be DO NOT want you to know about this, as this system is what has kept them at the top of the financial food-chain for the last 100 years.\n\nLearning this will change your life, because it will change the choices that you make. If enough people learn it, it will change the world... because it will change the system .\n\nFor this is the biggest Hidden Secret Of Money.\n\nNever in human history have so many been plundered by so few, and it's all accomplished through this... The Biggest Scam In The History Of Mankind. ","torrent":{"xt":"urn:btih:f7c4a29a3cb8cb4c5bd788460bd66412a8bb1778","amp;dn":"The+Biggest+Scam+In+The+History+Of+Mankind+%28Debt+Ceiling+Truth%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c4a29a3cb8cb4c5bd788460bd66412a8bb1778","infoHashBuffer":{"type":"Buffer","data":[247,196,162,154,60,184,203,76,91,215,136,70,11,214,100,18,168,187,23,120]},"announce":[],"urlList":[]}}