{"title":"The Caretaker - Patience (After Sebald) (2012) [FLAC]","uid":8359967,"size":256038704,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f84ba8094388e78107fb1e0556446dc4e7c33803&amp;dn=The+Caretaker+-+Patience+%28After+Sebald%29+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1365594139,"description":"\n  The Caretaker - Patience (After Sebald) (2012) [FLAC]\n\n  Released: 2012\n  Duration: 49:00\n  Genre: Electronic\n  Style: Ambient, Experimental\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Everything Is On The Point Of Decline \n  02 As If One Were Sinking Into Sand \n  03 Approaching The Outer Limits Of Our Solar System\n  04 When The Dog Days Were Drawing To An End\n  05 A Last Glimpse Of The Land Being Lost Forever \n  06 The Homesickness That Was Corroding Her Soul \n  07 I Have Become Almost Invisible, To Some Extent Like A Dead Man\n  08 In The Deep And Dark Hours Of The Night \n  09 No One Knows What Shadowy Memories Haunt Them To This Day \n  10 Increasingly Absorbed In His Own World \n  11 Isolated Lights On The Abyss Of Ignorance\n  12 Now The Night Is Over And The Dawn Is About To Break\n\n  Many artists would be called prolific if they released two albums in a year, but not Leyland James Kirby. Patience (After Sebald), the score to Grant Gee's documentary about W.G. Sebald's novel The Rings of Saturn released under his Caretaker alias, arrived just eight months after the Caretaker's most popular album to date, An Empty Bliss Beyond This World (he also released an album under his own name, Eager to Tear Apart the Stars, in 2011). That he began work on this album before beginning An Empty Bliss seems fitting, given how the Caretaker's work explores time, memory, and music -- not just in a nostalgic way by choosing older music (usually on vintage 78-rpm records) as source material to digitally loop, distort, and otherwise transform, but also in more literal expressions of the brain and how it processes music. \n\n  An Empty Bliss was a tone poem about Alzheimer's patients and their disintegrating memories; one of the most acclaimed Caretaker works, Theoretically Pure Anterograde Amnesia, evoked that ailment by setting fleeting snippets of melody adrift in six hours' worth of sonic fog. All of this makes Kirby especially suited to this project. Sebald transformed a walking tour of Suffolk, England into a novel that included not only the people and places he encountered, but the memories and associations they triggered. Kirby adds further cultural layers to Patience by using a 1927 recording of Franz Schubert's Winterreise (Winter's Journey), a song cycle for voice and piano that tells the story of a poet who leaves his town in the middle of winter after discovering his beloved loves someone else, as the score's source material. That Kirby connected these two works is inspired, but the way he applies the Caretaker's approach to Winterreise is brilliant -- by stretching, looping, and abrading them until they're nothing but ghostly shadows of themselves, he transforms them into literal rings of melancholia, emphasizing the circular, wintry bleakness of the whole project. Kirby's samples focus on Winterreise's piano instead of its vocals, underscoring the music's loneliness and insularity, and this starkness is more affecting than an entire orchestra.\n\n  &quot;Everything Is on the Point of Decline&quot; opens Patience (After Sebald) and sets the tone for the rest of the album, its darkly regal melody and aged hiss evoking a descent into a midnight blizzard. Throughout the rest of the score, Kirby crafts a remarkably varied amount of nuanced moods with his samples and processing. From track to track, the hiss ranges from assaulting to soothing, sounding like blasting winds or water under ice; on &quot;Approaching the Outer Limits of Our Solar System,&quot; it suggests a vast swath of space separating the listener from the melody. The loops are just as subtle and eloquent: &quot;As If One Were Sinking into Sand&quot; expresses Sisyphean frustration when the melody trails up hesitantly, only to cut off and start over again. On &quot;When the Dog Days Were Drawing to an End,&quot; a piano flourish anticipates a murky vocal that never finishes, leaving listeners craving a resolution that never comes, and the slight pause before the melody starts on &quot;The Homesickness That Was Corroding Her Soul&quot; seems to punctuate each loop with a pensive sigh. \n\n  Kirby also takes care to craft a chiaroscuro patchwork of gentler and more despairing moments in the score, echoing the film's grainy black-and-white film stock. By balancing pieces such as the spectral &quot;No One Knows What Shadowy Memories Haunt Them to This Day&quot; with the warmer, lighter &quot;Increasingly Absorbed in His Own World,&quot; he makes the album that much more conceptually and emotionally satisfying. A meditation on transformation and melancholy, Patience (After Sebald) succeeds as beautifully evocative music to accompany the documentary, as another distinctive entry in Kirby's Caretaker discography and as an inspired blending of different works that makes its own statement.","torrent":{"xt":"urn:btih:f84ba8094388e78107fb1e0556446dc4e7c33803","amp;dn":"The+Caretaker+-+Patience+%28After+Sebald%29+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f84ba8094388e78107fb1e0556446dc4e7c33803","infoHashBuffer":{"type":"Buffer","data":[248,75,168,9,67,136,231,129,7,251,30,5,86,68,109,196,231,195,56,3]},"announce":[],"urlList":[]}}