{"title":"Glee Seizoen 2, Aflevering 9 NL SUBS","uid":6170164,"size":435153342,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f8531f11c3cc45b58ad432bc8cdf1d6adf856b29&amp;dn=Glee+Seizoen+2%2C+Aflevering+9+NL+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HBGIO","files":1,"time":1297536791,"description":"Special Education\n\nENG:\nTo prepare for sectionals, Will wants the spotlight on the team, so, to Rachel\\'s dismay, she has no solo. Meanwhile, Kurt is brimming with ideas that don\\'t fit the eight-part, no-standout harmonies of his new school. Behind the scenes, Puck must find a replacement for Kurt or they\\'re one-short of eligibility, Will is losing Emma, Tina and Artie suspect Mike and Brittany of surreptitious romance, and Santana spikes Rachel and Finn\\'s relationship with a revelation. Can the club overcome divisions and jealousies to win sectionals?\n\nNL:\nVoor te bereiden op de selecties, Will wil de schijnwerpers op het team, dus, om ongenoegen Rachel\\'s, ze heeft geen solo. Ondertussen is Kurt vol met ideeÃƒÂ«n die niet passen bij de acht-deel niet-opvallende harmonieÃƒÂ«n van zijn nieuwe school. Achter de schermen, Puck moet een vervanger voor Kurt te vinden of ze een korte in aanmerking te komen, is Will verliezen Emma, Tina en Artie verdachte Mike en Bretagne van sluikreclame romantiek, en Santana spikes Rachel en Finn\\'s relatie met een openbaring. Kan de club verdeeldheid en jaloezie aan de sectiekaarten winnen?\n","torrent":{"xt":"urn:btih:f8531f11c3cc45b58ad432bc8cdf1d6adf856b29","amp;dn":"Glee+Seizoen+2%2C+Aflevering+9+NL+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8531f11c3cc45b58ad432bc8cdf1d6adf856b29","infoHashBuffer":{"type":"Buffer","data":[248,83,31,17,195,204,69,181,138,212,50,188,140,223,29,106,223,133,107,41]},"announce":[],"urlList":[]}}