{"title":"Berserk Manga Scans Ch1-289","uid":3825483,"size":1965599805,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f9ecf9050584707ae16c0f26bb7db7bdb55e0e32&amp;dn=Berserk+Manga+Scans+Ch1-289&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lordship","files":33,"time":1191203134,"description":"These are mostly the same as the scans that are already on the site. However, I found them to be quite annoying since they are not properly formatted (filename-wise) and if you don&amp;#039;t pay attention, you might read an entire volume in the wrong order because of badly named files (leading to some strange plot twists).\n\nI have manually renamed the files, so that they will be in the right order when sorted BY NAME. You will have to have the different volumes in their own folders though, since the names are only in the right order within their volume (sorry, but that would have been too much work with no apparent use). Also, I have included a high-quality volume 1 scan that is quite rare (judging by the time it took me to hunt it down) and some pages that were missing in volume 13, also HQ volumes 4-7.\n\nAs far as I can tell, everything should be included, up to the most recent chapter. I have looked everywhere, but was unable to find HQ scans of volume 2 and 3, so you will have to deal with it (if you have them in HQ though, upload them please). Also, the later chapters are done by Evil_Genius, not Hawks as it might seem because of the folders&amp;#039; names (the reasons are purely cosmetic). Have fun with the most awesome manga in existence.","torrent":{"xt":"urn:btih:f9ecf9050584707ae16c0f26bb7db7bdb55e0e32","amp;dn":"Berserk+Manga+Scans+Ch1-289","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9ecf9050584707ae16c0f26bb7db7bdb55e0e32","infoHashBuffer":{"type":"Buffer","data":[249,236,249,5,5,132,112,122,225,108,15,38,187,125,183,189,181,94,14,50]},"announce":[],"urlList":[]}}