{"title":"Superman &amp; Batman Generations (v1 - v3) (1999 - 2004) (Bchry","uid":10676310,"size":1230564477,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fab7f59be932a02e139357452e797e5e1c214ee7&amp;dn=Superman+%26amp%3B+Batman+Generations+%28v1+-+v3%29+%281999+-+2004%29+%28Bchry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"nemesis43","files":20,"time":1406950453,"description":"Superman &amp; Batman Generations (v1 - v3) (1999 - 2004) (Bchry-DCP)\n\n\nv1\n\nWhat if Superman made his debut in 1938 and Batman made his debut a year later in 1939? What would The World's Finest team look like over the years? That's the question super-star creator John Byrne (The Uncanny X-Men, Next Men, Superman: The Man of Steel, Spider-Man: Chapter One) poses in this prestige four-issue mini-series. Over four issues, spanning one hundred years, Byrne shows the triumphs and tragedies that The Man of Steel and The Dark Knight face.\n\nv2\n\nThe 2001 sequel to the 1999 Superman &amp; Batman: Generations, this four-issue Elseworlds mini-series follows the real-time careers of The Man of Steel and The Dark Knight from their earliest days on into the future! This new series follows their adventures over eleven years rather than the decade of the previous series. Written and drawn by fan-favorite John Byrne, of X-Men, Legends, The Man of Steel, Spider-Man: Chapter One, Next Men, Wonder Woman and Lab Rats fame and colored by Trish Mulvihill. Generations II broadens it's scope to include appearances from the rest of the DC Universe. Byrne brilliantly draws in the JSA and Blackhawks during World War II; Hal Jordan's predecessor Green Lantern Abin Sur; Kid Flash, Robin, Supergirl and Wonder Girl as a junior Justice League; Deadman and Dr. Occult. \n \nThe covers are reminiscent of Byrne's work on the original Marvel Universe Encyclopedia, with the characters marching, racing or flying from one side of the cover to the other. \n\nv3\n\nJohn Byrne's ambitious twelve-issue, limited series three-quel to Superman &amp; Batman: Generations and Superman &amp; Batman: Generations II. \n \nHere, Byrne - known for his work on X-Men with Chris Claremont; Crisis on Infinite Earths follow-up Legends; Superman re-boot, The Man of Steel; Spider-Man re-boot, Spider-Man: Chapter One; X-Men: The Hidden Years; the Dark Horse creator owned Next Men; as well as work on Captain America, Doom Patrol, Fantastic Four, The Incredible Hulk, The Indiana Jones Adventures, Justice League of America, Lab Rats, Namor, The Sub-Mariner, She-Hulk, Space: 1999 and Star Trek - spans the ages here with Kirby's Fourth World New Gods and the Legion of Super-Heroes. \n \nThis is the third and final Elseworlds &quot;imaginary story&quot;, where Byrne ages Superman, Batman, and in turn the rest of the DC Universe. Generations III spans from the days of Superboy in 1925 to 2925. \n","torrent":{"xt":"urn:btih:fab7f59be932a02e139357452e797e5e1c214ee7","amp;dn":"Superman+%26amp%3B+Batman+Generations+%28v1+-+v3%29+%281999+-+2004%29+%28Bchry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fab7f59be932a02e139357452e797e5e1c214ee7","infoHashBuffer":{"type":"Buffer","data":[250,183,245,155,233,50,160,46,19,147,87,69,46,121,126,94,28,33,78,231]},"announce":[],"urlList":[]}}