{"title":"Wonder Woman v3 01-44, 600-614 + Ann (2006-2011, Digital-Empire)","uid":9609035,"size":2132063376,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:facb862e2a9c770c6516fab6c5c51e93a389fc01&amp;dn=Wonder+Woman+v3+01-44%2C+600-614+%2B+Ann+%282006-2011%2C+Digital-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1392277537,"description":"Following Greg Rucka's enormously successful run on Wonder Woman at the end of Volume 2, a new series was launched with Donna Troy as the familiar Amazonian warrior for a brief spell. This was due to the events of Infinite Crisis, when Diana snapped Maxwell Lord's neck, and afterwards was temporarily shunned by the superhero community and went into hiding. The new series had a number of different writers until Gail Simone began her own lauded run from issue 14 to issue 44, as Diana was brought back into the fold. The series was then renumbered back to 600, and after a blowout celebration of the milestone numbering, J. Michael Stracynzski took over until the end of the volume. With the New 52 relaunch, Brian Azzarello took over and has redefined Diana once again, for a brand new generation of fans.\n\nThis torrent collects the entire v3 of Wonder Woman, prior to the New 52 version, issues 01-44 and 600-614 along with the 2007 Annual. Every issue is digital, thanks to Empire. This is defintely among the best periods in Diana's long and wonderful history, so it's worth checking out if you are recent fan or a longtime reader who never got into these comics. Simone's stories in particular are great reading, IMHO. Hope you like exploring with the Princesses of the Amazon - please seed and enjoy! :-)","torrent":{"xt":"urn:btih:facb862e2a9c770c6516fab6c5c51e93a389fc01","amp;dn":"Wonder+Woman+v3+01-44%2C+600-614+%2B+Ann+%282006-2011%2C+Digital-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"facb862e2a9c770c6516fab6c5c51e93a389fc01","infoHashBuffer":{"type":"Buffer","data":[250,203,134,46,42,156,119,12,101,22,250,182,197,197,30,147,163,137,252,1]},"announce":[],"urlList":[]}}