{"title":"Ian McDonald - The Dervish House","uid":13229657,"size":540183688,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:faceef530b2e06b7ff4145c9b0e6e2128cf523b6&amp;dn=Ian+McDonald+-+The+Dervish+House&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":42,"time":1452929886,"description":"It begins with an explosion. Another day, another bus bomb. Everyone it seems is after a piece of Turkey. But the shockwaves from this random act of 21st century pandemic terrorism will ripple further and resonate louder than just Enginsoy Square.\r\n\r\nWelcome to the world of The Dervish House; the great, ancient, paradoxical city of Istanbul, divided like a human brain, in the great, ancient, equally paradoxical nation of Turkey. The year is 2027 and Turkey is about to celebrate the fifth anniversary of its accession to the European Union; a Europe that now runs from the Arran Islands to Ararat. Population pushing one hundred million, Istanbul swollen to fifteen million; Turkey is the largest, most populous and most diverse nation in the EU, but also one of the poorest and most socially divided. It's a boom economy, the sweatshop of Europe, the bazaar of central Asia, the key to the immense gas wealth of Russia and Central Asia.\r\n\r\nGas is power. But it's power at a price, and that price is emissions permits. This is the age of carbon consciousness: every individual in the EU has a card stipulating individual carbon allowance that must be produced at every CO2 generating transaction. For those who can master the game, who can make the trades between gas price and carbon trading permits, who can play the power factions against each other, there are fortunes to be made. The old Byzantine politics are back. They never went away.\r\n\r\nThe ancient power struggled between Sunni and Shia threatens like a storm: Ankara has watched the Middle East emerge from twenty-five years of sectarian conflict. So far it has stayed aloof. A populist Prime Minister has called a referendum on EU membership. Tensions run high. The army watches, hand on holster. And a Galatasary Champions' League football game against Arsenal stokes passions even higher.\r\n\r\nThe Dervish House is seven days, six characters, three interconnected story strands, one central common core--the eponymous dervish house, a character in itself--that pins all these players together in a weave of intrigue, conflict, drama and a ticking clock of a thriller.\r\n\r\n\r\n\r\nFormat: MP3\r\nBitrate: 56 Kbps","torrent":{"xt":"urn:btih:faceef530b2e06b7ff4145c9b0e6e2128cf523b6","amp;dn":"Ian+McDonald+-+The+Dervish+House","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faceef530b2e06b7ff4145c9b0e6e2128cf523b6","infoHashBuffer":{"type":"Buffer","data":[250,206,239,83,11,46,6,183,255,65,69,201,176,230,226,18,140,245,35,182]},"announce":[],"urlList":[]}}