{"title":"Peter Hamilton - The dreaming void (Void trilogy book 1)","uid":3787323,"size":1804435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fad97df77cdff7657cf81fb86a7dfa92cb5f01b0&amp;dn=Peter+Hamilton+-+The+dreaming+void+%28Void+trilogy+book+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"avattar","files":4,"time":1188323119,"description":"AD 3580. The Intersolar Commonwealth has spread through the galaxy to over a thousand star systems. It is a culture of rich diversity with a place for everyone. A powerful navy protects it from any hostile species that may lurk among the stars. For Commonwealth citizens, even death has been overcome.\n\nAt the centre of the galaxy is the Void, a strange artificial universe created by aliens billions of years ago, shrouded by an event horizon more deadly than any natural black hole. In order to function, it is gradually consuming the mass of the galaxy. Watched over by its ancient enemies, the Raiel, the Void&amp;#039;s expansion is barely contained.\n\nInigo dreams of the sweet life within the Void, and shares these visions with billions of avid believers. When he mysteriously disappears, Inigo&amp;#039;s followers decide to embark on a pilgrimage into the Void to live the life of their messiah&amp;#039;s dreams - a pilgrimage which the Raiel claim will trigger a catastrophic expansion of the Void.\n\nAaron is a man whose only memory is his own name. He doesn&amp;#039;t know who he used to be, or what he is. All he does know is that his job is to find the missing messiah and stop the pilgrimage. He&amp;#039;s not sure how to do that, but whoever he works for has provided some pretty formidable weaponry that ought to help.\n\nMeanwhile inside The Void, a youth called Edeard is coming to terms with his unusually strong telepathic powers. A junior constable in Makkathran, he starts to challenge the corruption and decay that have poisoned the city. He is determined that his fellow citizens should know hope again. What Edeard doesn&amp;#039;t realize is just how far his message of hope is reaching.","torrent":{"xt":"urn:btih:fad97df77cdff7657cf81fb86a7dfa92cb5f01b0","amp;dn":"Peter+Hamilton+-+The+dreaming+void+%28Void+trilogy+book+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fad97df77cdff7657cf81fb86a7dfa92cb5f01b0","infoHashBuffer":{"type":"Buffer","data":[250,217,125,247,124,223,247,101,124,248,31,184,106,125,250,146,203,95,1,176]},"announce":[],"urlList":[]}}