{"title":"Handbook of Petroleum Processing 2nd ed","uid":14828827,"size":56455200,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb297b25d3f1398753ca65d043e99b7051fb31d9&amp;dn=Handbook+of+Petroleum+Processing+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1465323254,"description":"Handbook of Petroleum Processing 2nd ed - Steven A. Treese et al. (Springer, 2015).pdf\r\n\r\nISBN 978-3-319-14528-0\r\n\r\nThis extensively updated second edition of the already valuable reference targets research chemists and engineers who have chosen a career in the complex and essential petroleum industry, as well as other professionals just entering the industry who seek a comprehensive and accessible resource on petroleum processing. The handbook describes and discusses the key components and processes that make up the petroleum refining industry. Beginning with the basics of crude oils and their nature, it continues with the commercial products derived from refining and with related issues concerning their environmental impact. More in depth coverage of many topics previously covered in the first edition, such as hydraulic fracturing or fracking as it is often termed, help ensure this reference remains a relevant and up-to- date resource.\r\n\r\nAt its core is a complete overview of the processes that make up a modern refinery, plus a brief history of the development of processes. Also described in detail are design techniques, operations and in the case of catalytic units, the chemistry of the reaction routes. These discussions are supported by calculation procedures and examples, which enable readers to use today’s simulation-software packages. The handbook also covers off-sites and utilities, as well as environmental and safety aspects relevant to the industry. The chapter on refinery planning covers both operational planning and the decision making procedures for new or revamped processes. Major equipment used in the industry is reviewed along with details and examples of the process specifications for each.\r\n\r\nAn extensive glossary and dictionary of the terms and expressions used in petroleum refining, plus appendices supplying data such as converging factors and selected crude oil assays, as well as an example of optimizing a refinery configuration using linear programming are all included to aid the reader.\r\n\r\nThe 2nd edition of the Handbook of Petroleum\r\nProcessing is an indispensable desk reference for chemists and engineers as well as an essential part of the libraries of universities with a chemical engineering faculty and oil refineries and engineering firms performing support functions or construction","torrent":{"xt":"urn:btih:fb297b25d3f1398753ca65d043e99b7051fb31d9","amp;dn":"Handbook+of+Petroleum+Processing+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb297b25d3f1398753ca65d043e99b7051fb31d9","infoHashBuffer":{"type":"Buffer","data":[251,41,123,37,211,241,57,135,83,202,101,208,67,233,155,112,81,251,49,217]},"announce":[],"urlList":[]}}