{"title":"Low Sodium Cookbook by Shasta Press","uid":9649205,"size":2663858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb7b7b27f24db11c446260bba8516e30b476edd6&amp;dn=Low+Sodium+Cookbook+by+Shasta+Press&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":2,"time":1393047448,"description":"\nA low-sodium diet does not have to be a flavorless diet.\nChanging your eating habits can be difficult. The Low Sodium Cookbook offers small changes in your dietary habits that yield big health improvements. A guide to low-sodium eating, The Low Sodium Cookbook includes tips for shopping and cooking, and provides delicious recipes for your favorite dishes and comfort foods, so you feel satisfied and fulfilled by your new diet, not deprived.\n\nWith over 100 easy and delicious recipes, The Low Sodium Cookbook provides nutritious low-sodium meals without compromising flavor. The Low Sodium Cookbookincludes:\n\nLow-sodium versions of classic favorites, such as Heart-Healthful Cobb Salad, Lemony Chicken Noodle Soup, Savory Turkey Meatloaf with Mushrooms, and The Best Oatmeal-Chocolate Chip Cookies\nOver 100 delicious and low-sodium recipes, including dozens of budget-friendly, easy-to-make, low-fat recipes\nLow-sodium dietary guidelines, healthful cooking techniques, and tips for shopping, reading food labels, and eating out without overdosing on salt\nA 14-Day Low-Sodium Meal Plan to help get you started on a low-sodium diet\n\nReducing your sodium intake could save your life. The Low Sodium Cookbook is your complete guide to following a low-sodium diet and enjoying delicious heart-healthful recipes.\n\nGenre: Non-Fiction, Cookery","torrent":{"xt":"urn:btih:fb7b7b27f24db11c446260bba8516e30b476edd6","amp;dn":"Low+Sodium+Cookbook+by+Shasta+Press","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb7b7b27f24db11c446260bba8516e30b476edd6","infoHashBuffer":{"type":"Buffer","data":[251,123,123,39,242,77,177,28,68,98,96,187,168,81,110,48,180,118,237,214]},"announce":[],"urlList":[]}}