{"title":"Worms Reloaded","uid":7245634,"size":371426838,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fc1c7986f8a036c5eb8a0bd24f1cb3de9f817f1a&amp;dn=Worms+Reloaded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rayanwin","files":4,"time":1336275150,"description":"Worms Reloaded Full + Crack-SKIDROW\n\nDescription: Worms Reloaded is a turn based artillery game, in which players command a team of up to four worms; during each turn the player controls a single one of his or her worms. In the standard gameplay, the objective is to eliminate all enemy worms and be the last team standing. There is also a &quot;race&quot; mode where the objective is to reach the end point in less time.\nWhen &quot;Artillery&quot; mode is not enabled, worms can move across the landscape. Movement is primarily accomplished through crawling and jumping, but items such as the jet pack and ninja rope can enable much faster travel and access to more terrain. The player has a preset amount of time to move or attack with the worm before the turn ends (5 to 90 seconds). Once the player uses a weapon, the &quot;escape&quot; timer starts, giving up to five seconds to move the worm to a safe position before the turn ends.\nReloaded features a wide variety of weapons, some based on real weapons and others imaginary. Some weapons fire in straight line, such as the shotgun, but many such as grenades and bazooka shells follow curved trajectories (from gravity and wind) and can attack distant targets behind obstacles. Several animal weapons such as the sheep and ferrets will move along the landscape and then explode. There are also several &quot;air strike&quot;-type weapons which are dropped from the sky towards the intended target.\nA worm can be killed in two ways, either by having its health reduced to zero or by falling into the water below the landscape and drowning.\nWeapons, utilities (such as jet packs and blowtorches), and health kits can be randomly airdropped into the level if selected as part of the game scheme.\n\nWorms Reloaded Full + Crack-SKIDROW","torrent":{"xt":"urn:btih:fc1c7986f8a036c5eb8a0bd24f1cb3de9f817f1a","amp;dn":"Worms+Reloaded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc1c7986f8a036c5eb8a0bd24f1cb3de9f817f1a","infoHashBuffer":{"type":"Buffer","data":[252,28,121,134,248,160,54,197,235,138,11,210,79,28,179,222,159,129,127,26]},"announce":[],"urlList":[]}}