{"title":"Godspeed You! Black Emperor - Allelujah!... [24 bit FLAC] vinyl","uid":8345168,"size":1722120363,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fca463511f7898d26a13fbe91f5eba4c7121c941&amp;dn=Godspeed+You%21+Black+Emperor+-+Allelujah%21...+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"24.96","files":-1,"time":1365181857,"description":"  Godspeed You! Black Emperor - Allelujah! Don't Bend Ascend (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Source: CST081-1 / Canada\n  Genre: Pop/Rock\n  Style: Post Rock, Electronic\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A. Mladic 19:54 \n  B. We Drift Like Worried Fire 19:58 \n  C. Their Helicopters' Sing 6:30 \n  D. Strung Like Lights At Thee Printemps Erable 6:31\n\n  When Godspeed You! Black Emperor reassembled to tour in 2011 after nearly a decade off, fans were simultaneously excited and filled with trepidation. Despite the fact that there was precious little new material in the show, the rearrangements of particular tunes from their repertoire proved that they were still well invested in expanding on what they'd built. A few short weeks before its release, GY!BE announced 'Allelujah! Don't Bend Ascend, their first new album in a decade. Now expanded to a nine-piece, the album features four tracks. There are two longer ones clocking in at 20 minutes each, and a pair at around six-and-a-half. Fans will be familiar with the longer tunes, &quot;Mladic&quot; and &quot;We Drift Like Worried Fire&quot; have been in the band's live set since 2002. That said, they have been thoroughly re-imagined and expanded for this larger ensemble. &quot;Mladic&quot; commences with the now-trademark sampled, obscure vocal tracks. It opens in a simulated Middle Eastern mode played by a treated violin, sounding like a ney. The distorted guitars and bass commence as a drone, as a detuned slide carries dissonance into it that gradually gives way to a wall of churning guitars in alternate tunings, wailing strings, and deep thudding drums. Its orchestral changes in the last third are GY!BE at their most aggressive. By contrast, the other long work, &quot;We Drift Like Worried Fire,&quot; is almost a suite. Low bass drones, plucked guitars, and strings that suggest an Eastern European folk melody introduce it, answered by guitars; some playing distorted, restrained sonics, while others offer plucked, repetitive lines. The result is a languid, yet lovely, melodic series of repetitions. The strings enter to create a second, minimalist lyric line. Drums, feedback, and bass gradually quicken the pace until it gels into an intense, gorgeously melodic, and thunderous epic that soars. It disintegrates midway to assert another part of the journey, more minimal and tense. The musical dialogue is by turns contrapuntal, sinister, and elegiac before rising once more to a dramatic peak before feedbacking to close. &quot;Their Helicopters Sing&quot; and &quot;Strung Like Lights at Thee Printemps Erable&quot; are the shorter new works. (On the LP version, they're on a separate 7&quot; single.) They act as pauses, different tonal meditations between the extended works. Both are based on slow drones, and explore more dissonant, cacophonous, electronic elements in GY!BE's sound. They offer rich, spacious entries into different, far more experimental aspects of the group's soundworld. It would be inaccurate to call 'Allelujah! Don't Bend Ascend a major work on the scale of Lift Your Skinny Fists Like Antenna To Heaven. That said, given the discipline and experimentation in the short pieces, and in the creative imagination displayed in rearranging the longer ones to accommodate a larger band, 'Allelujah! Don't Bend Ascend proves that GY!BE still has plenty of captivating things to say.","torrent":{"xt":"urn:btih:fca463511f7898d26a13fbe91f5eba4c7121c941","amp;dn":"Godspeed+You%21+Black+Emperor+-+Allelujah%21...+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fca463511f7898d26a13fbe91f5eba4c7121c941","infoHashBuffer":{"type":"Buffer","data":[252,164,99,81,31,120,152,210,106,19,251,233,31,94,186,76,113,33,201,65]},"announce":[],"urlList":[]}}