{"title":"Windows XP Media Center Edition (Genuine Garunteed)","uid":6151742,"size":608637243,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd2423e9d59ad3e5b7dd4672974abad6fc30de21&amp;dn=Windows+XP+Media+Center+Edition+%28Genuine+Garunteed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SanctusSecurity","files":4,"time":1296900563,"description":"Sanctus Security Is Proud To Present Another Wonderful Torrent\n\n\n\nProduct: Microsoft Windows XP Media Center Edition 2005 (SP2)\nOS Platform: (x86) (32 Bit)\nSize: 580 MB\nSetup Type: OS Install\nLanguage: English\nService Pack: SP2\n\n\n\n\n\nYour Computer Must Meet These Requirements To Run Windows XP...\n\n\n    300 MHz Processor\n    128MB RAM\n    1.5GB Available Hard Drive Space\n    CD-ROM Drive\n\n\n\n\nProduct Key:  HYHV7-W343F-9TCCK-JPCBM-B2FQ8\n\n\n\n\nDuring the first part of setup, it will say &quot;Microsoft Windows XP Professional&quot;. This is normal, and it will install Media Center Edition 2005.\n\nSATA drivers have been integrated into this copy, so you should have no issues installing to a SATA hard drive (HDD) or solid state drive (SDD).\n\nThis copy of Windows XP uses a very special method of activation. It tricks the computer into thinking it has booted in safe mode (when it really has not), therefore skipping product activation at log on. It loads the product key into the Windows files, making your computer forever genuine. The best part is that you can continue to use Windows Update with no worries of an update overwriting the patch.\n\n\n\nIMPORTANT NOTE: You must leave the installation disc in the disc drive until 2 minutes after your first user log in. Otherwise, this copy will not be activated. Be sure to check your activation status after you have logged in, and if it has not activated, browse to the folder on the installation disc named &quot;APPLICATIONS&quot; , go to the folder &quot;Activation&quot;, then &quot;Manual Activation&quot;, and open the file &quot;Active Nexus 1.0.bat&quot;.\n\n\n\nThe disc is in ISO (Disc Image) format, so you will need to use a program that burns ISO files. You can use nLite (http://www.nliteos.com/), or some other disc image burner such as Nero.\n\nThe disc image we modified before we integrated drivers and updates was ripped from an original HP OEM re-installation disc. If you have any issues installing, please leave a comment. \n\n\nThe original installation disc was 748MB, and you therefore had to burn it to a DVD disc, wasting valuable space on the DVD disc. We have removed some features that are rarely used to make this ISO small enough to burn to a CD-R or CD-RW disc. Below are the features we removed....\n\n\n\n\nApplications\n\n  - Internet Games\n  - Pinball\n  - Default Screensavers\n  - Clipbook Viewer\n\n\nDrivers\n\n  - Logitech WingMan\n  - Modems\n  - Printers (You Can Install Your Own Driver)\n  - Scanners (You Can Install Your Own Driver)\n\n\nHardware Support\n\n  - Iomega Zip Drive\n\n\nMultimedia\n\n  - Music Samples\n  - Old &quot;CD Player&quot; And &quot;Sound Recorder&quot;\n  - Speech Support (You Can Download This Software)\n\n\nNetwork\n\n  - MSN Explorer\n\n\nOperating System Options\n\n  - Search Assistant (The Annoying Dog In Windows Search)\n  - Windows Your\n\n\nServices\n\n  - Indexing Service\n\n\n\n\n\n\nVERY IMPORTANT NOTE: During installation, it will ask you for to enter a password for the administrator account. There will be some text already in the box (unmasked, it is &quot;zx132&quot;). ERASE ALL THE TEXT IN BOTH BOXES and continue installing without a password for the administrator account!\n\n\n\n\n\n\nIf for some reason, you cannot install because setup tells you that you are using an incorect product key, one fix is to download and install nLite, and use it to change the itegrated product key. That should fix the problem. \n\n\nTEST THIS IN VIRTUALBOX OR OTHER VIRTUALIZATION SOFTWARE BEFORE YOU BURN THIS ISO TO A DISC\n\n\nPlease seed!\n\n\n\nSanctus Security (2/5/2011)\nTorrent Compiled By:  CyberFerret32 (Head Of Sanctus Security)","torrent":{"xt":"urn:btih:fd2423e9d59ad3e5b7dd4672974abad6fc30de21","amp;dn":"Windows+XP+Media+Center+Edition+%28Genuine+Garunteed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2423e9d59ad3e5b7dd4672974abad6fc30de21","infoHashBuffer":{"type":"Buffer","data":[253,36,35,233,213,154,211,229,183,221,70,114,151,74,186,214,252,48,222,33]},"announce":[],"urlList":[]}}