{"title":"Mommys Girl - Cherie DeVille, Alina West {HD-1080p]","uid":11856213,"size":1323942929,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:fd5ab3c391de6b93e45fd08f45f86d7d84bdd02c&amp;dn=Mommys+Girl+-+Cherie+DeVille%2C+Alina+West+%7BHD-1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"H4ckuos","files":1,"time":1430160561,"description":"Mommys Girl - Cherie DeVille, Alina West {HD-1080p]\nAlina needed some time to herself today, venting in her diary about the fight she had with her step mom Cherie. Alina is somewhat frustrated that her mom spends all her time in the kitchen preparing food. Having a mom cooking food for the family shouldn't be an issue, but Alina explains that Cherie's obsession with cooking has taken priority over quality time with Alina and her father. Alina thinks it's time to step up and advocate that her mom needs to pay more attention to her than her cooking, no matter what it takes... Alina's plot is to seduce her mother, wanting Cherie to touch her skin and teach her about sex. She fantasizes about Cherie kissing her passionately, and dominating her entire body. Alina decides it's time to make it happen. Alina confides in Cherie, admitting that she's way more interested in the girls at school than the boys. Alina also confesses that she's attracted to her step mom. Cherie, accepting her daughter's flirtation, begins fulfilling her sexual needs. Cherie removes her top and Alina follows. They kiss gently until Cherie eases her fingers into Alina panties. She massages Alina's pussy in circling motions. Alina cannot help but moan with pleasure. Cherie knows she's pleasing her daughter, and continues by removing her underwear and spreading Alina's legs on the kitchen table. Cherie's pussy licking, fingering and tribbing lead to Alina erupting with multiple orgasms. With both mother and daughter sexually ful filled, Cherie promises Alina she will continue to please her whenever she likes as long as Alina will be Cherie's little helper. Alina cannot refuse a great compromise. \n &lt;a href=&quot;\nhttp://xxxhost.info/img-553e6943edfc2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-553e6943edfc2.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.info/img-553e6947d33ca.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-553e6947d33ca.html&lt;/a&gt;","torrent":{"xt":"urn:btih:fd5ab3c391de6b93e45fd08f45f86d7d84bdd02c","amp;dn":"Mommys+Girl+-+Cherie+DeVille%2C+Alina+West+%7BHD-1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd5ab3c391de6b93e45fd08f45f86d7d84bdd02c","infoHashBuffer":{"type":"Buffer","data":[253,90,179,195,145,222,107,147,228,95,208,143,69,248,109,125,132,189,208,44]},"announce":[],"urlList":[]}}