{"title":"eMule Plus 1.2e","uid":4857381,"size":2685642,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd6fddaeaee408f5b37d2bccec599c2ec820e04d&amp;dn=eMule+Plus+1.2e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1240117328,"description":"Copied from eMule Plus Homepage:\n\n\neMule Plus is a new generation eMule compatible client created to improve the original GUI and to bring you the best experience ever. Give it a try and feel the boogie ;) eMule Plus does not contain any spyware, adware or the like.\nIt's an open source project released under General Public License (GPL).\nIt's free to download and use.\n\neMule Plus was achieved thanks to the extensive work of Aw3, DonGato, Eklmn, kuchin and KuSh and through the collaboration of all the people sending us code.\nWe also thank the dedication BavarianSnail, bond006, Cax2, DropF, DrSiRiUs, EC, FoRcHa, katsyonak, morphis, SyruS, Lord KiRon, moosetea, morevit, netwolf, obaldin, Purity, reCDVst, TwoBottleMod and zegzav gave to the project.\nWe wish them the best of the luck in their lives.\n\nWe want to thank all beta testers and translators who gave part of their lives to make this application better. Keep up the good work!\n\n\n\nFeatures:\n\n\nThis is a comprehensive list of eMule Plus features\n\n* Completely Free: eMule Plus is an open source project released under General Public License (GPL), as well as it doesn't contain any spyware, adware or the like. It's free to download and use.\n\n* Improved GUI: the client has been redesigned to have a more intuitive and appealing GUI. Servers, Transfers and Statistics windows has been revamped for better screen usage and greater customization.\n\n* Web Server: originally conceived in eMule Plus but now on official this 'light' interface is useful to remotely control your client. It's evolving each day, adding features to make it better while not making it a resource hog.\nWe have some extended features as Intruder Detection, A4AF support, a graphical queue list, client version information, automatic compression support (gzip) and much more. eMule XP and eMule Light templates are now included in the main distribution as eye candy or simplified interfaces to our Web Server.\nTemplates are optimized to reduce required traffic while keeping compatibility with different browsers.\n\n* Better Interface Design: we take special care in the interface design, so you won't see any misplaced box or a cut string. Images used in our client and sites are done the best way possible by Graphic Designers to be more appealing and meaningful.\n\n* Localization: eMule Plus has its own team of translators localizing new strings. Currently supported languages: Basque, Belarusian, Catalan, ChineseSimplified, ChineseTraditional, Croatian, Czech, Danish, Dutch, English, Extremaduran, Finnish, French, German, Greek, Hebrew, Italian, Korean, Lithuanian, Malay, Norwegian, Polish, Portuguese (Brazil), Portuguese (Portugal), Romanian, Russian, Serbian, Slovenian, Spanish, Turkish, Ukrainian.\n\n* Our Own Team of Betatesters: eMule Plus team has an extensive team of beta testers, including Windows 9x users, releasers and a lot of different system configurations are daily tested. We have an extensive testing process before a release. This doesn't mean the client won't have bugs, but there will be less of them or they won't affect the majority of the users.\n\n* Static Servers Priority: priority for static servers can be changed from the GUI without users having to change the configuration files directly.\n\n* Rating/Comments of Files: a better rating information has been added to help users to get an idea of the file rating. With several levels of quality and a special icon to inform users about fakes. This system accumulates ratings of remote users and calculates an average value shown to you in the thermometer style.\n\n* Upload Progress: a different and improved upload progress bar is used to give a better glimpse of the status of a client downloading from you.\nIt shows the number of parts each client has as well as currently downloading part.\n\n* A4AF (Asked for Another File) Management: the ed2k protocol allows only one file to be transferred at the same time from a single client, so other requests to the same user are queued until the transferring file is completed.\nOur client shows you sources that have been requested for other files in each single file sources list and allows you to force them to switch to another file.\n\n* Stored Sources: when you close your client for long periods sources are lost. Most of them can be recovered with the sources exchange protocol but for rare files the obtained sources from other sessions can be lost.\nStored Sources allows you to store sources in a file to be retrieved again when you restart your client.\n\n* Better Client Information: client software as well as the status is shown with different mule icons. Different colors related to the official color of the software are used to give a better insight on the client type distribution in your queues and the status of the clients you connect to or those connecting to you. Credits, friends and banning statuses are also shown with different icon modifications.\n\n* Unneeded Sources: there are sources in your download queue which sometimes don't have chunks for the file you're downloading, so they are using a slot while not being useful for us. This kind of sources are removed automatically when the max sources limit for a file is reached.\n\n* Download Queue Progress: queue progress is shown with color coding (progression, regression or the same position) and information about how many positions were gained or lost after previous source status check.\n\n* Destination Directory: you can set a different (from the main incoming directory) destination directory for every downloading file.\nAfter completion, a file will be transferred to that directory.\n\n* Filename Cleanup: automatically or manually activated, this feature allows you to clean filenames. Unwanted advertisement strings or non-cased files can be formatted in a more pleasant way.\n\n* Improved Search: you can search files not containing strings.\nThere is also support for FileDonkey and eMugle web service searches.\nSearch with Unicode allows to search for files containing non-Latin characters. The selected search method is also retained between sessions, so you won't need to change it to your preferred choice every time you start a new search.\n\n* Enhanced Information for Search Results: additional information is available providing the date when servers saw a complete source for the specific file last time. This information can be very helpful during file selection as it shows the risk of staying with incomplete file. Media information (length, bitrate and codec) is provided for media content files in search results.\nAverage file rating (comments are unaccessible) collected by servers is available as well together with the estimation of the number of voted users.\n\n* Related Files Search: a related search gives the files that are the most published by the clients who share the given file set.\nIt can be used to detect related (companion) files, but also anomalies in files distribution.\n\n* Part Traffic: spreading information in p2p applications is vital.\nKnowing which files are already well spread and which are not is something that releasers request a lot. This information can be obtained from the clients currently downloading from you or by storing all transfers information.\nThe Plus team believe that the second method is better because you know how your client actively performed.\n\n* Part Status: sometimes, old and not well designed clients asks for parts which are already well spread while not asking for rare parts.\nThis isn't useful for the network because files need more time to be spread.\nWith this in mind a feature that allows you to disable access to these parts has been bundled in the client.\n\n* JumpStart: the initial release of a file is mostly chaotic.\nThe problem is that some parts of the file are transferred hundred of times while others are not transferred at all. JumpStart automatically controls a release while supervising the spread of the different chunks by hiding well spread parts. This is an automated and intelligent process.\n\n* Upload System (zz): the ed2k protocol has been designed in a way only full chunks are shared. As chunks have a size of 9Mb you need to complete them before sharing that part to the world. The zz Upload System prioritizes the upload of full chunks while maximizing your upload speed with trickle slots.\nThese slots use the remaining bandwidth not used by the other downloading clients. The speed of spreading parts is prioritized instead of a level transfer speed between all the downloading clients, guaranteeing a faster spread of files on the network.\n\n* Small and Rare Files Boost: higher score for rare and small file requests in waiting queue, what increases chances to upload rare files as well as faster spread small files.\n\n* Shell Menu: for shared files a shell menu is provided bringing you the file handling options supported by the operating system.\n\n* Double-click Behavior: provides a possibility to configure the double-click action for sources and files, letting a user decide which way is better.\n\n* Font Configuration: allows customization of the font style and size used within IRC/chat/log windows.\n\n* Smooth File Completion: while using a custom made copy routine instead of not quite performing system one, completing files now let you with a much more responsive system.\n\n* Message Filtering: allows you to disable messages containing filtered words from being shown. There is an option to keep them in the log.\n\n* Comment Filtering: allows you to disable comments containing filtered words from being shown. There is an option to keep them in the log.\n\n* Intelligent Chunk Request (ICR): the Intelligent Chunk Request system allows faster file downloading by concentrating on the rarest and (or) complete chunks.\n\n* Lancast: saves bandwidth and increases download speeds in dual network capacity environments (your PC is on the internet, but also on a LAN with other eMule clients). Your client will discover other local/LAN sources and will upload to these clients above your client's normal upload limits, using multi-cast.\nUseful for people who share an Internet connection with other eMule Plus users (student networks, home networks and Metropolitan Area networks as long as they support multi-cast data).\n\n* Complete Sources: a new column in Shared Files window which shows a range of possible values for the number of complete sources, for the files you're currently sharing. If you didn't receive enough data to calculate a total range, you will see an approximate value preceded by a sign &quot;Tips - useful not visible features&quot;.\n\n* Shared File Permission: permission to show a file in the shared files list which can be requested by a remote user. This feature provides comprehensive flexibility to report only desirable shared files for particular user category.\n\n* Auto Download Lists: every X minutes client downloads Xml files from preconfigured locations, which contain ed2k links, those links are automatically added to download into specified categories.\nUseful for first spreading of files inside groups, etc.\n\n* Improved Source Exchange: tracks all file requests (not only clients waiting for some file in waiting queue) what provides more sources for source exchange requests as some clients can request several files.\n\n* Large File Support: eMule protocol extension to support large files (&gt; 4GB). Maximum supported file size is 512 GB - 1 byte (549,755,813,887 bytes).\n\n\nED2K Link:\ned2k://|file|eMulePlus-1.2e.Installer.exe|2685642|A22F1F734EFC64A3A924C85072A335A3|h=FN3IFHJVJLVMHVDZJ4FKAZ77HKDNTIDV|/","torrent":{"xt":"urn:btih:fd6fddaeaee408f5b37d2bccec599c2ec820e04d","amp;dn":"eMule+Plus+1.2e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6fddaeaee408f5b37d2bccec599c2ec820e04d","infoHashBuffer":{"type":"Buffer","data":[253,111,221,174,174,228,8,245,179,125,43,204,236,89,156,46,200,32,224,77]},"announce":[],"urlList":[]}}