{"title":"REM - Monster 1994 [FLAC] - Kitlope","uid":4283420,"size":339691107,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe510cf9bbc38322c37290a85fe969fd35893b16&amp;dn=REM+-+Monster+1994+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Kitlope","files":17,"time":1215550633,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: FE510CF9BBC38322C37290A85FE969FD35893B16\nFile Size: 324 Mb.\nYear: 1994\nLabel: Warner Bros.\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nR.E.M. is an American rock band formed in Athens, Georgia, in 1980 by Michael Stipe (lead vocals), Peter Buck (guitar), Mike Mills (bass guitar), and Bill Berry (drums and percussion). R.E.M. was one of the first popular alternative rock bands, and gained early attention due to Buck&amp;#039;s ringing, arpeggiated guitar style and Stipe&amp;#039;s unclear vocals. R.E.M. released its first single, &quot;Radio Free Europe&quot;, in 1981 on the independent record label Hib-Tone. The single was followed by the Chronic Town EP in 1982, the band&amp;#039;s first release on I.R.S. Records. In 1983, the band released its critically acclaimed debut album Murmur, and built its reputation over the next few years through subsequent releases, constant touring, and the support of college radio. Following years of underground success, R.E.M. achieved a mainstream hit in 1987 with the single &quot;The One I Love&quot;. The group signed to Warner Bros. Records in 1988, and began to espouse political and environmental concerns while playing large arenas worldwide.\n\nBy the early 1990s, when alternative rock began to experience broad mainstream success, R.E.M. was viewed as a pioneer of the genre and released its two most commercially successful albums, Out of Time (1991) and Automatic for the People (1992), which veered from the band&amp;#039;s established sound. R.E.M.&amp;#039;s 1994 Monster was a return to a more rock-oriented sound. The band began its first tour in six years to support the album; the tour was marred by medical emergencies suffered by three band members. In 1996, R.E.M. re-signed with Warner Bros. for a reported US$80 million, at the time the most expensive recording contract in history. The following year, Bill Berry left the band amicably, with Buck, Mills, and Stipe continuing as a three-piece. Through some changes in musical style, the band continued its career into the next decade with mixed critical and commercial success. In 2007, the band was inducted into the Rock and Roll Hall of Fame.\n\nMonster is the ninth album by the American band R.E.M., their fourth major label release for Warner Bros., released in 1994 (see 1994 in music). It is one of their most guitar-heavy albums to date, with glam/70s rock and grunge influences. It is also very multi-layered, with references to projected images, both in the media and in personal identity, particularly in terms of sexuality.\n\nMonster became a multi-platinum seller, and received critical acclaim by most critics, reaching #1 worldwide. There were several hits from the album, particularly &quot;What&amp;#039;s the Frequency, Kenneth?,&quot; &quot;Strange Currencies,&quot; and &quot;Bang and Blame.&quot;\n\nThe song &quot;Let Me In&quot; was written for Kurt Cobain, who died shortly after the sessions for Monster started. Michael Stipe said that the lyrics of the song were basically what he would tell Kurt over the phone. [1] The song was recorded on Kurt Cobain&amp;#039;s Jag-Stang.\n\n&quot;King of Comedy&quot; is a heavily processed, electronic-sounding track; Peter Buck called it a &quot;Leonard Cohen rip-off.&quot;[1] It had started out as a song called &quot;Yes I Am Fucking with You&quot;.\n\nThe caption in the liner notes reading &quot;For River&quot; is a dedication to late actor River Phoenix, a friend of Michael Stipe&amp;#039;s, who died of a drug overdose of cocaine and heroin on October 31, 1993 (1993-10-31).\n\nIn 2005, Warner Bros. issued an expanded two-disc edition of Monster which includes a CD, a DVD-Audio disc containing a 5.1-channel surround sound mix of the album done by Elliot Scheiner, and the original CD booklet with expanded liner notes. The CD (as with all in this series) is not remastered.\n\nThe cover artwork features a blurred out image of a bear&amp;#039;s head, and the back cover features the body of the bear next to the track listing. The liner notes give credit to &amp;#039;The Tilly Balloon Company&amp;#039; for &amp;#039;The Bear Image&amp;#039; [2] and mention copyrights from 1991, three years before Monster was released. The bear image used on the cover art was used in the 1995 world tour to support Monster, for example, on the tour posters.[3]\n\nThe inside sleeve artwork features images of a cartoon character named &amp;#039;Migraine Boy&amp;#039; along with other photographs and a list of names for possible outtake tracks or proposed names for the album. The song &quot;Revolution&quot; printed in this list then went on to feature in the Monster tour and was recorded and included on the soundtrack to Batman &amp; Robin.\n\n\n\n\n\n\nTracks:\n\n\n&quot;What&amp;#039;s the Frequency, Kenneth?&quot; ? 4:00 \n&quot;Crush with Eyeliner&quot; ? 4:39 \n&quot;King of Comedy&quot; ? 3:40 \n&quot;I Don&amp;#039;t Sleep, I Dream&quot; ? 3:27 \n&quot;Star 69&quot; ? 3:07 \n&quot;Strange Currencies&quot; ? 3:52 \n&quot;Tongue&quot; ? 4:13 \n&quot;Bang and Blame&quot; ? 5:30 \n&quot;I Took Your Name&quot; ? 4:02 \n&quot;Let Me In&quot; ? 3:28 \n&quot;Circus Envy&quot; ? 4:15 \n&quot;You&quot; ? 4:54 \n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:fe510cf9bbc38322c37290a85fe969fd35893b16","amp;dn":"REM+-+Monster+1994+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe510cf9bbc38322c37290a85fe969fd35893b16","infoHashBuffer":{"type":"Buffer","data":[254,81,12,249,187,195,131,34,195,114,144,168,95,233,105,253,53,137,59,22]},"announce":[],"urlList":[]}}