{"title":"The Rolling Stones - Love You Live (1977) WMA320","uid":6315307,"size":205070854,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe5d4ffd2164ca42123c1f5cd90f9cf7621abe73&amp;dn=The+Rolling+Stones+-+Love+You+Live+%281977%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302685659,"description":"I really like to hear Keith Richards do that faster live version of &quot;Happy&quot; in concerts. This Stones standout represents one of those instances in which a great song is slightly marred by having the studio version (&quot;Exile on Main Street&quot;) performed too slowly. Actually, altho &quot;Happy&quot; is just right, a few songs on &quot;Love You Live&quot; are a little too fast, like &quot;Get Off of My Cloud&quot; and &quot;Star Star.&quot; But overall, it's cool--this recording of concerts in Paris and Toronto is fast-paced, potent rock and roll.\nThis set has all the songs you want to hear in a Stones concert, like &quot;Honky Tonk Women,&quot; &quot;You Can't Always Get What You Want,&quot; and &quot;Tumbling Dice.&quot; Disk Two begins with Chuck Berry, Howlin' Wolf, etc. stuff, like &quot;Around and Around&quot; and &quot;Little Red Rooster.&quot; The sound quality and performance are a bit spotty, but they certainly are not on the last four songs: &quot;It's Only Rock 'N Roll,&quot; &quot;Brown Sugar,&quot; &quot;Jumpin' Jack Flash,&quot; and &quot;Sympathy for the Devil.&quot; What better choices to end a Stones concert can there be! The middle two are the Stones' best rockers ever, in my view, and all four give the band opportunities to open up. This was LP side four in college, and always the choice in parties and car stereos. The soloing is terrific, again, fast paced, and the band is ever so tight, everything clicking perfectly. Keith Richards and Ron Wood are fabulous on guitar, and there are blistering leads on the last three of the four songs. Billy Preston shines on keyboards. &quot;Love You Live&quot; is great live Stones for sure.\n\nby Jinkyu\n\nTRACKLIST:\nDisc 1:\n01 - Intro Fanfare For The Common Man.wma                             \n02 - Honky Tonk Woman.wma                                             \n03 - If You Can't Rock Meget Off Of My Cloud.wma                      \n04 - Happy.wma                                                        \n05 - Hot Stuff.wma                                                    \n06 - Star, Star.wma                                                   \n07 - Tumbling Dice.wma                                                \n08 - Fingerprint File.wma                                             \n09 - You Gotta Move.wma                                               \n10 - You Can't Always Get What You Want.wma \n\nDisc 2:\n01 - Mannish Boy.wma                                                  \n02 - Crackin' Up.wma                                                  \n03 - Little Red Rooster.wma                                           \n04 - Around And Around.wma                                            \n05 - It's Only Rock 'n' Roll.wma                                      \n06 - Brown Sugar.wma                                                  \n07 - Jumpin' Jack Flash.wma                                           \n08 - Sympathy For The Devil.wma  \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:fe5d4ffd2164ca42123c1f5cd90f9cf7621abe73","amp;dn":"The+Rolling+Stones+-+Love+You+Live+%281977%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5d4ffd2164ca42123c1f5cd90f9cf7621abe73","infoHashBuffer":{"type":"Buffer","data":[254,93,79,253,33,100,202,66,18,60,31,92,217,15,156,247,98,26,190,115]},"announce":[],"urlList":[]}}