{"title":"Music From The Lonely Planet TV series - Pilot guides - Globe tr","uid":3648596,"size":422010630,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff00207a52ba16e0c976fe50f8954fc094efb27c&amp;dn=Music+From+The+Lonely+Planet+TV+series+-+Pilot+guides+-+Globe+tr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ngminht","files":40,"time":1174996787,"description":"Enjoy  ;D \n[img]http://www.pilotguides.com/images/content/shop/cds/cd_earth_journey_v1_150x150.jpg[/img]\n &lt;a href=&quot;\nhttp://www.pilotguides.com/experience/albums/globe_trekker_original_journeys.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pilotguides.com/experience/albums/globe_trekker_original_journeys.php&lt;/a&gt; &lt;a href=&quot;\nhttp://www.pilotguides.com/experience/albums/globe_trekker_ambient_journeys.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pilotguides.com/experience/albums/globe_trekker_ambient_journeys.php&lt;/a&gt; &lt;a href=&quot;\nhttp://www.pilotguides.com/experience/albums/earth_journeys1.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pilotguides.com/experience/albums/earth_journeys1.php&lt;/a&gt; &lt;a href=&quot;\nhttp://www.pilotguides.com/experience/albums/earth_journeys2.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pilotguides.com/experience/albums/earth_journeys2.php&lt;/a&gt;\n\nEarth Journeys Volume 1 contains music from Globe Trekker episodes in Central America, Brazil, Peru, Southern Mexico, Ecuador, Rio de Janeiro, Baja California and Cuba. \n \n  \nTHE TRACKS \n1. Globe Trekker Theme: Featuring a Kubing, a bamboo instrument from the Philippines, with John Thomas on piano.\n\n2. Miao Song: Based on the haunting singing of the Longhorn Miao girls, wooing lovers from across the valleys. \n\n3. Journey to Djenne: A tribute to the surreal mud mosque rising from the sub-Saharan sands of Mali. \n\n4. Nez Perce: Based on the Nez Perce Indian chants, featuring the proud words of Chief Lonely Traveller.\n\n5. On The Road to Varkkalai: Sounds from a journey to the southernmost tip of India.\n\n6. Kilamanjaro: A reflective moment on the way to the rooftop of Africa featuring Paul Inder on guitar.\n\n7. And The Prince Had a Dream: A journey across the Saharan sand dunes.\n\n8. Karakol (Girl With a Guitar): Featuring Hazupa Hyzaebaon in her Uzbekistani homeland.\n\n9. Powayaane: Icelandic Inuit techno.\n\n10. Silk Road(God is Good): Based on the Koranic cry heard along the ancient Silk Route. Featuring Ney and Kwaal Flutes by Maher Khaury.\n\n11. Zanzibar: Featuring the guitar of Clem Clempson and the pan -African influence of township jive.\n\n12. Rishi Darling (O Jane Wales): Featuring the voice of Gauri Bopat and the sounds of Bollywood\n\n13. The Classification of Gesture (Medley): (i) The Classification of Gesture (ii) Laws Of Dancing (iii) Heavy With Drink (iv) Rudy (Wishing) (v) Tea Picking (Swingla) (vi) Natya Sastra (Dramatic Science) - From the markets, bars and festivals of Turkey.\n\nEarth Journeys Volume 2 contains music from Globe Trekker episodes in Greenland, Jamaica, China, Mexico, Uzbekistan, Turkey, India, Middle East, Chile, Vietnam, Baja California, and West Africa. It also features a remix of the Globe Trekker theme song. \n \n  \nTHE TRACKS \n1. Arctic Dance: Based on an Inuit woman\\&amp;#039;s performance of a Greenland drum dance. \n\n2. Cafe d\\&amp;#039;Afrique: The sounds of west Africa\\&amp;#039;s costal Cafes featuring Matt Bowers on electric guitar. \n\n3. Saga: Norse words from the songs of Greenland performed by the rich voice of Tryggvi Gunnar Hansen. \n\n4. Ranchero: Featuring the voice of Martin Williams. The desert cattle country of inland Baja Mexico still has the feel of the old west.\n\n5. Dog Bates Moon: Tequila round the campfire creates a dreamy calm.\n\n6. Uzebkistan Express: A steam journey through Central Asia\\&amp;#039;s mythical cities and glorious scenery.\n\n7. TILT: A jaunt around Jamaica featuring Steve Lima on guitar. \n\n8. SOUL FLUTE: Haunting flute epitomises the fragile purity of Chinese music.\n\n9. THE WATERING OF A TREE: Taken from a saz and drum performance one hot night in a traveller\\&amp;#039;s campsite. \n\n10. Spirit Girl Saraswatis Shakti: The spirit girls voice evoking the Devine energy of Hindu forces. \n\n11. Berberama: Featuring Matt Bowers on electric guitar, inspired by a group of Berber woman singing around a campfire. \n\n12. Wo-Lo-Lo - Featuring Adam Doughty on kora, inspired by the dramatic views from the Dogon escarpment. \n\n13. Four Miles Away: Featuring Neil Yates on trumpet, inspired by the distant trumpet echoes across the barren lands of Baja. \n\n14. Chinatown: The Chinese pipe guitar reflects the hustle and bustle of a modern Chinese city. \n\n15. Chilled Out: Featuring Mike Patton - The fastest mandolin in the west.\n\n16. Chant: The Inuit chant and Ian Richies soprano sax combine urban and ethnic dialogue as the sun sets over Greenland. \n\n17. Return to Bac Ha: A young girl greets the crew in the northern mountain village of Bac Ha.\n \nFrom a lively Zimbabwe village celebration to the fierce sounds of a Sahara Desert storm Original Journeys takes you worlds away from the ordinary. Globe Trekker episodes featured include Vietnam, Morocco, Africa, Brazil, Japan, India, Australia, Nepal, the Pacific Islands, plus the Globe Trekker theme tune. \n \n  \nTHE TRACKS \n1. Globe Trekker Theme: featuring the Kubing, a bamboo instrument from the Philippines\n\n2. Mountain Girl: Inspired by the voice of a little girl from the Vietnamese village of Bac Ha. \n\n3. Sintir Song: Recalling two Moroccan musicians on the harbour wall at Tangier. Tim Garside (percussion).\n\n4. Desert Storm: Following a disorientating night in the Sahara.\n\n5. Pool: A reflective moment on the landscapes of Brazil.\n\n6. Shinkansen: Inspired by the Japanese bullet train from Tokyo to Osaka.\n\n7. My Eyes: Reflecting the devotion of Shah Jeahan for his wife. Asha Bohsle (vocals), Ustad Sultan Khan (sarangi) and Ronu Majumdar (flute).\n\n8. Saigon: Sounds from the streets of Saigon. Brian Willoughby (speed guitar).\n\n9. Dolphin Fever: On swimming with the dolphins in Port Phillip Bay, Australia. Paul Inder (guitar and bass).\n\n10. Maroc Dance: Features the voice of Mohammed, who guided the film crew team through the Atlas Mountains in Morocco.\n\n11. Lace Maker: Recalling lace making In Prainha, Brazil.\n\n12. Rain Dreaming: The Australian Aborigines believe the world was sung into existence.\n\n13. Yoni of The Universe: A Hindi tribute to the place in the Himalayas from which all life springs.\n\n14. Vanuatu Voices: Created from the voices of the mysterious Rom dance on the island of Ambrym in Vanuatu. Tim Garside (percussion).\n\n15. Soono Humoro: The men and women of Nepal call to each other from fields across the valleys. Asha Bhosle &amp; MC Kinky (vocals).\n\n16. Zimbabwe: The drunken but happy voices of women celebrating in the village of Chitobe near the Victoria Falls. Emil Ogoo (highlife guitar).\n\n17. Dreamtime: Echoes the voices of the ghosts of the aboriginals driven from the outback of South Eastern Australia. Paul Inder (guitar).\n\n18. Willy\\&amp;#039;s Hymn: Sung by Willy, a cab driver from Sulphur Bay, in Vanuatu.\n\n19. Solomon Song: Blending ideas and voices from the Solomon Islands and Fiji. Tim Garside (percussion), Brian Willoughby (guitar).\n \n  \nGlobe Ambient Journeys contains soft rhythms from a steamy Central American jungle to the light uplifting note of a Chinese flute. Globe Trekker episodes featured include China, Brazil, Ecuador &amp; The Galapagos Islands, Indonesia, Vietnam, Japan, Morocco, India and The Philippines, plus the Globe Trekker theme song.\n\n \n \n  \nTHE TRACKS \n1. Songbird: Featuring plaintive yet uplifting Chinese flute. \n\n2. Red Rocks: Evoking a spacious red desert scene in Brazil.\n\n3. Ecuador: A voyage through the steamy Central American jungle. \n\n4. Indonesia: Echoes of gamelans and ethnic flutes.\n\n5. Mountain Voice: Evocative Vietnamese singing from Bac Ha.\n\n6. Nagasaki Sunburst: A eastern-inspired, introspective chill-out.\n\n7. Mohammed\\&amp;#039;s Call: Memories of Morocco.\n\n8. Galapagos: Light and rhythm.\n\n10. Brazil.\n\n10. Technotrain/Taj Express: (West India Company) ? Soft techno ambience.\n\n11. Windpower: (Ian Ritchie), the track that was the original inspiration for the Globe Trekker theme.\n \n\n \n","torrent":{"xt":"urn:btih:ff00207a52ba16e0c976fe50f8954fc094efb27c","amp;dn":"Music+From+The+Lonely+Planet+TV+series+-+Pilot+guides+-+Globe+tr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff00207a52ba16e0c976fe50f8954fc094efb27c","infoHashBuffer":{"type":"Buffer","data":[255,0,32,122,82,186,22,224,201,118,254,80,248,149,79,192,148,239,178,124]},"announce":[],"urlList":[]}}