{"title":"Harold James - The End of Globalization [2001][A]","uid":10426651,"size":6416527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff15aca22d239b1ac1d6c46229c3d20dcd1bd21d&amp;dn=Harold+James+-+The+End+of+Globalization+%5B2001%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1403712982,"description":"Description\nProduct Details\nBook Title: The End of Globalization: Lessons from the Great Depression\t\nBook Author: Harold James\nHardcover: 272 pages\nPublisher: Harvard University Press (June 15, 2001)\nLanguage: English\nISBN-10: 0674004744\nISBN-13: 978-0674004740\n\n===================================================================================\nBook Description\nPublication Date: June 15, 2001\n&quot;Globalization&quot; is here. Signified by an increasingly close economic interconnection that has led to profound political and social change around the world, the process seems irreversible. In this book, however, Harold James provides a sobering historical perspective, exploring the circumstances in which the globally integrated world of an earlier era broke down under the pressure of unexpected events.\nJames examines one of the great historical nightmares of the twentieth century: the collapse of globalism in the Great Depression. Analyzing this collapse in terms of three main components of global economics--capital flows, trade, and international migration--James argues that it was not simply a consequence of the strains of World War I but resulted from the interplay of resentments against all these elements of mobility, as well as from the policies and institutions designed to assuage the threats of globalism. Could it happen again? There are significant parallels today: highly integrated systems are inherently vulnerable to collapse, and world financial markets are vulnerable and unstable. While James does not foresee another Great Depression, his book provides a cautionary tale in which institutions meant to save the world from the consequences of globalization--think WTO and IMF, in our own time--ended by destroying both prosperity and peace.\n\n===================================================================================\nEditorial Reviews\nFrom Library Journal\nOne gets the impression that recent well-publicized World Trade Organization protests spurred Princeton historian James to write this cautionary book showing how protectionist actions and responses to the changing world trade of the 1920s and 1930s both led to and exacerbated the worldwide Depression of the 1930s. Furthermore, by analyzing the trade, immigration, and monetary policies of Germany, France, Great Britain, and other major countries, he makes a strong case that globalization breeds its own nationalist responses that, if not counteracted, can lead away from free markets and dangerously toward political dictatorship. Reading this book together with the first half of William L. Shirer's Rise and Fall of the Third Reich will give real insight into the economic (and sometimes political) reasons for the emergence of fascism and the slide into World War II. He writes with some economic jargon but no math. There are some tables, 27 pages of footnotes, and many citations in the text to other scholars who both support James's view and hold other opinions. While aimed at policymakers and professionals, this book will be understandable to undergraduate economics majors. Highly recommended for academic and economic libraries as well as public libraries with an active history or economic readership. Patrick J. Brunet, Western Wisconsin Technical Coll., La Crosse\n\nFrom Booklist\nRegardless of whether they applaud its benefits or decry its ill effects, the advocates and detractors of globalization both seem to regard the world's increasing economic interconnectedness as an irreversible trend. James, a history professor at Princeton University and author of The International Monetary System since Bretton Woods (1996), suggests instead a pendulum effect, noting that &quot;there already have been highly developed and highly integrated international communities that dissolved under the pressure of unexpected events.&quot; James argues that the Great Depression was the result in part of the failure of three institutions that had evolved to handle the consequences of an increasingly globalized world: tariff systems, central banks, and immigration legislation. James also detects modern-day parallels in the popular backlash against the World Trade Organization and NAFTA, the collapse of long-term capital management, and the meltdown of Asian economies. Though he does not foresee another depression, James does warn that another reverse of the pendulum might today threaten both peace and prosperity. David Rouse\n\n===================================================================================\nReviews\nJames argues that the Great Depression was the result in part of the failure of three institutions that had evolved to handle the consequences of an increasingly globalized world: tariff systems, central banks, and immigration legislation. James also detects modern-day parallels in the popular backlash against the World Trade Organization and NAFTA, the collapse of long-term capital management, and the meltdown of Asian economies. Though he does not foresee another depression, James does warn that another reverse of the pendulum might today threaten both peace and prosperity. (David Rouse Booklist 2001-04-15)\n\nHarold James points out one of the more amusing side effects of downturns through history--the countervailing boom in articles about economic crises. His own thesis is less doom-laden than the title suggests, but he points out some telling parallels. The Great Depression ended a long period during which the nineteenth-century technologies of rail, steam, and telegraphy integrated the world's economies as never before. (Leo Carey New Yorker 2001-12-03)\n\nGlobalization is a hot topic today, and the backlash against the increasing internationalization manifested in protests at recent meetings of the World Trade Organization has attracted considerable public attention. Globalization is not, however, a new phenomenon. The late 19th century saw a pronounced movement toward increased international economic integration. This earlier era of globalization came to a dramatic end during the Great Depression of the 1930s. James explores the history of this earlier episode of globalization to identify lessons for our own age. The core of the book tells the story of the interwar financial crisis and the resulting depression and then traces the paths through which the collapse of monetary and financial institutions led to trade and immigration restrictions and an increased emphasis on national economic policies...[James] provides a clear and accessible version of this story and explicitly focuses on the lessons it offers for the present. (J. L. Rosenbloom Choice 2001-11-01)\n\nStudents of the inter-war period will certainly be grateful to James for his authoritative, detailed, and elegantly written analysis of policy-making during the Great Depression. He takes in his stride a wealth of recent research, and dissects clearly the dilemmas facing policy-makers as they adopted policies which effectively dismantled the international economy. (English Historical Review 2002-09-01)\n\nThis is a deliberately provocative book...Prof James has useful things to say about the overstretched expectations that have partly crippled the International Monetary Fund and which are relevant to the World Bank and World Trade Organisation...Political leaders everywhere should keep a copy under their pillow. (Richard Lambert Financial Times)\n\nThis is a carefully crafted book on a topical subject. The scholarship is first rate. James demonstrates why he is rightly regarded as the leading historian of the political economy of the interwar period. (Barry Eichengreen, University of California, Berkeley, and author of Gold Fetters: The Gold Standard and the Great Depression, 1919-1939.)\n\n===================================================================================\nAbout the Author\nHarold James is Professor of History and International Affairs at Princeton University. \n===================================================================================","torrent":{"xt":"urn:btih:ff15aca22d239b1ac1d6c46229c3d20dcd1bd21d","amp;dn":"Harold+James+-+The+End+of+Globalization+%5B2001%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff15aca22d239b1ac1d6c46229c3d20dcd1bd21d","infoHashBuffer":{"type":"Buffer","data":[255,21,172,162,45,35,155,26,193,214,196,98,41,195,210,13,205,27,210,29]},"announce":[],"urlList":[]}}