{"title":"Joe Hill - Heart Shaped Box - Unb","uid":4395584,"size":316674724,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ff1c23a7a930bf4c374a7c42bf7d57942e6b30eb&amp;dn=Joe+Hill+-+Heart+Shaped+Box+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ripley5by5","files":16,"time":1221414391,"description":"Joe Hill&amp;#039;s Heart Shaped Box\n\nUnabridged Audio Book - Read by Stephen Lang\n\nFrom Publishers Weekly\nStarred Review. Stoker-winner Hill features a particularly merciless ghost in his powerful first novel. Middle-aged rock star Judas Coyne collects morbid curios for fun, so doesn&amp;#039;t think twice about buying a suit advertised at an online auction site as haunted by its dead owner&amp;#039;s ghost. Only after it arrives does Judas discover that the suit belonged to Craddock McDermott, the stepfather of one of Coyne&amp;#039;s discarded groupies, and that the old man&amp;#039;s ghost is a malignant spirit determined to kill Judas in revenge for his stepdaughter&amp;#039;s suicide. Judas isn&amp;#039;t quite the cad or Craddock the avenging angel this scenario makes them at first, but their true motivations reveal themselves only gradually in a fast-paced plot that crackles with expertly planted surprises and revelations. Hill (20th Century Ghosts) gives his characters believably complex emotional lives that help to anchor the supernatural in psychological reality and prove that (as one character observes) &quot;horror was rooted in sympathy.&quot; His subtle and skillful treatment of horrors that could easily have exploded over the top and out of control helps make this a truly memorable debut. (Feb.)\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. \n\n\nEnjoy the book!\n\nRipley5by5","torrent":{"xt":"urn:btih:ff1c23a7a930bf4c374a7c42bf7d57942e6b30eb","amp;dn":"Joe+Hill+-+Heart+Shaped+Box+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff1c23a7a930bf4c374a7c42bf7d57942e6b30eb","infoHashBuffer":{"type":"Buffer","data":[255,28,35,167,169,48,191,76,55,74,124,66,191,125,87,148,46,107,48,235]},"announce":[],"urlList":[]}}